{
  "id": "womens-maxi-dress-maxi",
  "handle": "womens-maxi-dress-maxi",
  "sku": "JC1563",
  "asin": "B01LYRTJQX",
  "title": "Womens Maxi Dress Maxi",
  "title_original": "Goood Times Caftan for Women Plus Size, Black and White Kaftan, Long Maxi Beach Cover Up, Loose Fit House Dress, Casual",
  "brand": "Visit the Goood Times Store",
  "price": 14.99,
  "social_proof": {
    "bought_past_month": 330,
    "text": "330+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/916xbNjj9rL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/715agImo19L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91nC1lIvwAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91c1OgCc-ZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71QiJ-0WrpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71aWZ9vJdqL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/916xbNjj9rL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/715agImo19L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91nC1lIvwAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91c1OgCc-ZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71QiJ-0WrpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71aWZ9vJdqL._SL1500_.jpg"
  ],
  "aplus_images": [
    "https://m.media-amazon.com/images/I/41KyNVpHm1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51z1A2DxnrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/4114Uu5F4rL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/416i0e2k39S._SL1500_.jpg"
  ],
  "description_images": [
    "https://m.media-amazon.com/images/I/41KyNVpHm1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51z1A2DxnrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/4114Uu5F4rL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/416i0e2k39S._SL1500_.jpg"
  ],
  "bullets": [],
  "specs": {
    "Item Weight ‏": "‎ 5.64 ounces",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ July 23, 2024",
    "Manufacturer ‏": "‎ Goood Times",
    "ASIN ‏": "‎ B0D9Y5MYVY",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#60,445 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #738 in Women's Casual Dresses",
    "Customer Reviews": "4.4 4.4 out of 5 stars (6,917)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Black & White",
      "Black and White",
      "Black"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.4,
    "count": 6917,
    "customers_say": "Customers find the caftan dress comfortable, well-designed, and beautifully made, with a nice fit that accommodates size 16/18 bodies and plenty of wiggle room. They appreciate its soft, silky material and lightweight, summer-weight construction. The fabric thickness receives mixed feedback, with some describing it as lovely while others find it thin and polyester-like. The sizing also gets mixed reviews, with some finding it true plus-size while others say it's too large. Generated from the text of customer reviews Select to learn more Comfort (269) Style (224) Quality (163) Fit (121) Soft material (95) Lightweight (81) Fabric thickness (130) Size (85) 269 customers mention comfort, 266 positive, 3 negative 269 customers mention \"Comfort\" 266 positive 3 negative Customers find the caftan dress comfortable, describing it as beautiful and cool, with one customer noting it's not see-through. \" I'm a Kaftan Fan . They are comfortable and when I wear them, I imagine I'm in an exotic locale, somewhere romantic ... Breathlessy awaiting... \" Read more \" Very comfortable but I couldn’t give it five stars because after washing it once in cold water, hand wash cycle and hang dry I don’t think it’s... \" Read more \" This is such a comfy and flattering kaftan. It was lightweight and was perfect for wearing to breakfast before being at the pool all day. \" Read more \" I love the comfort and loose flow…got another one as a gift to my sister-in-law who was so complimentary of me wearing this dress!! \" Read more 224 customers mention style, 219 positive, 5 negative 224 customers mention \"Style\" 219 positive 5 negative Customers find the caftan dress stylish, with beautiful prints that make them feel dressed up and glamorous. \" ...The black and white graphic is vivid and beautiful . These are so comfortable and cool to wear in hot summer heat and still be covered and cool! \" Read more \" Pretty but not what was indicated in advertisement. Expected black paisley but was shipped multicolored caftan with tiny gold flecks \" Read more \" This is exactly what I need for the warm weather. Very pretty . \" Read more \" This dress looks just as pictured. It is stylish and I had no issues machine washing it cold and air-drying it.... \" Read more 163 customers mention quality, 128 positive, 35 negative 163 customers mention \"Quality\" 128 positive 35 negative Customers find the caftan dress to be beautifully made and perfect as a house gown. \" ...it back as I was looking for something else more woven, but this is a nice , light yet still fairly opaque cover up, and can make a house dress.... \" Read more \" This kaftan looks and feels great. It is flowy and cool . It is a bit sheer for going outside, so if you are modest be aware of this.... \" Read more \" Its comfortable and well made . I'm 5ft 4in and the length comes to my ankle. The color was true as seen within the advertisement. \" Read more \" Cheaply Made and see through it completely. need two Under Slips underneath to be decent. \" Read more 121 customers mention fit, 111 positive, 10 negative 121 customers mention \"Fit\" 111 positive 10 negative Customers like how the caftan dress fits, particularly noting that it accommodates a size 16/18 body with plenty of room to move. \" Absolutely wonderful day – – so comfortable, and very elegant. Fits well , too... \" Read more \" I am a 3x, fits great . Love the v neck + it's flowy. Not too long on me. I am 5'7. It is lightweight cover up for beach.... \" Read more \" Lovely fabric, great fit , great price. I will enjoy wearing this at the beach. May even wear it around the house as it is so comfortable. \" Read more \" ...It’s a one size fits all- I’m a size 14 and average height. It fits perfectly because there is a lot of room(much bigger than my regular clothes).... \" Read more 95 customers mention soft material, 90 positive, 5 negative 95 customers mention \"Soft material\" 90 positive 5 negative Customers appreciate the caftan's silky and smooth material, describing it as soft and unstructured, with one customer noting it's not stiff or scratchy. \" ...Fabric is polyester but doesn’t feel cheap. It’s soft & flowy, and the print is gorgeous. Also very roomy; would definitely fit a full figured woman.... \" Read more \" I was worried it would be see through. But it’s not. It’s very soft and comfy. Bought for cruise but hope to wear not just at the pool.... \" Read more \" love it. shipping was quick. love the pattern and feels great . I am wearing as I type and its very very comfortable. I will definitely order more. \" Read more \" It’s super soft , not stiff or scratchy. Not too sheer, washes up nicely in cold- no dryer. It sir Dry’s in minutes. This is a good caftan purchase.... \" Read more 81 customers mention lightweight, 77 positive, 4 negative 81 customers mention \"Lightweight\" 77 positive 4 negative Customers appreciate that the caftan dress is lightweight and comfortable, with one customer noting it's not see-through. \" This is such a comfy and flattering kaftan. It was lightweight and was perfect for wearing to breakfast before being at the pool all day. \" Read more \" ...You look stylish without any effort. Color pattern easy to match. Light and comfortable. Sizing great. Throw in the washer and wear immediately.... \" Read more \" Light weight , fits my size 16/18 body with room. I fell asleep in it, woke up and stretched. That took a couple stitches out but no rip. \" Read more \" ...Very well made. Nice wrought l weight fabric, not too heavy not not too light or flimsy either. I've never ever worn a kaftan but I'm a fan now!... \" Read more 130 customers mention fabric thickness, 79 positive, 51 negative 130 customers mention \"Fabric thickness\" 79 positive 51 negative Customers have mixed opinions about the fabric thickness of the caftan dress, with some finding it lovely while others describe it as thin and polyester-like. \" The Caftan’s sheerness & thin material is more than I anticipated. I like the flow, roominess & feel of the dress.... \" Read more \" This dress it just OK. The material is thin and the dress is see through. Stitching and construction looks heap - but you get what you pay for right?... \" Read more \" Love the fabric and the comfortable, loose fit of this kaftan. I can wear it around the house or even use it as a nightgown to sleep in. Love it!! \" Read more \" Typical OS fit. Will enjoy lounging. Nice fabric , medium weight, so not see through, but not too heavy. At 5'6, hits top of feet. \" Read more 85 customers mention size, 57 positive, 28 negative 85 customers mention \"Size\" 57 positive 28 negative Customers have mixed opinions about the dress's size, with some finding it true plus size and perfect, while others report it being too large or loose across the chest. \" ...This Kaftan was not TOO sheer . I like them Big and this was roomy Sometimes you order them and they are so small you can use them for a... \" Read more \" ...It’s soft & flowy, and the print is gorgeous. Also very roomy ; would definitely fit a full figured woman. And you can’t beat the price! \" Read more \" It's way to big . I'm a size 10 - 14 and it swallows me \" Read more \" It fit perfectly and is super comfy to throw on at night where it’s hot and humid in FL and you’re just sitting around the house watching TV with... \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Beautiful dress",
        "body": "Beautiful dress love the material, cool and comfort. Read more",
        "author": "MaryGrace",
        "rating": 5.0,
        "date": "July 11, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Excellent buy for Summer Wear.",
        "body": "Very thin material but very roomy and comfortable. You will NOT get hot in this! You can dress this up easily. Read more",
        "author": "#1AMZNCSTMR",
        "rating": 5.0,
        "date": "August 29, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars You need this!",
        "body": "I can't believe the ratings for this lovely gown aren't higher. It is BEAUTIFUL in person. Very well made. Nice wrought l weight fabric, not too heavy not not too light or flimsy either. I've never ever worn a kaftan but I'm a fan now! It washes beautifully, on cold and air fluff dryer. It is somehow flattering, I don't know how. 5 stars for sure. Read more",
        "author": "StephieGabs",
        "rating": 5.0,
        "date": "May 11, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Beautiful work",
        "body": "Fits true to size and looks just like the pictures. The material is soft, comfortable, and not see-through. Very flattering and well-made. Read more",
        "author": "Tierra",
        "rating": 4.0,
        "date": "November 25, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Really good buy",
        "body": "It’s soooo comfy I love it Read more",
        "author": "Maya Wood",
        "rating": 5.0,
        "date": "October 25, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Great print, but was too synthetic for everyday, better as beach coverup.",
        "body": "Loved the design on this one, but the dress felt too synthetic against my skin and not comfortable as a night gown. It's great as a full body beach cover up as it will dry very quickly. I sent it back as I was looking for something else more woven, but this is a nice, light yet still fairly opaque cover up, and can make a house dress. It's not very absorbent though, so not great for humid or hot days. Read more",
        "author": "Zen",
        "rating": 3.0,
        "date": "April 6, 2022",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Lightweight",
        "body": "Long, light, and beautiful Read more",
        "author": "Amazonian",
        "rating": 5.0,
        "date": "August 29, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars best caftan",
        "body": "the best caftan I’ve purchased from Amazon. I originally bought one of these caftans about a year ago from Macys and was bummed when I went back and they no longer carried them. I found them on Amazon and am so happy to be able to purchase more. Read more",
        "author": "Luigi B",
        "rating": 5.0,
        "date": "October 27, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Maxi is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.",
  "about_this_item": "Womens Maxi Dress Maxi is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.",
  "long_description": "Womens Maxi Dress Maxi is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Black & White, Black and White, Black. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Maxi is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/41KyNVpHm1L._SL1500_.jpg",
      "alt": "Womens Maxi Dress Maxi details image 1"
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/51z1A2DxnrL._SL1500_.jpg",
      "alt": "Womens Maxi Dress Maxi details image 2"
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/4114Uu5F4rL._SL1500_.jpg",
      "alt": "Womens Maxi Dress Maxi details image 3"
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/416i0e2k39S._SL1500_.jpg",
      "alt": "Womens Maxi Dress Maxi details image 4"
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Black & White, Black and White, Black. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "a09985d3-fc2f-4467-8424-454f014cc1f4",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a09985d3-fc2f-4467-8424-454f014cc1f4/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a09985d3-fc2f-4467-8424-454f014cc1f4/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "584eaa15-13b5-4ee8-8161-9c0d52514133",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/584eaa15-13b5-4ee8-8161-9c0d52514133/embedded.cc.default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/584eaa15-13b5-4ee8-8161-9c0d52514133/embedded.cc.default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "33267e85-b7f2-4251-b4d3-b39d37195526",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/33267e85-b7f2-4251-b4d3-b39d37195526/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/33267e85-b7f2-4251-b4d3-b39d37195526/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "b80fd75c-0b4b-43ba-a9ce-a92ec4a9bc55",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b80fd75c-0b4b-43ba-a9ce-a92ec4a9bc55/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b80fd75c-0b4b-43ba-a9ce-a92ec4a9bc55/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Black & White": "https://m.media-amazon.com/images/I/41xlIqDJ3hL._AC_SR38,50_.jpg",
    "Black and White": "https://m.media-amazon.com/images/I/51IiKc37XFL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/51z1A2DxnrL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Black & White": "71QiJ-0WrpL",
    "Black and White": "71aWZ9vJdqL",
    "Black": "916xbNjj9rL"
  },
  "color_images": {
    "Black & White": [
      "https://m.media-amazon.com/images/I/71QiJ-0WrpL._SL1500_.jpg"
    ],
    "Black and White": [
      "https://m.media-amazon.com/images/I/71aWZ9vJdqL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/916xbNjj9rL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-bodycon-long-sleeve-ruched",
      "title": "Womens Maxi Dress Bodycon Long Sleeve Ruched",
      "price": 38.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/718YKBFbs3L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-off-shoulder-mermaid-evening",
      "title": "Womens Maxi Dress Formal Off Shoulder Mermaid Evening",
      "price": 86.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71C+AFY6HAL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-formal",
      "title": "Womens Maxi Dress Evening Formal",
      "price": 69.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71amdzuBfbL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-bodycon-sleeveless",
      "title": "Womens Dress Bodycon Sleeveless",
      "price": 29.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51UthcjfRfL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 38.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71l8OE0DiEL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress-sleeveless",
      "title": "Womens Dress Sleeveless",
      "price": 41.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71QMCW+8CcL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-ruched-v-neck-cocktail-bodycon",
      "title": "Womens Dress Ruched V Neck Cocktail Bodycon",
      "price": 45.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/51TCVhb-WzL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 298.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71Jq8YdpWeL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-split",
      "title": "Womens Dress Split",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61PPeTKsusL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-maxi-cocktail",
      "title": "Womens Maxi Dress Long Sleeve Maxi Cocktail",
      "price": 62.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71u2Xray0mL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-long-sleeve-ruched-cocktail-bodycon-formal",
      "title": "Womens Maxi Dress Maxi Long Sleeve Ruched Cocktail Bodycon Formal",
      "price": 28.3,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/81e1pG2+yqL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening-long-sleeve",
      "title": "Womens Maxi Dress Formal Evening Long Sleeve",
      "price": 75.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61e8WX2EcaL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-v-neck",
      "title": "Womens Dress V Neck",
      "price": 69.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/81MCqkA-7cL._SL1500_.jpg"
      ]
    }
  ]
}