{
  "id": "womens-dress-cocktail-sleeveless",
  "handle": "womens-dress-cocktail-sleeveless",
  "sku": "JC2000",
  "asin": "B01MS1GE55",
  "title": "Womens Dress Cocktail Sleeveless",
  "title_original": "MEROKEETY Women's Sleeveless Lace Floral Elegant Cocktail Dress Crew Neck Knee Length for Party",
  "brand": "Visit the MEROKEETY Store",
  "price": 55.99,
  "social_proof": {
    "bought_past_month": 75,
    "text": "75+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/61GAi4F7LzS._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61KqZduuWmS._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61tJDnPD6CS._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71oeUNu8+sL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/915q0tD1q7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71dDw+cD1pL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71gPvHZ2KRL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/6103vyrsm3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61L2R5E9LnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71BDXAs8bRS._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/719mpaxn6AL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61nlygKaIpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/717mWevn6aS._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71vcTxTlQgS._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71qL0zxNkvL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71FYo+2p92L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71tJ5iLzVXS._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ZjwwkCPcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71j+noce0LL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61tSdre1n5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61+1ESQqmJS._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71-OFIeK0vS._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/61GAi4F7LzS._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61KqZduuWmS._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61tJDnPD6CS._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71oeUNu8+sL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/915q0tD1q7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71dDw+cD1pL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71gPvHZ2KRL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/6103vyrsm3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61L2R5E9LnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71BDXAs8bRS._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/719mpaxn6AL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61nlygKaIpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/717mWevn6aS._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71vcTxTlQgS._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71qL0zxNkvL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71FYo+2p92L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71tJ5iLzVXS._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ZjwwkCPcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71j+noce0LL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61tSdre1n5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61+1ESQqmJS._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71-OFIeK0vS._SL1500_.jpg"
  ],
  "aplus_images": [
    "https://m.media-amazon.com/images/I/31mhet0CDOL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/313OvfLXhkL._SL1500_.jpg"
  ],
  "description_images": [
    "https://m.media-amazon.com/images/I/31mhet0CDOL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/313OvfLXhkL._SL1500_.jpg"
  ],
  "bullets": [],
  "specs": {
    "Item Weight ‏": "‎ 10.58 ounces",
    "Item model number ‏": "‎ Elegant Dress",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ January 9, 2023",
    "Manufacturer ‏": "‎ MEROKEETY",
    "ASIN ‏": "‎ B0BRZ52444",
    "Best Sellers Rank": "#33,775 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #50 in Women's Cocktail Dresses",
    "Customer Reviews": "4.4 4.4 out of 5 stars (20,741)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Magenta",
      "Black",
      "Sage",
      "Velvet Wine",
      "Coffee",
      "Gray Blue",
      "Blush Bean",
      "Dark Green",
      "Light Olive",
      "Royal",
      "Navy",
      "Plum",
      "Pink",
      "White",
      "Powder Blue",
      "Beige",
      "Light Violet",
      "Turquoise"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.4,
    "count": 20741,
    "customers_say": "Customers find this dress to be a great little black dress that looks very expensive and flatters various body types, with one noting it hugs curves in the most flattering way. The dress is comfortable, not itchy, and customers consider it a good value for money. While some it runs true to size, others mention it runs a little big. Generated from the text of customer reviews Select to learn more Fit (2.4K) Beauty (1.9K) Quality (1.6K) Comfort (772) Value for money (624) Flattering (484) Color (445) Size (514) 2401 customers mention fit, 1966 positive, 435 negative 2,401 customers mention \"Fit\" 1,966 positive 435 negative Customers like how the dress fits, noting it's not too loose. \" ...It's flattering, has some stretch to it and just the perfect fit . The length is great and the lace that's see thru is flattering and not scandalous.... \" Read more \" ...I put this dress on and was shocked that it fit perfectly . What's even weirder is how great it also looked on all the tall people that wrote reviews.... \" Read more \" I’m in love with this dress! Beautiful and a great fit ! The reviews said just buy it, I’m so thrilled I did! I received multiple compliments!... \" Read more \" ...I'm 5'8\" size 10/12 and 175lbs a 38DD and ordered a large. Fits perfectly ! Lace isn't itchy like some lace dresses. Modest with a sexy fit! \" Read more 1983 customers mention beauty, 1899 positive, 84 negative 1,983 customers mention \"Beauty\" 1,899 positive 84 negative Customers find the dress gorgeous and feminine, noting that it looks very expensive. \" ...It’s a beautiful dress with a lousy zipper. All of the dresses must have zipper issues as both of my dresses had this issue. I returned both of them. \" Read more \" ...The fabric isn’t too heavy and it’s not cheaply made. It’s beautiful . I would recommend keeping it in a garment bag, so the lace doesn’t get frayed.... \" Read more \" ...For anyone going through this, just buy this. It’s classy , the fit is right, and it’s a zero effort decision you have to make and look good when you... \" Read more \" I know many people are happy with this dress. It is cute and fits fine, but just seems to be cheaply made. However, for what I paid, I guess it's ok.... \" Read more 1641 customers mention quality, 1594 positive, 47 negative 1,641 customers mention \"Quality\" 1,594 positive 47 negative Customers find this dress to be of good quality, describing it as a great little black dress that works well as a wedding guest outfit. \" Great dress ! Wears well. I got a lot of compliments on it. Some thought it was altered to fit. My friends couldn't believe it was from mail order. \" Read more \" ...I bought the black in small and LOVE it! Great quality . I bought a small in the red and it was a bit snugger in the thighs than the black, so... \" Read more \" Love this dress . Fits just right. I thought it might be too tight fitting because of the lace, but it does have some stretch to it. Very comfortable. \" Read more \" A nice dress if you aren't looking for something with a little 'give and take' in the fabric. It's more of a cotton lace with a stiff feel.... \" Read more 772 customers mention comfort, 758 positive, 14 negative 772 customers mention \"Comfort\" 758 positive 14 negative Customers find the dress comfortable, noting it is not itchy or scratchy, and one customer mentions it is very forgiving. \" It's comfortable and fits as expected. The lace isn't \"finished\" looking on the sleeves and collar. It looks frayed. I'll be sending it back. \" Read more \" ...Perfect for a wedding or upscale social event. It’s very comfortable and easy to wear. The lace is beautiful. The price is so reasonable. Great deal!... \" Read more \" ...Its of great quality and it's so comfortable , comfortable to wear you don't need to duck tape yourself into it and it won't show unflattering lumps.... \" Read more \" Wore this for my bridal shower and got so many compliments! It's super comfortable and flattering, and a great price for the quality. \" Read more 624 customers mention value for money, 606 positive, 18 negative 624 customers mention \"Value for money\" 606 positive 18 negative Customers find the dress to be a great value, describing it as beautiful for the price and offering good quality relative to its cost. \" This is just what I was looking for and at a great price . The dress has enough stretch (but not too much) and will look great with a pair of heels.... \" Read more \" This is a great dress for the price . It fits great and is super comfortable. It is a bit loose, but better than skin tight.... \" Read more \" ...I feel the dress was a great value ! Something I can wear many times when I need a comfortable, simple dressy dress !!! \" Read more \" This dress for great and is great quality for the price . Ordered Large, I'm 5'8/ 170lbs. It fit well but with room to breathe, eat & sit.... \" Read more 484 customers mention flattering, 454 positive, 30 negative 484 customers mention \"Flattering\" 454 positive 30 negative Customers find the dress flattering, particularly noting that it complements various body types without being clingy. \" I ordered this for a wedding and it was perfect! The dress is Very flattering and very comfortable. I normally wear a sz 12-14. I weigh 185lbs. 5’7”.... \" Read more \" ...It is well made and flattering . The material was just much more pink than purple like I was expecting based on the picture. Pink just isn’t my thing.... \" Read more \" I am 5’8” and not curvy and this dress is so flattering ! I ordered a size small. I am almost 62 and might wear this to my son’s rehearsal dinner!... \" Read more \" Fits tts; super flattering . Elegant but sexy. Wore for funeral and was appropriate but could've dressed up with accessories for cocktail event. \" Read more 445 customers mention color, 402 positive, 43 negative 445 customers mention \"Color\" 402 positive 43 negative Customers love the color of the dress, with several mentioning it's a perfect black little dress, and one customer specifically appreciating the navy shade. \" Beautiful color (I selected pink) and very well-made! Gorgeous. But I'm a size 6 and typically wear between a S and a M, and this barely fit me.... \" Read more \" Love the color . Love the style. Love the fit... a little big around waist but that’s okay. For the price it is classy and comfy. \" Read more \" ...It is excellent quality, fit and color . I ordered Plum. I’m a size 14 typically in dresses, 5’6 and 183lbs. Bought an XL and it was perfect!... \" Read more \" ...I loved the color , but my hubby told me it looked like an old lady dress. That's what convinced me to keep looking and send this one back. \" Read more 514 customers mention size, 209 positive, 305 negative 514 customers mention \"Size\" 209 positive 305 negative Customers have mixed experiences with the dress's fit, with some finding it true to size while others report that it runs big. \" ABSOLUTELY BEAUTIFUL DRESS! Just too small , ordered in my normal size but just too fitting. GORGEOUS for the price, not see through. Just a bit small. \" Read more \" ... True to size and color was exactly as pictured! Very flattering, would definitely encourage anyone thinking about it or on the fence.....BUY it! \" Read more \" ...I sized up and it was too big . For reference, I am 5’6” and 140 lbs. I ordered a medium and probably could have fit a small. It does stretch.... \" Read more \" Did run a little big, so I would say it runs true to size . The lace is beautiful and even matched up well with my cowboy boots.... \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Gorgeous Dress! Fabulous Fit! Beautiful!",
        "body": "THIS is THE dress! It’s just beautiful!!! Great quality and it’s also very soft and comfortable! The zipper is very nicely stitched into the dress so it’s invisible and the seams lay flat. I have bought several dresses over the past few month for my upcoming honeymoon- and this dress is better than some of the $400 dresses I’ve tried! It is rare when you find something at a reasonable price that fits well and is also nice quality. I am between a size 6 and 8 and the medium fits very well. I could maybe also fit into a small but I like that the dress glides over my figure instead of clinging to it. I have a 28 inch waist, but I wear a 36D bra, so I usually need to buy dresses a bit bigger to accommodate my chest. This dress fits very well around my large bust, which is really rare for something that fits close to the body! I can’t say enough about this dress! I also appreciate its modest, but is still very sexy. A lot of modest dresses can look a bit matronly on my middle aged body- but this one certainly doesn’t! I also love that this dress is ready for date night, a wedding, graduation or just about ANY occasion you’d need to wear a dress! Love, love, love this dress and I’m delighted to have found it! Read more",
        "author": "kwi",
        "rating": 5.0,
        "date": "March 16, 2024",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Surprisingly good quality for the price",
        "body": "Surprisingly good quality and fit for an Amazon dress and the price. I ordered black for an evening cocktail event. I bought size Large - I’m 5’5”, size 36D and 168 pounds. It fit like a glove and was surprisingly forgiving. I haven’t had to dress up in years and this made me feel comfortable and stylish. I wore spanx under but didn’t really need to. I got away with a black bra under that blended into the lace I will likely get another color for day events. Read more",
        "author": "Muttnut",
        "rating": 5.0,
        "date": "September 14, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Perfect wedding guest dress",
        "body": "This dress was just what I was looking for a recent wedding. The color was brighter than I expected but beautiful. The fit was perfect. Felt great to dance in all night. Read more",
        "author": "E. Williams",
        "rating": 5.0,
        "date": "October 15, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars A great little black dress!",
        "body": "Classy, black dress. I am 5’2, 145lbs & big chested (38C). I tried a Large & it fits like a glove. The medium was too tight in the chest. Very comfortable. The fabric is medium weight, breathable and the inner liner has a little stretch. Read more",
        "author": "Jacquelyn G",
        "rating": 4.0,
        "date": "May 9, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71b3maz9gXL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/614PNB-mCcL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Did not wrinkle while wearing!",
        "body": "I loved this dress for a wedding I went to! Comfortable!! The very top and the back of the dress are not fully lined like the rest of the dress so a strapless bra is needed unless you can find a color bra that matches. Material is nice, the lace did not pull anywhere and it is lined well. I am 5’8”, a 34DDD and hips are 38 inches. The size medium was a perfect fit. I sometimes have trouble finding dressing that fit because of my breast size. The zipper on the back goes down pretty far making the dress easier to get into. I was comfortable in the dress all evening long and it did not wrinkle from the seatbelt on the way there nor from sitting at the wedding. I did have to iron it when I got it to get the fold wrinkles out. I have yet to wash it because of the rayon, but the color was the same as pictured. I got the purple. Read more",
        "author": "tom",
        "rating": 5.0,
        "date": "November 6, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Prefect!",
        "body": "This dress is so pretty and fits perfect. Rund Slightly big so if you're in between sizes, size down. I'm 170lbs and 5'10 and it falls at the knees. Perfect and a great price! Read more",
        "author": "Blaze",
        "rating": 5.0,
        "date": "September 6, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Runs small",
        "body": "Such a pretty dress but definitely runs small. All of the product reviews said the fit was just right and amazon suggested size Large and usually they are correct but not this time. Tight in waist and hips. I would exchange for an XL but I don’t think it would be much different and it would probably be too long. If you are a curvy girl size up. Read more",
        "author": "carebear85",
        "rating": 3.0,
        "date": "September 1, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Perfect black dress",
        "body": "Love this dress. Better than I expected. Fits perfectly. The zipper is a little janky, so I leave it unzipped on the hanger. Otherwise, this dress is perfect. Read more",
        "author": "antoinette s.",
        "rating": 5.0,
        "date": "November 28, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Dress Cocktail Sleeveless is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.",
  "about_this_item": "Womens Dress Cocktail Sleeveless is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.",
  "long_description": "Womens Dress Cocktail Sleeveless is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Magenta, Black, Sage, Velvet Wine, Coffee, Gray Blue, Blush Bean, Dark Green, Light Olive, Royal, Navy, Plum, Pink, White. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Dress Cocktail Sleeveless is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/31mhet0CDOL._SL1500_.jpg",
      "alt": "Womens Dress Cocktail Sleeveless details image 1"
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/313OvfLXhkL._SL1500_.jpg",
      "alt": "Womens Dress Cocktail Sleeveless details image 2"
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Magenta, Black, Sage, Velvet Wine, Coffee, Gray Blue, Blush Bean, Dark Green, Light Olive, Royal, Navy, Plum, Pink, White. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "bc7c78ec-8682-4130-ba96-9c7302c7663a",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bc7c78ec-8682-4130-ba96-9c7302c7663a/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bc7c78ec-8682-4130-ba96-9c7302c7663a/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "0dd42dd2-2c20-4e3e-91a2-7a58fa229a0c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0dd42dd2-2c20-4e3e-91a2-7a58fa229a0c/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0dd42dd2-2c20-4e3e-91a2-7a58fa229a0c/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "dcdbcac3-4c1f-4bb4-b2bf-68b5d93a3b21",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/dcdbcac3-4c1f-4bb4-b2bf-68b5d93a3b21/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/dcdbcac3-4c1f-4bb4-b2bf-68b5d93a3b21/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "a875e6e5-688b-4df7-be57-1e1cb974df1f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a875e6e5-688b-4df7-be57-1e1cb974df1f/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a875e6e5-688b-4df7-be57-1e1cb974df1f/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "9fda2356-ab46-4d73-b292-bb0db7e7adc4",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9fda2356-ab46-4d73-b292-bb0db7e7adc4/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9fda2356-ab46-4d73-b292-bb0db7e7adc4/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "dce6481c-3169-4186-8ad0-1cefaf1c14da",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/dce6481c-3169-4186-8ad0-1cefaf1c14da/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/dce6481c-3169-4186-8ad0-1cefaf1c14da/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "498b0277-1d91-49f9-a7b6-c55497d0878e",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/498b0277-1d91-49f9-a7b6-c55497d0878e/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/498b0277-1d91-49f9-a7b6-c55497d0878e/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "8066affa-1d8a-4be9-a11a-db5547c678ef",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8066affa-1d8a-4be9-a11a-db5547c678ef/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8066affa-1d8a-4be9-a11a-db5547c678ef/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "8485402f-d5fb-456f-8527-5f1f06720a44",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8485402f-d5fb-456f-8527-5f1f06720a44/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8485402f-d5fb-456f-8527-5f1f06720a44/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "f65d7f85-0a9a-4b87-80bc-49433d32c83d",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f65d7f85-0a9a-4b87-80bc-49433d32c83d/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f65d7f85-0a9a-4b87-80bc-49433d32c83d/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "eea16219-0636-4d6d-8267-1c806a2b9ac5",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/eea16219-0636-4d6d-8267-1c806a2b9ac5/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/eea16219-0636-4d6d-8267-1c806a2b9ac5/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "c7844cbe-37f0-4520-be9e-e3038576c0de",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c7844cbe-37f0-4520-be9e-e3038576c0de/videopreview.jobtemplate.mp4.342X192P_20HZ_350KBPS_VER_1_0.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c7844cbe-37f0-4520-be9e-e3038576c0de/videopreview.jobtemplate.mp4.342X192P_20HZ_350KBPS_VER_1_0.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Magenta": "https://m.media-amazon.com/images/I/41u3h1XsCUL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/41ANXWwLmQS._AC_SR38,50_.jpg",
    "Sage": "https://m.media-amazon.com/images/I/41FLo1sHCoL._AC_SR38,50_.jpg",
    "Velvet Wine": "https://m.media-amazon.com/images/I/31vxODswRoL._AC_SR38,50_.jpg",
    "Coffee": "https://m.media-amazon.com/images/I/31nBpCwEyuL._AC_SR38,50_.jpg",
    "Gray Blue": "https://m.media-amazon.com/images/I/41z7W2T2h7S._AC_SR38,50_.jpg",
    "Blush Bean": "https://m.media-amazon.com/images/I/41Vy9-JKkBL._AC_SR38,50_.jpg",
    "Dark Green": "https://m.media-amazon.com/images/I/41t6-UYtdoL._AC_SR38,50_.jpg",
    "Light Olive": "https://m.media-amazon.com/images/I/41SoNUixu-S._AC_SR38,50_.jpg",
    "Royal": "https://m.media-amazon.com/images/I/41aoFuCrzxS._AC_SR38,50_.jpg",
    "Navy": "https://m.media-amazon.com/images/I/416sQHq+0fL._AC_SR38,50_.jpg",
    "Plum": "https://m.media-amazon.com/images/I/41aH8QG4ZWL._AC_SR38,50_.jpg",
    "Pink": "https://m.media-amazon.com/images/I/41My2q2nQRS._AC_SR38,50_.jpg",
    "White": "https://m.media-amazon.com/images/I/412LDjWPEkL._AC_SR38,50_.jpg",
    "Powder Blue": "https://m.media-amazon.com/images/I/41hxs1rw1jL._AC_SR38,50_.jpg",
    "Beige": "https://m.media-amazon.com/images/I/31ohc2Pz20L._AC_SR38,50_.jpg",
    "Light Violet": "https://m.media-amazon.com/images/I/417XmRyYibS._AC_SR38,50_.jpg",
    "Turquoise": "https://m.media-amazon.com/images/I/41pD+EVuffS._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Magenta": "71dDw+cD1pL",
    "Black": "61GAi4F7LzS",
    "Sage": "71gPvHZ2KRL",
    "Velvet Wine": "6103vyrsm3L",
    "Coffee": "61L2R5E9LnL",
    "Gray Blue": "71BDXAs8bRS",
    "Blush Bean": "719mpaxn6AL",
    "Dark Green": "61nlygKaIpL",
    "Light Olive": "717mWevn6aS",
    "Royal": "71vcTxTlQgS",
    "Navy": "71qL0zxNkvL",
    "Plum": "71FYo+2p92L",
    "Pink": "71tJ5iLzVXS",
    "White": "61ZjwwkCPcL",
    "Powder Blue": "71j+noce0LL",
    "Beige": "61tSdre1n5L",
    "Light Violet": "61+1ESQqmJS",
    "Turquoise": "71-OFIeK0vS"
  },
  "color_images": {
    "Magenta": [
      "https://m.media-amazon.com/images/I/71dDw+cD1pL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/61GAi4F7LzS._SL1500_.jpg"
    ],
    "Sage": [
      "https://m.media-amazon.com/images/I/71gPvHZ2KRL._SL1500_.jpg"
    ],
    "Velvet Wine": [
      "https://m.media-amazon.com/images/I/6103vyrsm3L._SL1500_.jpg"
    ],
    "Coffee": [
      "https://m.media-amazon.com/images/I/61L2R5E9LnL._SL1500_.jpg"
    ],
    "Gray Blue": [
      "https://m.media-amazon.com/images/I/71BDXAs8bRS._SL1500_.jpg"
    ],
    "Blush Bean": [
      "https://m.media-amazon.com/images/I/719mpaxn6AL._SL1500_.jpg"
    ],
    "Dark Green": [
      "https://m.media-amazon.com/images/I/61nlygKaIpL._SL1500_.jpg"
    ],
    "Light Olive": [
      "https://m.media-amazon.com/images/I/717mWevn6aS._SL1500_.jpg"
    ],
    "Royal": [
      "https://m.media-amazon.com/images/I/71vcTxTlQgS._SL1500_.jpg"
    ],
    "Navy": [
      "https://m.media-amazon.com/images/I/71qL0zxNkvL._SL1500_.jpg"
    ],
    "Plum": [
      "https://m.media-amazon.com/images/I/71FYo+2p92L._SL1500_.jpg"
    ],
    "Pink": [
      "https://m.media-amazon.com/images/I/71tJ5iLzVXS._SL1500_.jpg"
    ],
    "White": [
      "https://m.media-amazon.com/images/I/61ZjwwkCPcL._SL1500_.jpg"
    ],
    "Powder Blue": [
      "https://m.media-amazon.com/images/I/71j+noce0LL._SL1500_.jpg"
    ],
    "Beige": [
      "https://m.media-amazon.com/images/I/61tSdre1n5L._SL1500_.jpg"
    ],
    "Light Violet": [
      "https://m.media-amazon.com/images/I/61+1ESQqmJS._SL1500_.jpg"
    ],
    "Turquoise": [
      "https://m.media-amazon.com/images/I/71-OFIeK0vS._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 44.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/81+PWHqLTjL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-bodycon-sleeveless-cocktail-ruched-v-neck",
      "title": "Womens Dress Bodycon Sleeveless Cocktail Ruched V Neck",
      "price": 56.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61vGL0kNJYL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-long-sleeve-ruched",
      "title": "Womens Maxi Dress Bodycon Long Sleeve Ruched",
      "price": 48.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61GxtvdkbCL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-bodycon",
      "title": "Womens Dress Bodycon",
      "price": 44.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71f2SHW7r3L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-long-sleeve-ruched-cocktail-off-shoulder-bodycon",
      "title": "Womens Maxi Dress Formal Long Sleeve Ruched Cocktail Off Shoulder Bodycon",
      "price": 46.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71xihJgY9BL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-bodycon-ruched-long-sleeve",
      "title": "Womens Maxi Dress Bodycon Ruched Long Sleeve",
      "price": 24.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61qiT1BxzSL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-cocktail-formal-off-shoulder",
      "title": "Womens Maxi Dress Evening Cocktail Formal Off Shoulder",
      "price": 115.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/81sAnoK5v1L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-mermaid-evening-formal",
      "title": "Womens Maxi Dress Mermaid Evening Formal",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71r8V4721qL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 155.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61Oyv4QLL-L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail-short-sleeve",
      "title": "Womens Dress Cocktail Short Sleeve",
      "price": 36.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/51VJVq72XsL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-v-neck-formal-long-sleeve",
      "title": "Womens Maxi Dress V Neck Formal Long Sleeve",
      "price": 84.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51LKzkO+MDL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-formal-evening",
      "title": "Womens Maxi Dress Maxi Formal Evening",
      "price": 52.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61NaRoByawL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-maxi",
      "title": "Womens Maxi Dress Long Sleeve Maxi",
      "price": 29.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/614-6WTFsKL._SL1500_.jpg"
      ]
    }
  ]
}