{
  "id": "womens-maxi-dress-ruched-long-sleeve",
  "handle": "womens-maxi-dress-ruched-long-sleeve",
  "sku": "JC2722",
  "asin": "B01NCJGLTF",
  "title": "Womens Maxi Dress Ruched Long Sleeve",
  "title_original": "Urban CoCo Women's Elegant Long Sleeve Ruched Velvet Stretchy Long Dress",
  "brand": "Visit the Urban CoCo Store",
  "price": 55.86,
  "social_proof": {
    "bought_past_month": 307,
    "text": "307+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/61Q-IWzDdZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61dnPsLjcxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61tDdk9mE3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61wlaS6nTrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61oaxhtYKHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71paWYSMP1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/711QYZpQ7YL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/615Rne+EofL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/717JU9xPHzL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61YoOuMuKrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71K4ebVEwBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61t1B+uCcML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ScQsPZUZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61YOJE5p+FL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71QoIM-c4lL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61rAzWkF2tL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/614lU6WqXBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61dXekwtViL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61XsJIbnbRL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/6152KZPhzcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/613oJBK3CqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61HIjSx9nvL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71DEtwql4wL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71oKkaMxBsL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71cBxB29+EL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/611wA8HX2SL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71z5zOUP54L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71gkD42aREL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71GslDIiE6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/719rAFu-lSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/619nmwinqxL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/61Q-IWzDdZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61dnPsLjcxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61tDdk9mE3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61wlaS6nTrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61oaxhtYKHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71paWYSMP1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/711QYZpQ7YL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/615Rne+EofL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/717JU9xPHzL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61YoOuMuKrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71K4ebVEwBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61t1B+uCcML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ScQsPZUZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61YOJE5p+FL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71QoIM-c4lL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61rAzWkF2tL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/614lU6WqXBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61dXekwtViL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61XsJIbnbRL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/6152KZPhzcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/613oJBK3CqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61HIjSx9nvL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71DEtwql4wL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71oKkaMxBsL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71cBxB29+EL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/611wA8HX2SL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71z5zOUP54L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71gkD42aREL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71GslDIiE6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/719rAFu-lSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/619nmwinqxL._SL1500_.jpg"
  ],
  "aplus_images": [
    "https://m.media-amazon.com/images/I/31AQyOGWA9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41eKwdvCfPL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31x0IKchbTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/314-QrgFxTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51AnhaQGhSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41L7plVuxpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51OAjdx-dVS._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41nDm-jDldL._SL1500_.jpg"
  ],
  "description_images": [
    "https://m.media-amazon.com/images/I/31AQyOGWA9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41eKwdvCfPL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31x0IKchbTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/314-QrgFxTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51AnhaQGhSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41L7plVuxpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51OAjdx-dVS._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41nDm-jDldL._SL1500_.jpg"
  ],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ November 16, 2016",
    "ASIN ‏": "‎ B01MXLJRM2",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#34,231 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #619 in Women's Casual Dresses",
    "Customer Reviews": "3.6 3.6 out of 5 stars (2,127)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Wine Red",
      "Purple",
      "Lyons Blue",
      "Royal Blue",
      "Black",
      "Green"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 3.6,
    "count": 2127,
    "customers_say": "Customers find the dress comfortable with its stretch velvet material that feels as soft as a t-shirt, and appreciate its velvety fabric and substantial quality. The dress receives positive feedback for its appearance, with one customer noting it looks expensive, and customers consider it a perfect winter bridesmaid dress that offers good value for money. However, the sizing receives mixed reviews - while the length is perfect, customers report needing to buy three sizes larger than expected. Select to learn more Beauty Quality Color Fabric quality Comfort Value for money Fit Size 184 customers mention \"Beauty\" 173 positive 11 negative Customers find the dress visually appealing, particularly when dressed up with jewelry, and one customer notes it looks expensive. \"This is a beautiful dress that I anticipate wearing on Christmas eve for singing in choir. I usually wear size 6 - 8. The dress is a perfect fit....\" Read more \"There’s was beautiful but was too small so had to return it. I would go go to the next size up but would be even longer & I would be stepping on it.\" Read more \"I loved!!! Simple but very beautiful, elegant !!! The fabric, the color, a length... everything perfect....\" Read more \"This dress fit me very well and is pretty . I usually wear a size 4-6 dress and a ordered a small. Perfect for the holidays....\" Read more 154 customers mention \"Quality\" 127 positive 27 negative Customers find the dress to be of good quality, describing it as a perfect holiday dress that offers great value for money. \"It's a nice dress , it's just not forgiving of a lumpy figure. Was not flattering on my 5'2\" 145lb frame.\" Read more \"This is a great dress , I wore it to my Christmas party and received lots of complements. Beautiful dress. True to size.\" Read more \"...The dress was good quality but still fit too tight in the arms and around the waist.\" Read more \"This is a lovely dress . After I put the dress on it fit perfectly. It is beautiful. The color is rich. I am going to buy another like it....\" Read more 94 customers mention \"Color\" 90 positive 4 negative Customers like the color of the dress, with several mentioning its beautiful black and dark green shades. \"Fabric, color and fit are great...a very affordable option that can be dressed up for formal wear or with the right accessories be perfect just for...\" Read more \"This dress has a beautiful color but does not flow or fit as the picture shows it fits tight from the neck down and I sized up hoping to get it...\" Read more \"The dress was perfect. Loved the color and it was very comfortable. I wore it to a renaissance event with a corset and it was great.\" Read more \"...After I put the dress on it fit perfectly. It is beautiful. The color is rich . I am going to buy another like it. This is an honest review.\" Read more 88 customers mention \"Fabric quality\" 67 positive 21 negative Customers appreciate the fabric of the dress, describing it as velvety and substantial, with one customer noting its heavier texture. \"Love this dress ! Gorgeous unique deep teal/turquoise color. Nice fabric . Perfect flattering fit ! Modest yet classy and sophisticated....\" Read more \" Fabric , color and fit are great...a very affordable option that can be dressed up for formal wear or with the right accessories be perfect just for...\" Read more \" Fabric was nice , very slim fit on sizing for the bodice and arms. Had to return XXL,.would say it was more like an XL-L cut.\" Read more \"Unflattering. Cheap velvet . There are much better velvet gowns out there for the same amount of money.\" Read more 64 customers mention \"Comfort\" 64 positive 0 negative Customers find the dress comfortable, noting that the stretch velvet feels as soft as a t-shirt. \"...black dress for my Anna Frozen 2 Cosplay and it was super soft and comfortable ! The waist was big but I tied it with a belt, anyway. Good purchase!...\" Read more \"...-edged Esprit flats I found here which looked adorable and were very comfortable for a long formal dinner party with a long cocktail party....\" Read more \"This is so comfy and attractive. It is gorgeous by itself but will be great with a leather jacket. You can dress it up or down....\" Read more \"Very beautiful, comfortable dress . The fit is nice, the colors are very rich. I own three colors and I receive compliments whenever I wear them.\" Read more 64 customers mention \"Value for money\" 57 positive 7 negative Customers find the dress offers good value for money. \"Beautiful dress at a great price . I am P4/6 & I ordered a M. It fits well. This is a long dress; can be worn at a formal occasion....\" Read more \"...The fabric will stretch to your body. A great value and I may purchase another color.\" Read more \"...This is a great dress for the price ...you can dress it up or down.\" Read more \"...Was not expecting a velvety stretch material. Not bad for the price , but not appropriate for the event I had in mind....\" Read more 300 customers mention \"Fit\" 164 positive 136 negative Customers have mixed opinions about the dress's fit, with some finding it beautiful and the length perfect, while others report it being too big in the waist and too long in the torso. \"Beautiful dress, great fit ! Soft fabric, minimal wrinkles. Not sure where the ruching is though. I’m 5’5 and it is ankle length.\" Read more \"...dress - it does not fit the waist and does not fit at chest and it is too long . The Dress length was too long even for her friend who is 5.7....\" Read more \"It was a perfect fit andbthe color eye-catching. Practically everyone whi passed me, hadva compliment on the color.\" Read more \"This dress was way too long and too tight around the middle. I am 5'4' ABOUT 139 LBS. I probably should have got the large....\" Read more 124 customers mention \"Size\" 12 positive 112 negative Customers report significant sizing issues with the dress, needing to purchase three sizes larger than expected. \"This is a decent dress, but it runs small . I ordered a 2XL, but it was still tight across the bust, so I had to return it. I loved the color!\" Read more \"There’s was beautiful but was too small so had to return it. I would go go to the next size up but would be even longer & I would be stepping on it.\" Read more \"Returned. Not true to size .\" Read more \"I bought this for my daughter for an orchestra concert. It runs VERY small . I went by their size chart but it is inaccurate!...\" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Runs very slim fit",
        "body": "Very pretty love the color but I had to return it was way to tight I wear 2xl some time smaller because of losing weight recent still could hardly pull the dress down over my body. Read more",
        "author": "Ronni Jane",
        "rating": 5.0,
        "date": "November 6, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "1.0 out of 5 stars It's kinda tight where it should not be",
        "body": "The arms are a good fit, but that is where the good ends. Even the fit around the legs is a bit tight for this dress, when it should not be so tight. The legs the fit is okay, it could do with more material to really make it fit, flow and move better. That is where the okay stuff ends with this dress. I was very surprised to have such a tight fit in the hip area, that is not normal for this sort of dress, and my review keeps moving towards the worst parts of this! At the waist where it should be a more smooth flowing transition from tight in the bust to loose at the hips and tons of room in the legs, this fits more like a sheath dress showing off all your imperfections in that area, rather than gliding over them and smoothing them out with a looser fit. The chest is VERY tight, and I'm not that big! I'm only a 38D and planning to go bigger this summer, if I go much bigger this dress may not even fit me! I would say order up a size if you can! If you look at the seams you can easily see the problem. There should be some triangular seems near the hemline, there isn't. When the dress is hanging you should see a slight hourglass shape to it, instead there is nothing but straight seams around the waist. The did stitch it together like a long sheath dress that fits nothing like it does the model in the image. It's cut to stretch so your body makes the curves instead of the dress giving you the curves with proper stitching. This is a cheap and poorly made dress. The weird part is that the seams are sitting where they should, but the fit is all wrong. It's as if the manufacturer tried to make the dress fit with as little material as possible. Rather than make a comfortable flattering dress for as many body types as possible they chose to cut corners and make people feel bad about themselves. Not a good business model. Read more",
        "author": "Elle",
        "rating": 1.0,
        "date": "January 17, 2022",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Comfy, classy, and flattering!",
        "body": "This is a very nice dress, especially for the price! I am a 12/14 and tried a few sizes, and ended up with the XXL. I did not want it too tight, and I wanted some give. I actually could have gotten away with a Xl or even L, but rather have the ease; rather than making my stomach poke out, the princess-ines are flattering. I said \"fit as expected\", but that is by the measurements they post with the sizes - this is NOT American sizing. Often when they use this sizing, I find the waist is too ow; that is NOT the case in this dress. I am 5'4\" and the length comes to my ankles. Glad I did not have to hem it but for a taller person you probably are looking at a tea-length dress. I actually bought it as a lounge-dress to be comfy at night, but I would not hesitate to put on a nice necklace an have a date-night! The purple is very dark, but some would call it elegant. The stretchy material is what makes it so comfortable. I cannot figure out why the \"Runched\" is in the title. When I first saw this title I passed it by, but then eventually I looked closely at the picture and did not see any raunching. Bottom line - if you wnt raunching you will not want this dress. The stretchy velvet has a nice, tight nap. again - WELL WORTH the money! Read more",
        "author": "MJM",
        "rating": 5.0,
        "date": "May 9, 2018",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Not true to size Sigh!",
        "body": "Very lovely dress, but it is cut narrowly. I am 5' 5\" and 154#. The XL was too small, but I have a lovely slender friend who can wear it. I ordered a second in XXL, and that is unflatteringly tight - shows all the bulges. Usually, XL is more than roomy; I like my clothes to fit loosely. I wish they made an XXXL. Read more",
        "author": "ANNE H.",
        "rating": 3.0,
        "date": "September 7, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Order up a size or two",
        "body": "I ordered one size up after reading the reviews, then had to order XXL and it fits well but snuggly. Runs small-tight, not short. Other than the sizing issues I really do like the dress. I hesitated to buy it because it said it was ruched which I’m not fond off, though it is very nicely subtle in this dress. Overall I’m happy with the dress, though it really runs quite small. I would have given it 5 stars if it weren’t for the small size. Read more",
        "author": "a reader",
        "rating": 4.0,
        "date": "December 22, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Fit and quality",
        "body": "Bought also in red, love the quality the fit. Love this Read more",
        "author": "Audrey S Foote",
        "rating": 5.0,
        "date": "December 4, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "2.0 out of 5 stars Pretty but did not fit properly",
        "body": "Color is great- deep saturated color (black and blue), material soft & stretchy. (For 5'1\" person/ hourglass shape body/145) The length was too long. It hit the floor. The neckline was very loose. The chest area fit nicely, with some room to move. The sleeves were long- hit at my knuckles. The waist of the dress rode up and bunched around the midsection of the body. The bottom is a bell-type shape that flares out a bit. I love the dress and usually would bring it to a tailor to adjust it where it didn't fit- but there are too many things that need adjustment. Read more",
        "author": "Chris Q.",
        "rating": 2.0,
        "date": "October 7, 2021",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Beautiful Long Velour Dress",
        "body": "Beautiful dress at a great price. I am P4/6 & I ordered a M. It fits well. This is a long dress; can be worn at a formal occasion. It can be hemmed, using the extra fabric as a belt to give the dress some body. The sleeves require some tailoring as well. The fabric is soft & comfortable. It is not transparent. I have not laundered it yet. But I would do so in a gentle cycle. Read more",
        "author": "Linda G. S.",
        "rating": 5.0,
        "date": "April 2, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Ruched Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.",
  "about_this_item": "Womens Maxi Dress Ruched Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.",
  "long_description": "Womens Maxi Dress Ruched Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Wine Red, Purple, Lyons Blue, Royal Blue, Black, Green. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Ruched Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/31AQyOGWA9L._SL1500_.jpg",
      "alt": "Womens Maxi Dress Ruched Long Sleeve details image 1"
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/41eKwdvCfPL._SL1500_.jpg",
      "alt": "Womens Maxi Dress Ruched Long Sleeve details image 2"
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/31x0IKchbTL._SL1500_.jpg",
      "alt": "Womens Maxi Dress Ruched Long Sleeve details image 3"
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/314-QrgFxTL._SL1500_.jpg",
      "alt": "Womens Maxi Dress Ruched Long Sleeve details image 4"
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Wine Red, Purple, Lyons Blue, Royal Blue, Black, Green. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/51AnhaQGhSL._SL1500_.jpg",
      "alt": "Womens Maxi Dress Ruched Long Sleeve details image 5"
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [],
  "color_swatches": {
    "Wine Red": "https://m.media-amazon.com/images/I/31pKs3sbxgL._AC_SR38,50_.jpg",
    "Purple": "https://m.media-amazon.com/images/I/3152DMBSm5L._AC_SR38,50_.jpg",
    "Lyons Blue": "https://m.media-amazon.com/images/I/31KMuMKxTvL._AC_SR38,50_.jpg",
    "Royal Blue": "https://m.media-amazon.com/images/I/31N2p4msMjL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31cjyehoAPL._AC_SR38,50_.jpg",
    "Green": "https://m.media-amazon.com/images/I/31eRUxiHKkL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Wine Red": "71paWYSMP1L",
    "Purple": "61t1B+uCcML",
    "Lyons Blue": "614lU6WqXBL",
    "Royal Blue": "61HIjSx9nvL",
    "Black": "61Q-IWzDdZL",
    "Green": "71z5zOUP54L"
  },
  "color_images": {
    "Wine Red": [
      "https://m.media-amazon.com/images/I/71paWYSMP1L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/711QYZpQ7YL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/615Rne+EofL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/717JU9xPHzL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61YoOuMuKrL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71K4ebVEwBL._SL1500_.jpg"
    ],
    "Purple": [
      "https://m.media-amazon.com/images/I/61t1B+uCcML._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61ScQsPZUZL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61YOJE5p+FL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71QoIM-c4lL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61rAzWkF2tL._SL1500_.jpg"
    ],
    "Lyons Blue": [
      "https://m.media-amazon.com/images/I/614lU6WqXBL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61dXekwtViL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61XsJIbnbRL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/6152KZPhzcL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/613oJBK3CqL._SL1500_.jpg"
    ],
    "Royal Blue": [
      "https://m.media-amazon.com/images/I/61HIjSx9nvL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71DEtwql4wL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71oKkaMxBsL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71cBxB29+EL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/611wA8HX2SL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/61Q-IWzDdZL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61dnPsLjcxL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61tDdk9mE3L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61wlaS6nTrL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61oaxhtYKHL._SL1500_.jpg"
    ],
    "Green": [
      "https://m.media-amazon.com/images/I/71z5zOUP54L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71gkD42aREL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71GslDIiE6L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/719rAFu-lSL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/619nmwinqxL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 75.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71He+3GUqJL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 149.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Wedding Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/515AET9H9TL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-off-shoulder-formal-sleeveless-cocktail",
      "title": "Womens Maxi Dress Off Shoulder Formal Sleeveless Cocktail",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61ML72R5uSL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 51.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51IkLUiIetL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-one-shoulder-formal-mermaid-bodycon-evening-maxi",
      "title": "Womens Maxi Dress One Shoulder Formal Mermaid Bodycon Evening Maxi",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71mgUBuGwhL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-maxi-formal-v-neck",
      "title": "Womens Maxi Dress Maxi Formal V Neck",
      "price": 101.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61nBlsgpmDL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-formal",
      "title": "Womens Dress Formal",
      "price": 67.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51IL+fRSLGL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-long-sleeve-ruched-cocktail",
      "title": "Womens Maxi Dress Bodycon Long Sleeve Ruched Cocktail",
      "price": 38.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61JSKJJKTeL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-mermaid",
      "title": "Womens Maxi Dress Long Sleeve Mermaid",
      "price": 178.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61rBTtxm4NL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-v-neck",
      "title": "Womens Maxi Dress Long Sleeve V Neck",
      "price": 42.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/716YlptkCIL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-bodycon",
      "title": "Womens Maxi Dress Cocktail Bodycon",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51uHSouUIRL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail-bodycon-ruched",
      "title": "Womens Dress Cocktail Bodycon Ruched",
      "price": 54.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61NkbYTg92L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-mermaid-formal",
      "title": "Womens Maxi Dress Mermaid Formal",
      "price": 94.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/51tD32RPJ+L._SL1500_.jpg"
      ]
    }
  ]
}