{
  "id": "womens-maxi-dress-formal-cocktail",
  "handle": "womens-maxi-dress-formal-cocktail",
  "sku": "JC1437",
  "asin": "B07L5874C2",
  "title": "Womens Maxi Dress Formal Cocktail",
  "title_original": "Dressystar Womens Long-Sleeve Wedding Guest Dress A-Line Lace Formal Party Cocktail Midi Dress Prom Gown",
  "brand": "Visit the Dressystar Store",
  "price": 49.99,
  "social_proof": {
    "bought_past_month": 50,
    "text": "50+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/71kZcZc7BkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71HW-1mpekL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71u6uptcmOL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71QG2QpoS1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81CfsT2NkiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71lT0X9j0FL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71wB4mroMZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71d2GvTDu-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/718peQCfbXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71VPdNm4MVL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81Igqx16BIL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71AI8BlnoQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61xsYBi97UL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81dO955xQ+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71clXwVnTeL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/716RN37WP4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/715w6auSX0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81ddZQInjuL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Tudb0rQWL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/71kZcZc7BkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71HW-1mpekL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71u6uptcmOL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71QG2QpoS1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81CfsT2NkiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71lT0X9j0FL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71wB4mroMZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71d2GvTDu-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/718peQCfbXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71VPdNm4MVL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81Igqx16BIL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71AI8BlnoQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61xsYBi97UL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81dO955xQ+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71clXwVnTeL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/716RN37WP4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/715w6auSX0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81ddZQInjuL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Tudb0rQWL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ January 5, 2018",
    "ASIN ‏": "‎ B078T1ZL25",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#40,023 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #101 in Women's Cocktail Dresses",
    "Customer Reviews": "4.2 4.2 out of 5 stars (8,729)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Burgundy",
      "Black",
      "Dark Red",
      "Dark Green",
      "Navy",
      "Champagne2",
      "Lavender2",
      "White",
      "Blush",
      "Purple",
      "Grape",
      "Royal Blue",
      "Blush2",
      "Grey"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.2,
    "count": 8729,
    "customers_say": "Customers find the dress beautiful and well-made, with a wonderful fit that falls just below the knee. They appreciate its comfort, noting it's not scratchy or itchy, and consider it good value for money. The color receives positive feedback, with one customer specifically mentioning the emerald green shade. Regarding size and length, while some find it true to measurements, others report it runs small and is too long for their height. Generated from the text of customer reviews Select to learn more Fit (578) Beauty (537) Quality (339) Comfort (193) Color (168) Value for money (132) Size (226) Length (122) 578 customers mention fit, 448 positive, 130 negative 578 customers mention \"Fit\" 448 positive 130 negative Customers are satisfied with how the dress fits, noting that it falls just below the knee and is not baggy. \" ...They are so pretty and feminine and fit perfectly . You'll have to order a strapless bra--unless you like the look of bra straps showing. I do not. :-) \" Read more \" I am 5’6 130lbs 35 bust, 31 waist and 35 hips the Medium was a perfect fit . I love the 3/4 length sleeves since no sleeve are never long enough.... \" Read more \" Great fit , I was worried about the waist due to the covid-19 extra pounds but this material has just the right amount of stretch.... \" Read more \" Was a little tight in the arms but overall, loved it! \" Read more 537 customers mention beauty, 510 positive, 27 negative 537 customers mention \"Beauty\" 510 positive 27 negative Customers find the dress beautiful and of nice quality, with one mentioning it looks expensive. \" This is beautiful dress I bought this for my marriage anniversary, I am 5’4 n buy xl size it’s little bit loose for me, but easily fix that, am do... \" Read more \" ...Got loads of compliments and I felt incredibly comfortable and beautiful . I have also worn it post partum for a photoshoot and it still fit nicely :) \" Read more \" I like this dress, is very pretty and the size was correct, I just have one complaint it’s that the style was different, I ordered four dresses for... \" Read more \" This dress was really classy and pretty . I received a lot of compliments and it was comfortable too. I am 5’4 and it hit almost at my calf. \" Read more 339 customers mention quality, 315 positive, 24 negative 339 customers mention \"Quality\" 315 positive 24 negative Customers find the dress to be well-made and perfect, with one customer specifically mentioning it works well as a mother of the groom dress. \" Nice dress , but very tight in the bodice. Usually wear a XL or 1X. I had to order a 3X to fit in the bodice. Wanted a fancy red dress for Christmas.... \" Read more \" Great dress looks just like the picture one of the dresses i pick to wear for my wedding.... \" Read more \" ...The dress is well made , and fits perfectly. Would totally work as a bridal dress for a non formal wedding. \" Read more \" ...this for my elopement and I thought it was really cute and it was a good quality but it was way smaller in person and I thought I ordered a size up.... \" Read more 193 customers mention comfort, 184 positive, 9 negative 193 customers mention \"Comfort\" 184 positive 9 negative Customers find the dress comfortable, noting it's not scratchy or itchy, and one customer mentions it's not suffocating. \" ...A weird fit, too tight, the usual. But this dress is really a comfortable and very pretty dress would definitely recommend to others to give it a try. \" Read more \" Such a beautiful dress and better than I expected. Very comfortable as well but I bought a size up(L instead of M) so it had a little room but was... \" Read more \" ...too sure about buying a dress off Amazon but I love this dress it’s comfy and exactly what I was looking for! I’m 5’1” 170lbs and I got large.... \" Read more \" ...Church appropriate and so comfortable . Fit true to size! I bought it in lavender and would definitely purchase it in other colors for other events. \" Read more 168 customers mention color, 133 positive, 35 negative 168 customers mention \"Color\" 133 positive 35 negative Customers like the dress's color, particularly its pretty black lace design and pure white version, with some appreciating the emerald green shade. \" The dress is a beautiful color but the fit is not accurate. It was ok in the bust and arms but too tight in the waist.... \" Read more \" ...At least 3 sizes smaller. Pretty style and color but totally useless unless you can possibly order 3 or more sizes bigger. Waste of time and money. \" Read more \" I love the color , i ordered this for an award banquet & i received a lot compliments on the dress. \" Read more \" Fit but was wrong color , needed a brighter color. \" Read more 132 customers mention value for money, 126 positive, 6 negative 132 customers mention \"Value for money\" 126 positive 6 negative Customers find the dress offers good value for money, describing it as stylish and well-made for its price point. \" ...Fit great, looked great, and a great price compared to the formal wear that is out on the market. \" Read more \" Great value . Used this dress instead of department store dress that looks very similar, but cost $85. \" Read more \" Beautiful dress! Good price . Delivery right on time. Thank you! \" Read more \" ...It is very pretty and inexpensive . The fabric is stretchy and soft. Looks very nice on. Fabric hooks easily though, so be careful! \" Read more 226 customers mention size, 69 positive, 157 negative 226 customers mention \"Size\" 69 positive 157 negative Customers have mixed opinions about the dress's sizing, with some finding it true to size and noting it's the right length, while others report it runs small and is way too small. \" ...fact that I ordered a larger size than what I wear and it was still too small and did not have a larger size so I couldn't get one very disappointing \" Read more \" Runs small ...typically wear a L ordered a XL.. wore to my Gma funeral.. needed a specific color in a short amount of time & it was perfect ! \" Read more \" True to Size . I wore this dress for my bridal shower. I received so many compliments. The material is nice and flowy and the dress looks expensive.... \" Read more \" Was disappointed not true to size , I wear a 3x and could not begin to zip up, should have read the size chart \" Read more 122 customers mention length, 67 positive, 55 negative 122 customers mention \"Length\" 67 positive 55 negative Customers have mixed opinions about the dress length, with some finding it great while others mention it runs long for their height. \" This dress had just the right amount of lace and nice length for my son's afternoon wedding. Great mother of the groom dress! \" Read more \" ...Unfortunately, it is too long and heavy. It fits fine except the length. I am only 5'1\" tall and weigh 74.4 pounds.... \" Read more \" ...The dress is very pretty, comfortable and great length . My daughter is 5’4/117 lbs and it still covered her knees. I ordered a small for her. \" Read more \" Nice Dress, a little short waisted . \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Perfect Mix of Classy and Comfortable",
        "body": "This dress is absolutely beautiful! The lace is incredibly soft, and the length is perfect—it falls just below my knee. The burgundy underdress paired with the lace overlay looks and feels so luxurious. I bought it for an outdoor wedding, and it’s the perfect balance of elegant and comfortable. The dress is really stretchy. Several have said it snags really easily but I haven’t worn it yet. I ordered a size up based on other reviews, but I probably should have gone with my regular size. I’m hesitant to exchange it because I’ve received returns before that smelled reeked of perfume, even though the tags were still attached. Read more",
        "author": "Pris",
        "rating": 5.0,
        "date": "October 29, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars This is a great dress at a great price",
        "body": "This is a beautiful dress. It is well Made and Elegant with lovely soft lace. Unfortunately the fit was not suiting me so I had to return it with regret. Read more",
        "author": "Customer",
        "rating": 5.0,
        "date": "December 2, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Good enough",
        "body": "It's ok. It looks nice and fits ok. It's a little shorter than I'd like. Read more",
        "author": "R. Dittmar",
        "rating": 4.0,
        "date": "October 28, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Perfect for my size and worth the money",
        "body": "The dress is exactly what I was expecting other than the little thing like getting in and out convenience. If you have someone to assist you zipping up the last few inches it's no problem, though. However, it is manageable. Material weight is not too thin or thick; it’s a perfect dress for a fall wedding I am attending. I am happy with the quality and shelouette. I am 5’2 and 107 lb 32 C. Purchased size S. There is just enough room for the upper body movement, but it's not a lot of room left. I would go up in size if you like more room or if you are D above in bra size. I am attending a rather formal wedding at the high-end hotel, and this is affordable, elegant yet not too flashy dress that would be approved by older generations. I looked around department store but couldn't find anything so decided to try this one after comparing everything I found on Amazon and other sites online. I am very happy with the purchase. Read more",
        "author": "Amy Sdareg",
        "rating": 5.0,
        "date": "October 15, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/615QDhJ02vL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/51mLfQ+EBQL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Beautiful Red Dress",
        "body": "This is a beautiful dark red dress. It fit perfect and the lace is soft and comfortable. I am 5’6” and 190lbs. I ordered a 3X which is larger than I normally order, but it fit perfect. It was just too red for my granddaughters wedding. Read more",
        "author": "Kris",
        "rating": 5.0,
        "date": "October 27, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Runs VERY small!",
        "body": "I ordered a size L as I am around a US size 12 so I thought the L would give me some breathing room. The dress itself is quite lovely, but I would say the size L was more like a US size 6 or 8! I am assuming the XL would also be too small. Read more",
        "author": "JAS",
        "rating": 3.0,
        "date": "November 24, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Great party dress",
        "body": "Perfect fit, beautiful on my daughter, nice color Read more",
        "author": "Gramgram",
        "rating": 5.0,
        "date": "December 7, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Beautiful dress.",
        "body": "Loved it way better than I thought I would. Fit was good. Little stretch to it. I'd buy another. Read more",
        "author": "Heather K",
        "rating": 5.0,
        "date": "December 16, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Formal Cocktail is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.",
  "about_this_item": "Womens Maxi Dress Formal Cocktail is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.",
  "long_description": "Womens Maxi Dress Formal Cocktail is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Burgundy, Black, Dark Red, Dark Green, Navy, Champagne2, Lavender2, White, Blush, Purple, Grape, Royal Blue, Blush2, Grey. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Formal Cocktail is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Burgundy, Black, Dark Red, Dark Green, Navy, Champagne2, Lavender2, White, Blush, Purple, Grape, Royal Blue, Blush2, Grey. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "08a9abef-dc58-4db6-9c01-d72edd468ea1",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/08a9abef-dc58-4db6-9c01-d72edd468ea1/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/08a9abef-dc58-4db6-9c01-d72edd468ea1/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/1a51dce4-2eee-4087-880d-72dcd77b81b1.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "ef53aa48-1049-49b8-84c4-8a9d035b5681",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ef53aa48-1049-49b8-84c4-8a9d035b5681/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ef53aa48-1049-49b8-84c4-8a9d035b5681/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/1a51dce4-2eee-4087-880d-72dcd77b81b1.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "07e22c68-72ef-4c16-8196-65e3f418763e",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/07e22c68-72ef-4c16-8196-65e3f418763e/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/07e22c68-72ef-4c16-8196-65e3f418763e/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/1a51dce4-2eee-4087-880d-72dcd77b81b1.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "05ce58eb-1328-417e-ba7b-6becec01c0fa",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/05ce58eb-1328-417e-ba7b-6becec01c0fa/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/05ce58eb-1328-417e-ba7b-6becec01c0fa/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/1a51dce4-2eee-4087-880d-72dcd77b81b1.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "f4980fe4-2023-4dba-bd19-2d1c18897865",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f4980fe4-2023-4dba-bd19-2d1c18897865/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f4980fe4-2023-4dba-bd19-2d1c18897865/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/1a51dce4-2eee-4087-880d-72dcd77b81b1.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "58fd6a8b-466e-48a8-9d30-d647424af1fb",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/58fd6a8b-466e-48a8-9d30-d647424af1fb/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/58fd6a8b-466e-48a8-9d30-d647424af1fb/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/1a51dce4-2eee-4087-880d-72dcd77b81b1.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "bf8808a8-913c-4367-9920-7978c3f65319",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bf8808a8-913c-4367-9920-7978c3f65319/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bf8808a8-913c-4367-9920-7978c3f65319/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/1a51dce4-2eee-4087-880d-72dcd77b81b1.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "c1ba3d0a-b7c6-48bf-84b2-28f3e004d1e8",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c1ba3d0a-b7c6-48bf-84b2-28f3e004d1e8/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c1ba3d0a-b7c6-48bf-84b2-28f3e004d1e8/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/1a51dce4-2eee-4087-880d-72dcd77b81b1.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "7e38f92f-fb46-4967-84d5-7c792764086f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7e38f92f-fb46-4967-84d5-7c792764086f/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7e38f92f-fb46-4967-84d5-7c792764086f/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/1a51dce4-2eee-4087-880d-72dcd77b81b1.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "54e77c59-de28-44f6-b520-e922de10766c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/54e77c59-de28-44f6-b520-e922de10766c/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/54e77c59-de28-44f6-b520-e922de10766c/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/1a51dce4-2eee-4087-880d-72dcd77b81b1.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "d83453cf-3105-4937-9d8c-79668a7ab557",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d83453cf-3105-4937-9d8c-79668a7ab557/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d83453cf-3105-4937-9d8c-79668a7ab557/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/1a51dce4-2eee-4087-880d-72dcd77b81b1.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "30cda7fb-8b7d-4804-bf17-89d92d1a2b55",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/30cda7fb-8b7d-4804-bf17-89d92d1a2b55/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/30cda7fb-8b7d-4804-bf17-89d92d1a2b55/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/1a51dce4-2eee-4087-880d-72dcd77b81b1.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Burgundy": "https://m.media-amazon.com/images/I/412FZ8i2YsL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/415z7uIPm4L._AC_SR38,50_.jpg",
    "Dark Red": "https://m.media-amazon.com/images/I/41iVhziSV2L._AC_SR38,50_.jpg",
    "Dark Green": "https://m.media-amazon.com/images/I/41RGz1joP0L._AC_SR38,50_.jpg",
    "Navy": "https://m.media-amazon.com/images/I/41-pycU-UwL._AC_SR38,50_.jpg",
    "Champagne2": "https://m.media-amazon.com/images/I/41WDZ6fPg8L._AC_SR38,50_.jpg",
    "Lavender2": "https://m.media-amazon.com/images/I/41CWiWHmGBL._AC_SR38,50_.jpg",
    "White": "https://m.media-amazon.com/images/I/31IQ6hgPccL._AC_SR38,50_.jpg",
    "Blush": "https://m.media-amazon.com/images/I/41e2C9W4LbL._AC_SR38,50_.jpg",
    "Purple": "https://m.media-amazon.com/images/I/41jYoyaTvxL._AC_SR38,50_.jpg",
    "Grape": "https://m.media-amazon.com/images/I/41fgdf1olSL._AC_SR38,50_.jpg",
    "Royal Blue": "https://m.media-amazon.com/images/I/418E4InM4lL._AC_SR38,50_.jpg",
    "Blush2": "https://m.media-amazon.com/images/I/41i3Bdw4TgL._AC_SR38,50_.jpg",
    "Grey": "https://m.media-amazon.com/images/I/41PGye6XldL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Burgundy": "71kZcZc7BkL",
    "Black": "71wB4mroMZL",
    "Dark Red": "71d2GvTDu-L",
    "Dark Green": "718peQCfbXL",
    "Navy": "71VPdNm4MVL",
    "Champagne2": "81Igqx16BIL",
    "Lavender2": "71AI8BlnoQL",
    "White": "61xsYBi97UL",
    "Blush": "81dO955xQ+L",
    "Purple": "71clXwVnTeL",
    "Grape": "716RN37WP4L",
    "Royal Blue": "715w6auSX0L",
    "Blush2": "81ddZQInjuL",
    "Grey": "71Tudb0rQWL"
  },
  "color_images": {
    "Burgundy": [
      "https://m.media-amazon.com/images/I/71kZcZc7BkL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/71wB4mroMZL._SL1500_.jpg"
    ],
    "Dark Red": [
      "https://m.media-amazon.com/images/I/71d2GvTDu-L._SL1500_.jpg"
    ],
    "Dark Green": [
      "https://m.media-amazon.com/images/I/718peQCfbXL._SL1500_.jpg"
    ],
    "Navy": [
      "https://m.media-amazon.com/images/I/71VPdNm4MVL._SL1500_.jpg"
    ],
    "Champagne2": [
      "https://m.media-amazon.com/images/I/81Igqx16BIL._SL1500_.jpg"
    ],
    "Lavender2": [
      "https://m.media-amazon.com/images/I/71AI8BlnoQL._SL1500_.jpg"
    ],
    "White": [
      "https://m.media-amazon.com/images/I/61xsYBi97UL._SL1500_.jpg"
    ],
    "Blush": [
      "https://m.media-amazon.com/images/I/81dO955xQ+L._SL1500_.jpg"
    ],
    "Purple": [
      "https://m.media-amazon.com/images/I/71clXwVnTeL._SL1500_.jpg"
    ],
    "Grape": [
      "https://m.media-amazon.com/images/I/716RN37WP4L._SL1500_.jpg"
    ],
    "Royal Blue": [
      "https://m.media-amazon.com/images/I/715w6auSX0L._SL1500_.jpg"
    ],
    "Blush2": [
      "https://m.media-amazon.com/images/I/81ddZQInjuL._SL1500_.jpg"
    ],
    "Grey": [
      "https://m.media-amazon.com/images/I/71Tudb0rQWL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress-sleeveless",
      "title": "Womens Dress Sleeveless",
      "price": 35.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61yI39cmpfL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-long-sleeve-maxi",
      "title": "Womens Maxi Dress Cocktail Long Sleeve Maxi",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61blndjnsnL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-bodycon-long-sleeve",
      "title": "Womens Maxi Dress Maxi Bodycon Long Sleeve",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51xY-nVpN9L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 36.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61Uh0mHFneL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-sleeveless",
      "title": "Womens Dress Sleeveless",
      "price": 38.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71h38kyippL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress-v-neck",
      "title": "Womens Dress V Neck",
      "price": 38.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71B0V8etdmL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening",
      "title": "Womens Maxi Dress Formal Evening",
      "price": 63.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71DmbLdJdkL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 33.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61W5l+uioHL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-maxi",
      "title": "Womens Maxi Dress Evening Maxi",
      "price": 14.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/81CIc2WXCaL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-sleeveless",
      "title": "Womens Dress Sleeveless",
      "price": 19.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71nuuzdxpsL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-v-neck",
      "title": "Womens Dress V Neck",
      "price": 36.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61y1kzGaLhL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-off-shoulder",
      "title": "Womens Maxi Dress Off Shoulder",
      "price": 165.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Wedding Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/61i1OBlANrL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-evening",
      "title": "Womens Maxi Dress Long Sleeve Evening",
      "price": 80.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61VgahOOFhL._SL1500_.jpg"
      ]
    }
  ]
}