{
  "id": "womens-maxi-dress-long-sleeve-off-shoulder",
  "handle": "womens-maxi-dress-long-sleeve-off-shoulder",
  "sku": "JC1557",
  "asin": "B07L6GRYMX",
  "title": "Womens Maxi Dress Long Sleeve Off Shoulder",
  "title_original": "GOKATOSAU Women's Sexy Casual Off Shoulder Long Sleeve Lace Up Loose Club Mini Dress",
  "brand": "Visit the GOKATOSAU Store",
  "price": 41.99,
  "social_proof": {
    "bought_past_month": 587,
    "text": "587+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/51toMunZZJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/4114tAkQ6iL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61A5YfBfTkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71l+-d4sKYL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81etm3pspJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61W9K-iM1UL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81IDgcJw09L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71iH73vwagL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71XmcJJHc9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51QqemZ-ZYL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/513-GgBPC7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51mYHSeWZqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51WBRBMhL5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/518ZcsEYI5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61KKUBWNeJL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/51toMunZZJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/4114tAkQ6iL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61A5YfBfTkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71l+-d4sKYL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81etm3pspJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61W9K-iM1UL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81IDgcJw09L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71iH73vwagL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71XmcJJHc9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51QqemZ-ZYL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/513-GgBPC7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51mYHSeWZqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51WBRBMhL5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/518ZcsEYI5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61KKUBWNeJL._SL1500_.jpg"
  ],
  "aplus_images": [
    "https://m.media-amazon.com/images/I/41mjL-yM4EL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/4194B3GEBbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41WaB1bnLAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41hP7ZGZo1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41AmSk4%2B0KL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31J%2B0VY%2BDoL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41hHrPWx5zL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41AxPe6T3gL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41jtcmYbfrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31Ncdld9waL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41CQelRF0XL._SL1500_.jpg"
  ],
  "description_images": [
    "https://m.media-amazon.com/images/I/41mjL-yM4EL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/4194B3GEBbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41WaB1bnLAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41hP7ZGZo1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41AmSk4%2B0KL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31J%2B0VY%2BDoL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41hHrPWx5zL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41AxPe6T3gL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41jtcmYbfrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31Ncdld9waL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41CQelRF0XL._SL1500_.jpg"
  ],
  "bullets": [],
  "specs": {
    "Is Discontinued By Manufacturer ‏": "‎ No",
    "Item model number ‏": "‎ KO013",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ December 7, 2018",
    "ASIN ‏": "‎ B07L6FCQ5P",
    "Best Sellers Rank": "#19,058 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #377 in Women's Casual Dresses",
    "Customer Reviews": "4.1 4.1 out of 5 stars (4,135)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Red",
      "Winered",
      "Khaki",
      "Pink",
      "White",
      "Iongrey",
      "Black"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.1,
    "count": 4135,
    "customers_say": "Customers find the dress comfortable, sexy, and flattering, with one noting it's perfect for New Year's Eve and another mentioning it's suitable for winter in Vegas. The material quality receives positive feedback, and the fit is nice, with one customer noting it hits right above the knee. The length receives mixed reviews - while some find it true to size, others say it's not short enough. The sizing is also mixed, with some finding it true to size while others say it runs large. Select to learn more Fit Sexy look Quality Comfort Material quality Flattering Size Length 191 customers mention \"Fit\" 151 positive 40 negative Customers like how the dress fits, noting it's not tight around the arms and is not loose, with one customer mentioning it hits right above the knee. \"I am a big girl and this was a perfect fit you don't even have to keep The ties on if you don't want it cute with or without the them.\" Read more \"It makes me feel so sexy! And fits great I got a large and I am 170 and 5'7 and it makes me look amazing! Can't wait to wear it on date night\" Read more \"Loved everything!!!! Fit perfectly ! Loved the short length to show a little thigh!!! Oh the boots were Amazon too! Absolute fire!\" Read more \"The dress was perfect. It was a little short on me , so I wore it with some leggings. It is true to size. I love it!!!\" Read more 161 customers mention \"Sexy look\" 151 positive 10 negative Customers love the dress's appearance, noting it looks exactly like the picture and makes them feel beautiful, while being versatile enough to dress up or down. \"I ordered this last min on my birthday this dress came thru super cute easy to style very comfortable also it is a very thick sweater like material...\" Read more \"...Very comfortable and sexy . I have a big belly I am 5’6 241 pounds I ordered an XL. My daughter is 5’11 and she ordered a XXL GREAT FIT VERY HAPPY\" Read more \" Super cute ! I got a size larger so that it would be long enough, and fall off my shoulders. I gathered the strings really tight to form a silhouette....\" Read more \" very cute . almost as pictured. strings aren’t nearly as long as they appear in the photo. good material. well made....\" Read more 106 customers mention \"Quality\" 98 positive 8 negative Customers find the dress to be of good quality, with several mentioning it's perfect for New Year's Eve, and one customer noting it doesn't feel cheap. \" Good quality and beautiful material but Will be returning this item. It is too tight over my breast and I ordered a size bigger than I wear....\" Read more \" Great dress . Bought this for new years and it didn't disappoint\" Read more \" Love the dress . I ordered the dress based on the reviews because the dress was a darker yellow the the pictures....\" Read more \"...under my dress so it wasn't that big of a deal.. came quick... great quality looks as pictured!\" Read more 89 customers mention \"Comfort\" 85 positive 4 negative Customers find the dress comfortable, with one mentioning it works well in cold weather and another noting it's suitable for night wear. \"...The material is thick and comfortable , but I would have been pulling this down the whole time so in returned it. You'd need to order 1-2 sizes up.\" Read more \"I love this dress. It fits right, it's made nicely and its comfy . I bought it to ware it for my birthday and I'm happy I got it....\" Read more \"...More like a oversized sweatshirt. I am keeping it, because it is very comfortable , and good quality, just don't expect to wear it out to the Club...\" Read more \"Love the material. Super comfortable and thick, will not rip or damage easy. Will be buying in other colors\" Read more 49 customers mention \"Material quality\" 42 positive 7 negative Customers like the material of the dress, describing it as nice and not cheap-looking. \"...I went to a white party and I felt cute all night. Good material , doesn’t feel cheap or anything. It’s like a hoodie almost....\" Read more \"...I love the material and if you don’t mind a tight fit it looks better right but loose and kinda baggy like the mode no they just posed her well\" Read more \" Great material fit wonderful a little long in the arms but it worked out perfect! Stayed over my booty too while I danced the night away!\" Read more \"Very comfortable, nice fabric . I'm glade I got a medium to have more room.\" Read more 45 customers mention \"Flattering\" 36 positive 9 negative Customers find the dress flattering, particularly noting how it hugs their curves, and one customer mentions it hides a big belly well. \"...The fit is great, it’s flattering and the material is soft. Overall, no complaints. I like it a lot.\" Read more \"...However, if you don't this could be very flattering and hide any imperfections around the waist....\" Read more \" Very flattering dress . Fit perfect. Ordered a large....\" Read more \"Was not flattering . Fits more like a shirt than a dress.\" Read more 60 customers mention \"Size\" 30 positive 30 negative Customers have mixed opinions about the dress's fit, with some finding it true to size while others report it runs large. \"...It is true to size . I ordered a small , and I am satisfied. It’s sexy and simple. I can wore this out to eat ,and received over ten compliments....\" Read more \"It was too small .\" Read more \" Runs extremely big \" Read more \"The dress was to big but looks nice\" Read more 79 customers mention \"Length\" 22 positive 57 negative Customers have mixed opinions about the dress's length, with some finding it too long while others say it's not short enough. \"...I say \"dress\" because it's way too wide and too short . It just looks frumpy. If you want a giant comfy hoodie like top, then this would be great....\" Read more \"I'm 5'0 150 lbs. I ordered a large. It fits true to size, but it's kind of short . I might wear it as a shirt with some ripped up jeans.\" Read more \"I was hesitant at first to buy this, but I’m glad I did. It’s not too short and not long. It’s thick, so perfect for the colder months....\" Read more \"this dress i way too short for a dress and way too long for a shirt. I have never worn it and can't return it because I'm a procrastinator..smh\" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Comfy and Sexy (dress it up or down)",
        "body": "I like that you can wear this out to a party and look hot or a baseball game with some adidas and a ball cap and still look cute af and feel comfy af. I'm 5'7, was a little worried about it being too short, but it actually hits right above my knee, even wearing boots with a heel, the dress still didn't feel too short. In plus size usually wear xl or xxl depending on fit, some reviews said it ran a little small so I purchased a 3xl. I'm a bigger girl, 250 pounds, I still had plenty of room, wasn't too fitting, of course you can adjust that with the strings. The sleeves are longer (which you can even see that with the model) I probably could have gone down to a 2xl but was worried about the length. The shoulders actually come off the shoulder, I've bought off the shoulder shirts and dresses before that barely came off the should without forcing it down, you don't have to do that with this dress. Very Flattering, especially on bigger thicker girls. Read more",
        "author": "Ashley",
        "rating": 5.0,
        "date": "September 26, 2023",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Very cute, nice material",
        "body": "So I didn't upload a pic because quite honestly; the dress is too short on me. HOWEVER, it fits everywhere else wonderfully! The sleeves are nice and long. They hang past my palms. The material is thick and stretchy. You do have to lace it up yourself. I used tweezers to pull it through. I'm 5\"6 265 lbs. My bust is 49 C, 46\" waist, 53\" hips. I carry my weight in my tummy so I believe that's why it was too short on me. Perhaps with a shaper I can pull it off. I hope so because it is a very cute dress. I have broad shoulders and both sides were still able to hang off both shoulders nicely. The color is accurate as advertised. I really have nothing bad to say about this dress. The only issue is I chose the wrong size. I ordered a XXL so I will be getting a XXXL next time because I really want the white and red one! Read more",
        "author": "♡ Brit Brat ♡",
        "rating": 5.0,
        "date": "November 15, 2024",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/81Rhj6O0lTL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/81ng6Qvn0HL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71jJ+7xUB8L._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71GGzsq-pmL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71W1vPQEXbL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Fits great",
        "body": "Nice quality material, sexy, just as described, fits great. Read more",
        "author": "Krystal B",
        "rating": 5.0,
        "date": "November 6, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61wYR6MDdYL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71zoI8-Bo0L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "4.0 out of 5 stars Just Buy It!",
        "body": "This dress is amazing. The material is soft, stretchy and thick, the sleeves fit slightly loose, shoulder placement is perfect. I’m 5’6, thick on the bottom, 38D, I have a little bit of tummy, and usually where an XL-1X. I ordered a 2X based on reviews, and it’s everything. Hugs the curves and hides everything you want it too. The only reason I didn’t give it 5 stars is because the drawstrings are placed just slightly high. It still looks amazing, but I think an inch down would make it perfect. I will definitely buy in more colors Read more",
        "author": "Andrea",
        "rating": 4.0,
        "date": "January 31, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "1.0 out of 5 stars Off shoulder mini dress",
        "body": "GOKATOSAU Club Mini Dress: Sexy Style with an Unfortunate Fit Caveat The GOKATOSAU Women's Sexy Casual Off Shoulder Long Sleeve Lace Up Loose Club Mini Dress aims to deliver a trendy and revealing look. However, a significant fit issue might hinder its wearability for some. Pros: Stylish Design: The off-the-shoulder style and lace-up detailing create a fashion-forward look that might appeal to those who enjoy clubwear aesthetics. Stretchy Fabric: The material is reported to be comfortable and stretchy, offering some flexibility in terms of fit. Affordable: This dress falls within a budget-friendly price range for clubwear. Cons: Awkward Lace-Up Placement: The biggest drawback lies in the placement of the lace-up sides. Multiple user reviews mention that the laces reach uncomfortably high, potentially sitting near or even under the armpits for some wearers. This can cause an awkward and potentially restrictive fit. Limited Size Information: While the product description provides size options, some users report inconsistencies in sizing and recommend ordering a size up. Overall: While the GOKATOSAU Club Mini Dress boasts a trendy design and affordable price, the unfortunate placement of the lace-up sides is a significant fit concern. This might be a dealbreaker for many potential buyers. If you're considering this dress, it's crucial to carefully review the size chart and be aware of the potential fit issues around the arms before making a purchase. It might also be advisable to look for alternative dresses with a similar style but a more comfortable and flattering lace-up design. Read more",
        "author": "SRAMAZON",
        "rating": 1.0,
        "date": "February 29, 2024",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Missing strings",
        "body": "The dress is nice just do not come with strings at all Read more",
        "author": "China",
        "rating": 3.0,
        "date": "December 19, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars True to size",
        "body": "Did just what I needed it to do! I'm 5'4 160lbs, bought a medium. Perfect fit! Read more",
        "author": "L Kay",
        "rating": 5.0,
        "date": "December 1, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Love The Dress",
        "body": "Very cute and comfortable. Wore this to a concert. Read more",
        "author": "Bri",
        "rating": 5.0,
        "date": "November 29, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61uETzHIWlL._SY88._SL1500_.jpg"
        ]
      }
    ]
  },
  "short_description": "Womens Maxi Dress Long Sleeve Off Shoulder is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.",
  "about_this_item": "Womens Maxi Dress Long Sleeve Off Shoulder is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.",
  "long_description": "Womens Maxi Dress Long Sleeve Off Shoulder is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Red, Winered, Khaki, Pink, White, Iongrey, Black. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Long Sleeve Off Shoulder is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/41mjL-yM4EL._SL1500_.jpg",
      "alt": "Womens Maxi Dress Long Sleeve Off Shoulder details image 1"
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/4194B3GEBbL._SL1500_.jpg",
      "alt": "Womens Maxi Dress Long Sleeve Off Shoulder details image 2"
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/41WaB1bnLAL._SL1500_.jpg",
      "alt": "Womens Maxi Dress Long Sleeve Off Shoulder details image 3"
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/41hP7ZGZo1L._SL1500_.jpg",
      "alt": "Womens Maxi Dress Long Sleeve Off Shoulder details image 4"
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Red, Winered, Khaki, Pink, White, Iongrey, Black. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/41AmSk4%2B0KL._SL1500_.jpg",
      "alt": "Womens Maxi Dress Long Sleeve Off Shoulder details image 5"
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "0723a5d7-dfb9-4e9d-b622-421b9e42d24e",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0723a5d7-dfb9-4e9d-b622-421b9e42d24e/embedded.cc.default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0723a5d7-dfb9-4e9d-b622-421b9e42d24e/embedded.cc.default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "5a4ccef6-8acc-466c-96d9-03143cf4e961",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5a4ccef6-8acc-466c-96d9-03143cf4e961/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5a4ccef6-8acc-466c-96d9-03143cf4e961/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Red": "https://m.media-amazon.com/images/I/41C3TPRhOCL._AC_SR38,50_.jpg",
    "Winered": "https://m.media-amazon.com/images/I/31bSko3IaBL._AC_SR38,50_.jpg",
    "Khaki": "https://m.media-amazon.com/images/I/41P1c0zjkZL._AC_SR38,50_.jpg",
    "Pink": "https://m.media-amazon.com/images/I/41YV5SK-pqL._AC_SR38,50_.jpg",
    "White": "https://m.media-amazon.com/images/I/41odHaeUMcL._AC_SR38,50_.jpg",
    "Iongrey": "https://m.media-amazon.com/images/I/41HTeB+toVL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31Ofh0hGk1L._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Red": "51QqemZ-ZYL",
    "Winered": "513-GgBPC7L",
    "Khaki": "51mYHSeWZqL",
    "Pink": "51WBRBMhL5L",
    "White": "518ZcsEYI5L",
    "Iongrey": "61KKUBWNeJL",
    "Black": "51toMunZZJL"
  },
  "color_images": {
    "Red": [
      "https://m.media-amazon.com/images/I/51QqemZ-ZYL._SL1500_.jpg"
    ],
    "Winered": [
      "https://m.media-amazon.com/images/I/513-GgBPC7L._SL1500_.jpg"
    ],
    "Khaki": [
      "https://m.media-amazon.com/images/I/51mYHSeWZqL._SL1500_.jpg"
    ],
    "Pink": [
      "https://m.media-amazon.com/images/I/51WBRBMhL5L._SL1500_.jpg"
    ],
    "White": [
      "https://m.media-amazon.com/images/I/518ZcsEYI5L._SL1500_.jpg"
    ],
    "Iongrey": [
      "https://m.media-amazon.com/images/I/61KKUBWNeJL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/51toMunZZJL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 89.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51NuUv+OXgL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 545.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61ZukB9C16L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 175.42,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/81pwjJgvUtL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-off-shoulder",
      "title": "Womens Maxi Dress Off Shoulder",
      "price": 103.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51ipqmzN4IL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-long-sleeve-ruched",
      "title": "Womens Maxi Dress Bodycon Long Sleeve Ruched",
      "price": 40.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51Ya-KxobWL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-long-sleeve-v-neck",
      "title": "Womens Maxi Dress Long Sleeve V Neck",
      "price": 28.78,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61Snqr58PqL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 83.16,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61myt1FB2YL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-off-shoulder-bodycon-long-sleeve-maxi",
      "title": "Womens Maxi Dress Off Shoulder Bodycon Long Sleeve Maxi",
      "price": 53.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/611pJhxTuIL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-long-sleeve",
      "title": "Womens Maxi Dress Bodycon Long Sleeve",
      "price": 36.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71ykLRhk+6L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-sleeveless-cocktail",
      "title": "Womens Dress Sleeveless Cocktail",
      "price": 38.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51zplUMtETL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-ruched-maxi-bodycon-cocktail",
      "title": "Womens Maxi Dress Long Sleeve Ruched Maxi Bodycon Cocktail",
      "price": 58.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61BOHuOzjjL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi",
      "title": "Womens Maxi Dress Maxi",
      "price": 31.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61pjj-1NYOL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi",
      "title": "Womens Maxi Dress Maxi",
      "price": 19.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71QZPXa-3TL._SL1500_.jpg"
      ]
    }
  ]
}