{
  "id": "womens-maxi-dress-formal",
  "handle": "womens-maxi-dress-formal",
  "sku": "JC1928",
  "asin": "B07QDHRX1W",
  "title": "Womens Maxi Dress Formal",
  "title_original": "Meier Women's Glitter Tulle Double V-Neck A-Line Prom Formal Gown",
  "brand": "Visit the Meier Store",
  "price": 129.0,
  "social_proof": {
    "bought_past_month": 77,
    "text": "77+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/81FHR80ISVL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/817WT9XN1wL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91ThjGXin-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/910Jp4bWNBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/9156tThyR+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91RMiEgc4SL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ZGAsv-bpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71YRNTldM0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81Q82fGOW8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81K3dEW73UL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81q+3j3IT-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/817VgoHTaNL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/81FHR80ISVL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/817WT9XN1wL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91ThjGXin-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/910Jp4bWNBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/9156tThyR+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91RMiEgc4SL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ZGAsv-bpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71YRNTldM0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81Q82fGOW8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81K3dEW73UL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81q+3j3IT-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/817VgoHTaNL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ April 5, 2019",
    "ASIN ‏": "‎ B07QCHY8WH",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#550,789 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #3,755 in Women's Formal Dresses",
    "Customer Reviews": "3.5 3.5 out of 5 stars (161)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Gold",
      "Navy",
      "Black Multi",
      "Purple",
      "Rose Gold",
      "Strapless Rose Gold",
      "Black"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 3.5,
    "count": 161,
    "customers_say": "Customers find the dress gorgeous, particularly noting its rose gold color, and appreciate its quality as a perfect choice for special occasions. The glitter receives mixed feedback - while it sparkles beautifully in sunlight, customers report it falls off during wear. Customers disagree on the sizing, with some finding it fits beautifully while others say it's too small. The dress receives negative feedback for being itchy and uncomfortable, with customers describing the material as cheap and poor quality. While some find it impressive for the price, others express concerns about its durability, with one customer reporting issues with the boning coming out. Generated from the text of customer reviews Select to learn more Beauty (31) Quality (21) Glitter (25) Size (23) Value for money (6) Discomfort (9) Material quality (8) Durability (5) 31 customers mention beauty, 31 positive, 0 negative 31 customers mention \"Beauty\" 31 positive 0 negative Customers find the dress gorgeous, particularly appreciating its rose gold color, which they describe as luxe. \" ...It does shed a lot of sparkles. But it shines and it's beautiful . \" Read more \" Beautiful Dress , a little too long and tight on the back but was an easy fix. \" Read more \" ...n’t care, because people will be complimenting you all day on this gorgeous dress . \" Read more \" Very cute ! Loved the dress. Just very uncomfortable. It’s not too bad for a few hours tho. \" Read more 21 customers mention quality, 15 positive, 6 negative 21 customers mention \"Quality\" 15 positive 6 negative Customers find the dress to be of great quality and perfect for special occasions. \" ...Definitely get the next size up because it runs small. It was the perfect dress for my daughters senior prom \" Read more \" Loved this dress ! It fit well and looked beautiful! \" Read more \" The dress was ripped Poor quality \" Read more \" Very cute! Loved the dress . Just very uncomfortable. It’s not too bad for a few hours tho. \" Read more 25 customers mention glitter, 11 positive, 14 negative 25 customers mention \"Glitter\" 11 positive 14 negative Customers have mixed opinions about the dress's glitter: while some find it very sparkling and appreciate how it shines in sunlight, others report that it falls off in large amounts. \" ...the only negative thing is that the glitter falls off and gets left everywhere you go but other than that 10/10! \" Read more \" ...Great quality and super sparkly . In the sunlight it really sparkles. Highly recommend. \" Read more \" ...10/10 would recommend. Only thing is that it sheds glitter everywhere so be prepared to vacuum up a mess when you take it out. \" Read more \" Omggg get this. The shine , the sparkle, are OUT of this world.... \" Read more 23 customers mention size, 12 positive, 11 negative 23 customers mention \"Size\" 12 positive 11 negative Customers have mixed opinions about the dress's size, with some saying it fits beautifully and is long enough, while others find it way too small. \" I am 5'10\" 155lbs and ordered a size 12. It fit perfectly with the exception of the straps being a little loose but I am also small chested so that... \" Read more \" This gown is GORGEOUS to say the least! It runs about 2 sizes too small . That is the only reason for 3 star rating. \" Read more \" it was really gorgeous it looked really good and fit well . i’m 5 foot 4 and 170 pounds and a size 12 fit great \" Read more \" ...dance but she was not able to keep it becasue the shoulder straps were too long .... \" Read more 6 customers mention value for money, 3 positive, 3 negative 6 customers mention \"Value for money\" 3 positive 3 negative Customers have mixed opinions about the dress's value for money, with some finding it impressive for the price while others disagree. \" ...This was the perfect dress for the occasion at the right price .... \" Read more \" ...Nice color, poor construction. Not worth the price . \" Read more \" Impressive for the price , looked amazing... \" Read more \" ...It felt like a cheaply made Halloween costume. It was not worth it . \" Read more 9 customers mention discomfort, 1 positive, 8 negative 9 customers mention \"Discomfort\" 1 positive 8 negative Customers find the dress uncomfortable, describing it as itchy and scratchy. \" ...to wear this for an actual event, because it is extremely harsh and scratchy , and a glitter explosion every time you move.... \" Read more \" ...of glitter.. that’s ok for me BUT the dress is so scratchy and uncomfortable .... \" Read more \" Material was glue and very itchy . It was pretty from a distance but not practical \" Read more \" It was so itchy . It felt like a cheaply made Halloween costume. It was not worth it. \" Read more 8 customers mention material quality, 1 positive, 7 negative 8 customers mention \"Material quality\" 1 positive 7 negative Customers express dissatisfaction with the dress's material quality, describing it as cheap and rough, with one customer noting that the straps are made of ribbon material. \" This dress did look like the photo, but was very tough, cheap material . I felt like the bust area was awkward as well.... \" Read more \" I love love this dress! The reason i left 4 ⭐️ IS BECAUSE its made with a cheap material .... \" Read more \" The \" fabric\" is so rough you won't want to touch it....and he won't want to touch you! Grabs at anything it touches like evil Velcro.... \" Read more \" ...Since the chest area is sheer fabric , you can see the circle outline that looks like two sewn-in pasties.... \" Read more 5 customers mention durability, 0 positive, 5 negative 5 customers mention \"Durability\" 0 positive 5 negative Customers report issues with the dress's durability, with multiple reviews mentioning construction problems, including threads coming apart and the dress being ripped. \" The dress was ripped Poor quality \" Read more \" ...The quality of work is less than impressive with thread coming apart . \" Read more \" ...is pretty, the sleeves/straps are made of ribbon material, super likely to break . Also they are too long and not adjustable.... \" Read more \" ...dress looks beautiful, but within an hour of wearing it, the boning started coming out and sticking my arms and underarm.... \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Just what you need for an evening of elegance.",
        "body": "I’m 5’3” and 172lbs, hourglass body shape, (42” bust, 36” waist and 47” hips) Ordered a size 14 and it fits beautifully. However, I’ll have to cut about 20cms since it’s too long and I’m too short, but I will wear this for my brother’s wedding next April. It looks simply astonishing... no need to wear bra, probably will use sticky pads to pull my girls up. I ordered 8-10 dresses and this was the only one I was 100% satisfied with. Now, it’s more expensive than the other dresses, but I can clearly see why. It’s heavier than you might think, just keep that in mind.I’ll update with pictures when I’m ready to wear it! Warning: it is tried that you’ll have a massive amount of glitter falling from the dress wherever you go. I had to sweep the WHOLE house after trying it on. The day of the wedding, I’ll just have it in the bag and put it on on the restroom of the wedding place. Read more",
        "author": "Diana Copher",
        "rating": 5.0,
        "date": "January 13, 2021",
        "verified": false,
        "images": []
      },
      {
        "title": "1.0 out of 5 stars Plastic- Glue like feel",
        "body": "Material was glue and very itchy. It was pretty from a distance but not practical Read more",
        "author": "⚓️❤️Y❤️⚓️",
        "rating": 1.0,
        "date": "December 18, 2019",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Rose gold is luxe —love it.",
        "body": "5’9”/170/36DD purchased in rose gold size 14. Measurements 41/31/39 Flattering & feminine. This was the perfect dress for the occasion at the right price. It was gloriously long enough on me (I never find dresses long enough because I’m tall) Be advised, you will leave a trail of glitter EVERYWHERE, but you won’t care, because people will be complimenting you all day on this gorgeous dress. Read more",
        "author": "mac girl*",
        "rating": 5.0,
        "date": "September 17, 2019",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71HrNNlHIEL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "2.0 out of 5 stars Beautiful but painful…",
        "body": "The dress looks beautiful, but within an hour of wearing it, the boning started coming out and sticking my arms and underarm. By the time I got home I had all these painful scrapes on my underarms. Read more",
        "author": "Troy Wong",
        "rating": 2.0,
        "date": "November 11, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/716rHmXuO6L._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71cpxI3YO6L._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71jfbkZx3dL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "4.0 out of 5 stars Looks great, but very uncomfortable",
        "body": "Fits well, looks great. For the price, I would expect the quality to be a little better. I bought this for a cosplay so I’ll only be wearing it for a short period of time, so it works for my purposes. But I don’t think I’d be able to wear this for an actual event, because it is extremely harsh and scratchy, and a glitter explosion every time you move. I’m 5’2” and with 5 inch heels it’s still pretty long, so it may require alterations if you’re a shorty like me. Read more",
        "author": "danielle gordon",
        "rating": 4.0,
        "date": "April 2, 2021",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/B1tmZuvBLXS._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/B1oQCwaANVS._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Awesome gown",
        "body": "I am 5'10\" 155lbs and ordered a size 12. It fit perfectly with the exception of the straps being a little loose but I am also small chested so that is why. Great quality and super sparkly. In the sunlight it really sparkles. Highly recommend. Read more",
        "author": "Robin",
        "rating": 5.0,
        "date": "April 5, 2022",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Chest is just pink bra cups",
        "body": "Such a pretty dress, but the chest is just circular pink bra cups you would get at the hobby store sewn in. Since the chest area is sheer fabric, you can see the circle outline that looks like two sewn-in pasties. It ruins what would be an otherwise classy dress. I'm a size 4-6 in most formal gowns, and in this one the size 6, 8, and 10 were too tight around the ribcage. I could not zip it up. The 10 was also too large in the chest. My band size is only a 32 inch so this is really odd sizing. Read more",
        "author": "Brooklyn",
        "rating": 3.0,
        "date": "December 17, 2023",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Impressive for the price, looked amazing",
        "body": "I followed the size chart and the dress fit perfectly. For the cost, this dress is spectacular. Two people stopped and asked me if if was from Nordstrom. They were blown away when I told them amazon and the price. It does shed some glitter but that’s the only negative thing I can say and to be fair, what would you expect - it’s a glitter covered dress! Read more",
        "author": "M. & A. U.",
        "rating": 5.0,
        "date": "December 23, 2019",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Formal is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.",
  "about_this_item": "Womens Maxi Dress Formal is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.",
  "long_description": "Womens Maxi Dress Formal is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Gold, Navy, Black Multi, Purple, Rose Gold, Strapless Rose Gold, Black. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Formal is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Gold, Navy, Black Multi, Purple, Rose Gold, Strapless Rose Gold, Black. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [],
  "color_swatches": {
    "Gold": "https://m.media-amazon.com/images/I/41+y7CsI8VL._AC_SR38,50_.jpg",
    "Navy": "https://m.media-amazon.com/images/I/41J8pKhUz6L._AC_SR38,50_.jpg",
    "Black Multi": "https://m.media-amazon.com/images/I/41bQ6EZ3B8L._AC_SR38,50_.jpg",
    "Purple": "https://m.media-amazon.com/images/I/41hge2cC-aL._AC_SR38,50_.jpg",
    "Rose Gold": "https://m.media-amazon.com/images/I/41Qc1MzRRYL._AC_SR38,50_.jpg",
    "Strapless Rose Gold": "https://m.media-amazon.com/images/I/41aY2AaXtUL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/411vmi9J+BL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Gold": "71ZGAsv-bpL",
    "Navy": "81FHR80ISVL",
    "Black Multi": "71YRNTldM0L",
    "Purple": "81Q82fGOW8L",
    "Rose Gold": "81K3dEW73UL",
    "Strapless Rose Gold": "81q+3j3IT-L",
    "Black": "817VgoHTaNL"
  },
  "color_images": {
    "Gold": [
      "https://m.media-amazon.com/images/I/71ZGAsv-bpL._SL1500_.jpg"
    ],
    "Navy": [
      "https://m.media-amazon.com/images/I/81FHR80ISVL._SL1500_.jpg"
    ],
    "Black Multi": [
      "https://m.media-amazon.com/images/I/71YRNTldM0L._SL1500_.jpg"
    ],
    "Purple": [
      "https://m.media-amazon.com/images/I/81Q82fGOW8L._SL1500_.jpg"
    ],
    "Rose Gold": [
      "https://m.media-amazon.com/images/I/81K3dEW73UL._SL1500_.jpg"
    ],
    "Strapless Rose Gold": [
      "https://m.media-amazon.com/images/I/81q+3j3IT-L._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/817VgoHTaNL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-off-shoulder-long-sleeve",
      "title": "Womens Maxi Dress Off Shoulder Long Sleeve",
      "price": 54.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71Ij3RfAevL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 37.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Work",
      "images": [
        "https://m.media-amazon.com/images/I/71A+oMNr1kL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-v-neck-short-sleeve-formal-maxi",
      "title": "Womens Maxi Dress V Neck Short Sleeve Formal Maxi",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71XBVAHbDGL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-short-sleeve",
      "title": "Womens Dress Short Sleeve",
      "price": 43.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51SC0J3glyL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-off-shoulder-evening",
      "title": "Womens Maxi Dress Formal Off Shoulder Evening",
      "price": 54.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61XzdxMMIDL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 24.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/81-gVZjMLrL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-formal",
      "title": "Womens Maxi Dress Evening Formal",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/614uBMNJtCL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-maxi-ruched-cocktail-long-sleeve-formal",
      "title": "Womens Maxi Dress Bodycon Maxi Ruched Cocktail Long Sleeve Formal",
      "price": 45.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51Pz8Ff5DqL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-one-shoulder-evening",
      "title": "Womens Maxi Dress Formal One Shoulder Evening",
      "price": 67.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61dhJFrXgpL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 172.33,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71IxYLWhd8L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-off-shoulder",
      "title": "Womens Maxi Dress Off Shoulder",
      "price": 129.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61wC5ifxGwL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 36.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/610h42KQ0kL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi",
      "title": "Womens Maxi Dress Maxi",
      "price": 22.46,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51pkMS1TczL._SL1500_.jpg"
      ]
    }
  ]
}