{
  "id": "womens-maxi-dress-formal-evening-cocktail",
  "handle": "womens-maxi-dress-formal-evening-cocktail",
  "sku": "JC1427",
  "asin": "B07RFF64R4",
  "title": "Womens Maxi Dress Formal Evening Cocktail",
  "title_original": "DRESSTELLS Red Christmas Holiday Party Cocktail Dresses for Women 2025, Formal Wedding Guest Church Vintage 50s Fit Flare Evening Gown Burgundy S",
  "brand": "Visit the DRESSTELLS Store",
  "price": 46.99,
  "social_proof": {
    "bought_past_month": 79,
    "text": "79+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/51+uOaKMpBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/512zzQtIrKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/510eFhoheKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71dfpZ2JMaL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/51+uOaKMpBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/512zzQtIrKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/510eFhoheKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71dfpZ2JMaL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Package Dimensions ‏": "‎ 11.02 x 9.76 x 2.28 inches; 11.29 ounces",
    "Item model number ‏": "‎ DTC10063Burgundy S",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ May 5, 2019",
    "ASIN ‏": "‎ B07RFF64R4",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#502,442 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #1,508 in Women's Cocktail Dresses",
    "Customer Reviews": "4.4 4.4 out of 5 stars (84)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.4,
    "count": 84,
    "customers_say": "Customers find the dress well-made and appreciate its beautiful color, good fabric, and appropriate material thickness. Moreover, they consider it good value for money. However, the fit receives mixed feedback, with some saying it fits perfectly while others mention it runs small through the chest. Generated from the text of customer reviews Select to learn more Beauty (7) Quality (6) Fabric quality (5) Color (4) Material thickness (3) Value for money (3) Fit (12) 7 customers mention beauty, 6 positive, 1 negative 7 customers mention \"Beauty\" 6 positive 1 negative Customers find the dress beautiful. \" I highly recommend this beautiful dress . Just be warned that it runs quite small through the chest! It fit me perfectly everywhere else.... \" Read more \" ...She is a teenager. So it had to be appropriate, but, of course, cute .... \" Read more \" ...this for my 13 year old daughter to wear to a fall wedding.. and its beautiful . The quality is much better than other dresses of the same price.... \" Read more \" This dress is surprisingly beautiful . Well made and good fabric. \" Read more 6 customers mention quality, 6 positive, 0 negative 6 customers mention \"Quality\" 6 positive 0 negative Customers appreciate the dress's construction, noting it is well made and has better quality than expected. \" This dress is surprisingly beautiful. Well made and good fabric. \" Read more \" ...It seems nicely made , though I would not put it through the washer or dryer. Seams look good, no loose threads or short-seaming.... \" Read more \" ...The quality is much better than other dresses of the same price.... \" Read more \" ...It fit me perfectly everywhere else. Quality construction and fabric. The fabric is substantial, not thin, and drapes beautifully. \" Read more 5 customers mention fabric quality, 5 positive, 0 negative 5 customers mention \"Fabric quality\" 5 positive 0 negative Customers like the fabric quality of the dress, with one mentioning that the bodice is lined with soft material. \" This dress is surprisingly beautiful. Well made and good fabric . \" Read more \" ...It fit me perfectly everywhere else. Quality construction and fabric . The fabric is substantial, not thin, and drapes beautifully. \" Read more \" This dress fits perfect. Great material with easy to steam. A more casual dress, but could dress it up with more decorative accessories. \" Read more \" ...It fit as expected. The style and material were good . It moved well with me throughout the evening.... \" Read more 4 customers mention color, 4 positive, 0 negative 4 customers mention \"Color\" 4 positive 0 negative Customers like the dress's color, describing it as beautiful. \" Purchased for a formal dinner. Color was beautiful and fabric good quality for the price. Bought 2, red and black. Size small126 pounds, 5 foot.... \" Read more \" ...It was a good price for a dress that I’ll wear one time. The color was really vibrant . \" Read more \" Beautiful deep/dark red and the fit was perfect as well. \" Read more \" ...The dress still looked great on her. The burgundy color is exactly as shown . The dress is a flattering and modest- important in today's culture ;) \" Read more 3 customers mention material thickness, 3 positive, 0 negative 3 customers mention \"Material thickness\" 3 positive 0 negative Customers like the material thickness of the dress. \" ...The fabric is thick , but still flowy, and the bodice is lined with satiny soft material. She is 5-5 and 105 lbs, and the small fits perfectly. \" Read more \" ...I thought the material thickness was good as well. It was a good price for a dress that I’ll wear one time. The color was really vibrant. \" Read more \" ...Quality construction and fabric. The fabric is substantial, not thin , and drapes beautifully. \" Read more 3 customers mention value for money, 3 positive, 0 negative 3 customers mention \"Value for money\" 3 positive 0 negative Customers find the dress to be good value for money, with one mentioning that the fabric quality matches the price point. \" ...I thought the material thickness was good as well. It was a good price for a dress that I’ll wear one time. The color was really vibrant. \" Read more \" Purchased for a formal dinner. Color was beautiful and fabric good quality for the price . Bought 2, red and black. Size small126 pounds, 5 foot.... \" Read more \" Well made and at a great price ... \" Read more 12 customers mention fit, 8 positive, 4 negative 12 customers mention \"Fit\" 8 positive 4 negative Customers have mixed experiences with how the dress fits, with some saying it's perfect while others mention it runs long. \" Fits perfectly ! I'm 5'1, 112, and got a small and fits perfectly. Its a little long, but very flattering. I like that its lined and comes with a sash. \" Read more \" ...5’3” 130 lbs couldn’t get this zipped plus the waist was too high . Looked strange. Will return and not reorder. \" Read more \" This dress fits perfect . Great material with easy to steam. A more casual dress, but could dress it up with more decorative accessories. \" Read more \" ...The dress fit great everywhere but is longer than shown in the pictures. The dress hit below her knee by close to 1.5-2 inches.... \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Good Dress.",
        "body": "I bought this dress for a Valentine Banquet at church. It fit as expected. The style and material were good. It moved well with me throughout the evening. I thought the material thickness was good as well. It was a good price for a dress that I’ll wear one time. The color was really vibrant. Read more",
        "author": "6sons",
        "rating": 5.0,
        "date": "November 3, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Great and tasteful dress- even for a teen",
        "body": "My kid needed a dress for a concert she was performing in. She is a teenager. So it had to be appropriate, but, of course, cute. We got this one in the deep red color, and we were careful to measure her and use the size chart. The fit was spot-on, and it looked great! She is a bit in the conservative side, so she likes that this did not expose a lot, but still looked cute and age-appropriate. That said, it would look great on any age, I believe. The bottom has a nice “swing” to it when she moves, but it doesn’t puff far from the body. One could add a crinoline under it it you wanted that, though. She also is sensitive to itchy or uncomfortable fabric, and this did not bother her at all. She was able to move in it without feeling restricted, and she could wear “normal” undergarments. I recommend a slip under it to help the fabric stay smooth over the body. Because of packaging it did come with some folds in it, but those came out nicely steaming it (careful not to soak) on the hanger. It seems nicely made, though I would not put it through the washer or dryer. Seams look good, no loose threads or short-seaming. I am considering getting another in black for her in the future. Hard to find tasteful dresses for a conservative teen, so happy to have found this! Hope this review helps. Read more",
        "author": "Maggie Whitney",
        "rating": 5.0,
        "date": "July 2, 2023",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Great dress but runs small",
        "body": "I highly recommend this beautiful dress. Just be warned that it runs quite small through the chest! It fit me perfectly everywhere else. Quality construction and fabric. The fabric is substantial, not thin, and drapes beautifully. Read more",
        "author": "Juanita",
        "rating": 5.0,
        "date": "July 11, 2023",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Longer Than Expected",
        "body": "We ordered a small dress for a 5'4.5\" 14 year old girl who weighs 105. The dress fit great everywhere but is longer than shown in the pictures. The dress hit below her knee by close to 1.5-2 inches. The dress still looked great on her. The burgundy color is exactly as shown. The dress is a flattering and modest- important in today's culture ;) Read more",
        "author": "Kelly Nestler",
        "rating": 4.0,
        "date": "October 20, 2023",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars beautiful quality dress",
        "body": "I bought this for my 13 year old daughter to wear to a fall wedding.. and its beautiful. The quality is much better than other dresses of the same price. The fabric is thick, but still flowy, and the bodice is lined with satiny soft material. She is 5-5 and 105 lbs, and the small fits perfectly. Read more",
        "author": "Kindle Customer",
        "rating": 5.0,
        "date": "November 22, 2019",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Beautiful dress",
        "body": "This dress was perfect for my daughter’s Christmas dress. Looks amazing on her. Read more",
        "author": "Amy Bender",
        "rating": 5.0,
        "date": "December 23, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Simple Dress",
        "body": "This dress fits perfect. Great material with easy to steam. A more casual dress, but could dress it up with more decorative accessories. Read more",
        "author": "Melissa Horn",
        "rating": 5.0,
        "date": "November 10, 2024",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/712ZXPS6BQL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Well made and at a great price",
        "body": "Beautiful deep/dark red and the fit was perfect as well. Read more",
        "author": "Customer",
        "rating": 5.0,
        "date": "July 28, 2023",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Formal Evening Cocktail is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.",
  "about_this_item": "Womens Maxi Dress Formal Evening Cocktail is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.",
  "long_description": "Womens Maxi Dress Formal Evening Cocktail is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Color options depend on the listing. Pick the shade that matches your wardrobe for the most repeat wear.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Formal Evening Cocktail is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Color options depend on the listing. Pick the shade that matches your wardrobe for the most repeat wear."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "6491b54d-62af-4389-b2bf-851960c55a7e",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6491b54d-62af-4389-b2bf-851960c55a7e/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6491b54d-62af-4389-b2bf-851960c55a7e/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "24d4af1e-a495-42aa-bbcd-dccce5d76dfb",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/24d4af1e-a495-42aa-bbcd-dccce5d76dfb/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/24d4af1e-a495-42aa-bbcd-dccce5d76dfb/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "a6245ed2-09fa-4b13-a31e-599894c085a9",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a6245ed2-09fa-4b13-a31e-599894c085a9/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a6245ed2-09fa-4b13-a31e-599894c085a9/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "a32912f7-bd5b-410f-8de8-f4c5b6271570",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a32912f7-bd5b-410f-8de8-f4c5b6271570/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a32912f7-bd5b-410f-8de8-f4c5b6271570/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "dc36d1df-9a9b-4560-8af5-bcfaa770fdf1",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/dc36d1df-9a9b-4560-8af5-bcfaa770fdf1/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/dc36d1df-9a9b-4560-8af5-bcfaa770fdf1/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "2fda3c8b-6586-4f53-b589-9e122a1d9d55",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2fda3c8b-6586-4f53-b589-9e122a1d9d55/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2fda3c8b-6586-4f53-b589-9e122a1d9d55/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "f34c0c97-fb00-4a88-8ece-315c56ff492d",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f34c0c97-fb00-4a88-8ece-315c56ff492d/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f34c0c97-fb00-4a88-8ece-315c56ff492d/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "1115ace0-f182-4ae8-8d6a-50d29fbf2609",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1115ace0-f182-4ae8-8d6a-50d29fbf2609/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1115ace0-f182-4ae8-8d6a-50d29fbf2609/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "441642ad-4c90-4f5a-a243-f1a00594c35e",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/441642ad-4c90-4f5a-a243-f1a00594c35e/videopreview.jobtemplate.mp4.342X192P_20HZ_350KBPS_VER_1_0.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/441642ad-4c90-4f5a-a243-f1a00594c35e/videopreview.jobtemplate.mp4.342X192P_20HZ_350KBPS_VER_1_0.mp4"
        }
      ]
    },
    {
      "id": "19c5bc43-46cb-4b63-847f-60ca170df9f0",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/19c5bc43-46cb-4b63-847f-60ca170df9f0/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/19c5bc43-46cb-4b63-847f-60ca170df9f0/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "38c72bb1-8cb4-4a80-a3a7-f182bd625355",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/38c72bb1-8cb4-4a80-a3a7-f182bd625355/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/38c72bb1-8cb4-4a80-a3a7-f182bd625355/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {},
  "color_image_key": {},
  "color_images": {},
  "related": [
    {
      "id": "womens-maxi-dress-short-sleeve-split-bodycon-ruched-high-split-boat-neck",
      "title": "Womens Maxi Dress Short Sleeve Split Bodycon Ruched High Split Boat Neck",
      "price": 47.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51NZ2UbUgoL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-bodycon",
      "title": "Womens Dress Bodycon",
      "price": 31.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61-R+VVwxQL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-short-sleeve",
      "title": "Womens Dress Short Sleeve",
      "price": 28.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61YKuWHaTuL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-bodycon",
      "title": "Womens Dress Bodycon",
      "price": 30.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71Br1mzvDtL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-v-neck-maxi",
      "title": "Womens Maxi Dress Long Sleeve V Neck Maxi",
      "price": 40.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61gIPEBoaCL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 29.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61IPbiN-fHL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi",
      "title": "Womens Maxi Dress Maxi",
      "price": 139.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71bWQZrKZnL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-split-v-neck-ruched",
      "title": "Womens Maxi Dress Split V Neck Ruched",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/41nxR29NUrL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-bodycon",
      "title": "Womens Maxi Dress Long Sleeve Bodycon",
      "price": 33.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51h6UXGlVHL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-bodycon-evening-formal",
      "title": "Womens Maxi Dress Maxi Bodycon Evening Formal",
      "price": 65.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61k+TMiIHwL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail-evening-formal",
      "title": "Womens Dress Cocktail Evening Formal",
      "price": 53.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71O9kkR1wfL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-short-sleeve-maxi",
      "title": "Womens Maxi Dress Short Sleeve Maxi",
      "price": 63.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51pU-JcR5ML._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-off-shoulder-bodycon",
      "title": "Womens Dress Off Shoulder Bodycon",
      "price": 35.58,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61abQ+pTZfL._SL1500_.jpg"
      ]
    }
  ]
}