{
  "id": "womens-maxi-dress-long-sleeve",
  "handle": "womens-maxi-dress-long-sleeve",
  "sku": "JC2793",
  "asin": "B07SWZGMR3",
  "title": "Womens Maxi Dress Long Sleeve",
  "title_original": "Wedding Dresses for Bride with Lace Appliques Chiffon A Line Women Dress Long Sleeves Beach Bride Dress",
  "brand": "Findlovewedding",
  "price": 169.99,
  "social_proof": {
    "bought_past_month": 362,
    "text": "362+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/61SuqNfzs8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61MGN7X5mWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61JHjVXx8YL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61EdUtIpiSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71rQLEuwmWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61mnPgRfx7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71+SHpN8rNL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71AM51RNidL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61k9Yqk+QEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61RUk7XRaXL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/61SuqNfzs8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61MGN7X5mWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61JHjVXx8YL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61EdUtIpiSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71rQLEuwmWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61mnPgRfx7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71+SHpN8rNL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71AM51RNidL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61k9Yqk+QEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61RUk7XRaXL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ April 13, 2022",
    "Manufacturer ‏": "‎ DREAMY BRIDAL",
    "ASIN ‏": "‎ B09XWRGGHL",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#127,340 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #7 in Wedding Dresses #601 in Women's Formal Dresses",
    "Customer Reviews": "3.8 3.8 out of 5 stars (924)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Wedding Dresses",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Off-white"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 3.8,
    "count": 924,
    "customers_say": "Customers find the wedding dress gorgeous, well-made, and comfortable, noting it's not itchy and offers good value for the price. The fit and sizing receive mixed feedback - while some find it perfect, others report issues with arms and shoulders. The material quality and lace quality also get mixed reviews, with some praising the wonderful material while others complain about poor quality, and one customer specifically mentions issues with the lace-up back. Select to learn more Beauty Quality Value for money Comfort Fit Size Material quality Lace quality 108 customers mention \"Beauty\" 99 positive 9 negative Customers find the dress gorgeous, with one mentioning it looked more expensive than expected. \" Beautiful dress , but way too small through shoulders & chest. & 1 dress they sent me have a rip in the seam. Had to go buy another dress elsewhere.\" Read more \"Its beautiful , and a great price Like the other reviews the sleeves are very tight. I went up a few extra dress sizes and it works great....\" Read more \"This dress was very pretty , but you could tell it was on the cheaper side. For the price that's what you'd expect though....\" Read more \"This dress is absolutely gorgeous and perfect! If you use the chart provided for your measurements it fit perfect!...\" Read more 68 customers mention \"Quality\" 55 positive 13 negative Customers find the dress to be well-made with a nice train. \"...it to anyone who is planning to buy a wedding dress for a low price good quality and get it on time!!...\" Read more \"Great fit great quality . It was a bit long for me cause I am just 5 ft. True to size ordered XL I’m usually size 12 in clothes\" Read more \" Perfect dress if you are looking for something comfortable simple and beautiful. I loved this dress. It’s prettiest than the picture\" Read more \" Great dress the back was a bit hard to do with the corset top but other wise fit great. I did size down\" Read more 44 customers mention \"Value for money\" 41 positive 3 negative Customers find the wedding dress offers excellent value, describing it as very nice and amazing quality for the price. \"...fits me perfect I didn’t need any alterations and is that a great price perfect for my wedding day THANK YOU SO MUCH AMAZON CAME IN CLUTCH I could...\" Read more \"...Beautiful dress and so worth the money !! Length was a little long,but if I had worn heels it would have been okay! Definitely recommend\" Read more \" Great dress for the price ! 5'3 and it was too long by probably 5 inches, so keep that in mind!...\" Read more \"...She loved it, very comfortable, and she looked stunning. Good price .\" Read more 21 customers mention \"Comfort\" 15 positive 6 negative Customers find the dress comfortable and not itchy at all. \"...The fabric is of great quality, lightweight, and very comfortable , which allowed me to enjoy my entire wedding day without feeling restricted....\" Read more \"The dress is totally worth the money. It was pretty comfy and as long as the top it tightened up really good, the sleeves stay on.\" Read more \"Very disappointed. Poor quality and strange fit. Uncomfortable material ....\" Read more \"...to have this dress for my 25th anniversary is so beautiful and comfortable is Just perfect ⭐️⭐️⭐️⭐️⭐️\" Read more 88 customers mention \"Fit\" 45 positive 43 negative Customers have mixed experiences with the dress's fit, with some finding it perfect while others report it being too tight, particularly noting issues with the sleeves not properly accommodating arms and the shoulder area being too big. \"...We were in a pinch at the last minute and it came within 2 days. It fit perfectly . Our daughter is 5.1 in height and wears a size 2....\" Read more \"...However, even with giving my measurements, it was still too big ....\" Read more \"...I followed the size chart and with the corset back it was a perfect fit ....\" Read more \"The sleeves were too tight and it smelled weird. Dress doesn't look like the photo it's a knockoff.\" Read more 45 customers mention \"Size\" 17 positive 28 negative Customers have mixed experiences with the dress's size, with some finding it well-fitting, particularly noting the perfect length, while others report it being too big, with measurements not matching the advertised specifications. \" Too small even though we used the measurement chart!! Another return!\" Read more \"...This was true to size . The price was very reasonable and the quality exceeded my expectations. I did add a bit of fabric to cover the bust....\" Read more \"Beautiful dress, runs small \" Read more \" Sleeves are short and look awful\" Read more 26 customers mention \"Material quality\" 16 positive 10 negative Customers have mixed opinions about the dress's material quality, with some finding it wonderful while others report it being of poor quality. \"...The bottom of the dress wasn’t too bad it’s chiffon and seems to flow nicely.\" Read more \"Absolutely horrible! Dress looks nothing like the pictures. Cheap material and looks like a Halloween costume!...\" Read more \"...The boning is great as well as the corset back. The fabric was soft and was exactly what I was hoping for. The sleeves however, are not great....\" Read more \"It's super pretty and it fits me perfectly. The fabric is very nice .\" Read more 20 customers mention \"Lace quality\" 8 positive 12 negative Customers have mixed opinions about the lace quality of the dress, with one customer finding it flawless, while another reports issues with the ribbon closure being too short. \"The dress is like a corset. It laces in the back you need someone to help you lace it. But this makes it form fitting and adjustable....\" Read more \"...The dress is not heavy or hot. The sleeves are lace , but they are not itchy at all!...\" Read more \"Hello I would like to return my dress cause it’s missing the ribbon for the back and it’s not fitting me.\" Read more \"Fit our daughter perfectly. Long on her as she is 5ft1 but easily hemmed for sure\" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Absolutely gorgeous!!! Planned a wedding in a week!",
        "body": "The price does not say’s everything about the value and quantity of this product!!!! First, it’s priced perfectly as to not rip off the modern bride in today’s world! I Absolutely loved this dress- it was the perfect YES to the dress and what would be our beginning of relocating our wedding and changing the date, venue, and State in a matter of a weeks notice for some of our guests to ensure our family who wouldn’t had been able to attend could! I gladly canceled my original gown for this one - not just because it was saving me nine times less ( not even a joke!) but because it was perfect for the occasion. I am 5’4- about 175(hips& butt) Got the dress in two days Ordered a size 16- fit a little big in my breast area- but it’s most likely due to stress and losing weight there first- The length was perfect had I been able to wear a nice heal- but I had a beach wedding and even still it was a good fit resting on the sand. Color was Ivory- which was beautiful in photos !!! The back of the dress laces up! So ladies be ready for so sucking in !!!! It holds you in and push’s you up in the right direction!!! Had I planned a little more appropriately- I would had pulled the inner layer out more and maybe even cut some of the fabric so it laid a little shorter- just so it didn’t bunch up so much- over all - had I known what I know now- regardless of changing and rebudgeing the whole event, this still would’ve been my favorite dress and Yes dress ! Highly recommend this dress! Seems to be a great choice for a ton of us brides ! ❤️ Read more",
        "author": "Dina Harris",
        "rating": 5.0,
        "date": "August 1, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71k5b695-FL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71R05a6Y4JL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/81Hpy7coE+L._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/81m11M4nwWL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/81D6o5j5JeL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/816in8rIHzL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Don't let the low price fool you, this dress is BEAUTIFUL!",
        "body": "My custom made wedding dress bought elsewhere didn't fit, and I found out 3 days before my wedding that I needed a new dress. This one was available in my size, would arrive the day before the wedding, and had good reviews, so I took a leap of faith and ordered it. To my surprise, it was the perfect length, the measurements on the size chart were accurate, the color didn't wash me out, and the sleeves were big enough for my large arms. It was very comfortable, and the corset was able to be tight without being so tight that I couldn't breathe. It was thick enough too, that it wasn't see-through. I got SO MANY COMPLIMENTS on this dress! My now husband (who hadn't seen my other dress) said he liked this one better than the custom made one, which he saw for the first time after the wedding. Everyone talked about how beautiful the dress was and they couldn't believe that it was from Amazon! I couldn't recommend this dress more! I could've gone one size down, but after having one dress that didn't fit, I went with the size Amazon recommended based on other orders. Also, for reference, I'm 5'11\", and weigh about 180 lbs. Read more",
        "author": "katherine",
        "rating": 5.0,
        "date": "October 30, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "1.0 out of 5 stars Beware of Chinese Company Not Playing by Return Rules",
        "body": "The dress was lovely but it did not fit in the shoulders or the back and would have been too much of an alteration project. But the reason for ONE-STAR is that I had so much trouble from the Chinese dress company in trying to return it. They refused to send me a pre-paid return label like promised on the Amazon listing, and tried to offer me 30-percent back if I would keep the dress, which I could not use and was not an option for me. Once I got Amazon involved, they finally sent the pre-paid return label. However, it's been six weeks and I still don't have a refund. They now claim they have not yet received the dress back, even though the mailing label was sent to a U.S address. Just checked my USPS tracking number and it said the pre-paid label by the seller did not have proper postage, so the package is in limbo. What a shady dealer!!! Checking back with Amazon now for recourse. Read more",
        "author": "elainebythebeach",
        "rating": 1.0,
        "date": "May 20, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Good quality",
        "body": "Nice fabulous design Read more",
        "author": "Lillie",
        "rating": 4.0,
        "date": "June 9, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Elegant and comfortable wedding dress – perfect for my big day",
        "body": "This wedding dress was an absolute dream come true. It has a classic, elegant, and romantic design, with delicate lace sleeves that add a sophisticated and timeless touch. The fabric is of great quality, lightweight, and very comfortable, which allowed me to enjoy my entire wedding day without feeling restricted. The fit on the top is flattering and secure, while the skirt flows beautifully with every step. The veil completed the look perfectly, making it even more graceful. I loved how it looked in the photos — both outdoors and indoors the dress stood out and looked flawless. It truly made me feel like a princess on my wedding day. I highly recommend it to any bride looking for a dress that combines comfort, quality, and elegance in one design. Read more",
        "author": "Melissa Alfonso",
        "rating": 5.0,
        "date": "September 30, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71HRRzwL7aL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/81sJ23MlfzL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/81LOM20RQBL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/61eFOV6XqnL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71M-NA0ErmL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "3.0 out of 5 stars Lace Issue, doesn’t naturally adapt to body’s form maybe too thick",
        "body": "while I really wanted to love this one, it just didn’t deliver. The lace sleeves didn’t lay naturally on my arms, and the lace on the bust was a bit too thick, it didn’t form or drape as easily as I’d hoped. I know this is a budget-friendly dress, but still it didn’t quite deliver enough for me. It runs true to size, though the bust is a bit roomier just a heads up that you’ll need to wear a bra with it. There’s also not much volume in the skirt, which may be totally fine depending on your style, but something to keep in mind. Read more",
        "author": "ClaireCatt",
        "rating": 3.0,
        "date": "June 8, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61LbkjxA6-L._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/61orPLfOIzL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars perfect wedding dress",
        "body": "It's super pretty and it fits me perfectly. The fabric is very nice. Read more",
        "author": "Moreth",
        "rating": 5.0,
        "date": "December 10, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71y3ezRzP7L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Perfect fit great quality",
        "body": "I wore this on my wedding and people thought I spent a fortune on it. For the price you cannot go wrong. I dressed it up with veil and accessories it was beautiful! It is true to size Read more",
        "author": "R Taylor",
        "rating": 5.0,
        "date": "November 19, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.",
  "about_this_item": "Womens Maxi Dress Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.",
  "long_description": "Womens Maxi Dress Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Off-white. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Off-white. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "9a62ac48-7c5f-4969-bed7-d314f7469309",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9a62ac48-7c5f-4969-bed7-d314f7469309/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9a62ac48-7c5f-4969-bed7-d314f7469309/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "739f2dbd-4a88-49ce-8627-127aabe946cc",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/739f2dbd-4a88-49ce-8627-127aabe946cc/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/739f2dbd-4a88-49ce-8627-127aabe946cc/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "09c075f3-3c72-4689-a239-9e143b456e24",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/09c075f3-3c72-4689-a239-9e143b456e24/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/09c075f3-3c72-4689-a239-9e143b456e24/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "2c350c42-643f-46ae-8fa5-8ba9c9648437",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2c350c42-643f-46ae-8fa5-8ba9c9648437/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2c350c42-643f-46ae-8fa5-8ba9c9648437/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Off-white": "https://m.media-amazon.com/images/I/31rmPvbt2mL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Off-white": "61SuqNfzs8L"
  },
  "color_images": {
    "Off-white": [
      "https://m.media-amazon.com/images/I/61SuqNfzs8L._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress-cocktail-bodycon",
      "title": "Womens Dress Cocktail Bodycon",
      "price": 47.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61NfEwzl3xL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-one-shoulder-maxi-formal",
      "title": "Womens Maxi Dress Evening One Shoulder Maxi Formal",
      "price": 69.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/5150AIQL4eL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail",
      "title": "Womens Dress Cocktail",
      "price": 103.54,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61JApwce25L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-formal-bodycon-evening-sleeveless",
      "title": "Womens Maxi Dress Maxi Formal Bodycon Evening Sleeveless",
      "price": 61.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61s8qg6u1VL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 158.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71PmRANW40L._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress-bodycon-split-ruched-off-shoulder",
      "title": "Womens Dress Bodycon Split Ruched Off Shoulder",
      "price": 38.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/41JjYcPgcpL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 95.61,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Work",
      "images": [
        "https://m.media-amazon.com/images/I/71hVgSIB1jL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 138.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51PZNrlyY9L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-split-evening-formal",
      "title": "Womens Maxi Dress Split Evening Formal",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51BZ1BqPx8L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 65.97,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/81wr8PDg55L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-v-neck",
      "title": "Womens Dress V Neck",
      "price": 82.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/710bSTpZ9hL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 278.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/91YXeyW506L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening-long-sleeve",
      "title": "Womens Maxi Dress Formal Evening Long Sleeve",
      "price": 87.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61nnk+flvaL._SL1500_.jpg"
      ]
    }
  ]
}