{
  "id": "womens-maxi-dress-long-sleeve",
  "handle": "womens-maxi-dress-long-sleeve",
  "sku": "JC1051",
  "asin": "B07VGNVNQ5",
  "title": "Womens Maxi Dress Long Sleeve",
  "title_original": "Alaster Queen Women's Long Sleeve Fall Dresses 2024 Trendy Casual Plaid Cowl Neck Winter Tunic Dress for Women",
  "brand": "Visit the Alaster Queen Store",
  "price": 26.99,
  "social_proof": {
    "bought_past_month": 50,
    "text": "50+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/61RmKCKVLLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61aVNoc+ByL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Rqao-a86L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61wVRBZqgUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61SvggTpPzL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71-fHSt67iL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71OKQ+iZt3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71YDIvWURvL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61gDSQKg5fL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61X4HpF5M8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Mv3RkuA7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61QLP3rHmEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/619F1fetb2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61WgdWdpIBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/618g+tAMhIL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/61RmKCKVLLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61aVNoc+ByL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Rqao-a86L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61wVRBZqgUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61SvggTpPzL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71-fHSt67iL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71OKQ+iZt3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71YDIvWURvL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61gDSQKg5fL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61X4HpF5M8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Mv3RkuA7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61QLP3rHmEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/619F1fetb2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61WgdWdpIBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/618g+tAMhIL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Item model number ‏": "‎ 220479",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ October 10, 2023",
    "ASIN ‏": "‎ B0CKTLXXWF",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#28,829 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #758 in Women's Casual Dresses",
    "Customer Reviews": "4.1 4.1 out of 5 stars (5,258)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Red",
      "Brown",
      "Purplish Red",
      "Dark Grey",
      "Black",
      "Navy Blue",
      "White Black Plaid",
      "Grey"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.1,
    "count": 5258,
    "customers_say": "Customers find the dress cute and well-made, with one noting the adorable elbow patches, and they appreciate its comfort and flattering fit. The material thickness receives mixed feedback - while some praise its nice thickness, others find it very thin. Customers disagree on the sizing, with some finding it roomy while others say it runs big. The length is also a concern, with several customers noting it's too short for wearing with bare legs. Generated from the text of customer reviews Select to learn more Look (284) Quality (140) Comfort (123) Fit (122) Flattering (44) Size (118) Material thickness (114) Length (97) 284 customers mention look, 260 positive, 24 negative 284 customers mention \"Look\" 260 positive 24 negative Customers find the dress cute and trendy, describing it as a darling little red dress, with one customer noting the adorable elbow patches. \" Its cute and warm. I love the elbow patches. Comfortable and soft. Its not heavy but I do wish it had pockets. Love the plaid pattern as well.... \" Read more \" Really is super cute on - and it’s hard to tell if the quality will be good from just a few reviews and photos online but we took the chance.... \" Read more \" this dress is very cute and comfortable. the only weird thing is that there's no tag, so I didn't know which side was the front... \" Read more \" This is a cute dress that you can wear with leggings or tights. Great for the office and zoom meetings! Professional but comfortable.... \" Read more 140 customers mention quality, 102 positive, 38 negative 140 customers mention \"Quality\" 102 positive 38 negative Customers praise the dress's construction, describing it as a well-made top. \" Great dress , fit as described. Got lots of compliments. Would buy again and recommend to a friend... \" Read more \" I enjoyed the dress. It's well made and fit perfectly. My husband really likes the outfit on me as well.... \" Read more \" This looks like a clown outfit such poor quality \" Read more \" Good quality and soft. Fits great and goes well with jeans. It is a thinner material so ideal for cool vs cold days. \" Read more 123 customers mention comfort, 118 positive, 5 negative 123 customers mention \"Comfort\" 118 positive 5 negative Customers find the dress comfortable and cozy. \" I love this dress. It is comfortable , true to size and looks really nice dressed up with heels or down with leggings and tennies!! It is really cute.... \" Read more \" It's more of a dress. It's very comfortable , but it's long and not form fitting. So if you want a cozy, long, loose fit, this is the one. \" Read more \" Literally no negatives to this dress. Comfy ? Check. Flattering? Check? Not too heavy, not too thin? Check? Tons of compliments? Check.... \" Read more \" I like that the fabric is very soft and very comfy . I am 5'2 and 138 lbs, and I usually wear a medium. The medium fits if I wear a belt.... \" Read more 122 customers mention fit, 99 positive, 23 negative 122 customers mention \"Fit\" 99 positive 23 negative Customers like how the dress fits, with one mentioning it sits well over the hips with room to spare, and another noting it's loose enough to be comfortable. \" Great fit , comfortable material true to size. Sleeves a little long for my short arms, but a tuck under, and it’s all good. \" Read more \" ...I’m 155 5’6 size small. Fits perfectly and brings out my figure!! Wowww just absolutely stunning and quality is great! \" Read more \" Good quality and soft. Fits great and goes well with jeans. It is a thinner material so ideal for cool vs cold days. \" Read more \" No complaints. Better than I expected honestly for the price. Fits well . Fabric feels good. I've washed it twice and it's not falling apart. \" Read more 44 customers mention flattering, 34 positive, 10 negative 44 customers mention \"Flattering\" 34 positive 10 negative Customers find the dress flattering, with one mentioning it brings out their figure and another noting its slimming effect. \" I was so happy when I tried this tunic dress on. It was flattering and the attached scarf made the tunic adorable. I am 5 ft and 170 pounds.... \" Read more \" I love this dress. It’s very flattering and fits true to size. I receive many compliments when I wear it, however, it is shorter than I expected.... \" Read more \" This tunic is SO flattering ! I'm narrow up top and wider at the hips- this is plenty wide at the bottom so it isn't tight on my thighs/butt area.... \" Read more \" ...However, the fabric is so thin it clings to every curve which is not flattering unless one is thin.... \" Read more 118 customers mention size, 63 positive, 55 negative 118 customers mention \"Size\" 63 positive 55 negative Customers have mixed opinions about the dress's size, with some finding it roomy and well-fitting, while others report that it runs big and is unflattering. \" I love this dress. It is comfortable, true to size and looks really nice dressed up with heels or down with leggings and tennies!! It is really cute.... \" Read more \" Another sizing failure. This runs small , whick sucks because it really is a cute dress. If you think you still want to try it definitely go a size up! \" Read more \" ...She is usually an 8-10 in women’s so I bought a large and it was a perfect fit . You won’t be disappointed. \" Read more \" Beautiful dress!! Love it. Runs a little big . The fabric is soft and delicate. I definitely recommend this product. \" Read more 114 customers mention material thickness, 41 positive, 73 negative 114 customers mention \"Material thickness\" 41 positive 73 negative Customers have mixed opinions about the dress's material thickness, with some appreciating its nice thickness while others find it very thin. \" ...I’m 5’3” and it was a little longer than mid thigh. Also it is a thin material so mine had a snag when I got it. \" Read more \" ...Comfy? Check. Flattering? Check? Not too heavy, not too thin ? Check? Tons of compliments? Check. Runs true to size. \" Read more \" This has no shape and is made of super thin, cheap material . It’s also a lot longer than I expected. Just kind of sloppy looking. \" Read more \" Material was thin & felt cheap. \" Read more 97 customers mention length, 25 positive, 72 negative 97 customers mention \"Length\" 25 positive 72 negative Customers have mixed opinions about the dress's length, with some finding it appropriate while others consider it too short, particularly noting that the sleeves are longer than desired. \" ...It’s also very short ! I’m only 5’5” and while I could maybe get away with wearing this as a dress, the length is more suitable as a tunic \" Read more \" I didn’t like any part of it. It was too short , the cowl Deck wouldn’t lay correctly and the fabric made me itch. \" Read more \" Comfortable and flattering. Wore with thick tights and was the perfect length . Received lots of compliments while wearing \" Read more \" The material was not good, thin. And it was too short for a dress . I’m 5’10” \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars A little short",
        "body": "Its cute and warm. I love the elbow patches. Comfortable and soft. Its not heavy but I do wish it had pockets. Love the plaid pattern as well. My only issue is it becomes more of a tunic than a dress. So if you're looking for a dress that has more length to it this might not be the one for you. I wear leggings not tights underneath just in case. It may be my body type that makes it but I feel like im pulling it down a lot throughout the day. However I did buy another one in a different pattern. So I must like it Read more",
        "author": "Stacey N",
        "rating": 5.0,
        "date": "December 8, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Nice tunic",
        "body": "This tunic is very pretty. The fabric is very light. Read more",
        "author": "Ane G",
        "rating": 4.0,
        "date": "December 19, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Fabric too thin",
        "body": "This dress is very cute; just as pictured. However, the fabric is so thin it clings to every curve which is not flattering unless one is thin. I'm disappointed in having to return it because otherwise it is cute. Read more",
        "author": "Jill E.",
        "rating": 3.0,
        "date": "November 5, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "2.0 out of 5 stars Don't like collar",
        "body": "I just don't like the collar. If there was a way to change it I might keep the dress. Read more",
        "author": "Sarah T.",
        "rating": 2.0,
        "date": "November 5, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Cute dress",
        "body": "Very comfortable dress. I’m 5’2” and weigh 100 pounds. I believe I ordered the small. It was a little roomy but I loved it. Read more",
        "author": "Aidamelie espaillat",
        "rating": 4.0,
        "date": "December 14, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Cute!",
        "body": "So cute! Fits great and love the look. Mid-weight is nice as well. Read more",
        "author": "Jen",
        "rating": 5.0,
        "date": "October 26, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Lg stuffy cowl neck, rises in back when bending forward.",
        "body": "I liked the dress okay but I didnt expext the neck to be a rather large cowl. Was a bit stuffy and stifling. If you’re larger around the middle, make sure you wear this with some heavy tights as it rises up in back when bending forward. Read more",
        "author": "As I said, the machine itself is good. But your English instructions need to be more clear. Also it is Very important to include the type of expresso grind/brand to buy, included in the advertisement, so people will know what to buy for machine when they order it!",
        "rating": 3.0,
        "date": "November 17, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "2.0 out of 5 stars Mala calidad",
        "body": "No me gustó la tela venía muy grande Read more",
        "author": "Adela",
        "rating": 2.0,
        "date": "November 15, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.",
  "about_this_item": "Womens Maxi Dress Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.",
  "long_description": "Womens Maxi Dress Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Red, Brown, Purplish Red, Dark Grey, Black, Navy Blue, White Black Plaid, Grey. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Red, Brown, Purplish Red, Dark Grey, Black, Navy Blue, White Black Plaid, Grey. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "eb80bf2e-f0a1-4406-953a-8e2e40e8a656",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/eb80bf2e-f0a1-4406-953a-8e2e40e8a656/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/eb80bf2e-f0a1-4406-953a-8e2e40e8a656/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "64967f34-d16e-41f0-949c-d845903209b7",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/64967f34-d16e-41f0-949c-d845903209b7/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/64967f34-d16e-41f0-949c-d845903209b7/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Red": "https://m.media-amazon.com/images/I/41dj1M9a+wL._AC_SR38,50_.jpg",
    "Brown": "https://m.media-amazon.com/images/I/41ZPc5xcOHL._AC_SR38,50_.jpg",
    "Purplish Red": "https://m.media-amazon.com/images/I/41IkP+BctxL._AC_SR38,50_.jpg",
    "Dark Grey": "https://m.media-amazon.com/images/I/41MRt5APn5L._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/41ntBhcMyaL._AC_SR38,50_.jpg",
    "Navy Blue": "https://m.media-amazon.com/images/I/41jdmxXXZAL._AC_SR38,50_.jpg",
    "White Black Plaid": "https://m.media-amazon.com/images/I/41PyY4yFBnL._AC_SR38,50_.jpg",
    "Grey": "https://m.media-amazon.com/images/I/41711Q+gO7L._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Red": "61RmKCKVLLL",
    "Brown": "61gDSQKg5fL",
    "Purplish Red": "61X4HpF5M8L",
    "Dark Grey": "61Mv3RkuA7L",
    "Black": "61QLP3rHmEL",
    "Navy Blue": "619F1fetb2L",
    "White Black Plaid": "61WgdWdpIBL",
    "Grey": "618g+tAMhIL"
  },
  "color_images": {
    "Red": [
      "https://m.media-amazon.com/images/I/61RmKCKVLLL._SL1500_.jpg"
    ],
    "Brown": [
      "https://m.media-amazon.com/images/I/61gDSQKg5fL._SL1500_.jpg"
    ],
    "Purplish Red": [
      "https://m.media-amazon.com/images/I/61X4HpF5M8L._SL1500_.jpg"
    ],
    "Dark Grey": [
      "https://m.media-amazon.com/images/I/61Mv3RkuA7L._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/61QLP3rHmEL._SL1500_.jpg"
    ],
    "Navy Blue": [
      "https://m.media-amazon.com/images/I/619F1fetb2L._SL1500_.jpg"
    ],
    "White Black Plaid": [
      "https://m.media-amazon.com/images/I/61WgdWdpIBL._SL1500_.jpg"
    ],
    "Grey": [
      "https://m.media-amazon.com/images/I/618g+tAMhIL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress-cocktail-bodycon",
      "title": "Womens Dress Cocktail Bodycon",
      "price": 47.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61NfEwzl3xL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-one-shoulder-maxi-formal",
      "title": "Womens Maxi Dress Evening One Shoulder Maxi Formal",
      "price": 69.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/5150AIQL4eL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail",
      "title": "Womens Dress Cocktail",
      "price": 103.54,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61JApwce25L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-formal-bodycon-evening-sleeveless",
      "title": "Womens Maxi Dress Maxi Formal Bodycon Evening Sleeveless",
      "price": 61.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61s8qg6u1VL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 158.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71PmRANW40L._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress-bodycon-split-ruched-off-shoulder",
      "title": "Womens Dress Bodycon Split Ruched Off Shoulder",
      "price": 38.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/41JjYcPgcpL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 95.61,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Work",
      "images": [
        "https://m.media-amazon.com/images/I/71hVgSIB1jL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 138.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51PZNrlyY9L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-split-evening-formal",
      "title": "Womens Maxi Dress Split Evening Formal",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51BZ1BqPx8L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 65.97,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/81wr8PDg55L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-v-neck",
      "title": "Womens Dress V Neck",
      "price": 82.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/710bSTpZ9hL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 278.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/91YXeyW506L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening-long-sleeve",
      "title": "Womens Maxi Dress Formal Evening Long Sleeve",
      "price": 87.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61nnk+flvaL._SL1500_.jpg"
      ]
    }
  ]
}