{
  "id": "womens-maxi-dress-ruched-bodycon-long-sleeve",
  "handle": "womens-maxi-dress-ruched-bodycon-long-sleeve",
  "sku": "JC2048",
  "asin": "B07YQHG1P3",
  "title": "Womens Maxi Dress Ruched Bodycon Long Sleeve",
  "title_original": "Mokoru Women's Sexy Basic Elegant Long Sleeve Ruched Bodycon Club Party Mini Dress",
  "brand": "Visit the Mokoru Store",
  "price": 23.39,
  "social_proof": {
    "bought_past_month": 50,
    "text": "50+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/51gDiOOlTuL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51GxwDv3uGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71uSi86BoCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61daIA4K6gL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51OvUSI3VuL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51yPrI0UWSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71uSLTrh6ZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/615boTNxOIL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/511LT4zY7UL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51WoNQ2LqVL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61MW014q0YL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51LbWb0ZljL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51GXIa2gxEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ETbc-Sa9L._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/51gDiOOlTuL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51GxwDv3uGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71uSi86BoCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61daIA4K6gL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51OvUSI3VuL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51yPrI0UWSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71uSLTrh6ZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/615boTNxOIL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/511LT4zY7UL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51WoNQ2LqVL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61MW014q0YL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51LbWb0ZljL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51GXIa2gxEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ETbc-Sa9L._SL1500_.jpg"
  ],
  "aplus_images": [
    "https://m.media-amazon.com/images/I/31vPIxPX0mL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31%2BC6FY2SWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41jkj3FLmPL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31S9H0bn9nL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31SxAjtvfSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31agg1mZpEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31vkBYcsMfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31FNyOR%2BbjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/318%2B-HAPEeL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/21QcWn9BkrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31kf9hY0MUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/3129DsfK3ML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41s750gv8WL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41Qj7iW7TCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41GV5O7tFaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41E8IdXgvcL._SL1500_.jpg"
  ],
  "description_images": [
    "https://m.media-amazon.com/images/I/31vPIxPX0mL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31%2BC6FY2SWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41jkj3FLmPL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31S9H0bn9nL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31SxAjtvfSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31agg1mZpEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31vkBYcsMfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31FNyOR%2BbjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/318%2B-HAPEeL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/21QcWn9BkrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31kf9hY0MUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/3129DsfK3ML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41s750gv8WL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41Qj7iW7TCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41GV5O7tFaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41E8IdXgvcL._SL1500_.jpg"
  ],
  "bullets": [],
  "specs": {
    "Item model number ‏": "‎ XG096",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ September 15, 2019",
    "ASIN ‏": "‎ B07XM2KKSX",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#47,480 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #241 in Women's Club & Night Out Dresses",
    "Customer Reviews": "4.4 4.4 out of 5 stars (3,114)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Dark Green",
      "Red",
      "Wine Red",
      "White",
      "Purple",
      "Royal Blue",
      "Black",
      "Coffee",
      "Nude"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.4,
    "count": 3114,
    "customers_say": "Customers find the dress fits beautifully, with one noting it hits just above the knees, and appreciate its flattering design that hugs the body. The dress is made of sports jersey-like material with fleece lining, making it perfect for cold evening events and fall/winter wear. They like its stretchiness, with one mentioning the gathered sides provide lots of flexibility, and consider it a great value. Generated from the text of customer reviews Select to learn more Fit (141) Style (102) Quality (90) Comfort (64) Flattering (64) Material quality (57) Warmth (50) Stretchiness (43) 141 customers mention fit, 114 positive, 27 negative 141 customers mention \"Fit\" 114 positive 27 negative Customers are satisfied with how the dress fits, particularly noting its perfect length and how it hits just above the knees. \" Fits perfectly but came with rip under the arm. I will be sending it back to exchange for another one. I’m 160 pds and wear a size 12 in pants.... \" Read more \" I ordered a small. 4'8 135lbs. It was a perfect fit . Nice material. Warm and comfortable. \" Read more \" Great fit … great for cold weather temperatures. \" Read more \" This shirt is sooo warm! I love it! It fits perfect ! I am 5’4, 135lbs and a size small fits great! I will be ordering more of these! \" Read more 102 customers mention style, 96 positive, 6 negative 102 customers mention \"Style\" 96 positive 6 negative Customers find the dress visually appealing, with one customer noting it looks great regardless of weight, while another mentions it receives compliments every time they wear it. \" ...I love it because it was classy but still sexy , and didn't break the bank! Im very happy with this purchase.... \" Read more \" Super cute . Fits my curves perfectly. Wearing it to a formal tonight but didn't realize it had a warm lining so I'm probably gonna bee too hot.... \" Read more \" ...I like simple and cute but with the right accessories and a cute pair of shoes you don't have to to do too much. I brought the black one too.... \" Read more \" Beautiful Dress ! Definitely will order again! \" Read more 90 customers mention quality, 84 positive, 6 negative 90 customers mention \"Quality\" 84 positive 6 negative Customers find the dress to be of good quality, describing it as wonderful and sexy, and consider it a great bargain. \" It’s a great dress . Very stretchy. It’s flattering. Good material. BUT… it’s inner lining in like a fleece material. I’m not down with that.... \" Read more \" Great quality ! I love the dress. Very flattering and the ruching on the stomach area is perfect any stomach insecurities. I would recommend!... \" Read more \" Very sexy, good quality , great price, holds you, & I felt very sexy win I put it on. Will purchase/ have purchased in ah different color... \" Read more \" Love this dress . I'm 5'4 220 and xxl fit great. Can't wait to put it on with my spanxs lol \" Read more 64 customers mention comfort, 64 positive, 0 negative 64 customers mention \"Comfort\" 64 positive 0 negative Customers find the dress comfortable and cozy. \" I loved everything about this dress. It’s comfortable , flattering, it fit as expected, it’s stretchy, the color is perfect, a perfect day to night... \" Read more \" This dress was true to size. It was very comfortable and flattering. I washed it one time on hand wash/gentle and the dress was pretty much ruined. \" Read more \" ...However, so worth it!! It’s super flattering and comfy , I don’t have to keep pulling it down either! \" Read more \" ...I wore to a wedding it was super comfy had soft lining inside that adds warmth. And it was super cute. Will definitely order more. \" Read more 64 customers mention flattering, 60 positive, 4 negative 64 customers mention \"Flattering\" 60 positive 4 negative Customers find the dress flattering, particularly noting how it hugs the body and accentuates curves, with one customer mentioning that the waist and bottom gather enhance its appearance. \" Great quality! I love the dress. Very flattering and the ruching on the stomach area is perfect any stomach insecurities. I would recommend!... \" Read more \" This dress was true to size. It was very comfortable and flattering . I washed it one time on hand wash/gentle and the dress was pretty much ruined. \" Read more \" I absolutely LOVE this dress, and so does my husband! It's super flattering , and fits perfectly! Definitely worth the money... \" Read more \" ...It hugs in all the right places and it’s very comfortable. The material inside is fleece, very warm and soft.... \" Read more 57 customers mention material quality, 46 positive, 11 negative 57 customers mention \"Material quality\" 46 positive 11 negative Customers appreciate the dress's material, noting it feels like sports jersey and has a warm fleece-like texture. One customer mentions it's great for adding feathers or rhinestones with fabric glue. \" ...It hugs the curves perfectly, it is very warm because it is fleece lined so if you are in a place where it gets colder this is great for going out.... \" Read more \" It’s a great dress. Very stretchy. It’s flattering. Good material . BUT… it’s inner lining in like a fleece material. I’m not down with that.... \" Read more \" I absolutely love this dress. I was surprised at what good quality material it is, For the great price. Im gonna buy more in different colors. \" Read more \" The fabric is great . Thick enough to help hide the rolls and thin enough to not be hot. It has just the right amount of stretch.... \" Read more 50 customers mention warmth, 46 positive, 4 negative 50 customers mention \"Warmth\" 46 positive 4 negative Customers find the dress keeps them warm, particularly noting it works well for cold evening events and is perfect for fall and winter. \" Super soft, warm , perfect for fall, winter or spring, stretchy, I'm 5 feet 3 inch tall and 124lbs ordered Small and fits great! \" Read more \" ...It hugs the curves perfectly, it is very warm because it is fleece lined so if you are in a place where it gets colder this is great for going out.... \" Read more \" ...Very comfy and warm dress . Must have ladies! \" Read more \" ...The dinner party was in November so it kept me warm . I will order again in other colors! \" Read more 43 customers mention stretchiness, 41 positive, 2 negative 43 customers mention \"Stretchiness\" 41 positive 2 negative Customers appreciate the dress's stretchiness, noting that it can be lengthened and has a buttery-soft feel, with one customer mentioning it's lined with fleece. \" ...It’s comfortable, flattering, it fit as expected, it’s stretchy , the color is perfect, a perfect day to night dress, it didn’t ride up, it’s classy,... \" Read more \" It’s a great dress. Very stretchy . It’s flattering. Good material. BUT… it’s inner lining in like a fleece material. I’m not down with that.... \" Read more \" ...It has just the right amount of stretch . I just had a baby 2 months ago and I can hide my belly rolls perfectly. Wish there were more colors. \" Read more \" ...It fits perfectly and has a lot of stretch . It stays in place and does not ride up.... \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Lovely in lavender!",
        "body": "I love this long sleeve dress in the pretty lavender color! It's a simple dress, but it looks amazing and fits perfectly. It's so light-weight and feels very comfortable. Body shapers that I usually wear do show underneath this dress, but it isn't that distracting. Any form fitting dress is likely going to show the outline of most body shapers. I've worn this dress with some nice silky and shiny pantyhose and platform high heels for a night, and it made me feel delightfully feminine and sexy the entire time. Read more",
        "author": "Lenny S.",
        "rating": 5.0,
        "date": "October 30, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Great quality, soft, and warm.",
        "body": "I bought this for a bachelorette party in March. It was a little chilly so I opted for long sleeves but still sexy little dress. Has a soft warm layer inside. I got purple heels that matched perfectly and overall felt so pretty in this dress! I got a small I’m 5’3, 120lbs and it fit true to size. Read more",
        "author": "Customer",
        "rating": 5.0,
        "date": "March 24, 2024",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71JcldPxZOL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Best Bodycon For A Curvy Figure!",
        "body": "The media could not be loaded. I really loved the fit of this dress! I was surprised to see how well it fit on me with my curvy, plus- size 16/18 body. The length of the dress was really nice, I didn’t feel like I was too exposed. The material was much thicker than I expected almost like it’s double layered so it’s not sheer where it’s stretchy. It’s touchably soft and feels almost like sports jersey material, I love that it comes in so many colors!! The fit is so flattering and it’s incredibly comfortable, I would buy several more in the other color options! I normally wear a size 1x -2X in this type of garment this fit better than expected! Nothing uncomfortable about the fabric, love it all the way around! Read more",
        "author": "Tammy Viviano",
        "rating": 5.0,
        "date": "May 21, 2023",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61SiKZ--AwL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/61Rqr0U5fkL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/6115HgK3A1L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "4.0 out of 5 stars Love",
        "body": "Really cute dress and gives great shape Read more",
        "author": "Romina",
        "rating": 4.0,
        "date": "October 28, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Great dresss",
        "body": "I am six months pregnant and was looking for a stretchy dress. The gathered sides allow lots of stretch and adjustment in length. Like others said it is a nice thick material. I didn’t feel like it was skin tight or suffocating me. It looked more expensive than it is! Read more",
        "author": "Haley Humphry",
        "rating": 5.0,
        "date": "January 1, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71h4Nw9o5OL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Versatile dress!",
        "body": "This was my first Amazon dress that I truly love wearing. I am 5'2 140 lb and the dress fits perfectly. The reusche style allows you to adjust the length of the skirt to your liking without it looking odd. The fabric is also lined with a warm fleece like texture, and it keeps me warm in New England weather. It hugs my body just right. I'm petite and sometimes it is difficult to find things that fit me proportionately, so this is a win! This dress would work for people taller than me too. It's not see through, the fabric has a good thickness. Overall very happy. Read more",
        "author": "Verified buyer",
        "rating": 5.0,
        "date": "December 16, 2024",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars its okay",
        "body": "thick material and fleece inside but I just prefer my sleeves to be longer, good dress though! Read more",
        "author": "Kelsey",
        "rating": 3.0,
        "date": "November 8, 2024",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Very Flattering!",
        "body": "Love this dress, got soooo many compliments. It has a thin cotton liner attached to the inside so it's not super see through for being white. Actually very comfortable, nice material and super flattering. I couldn't get the wrinkles out after washing and the rouching makes it hard to iron, but my hand held streamer worked great. I'm 5'3\" curvy and 165 lbs, bought a large and it fit perfect. Length was about mid thigh for me. Read more",
        "author": "Brooke",
        "rating": 5.0,
        "date": "November 6, 2024",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Ruched Bodycon Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.",
  "about_this_item": "Womens Maxi Dress Ruched Bodycon Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.",
  "long_description": "Womens Maxi Dress Ruched Bodycon Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Dark Green, Red, Wine Red, White, Purple, Royal Blue, Black, Coffee, Nude. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Ruched Bodycon Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/31vPIxPX0mL._SL1500_.jpg",
      "alt": "Womens Maxi Dress Ruched Bodycon Long Sleeve details image 1"
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/31%2BC6FY2SWL._SL1500_.jpg",
      "alt": "Womens Maxi Dress Ruched Bodycon Long Sleeve details image 2"
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/41jkj3FLmPL._SL1500_.jpg",
      "alt": "Womens Maxi Dress Ruched Bodycon Long Sleeve details image 3"
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/31S9H0bn9nL._SL1500_.jpg",
      "alt": "Womens Maxi Dress Ruched Bodycon Long Sleeve details image 4"
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Dark Green, Red, Wine Red, White, Purple, Royal Blue, Black, Coffee, Nude. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/31SxAjtvfSL._SL1500_.jpg",
      "alt": "Womens Maxi Dress Ruched Bodycon Long Sleeve details image 5"
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "f50d051d-f2db-4e29-a792-1ae29679dfbe",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f50d051d-f2db-4e29-a792-1ae29679dfbe/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f50d051d-f2db-4e29-a792-1ae29679dfbe/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "3fc26c29-83bd-4067-99cc-ac80d86da2b8",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3fc26c29-83bd-4067-99cc-ac80d86da2b8/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3fc26c29-83bd-4067-99cc-ac80d86da2b8/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "ee0386c3-cc5e-4519-94dc-fdac7832231e",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ee0386c3-cc5e-4519-94dc-fdac7832231e/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ee0386c3-cc5e-4519-94dc-fdac7832231e/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "11992f7f-ad53-4172-9599-84666a5b16b6",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/11992f7f-ad53-4172-9599-84666a5b16b6/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/11992f7f-ad53-4172-9599-84666a5b16b6/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "233fedc2-53ab-47bd-b73e-767f6f83e07a",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/233fedc2-53ab-47bd-b73e-767f6f83e07a/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/233fedc2-53ab-47bd-b73e-767f6f83e07a/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "ba756f1a-cd4d-4be3-99f6-5cf481fcaf8a",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ba756f1a-cd4d-4be3-99f6-5cf481fcaf8a/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ba756f1a-cd4d-4be3-99f6-5cf481fcaf8a/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "109147ec-5c1f-4d8c-b11a-bcb9c916197e",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/109147ec-5c1f-4d8c-b11a-bcb9c916197e/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/109147ec-5c1f-4d8c-b11a-bcb9c916197e/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "aff705d9-1637-4c6e-9472-1197c049d912",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/aff705d9-1637-4c6e-9472-1197c049d912/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/aff705d9-1637-4c6e-9472-1197c049d912/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "af6f0a86-8309-4b45-9a26-d68cf4dde726",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/af6f0a86-8309-4b45-9a26-d68cf4dde726/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/af6f0a86-8309-4b45-9a26-d68cf4dde726/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "4b90a20f-6716-4254-b298-5af79f185a82",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4b90a20f-6716-4254-b298-5af79f185a82/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4b90a20f-6716-4254-b298-5af79f185a82/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Dark Green": "https://m.media-amazon.com/images/I/41GHsoGjHTL._AC_SR38,50_.jpg",
    "Red": "https://m.media-amazon.com/images/I/41jkj3FLmPL._AC_SR38,50_.jpg",
    "Wine Red": "https://m.media-amazon.com/images/I/41fMs1ee7oL._AC_SR38,50_.jpg",
    "White": "https://m.media-amazon.com/images/I/31S9H0bn9nL._AC_SR38,50_.jpg",
    "Purple": "https://m.media-amazon.com/images/I/414fogYPTTL._AC_SR38,50_.jpg",
    "Royal Blue": "https://m.media-amazon.com/images/I/41eqkCmwe1L._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31vPIxPX0mL._AC_SR38,50_.jpg",
    "Coffee": "https://m.media-amazon.com/images/I/31+C6FY2SWL._AC_SR38,50_.jpg",
    "Nude": "https://m.media-amazon.com/images/I/41gvjVv2lfL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Dark Green": "71uSLTrh6ZL",
    "Red": "615boTNxOIL",
    "Wine Red": "511LT4zY7UL",
    "White": "51WoNQ2LqVL",
    "Purple": "61MW014q0YL",
    "Royal Blue": "51LbWb0ZljL",
    "Black": "51gDiOOlTuL",
    "Coffee": "51GXIa2gxEL",
    "Nude": "71ETbc-Sa9L"
  },
  "color_images": {
    "Dark Green": [
      "https://m.media-amazon.com/images/I/71uSLTrh6ZL._SL1500_.jpg"
    ],
    "Red": [
      "https://m.media-amazon.com/images/I/615boTNxOIL._SL1500_.jpg"
    ],
    "Wine Red": [
      "https://m.media-amazon.com/images/I/511LT4zY7UL._SL1500_.jpg"
    ],
    "White": [
      "https://m.media-amazon.com/images/I/51WoNQ2LqVL._SL1500_.jpg"
    ],
    "Purple": [
      "https://m.media-amazon.com/images/I/61MW014q0YL._SL1500_.jpg"
    ],
    "Royal Blue": [
      "https://m.media-amazon.com/images/I/51LbWb0ZljL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/51gDiOOlTuL._SL1500_.jpg"
    ],
    "Coffee": [
      "https://m.media-amazon.com/images/I/51GXIa2gxEL._SL1500_.jpg"
    ],
    "Nude": [
      "https://m.media-amazon.com/images/I/71ETbc-Sa9L._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-cocktail-bodycon-ruched-long-sleeve",
      "title": "Womens Maxi Dress Cocktail Bodycon Ruched Long Sleeve",
      "price": 41.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/41Szm0KzP5L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-mermaid-formal-evening",
      "title": "Womens Maxi Dress Mermaid Formal Evening",
      "price": 89.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51ZwWhqKP8L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-evening-sleeveless-v-neck-maxi",
      "title": "Womens Maxi Dress Bodycon Evening Sleeveless V Neck Maxi",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61mWvWOD+8L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-long-sleeve-ruched-bodycon",
      "title": "Womens Maxi Dress Cocktail Long Sleeve Ruched Bodycon",
      "price": 27.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61kxACexcRL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-formal-evening-ruched",
      "title": "Womens Dress Formal Evening Ruched",
      "price": 78.24,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61uMhHItwHL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress-off-shoulder-mermaid-formal",
      "title": "Womens Dress Off Shoulder Mermaid Formal",
      "price": 84.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71FVSadz-3L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-long-sleeve",
      "title": "Womens Maxi Dress Maxi Long Sleeve",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61OsL3-CxuL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-one-shoulder-long-sleeve-evening-mermaid-formal",
      "title": "Womens Maxi Dress One Shoulder Long Sleeve Evening Mermaid Formal",
      "price": 64.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61L6fFFFeuL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-mermaid",
      "title": "Womens Maxi Dress Mermaid",
      "price": 139.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51x9-1qBFQL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-maxi-evening",
      "title": "Womens Maxi Dress Cocktail Maxi Evening",
      "price": 299.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61Igvpr1t+L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 45.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61LabDaKTsL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-suede",
      "title": "Womens Maxi Dress Maxi Suede",
      "price": 170.71,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/515EW+zJ0UL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61-soOVYL7L._SL1500_.jpg"
      ]
    }
  ]
}