{
  "id": "womens-maxi-dress-bodycon-long-sleeve",
  "handle": "womens-maxi-dress-bodycon-long-sleeve",
  "sku": "JC1553",
  "asin": "B0817X3551",
  "title": "Womens Maxi Dress Bodycon Long Sleeve",
  "title_original": "GOBLES Womens Sexy Velvet Long Sleeve Bodycon Elegant Mini Party Dress",
  "brand": "Visit the GOBLES Store",
  "price": 33.99,
  "social_proof": {
    "bought_past_month": 58,
    "text": "58+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/615f4ikn5fL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61jwfro+9jL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61dkbdS99SL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/919hKvLYM9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/811Otd1xWOL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61xUlIhGQ5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61K7eeBGnsL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71JHVAwf8SL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61oDuHynoeL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/717VcQWg6CL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71UaQshBL6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51JGMKsATtL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61vriCeL6fL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61HxuVwV5HL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ACJtN04VL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71kbnQl5fXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71aoG7kbsgL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/615f4ikn5fL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61jwfro+9jL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61dkbdS99SL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/919hKvLYM9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/811Otd1xWOL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61xUlIhGQ5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61K7eeBGnsL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71JHVAwf8SL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61oDuHynoeL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/717VcQWg6CL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71UaQshBL6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51JGMKsATtL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61vriCeL6fL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61HxuVwV5HL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ACJtN04VL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71kbnQl5fXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71aoG7kbsgL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Item model number ‏": "‎ GO118",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ January 14, 2019",
    "Manufacturer ‏": "‎ GOBLES",
    "ASIN ‏": "‎ B0CN54NKJV",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#11,175 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #32 in Women's Club & Night Out Dresses",
    "Customer Reviews": "4.0 4.0 out of 5 stars (4,860)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Dark Green",
      "Red",
      "Wine Red",
      "White",
      "Royal Blue",
      "Dark Blue",
      "Nude Pink",
      "Black",
      "Orange",
      "Smoky Gray"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.0,
    "count": 4860,
    "customers_say": "Customers find the dress perfect for parties and dinner events, with a flattering design that hugs the body and accentuates curves. They appreciate its comfort, with one customer noting it's cozy for cold nights out, and its stretchy, thick material. The fit and length receive mixed feedback - while some find it a good fit, others say it runs large and is too long. The material quality also gets mixed reviews, with some praising the velvet quality while others find it cheap. Generated from the text of customer reviews Select to learn more Style (218) Quality (165) Flattering (83) Comfort (69) Stretchiness (59) Fit (269) Size (131) Material quality (88) 218 customers mention style, 200 positive, 18 negative 218 customers mention \"Style\" 200 positive 18 negative Customers find the dress stylish, describing it as a perfect little black dress that looks exactly like the pictures, with one customer noting its dramatic effect. \" This was cute . Fit was loose but I ordered it that way. Received many compliments. I have big boobs so it fit tighter up too but loose on the bottom.... \" Read more \" Beautiful dress , fits 100% as I expected. Made from quality material. I want this dress in every color now! \" Read more \" I am so happy with this purchase. The dress is so sexy and comfortable which is a hard-to-find combo. I bought a small and it fit like a glove.... \" Read more \" Super cute , not as low cut as in the picture. It was super soft, and went with my witch costume which was awesome! \" Read more 165 customers mention quality, 151 positive, 14 negative 165 customers mention \"Quality\" 151 positive 14 negative Customers find the dress to be of good quality, describing it as perfect for holiday and semi-formal occasions, with one customer noting it's suitable for a night out. \" Great dress , wore for a office Christmas party at a nicer restaurant. Stretchy material and not see through. Very pleased. \" Read more \" Nice dress but arms are tight and my arms arent \"fat\" im 130 lbs 5'4 C cup small figure \" Read more \" ...I really love how thick the material is as well, its a good quality , especially for the price.... \" Read more \" ...Other than that I think it’s an amazing dress , especially for the price, and I got so many complements in it! \" Read more 83 customers mention flattering, 63 positive, 20 negative 83 customers mention \"Flattering\" 63 positive 20 negative Customers find the dress flattering, noting that it hugs the body perfectly and accentuates curves, with one customer mentioning it's particularly suitable for curvy figures. \" This dress is an amazing color and very flattering . The price is worth the product in my opinion. I wore it for New Years and my birthday.... \" Read more \" This dress was really cute and flattering . My only gripe is that it rides up pretty easily.... \" Read more \" SO flattering . The color is a good wine red, not as dark as in the photos. I am usually a medium but I got a small and it looked great.... \" Read more \" ...the bright pink one and when I got it I was a light pink and so not flattering , do not go based on the photo with the colors.... \" Read more 69 customers mention comfort, 62 positive, 7 negative 69 customers mention \"Comfort\" 62 positive 7 negative Customers find the dress comfortable, noting that the fabric isn't itchy on the skin, and one customer mentions it's cozy for a cold night out. \" ...Christmas photos with my daughter it has a very nice stretch it is comfortable and the color is beautiful I ironed it on medium heat inside out in... \" Read more \" Wore to a show in Seattle and got several compliments. It was comfy and warm. Will definitely be one of my favorite winter and fall dresses. \" Read more \" Super sexy dress that’s nicely made. It’s very comfortable and has so much stretch. I wore it to a party and received many compliments!... \" Read more \" GET THE DRESS! Great for small chests! It's extremely comfortable , because of how small I am I'll be altering it a tiny bit for my preference.... \" Read more 59 customers mention stretchiness, 46 positive, 13 negative 59 customers mention \"Stretchiness\" 46 positive 13 negative Customers like the dress's stretchiness, particularly noting its thick, comfortable material. \" ...It went down to almost my knees. It is stretchy I will give it that and the style was cute it did match the photos but if you’re around my size even... \" Read more \" I bought this dress for New Years. It is very stretchy , breathable, and comfy! No zipper or buttons involved!... \" Read more \" ...I get tons of compliments in this. I'm a bigger girl and the material is stretchy and fits comfortably. \" Read more \" Cute dress! Slight stretch , based on how it feels you’d expect it to be stretchy. I’m a size 2/4, 5’8 125lbs.... \" Read more 269 customers mention fit, 170 positive, 99 negative 269 customers mention \"Fit\" 170 positive 99 negative Customers have mixed opinions about the dress's fit, with some finding it lovely while others note that the arms are tight and it runs large. \" Really adore this dress 5’4 185 size large and it fit perfectly , hugged my curves in all the right places, only dislike is it did rise from time to... \" Read more \" ...The arms are tight , and a bit short, but I have long arms and the tightness isn’t uncomfortable.... \" Read more \" Love this dress! Fits perfectly ! Had no issues with a strapless bra with it! Danced all night and didn’t have a problem with it riding up or anything! \" Read more \" The fabric is pretty thin and cheap feeling, kinda itchy, fits well though. I ordered a small-I’m 5’4 and 115 lbs. skinny build with size D breast.... \" Read more 131 customers mention size, 44 positive, 87 negative 131 customers mention \"Size\" 44 positive 87 negative Customers have mixed opinions about the dress's length, with some finding it perfect while others say it runs small. \" ...this dress I usually wear a small so I went for that but sadly it runs small I could still squeeze in for comfort and it is stretchy so I didn’t... \" Read more \" True to size . I am 5'2\" fit body type and the small fit perfectly for me. Cute and comfy. \" Read more \" I’m 5’5” 125” 34A and this was too small and too tight! I was bummed out because it would have been cute if it fit well.... \" Read more \" ...It fit me everywhere (snug but not too tight) except it was VERY short .... \" Read more 88 customers mention material quality, 61 positive, 27 negative 88 customers mention \"Material quality\" 61 positive 27 negative Customers have mixed opinions about the dress's material quality, with some finding it lovely and good quality, while others describe it as awful and thin. \" Too large in the waist area, but great material . If it came in an XS I would be exchanging my Small for that instead of returning it. \" Read more \" ...And it has a good hold on your mid area. Nice material . Warm dress. If i was hostess at a restaurant and exposed to cold air?... \" Read more \" This dress was extremely unflattering. It was cheap material and see through. \" Read more \" I love the material and how stretchy it is! It’s really comfortable and easy to get into.... \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Great dress, very fitted, slight stretch, but love it!",
        "body": "Cute dress! Slight stretch, based on how it feels you’d expect it to be stretchy. I’m a size 2/4, 5’8 125lbs. It doesn’t feel too short, though it’s fitted the texture makes me feel more comfortable. The arms are tight, and a bit short, but I have long arms and the tightness isn’t uncomfortable. It doesn’t feel too breathable, but that’s good for a winter dress. No weird smell, seems to be well made. Happy with this purchase! Just wanted to touch on how it fits and feels because the reviews seem to be mixed. Read more",
        "author": "Jane Mader",
        "rating": 5.0,
        "date": "December 7, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71sg9P-WB-L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Beautiful and Flattering Dress!",
        "body": "So beautiful! I absolutely love this velvet dress! I purchased this to take a mini photo shoot here at home and it fit perfectly! I'm looking to get another color or two because these are so easy to wear. Just for contex, I am 5'4\" tall and currently 133 lbs. and purchased a size small. I love it! Read more",
        "author": "Trixia Lassiter",
        "rating": 5.0,
        "date": "December 5, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/81RGhQm2D2L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "4.0 out of 5 stars Used",
        "body": "This dress is really pretty, fits well and made of good material. My qualm is the dress I received was clearly used. Smelled strongly of perfume and/or fabric softener. I shouldn’t be paying full price for a used dress. Read more",
        "author": "Customer",
        "rating": 4.0,
        "date": "December 14, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Great dress",
        "body": "I was really surprised by the quality and the fit of this dress. 5 stars!! Read more",
        "author": "K. Osborn",
        "rating": 5.0,
        "date": "December 12, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "1.0 out of 5 stars Fits weird.",
        "body": "Don’t even waste your money. I’m 5’2 115lbs. The sleeves were too short and the dress fits weird. It’s tight in some spots but loose in others. It went down to almost my knees. It is stretchy I will give it that and the style was cute it did match the photos but if you’re around my size even a small won’t do justice Read more",
        "author": "Taylor",
        "rating": 1.0,
        "date": "December 21, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Nice",
        "body": "The dress is nice and sexy. My only complaint is that the arms are a bit tight I still kept it because it looks nice. I ordered a small and I weigh 121 bra size36 B I'm 5'1 Read more",
        "author": "Cindy Razo",
        "rating": 3.0,
        "date": "March 4, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61lidTtyMgL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/61pdyAAAPtL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Cute and great material",
        "body": "I am 131 pounds and 5”2. I got a size small- the fit was tight and body hugging which is what I wanted for Christmas photos. I could have gone up a size for a looser fit. Red is definitely vibrant and the velvet material is so pretty! I’d say it’s a great dress for the price. Read more",
        "author": "Kendra Jones",
        "rating": 5.0,
        "date": "November 16, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61CGBUfn+JL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "2.0 out of 5 stars Beautiful Material, But Fit and Quality Miss the Mark",
        "body": "I really wanted to love this velvet long sleeve top because the fabric itself is soft and luxurious to the touch! It has that rich, smooth feel that you expect from velvet. The color is gorgeous and the style is definitely eye-catching, which makes it tempting for a special night out. Unfortunately, the fit was a major issue. The sizing runs small and the cut doesn’t flatter most body types, including mine. It felt tight in awkward areas while loose in others. The construction also seems a bit flimsy; seams didn’t feel very secure, and the fabric can stretch oddly after even brief wear. For a top marketed as “sexy,” it was more frustrating than flattering. Overall, while the material and color are nice, the poor fit and inconsistent quality make this a miss. I can only give it 2 stars because it looks good on the hanger, but in practice, it just didn’t deliver. Read more",
        "author": "Michelle Kim",
        "rating": 2.0,
        "date": "November 7, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Bodycon Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.",
  "about_this_item": "Womens Maxi Dress Bodycon Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.",
  "long_description": "Womens Maxi Dress Bodycon Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Dark Green, Red, Wine Red, White, Royal Blue, Dark Blue, Nude Pink, Black, Orange, Smoky Gray. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Bodycon Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Dark Green, Red, Wine Red, White, Royal Blue, Dark Blue, Nude Pink, Black, Orange, Smoky Gray. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "85d821f1-07b4-4769-8ea3-37677dbf567f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/85d821f1-07b4-4769-8ea3-37677dbf567f/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/85d821f1-07b4-4769-8ea3-37677dbf567f/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "77208b1f-244c-440f-96ac-037c7571540e",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/77208b1f-244c-440f-96ac-037c7571540e/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/77208b1f-244c-440f-96ac-037c7571540e/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "225974b2-36c3-42e3-9f20-42c6a59e0183",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/225974b2-36c3-42e3-9f20-42c6a59e0183/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/225974b2-36c3-42e3-9f20-42c6a59e0183/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "bf824898-8ef2-405c-9339-b18b56f1e73d",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bf824898-8ef2-405c-9339-b18b56f1e73d/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bf824898-8ef2-405c-9339-b18b56f1e73d/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "05eb111d-517c-43b4-919b-1c222876ae15",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/05eb111d-517c-43b4-919b-1c222876ae15/embedded.cc.default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/05eb111d-517c-43b4-919b-1c222876ae15/embedded.cc.default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "88a8f248-9628-45ee-8592-ab53e07ac43b",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/88a8f248-9628-45ee-8592-ab53e07ac43b/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/88a8f248-9628-45ee-8592-ab53e07ac43b/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "20aef8c5-0338-4745-a103-d69a0d29e3fd",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/20aef8c5-0338-4745-a103-d69a0d29e3fd/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/20aef8c5-0338-4745-a103-d69a0d29e3fd/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "83e5fd1e-598f-4923-937d-a8163918fcac",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/83e5fd1e-598f-4923-937d-a8163918fcac/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/83e5fd1e-598f-4923-937d-a8163918fcac/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "1b6a6b46-06e5-449b-9cde-01395d735fb6",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1b6a6b46-06e5-449b-9cde-01395d735fb6/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1b6a6b46-06e5-449b-9cde-01395d735fb6/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "98586183-9d1e-4738-9948-c50bbe993366",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/98586183-9d1e-4738-9948-c50bbe993366/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/98586183-9d1e-4738-9948-c50bbe993366/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "564436d8-dd91-4d19-91ce-5c78d10e9869",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/564436d8-dd91-4d19-91ce-5c78d10e9869/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/564436d8-dd91-4d19-91ce-5c78d10e9869/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "1bb29a43-e170-405e-8b8e-d516660e9a29",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1bb29a43-e170-405e-8b8e-d516660e9a29/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1bb29a43-e170-405e-8b8e-d516660e9a29/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Dark Green": "https://m.media-amazon.com/images/I/41oB8c9-qJL._AC_SR38,50_.jpg",
    "Red": "https://m.media-amazon.com/images/I/41Z6x4HJadL._AC_SR38,50_.jpg",
    "Wine Red": "https://m.media-amazon.com/images/I/41+q1sfZYWL._AC_SR38,50_.jpg",
    "White": "https://m.media-amazon.com/images/I/31vw0be8f1L._AC_SR38,50_.jpg",
    "Royal Blue": "https://m.media-amazon.com/images/I/31B6vLn58UL._AC_SR38,50_.jpg",
    "Dark Blue": "https://m.media-amazon.com/images/I/312yAHwBOwL._AC_SR38,50_.jpg",
    "Nude Pink": "https://m.media-amazon.com/images/I/31akBMiwlbL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31TZkoiVMkL._AC_SR38,50_.jpg",
    "Orange": "https://m.media-amazon.com/images/I/31LMmehG+dL._AC_SR38,50_.jpg",
    "Smoky Gray": "https://m.media-amazon.com/images/I/31FdwKAJqfL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Dark Green": "615f4ikn5fL",
    "Red": "61oDuHynoeL",
    "Wine Red": "717VcQWg6CL",
    "White": "71UaQshBL6L",
    "Royal Blue": "51JGMKsATtL",
    "Dark Blue": "61vriCeL6fL",
    "Nude Pink": "61HxuVwV5HL",
    "Black": "71ACJtN04VL",
    "Orange": "71kbnQl5fXL",
    "Smoky Gray": "71aoG7kbsgL"
  },
  "color_images": {
    "Dark Green": [
      "https://m.media-amazon.com/images/I/615f4ikn5fL._SL1500_.jpg"
    ],
    "Red": [
      "https://m.media-amazon.com/images/I/61oDuHynoeL._SL1500_.jpg"
    ],
    "Wine Red": [
      "https://m.media-amazon.com/images/I/717VcQWg6CL._SL1500_.jpg"
    ],
    "White": [
      "https://m.media-amazon.com/images/I/71UaQshBL6L._SL1500_.jpg"
    ],
    "Royal Blue": [
      "https://m.media-amazon.com/images/I/51JGMKsATtL._SL1500_.jpg"
    ],
    "Dark Blue": [
      "https://m.media-amazon.com/images/I/61vriCeL6fL._SL1500_.jpg"
    ],
    "Nude Pink": [
      "https://m.media-amazon.com/images/I/61HxuVwV5HL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/71ACJtN04VL._SL1500_.jpg"
    ],
    "Orange": [
      "https://m.media-amazon.com/images/I/71kbnQl5fXL._SL1500_.jpg"
    ],
    "Smoky Gray": [
      "https://m.media-amazon.com/images/I/71aoG7kbsgL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-v-neck-long-sleeve",
      "title": "Womens Maxi Dress V Neck Long Sleeve",
      "price": 42.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61ESKKVXeyL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 174.91,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71SN6Oih0hL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-cocktail-v-neck",
      "title": "Womens Maxi Dress Long Sleeve Cocktail V Neck",
      "price": 58.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/615ijFkMCdL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-v-neck-bodycon",
      "title": "Womens Maxi Dress Long Sleeve V Neck Bodycon",
      "price": 47.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61QbwpUJEwL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 24.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61H3TuaNRDL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-cocktail-split-formal",
      "title": "Womens Maxi Dress Cocktail Split Formal",
      "price": 57.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51TDVOmSHDL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi",
      "title": "Womens Maxi Dress Maxi",
      "price": 35.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/6135-lSmLWL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 55.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/81BWIeE3JdL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 169.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51Cd8onMJbL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 35.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71xNIsc8O6L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-evening-v-neck-mermaid-bodycon",
      "title": "Womens Dress Evening V Neck Mermaid Bodycon",
      "price": 84.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61VKe8rgggL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-ruched-sleeveless-maxi-cocktail",
      "title": "Womens Maxi Dress Bodycon Ruched Sleeveless Maxi Cocktail",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51KEafj4npL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-sleeveless-cocktail",
      "title": "Womens Dress Sleeveless Cocktail",
      "price": 43.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61yL+tI8RDL._SL1500_.jpg"
      ]
    }
  ]
}