{
  "id": "womens-dress-short-sleeve",
  "handle": "womens-dress-short-sleeve",
  "sku": "JC1084",
  "asin": "B083B63P9H",
  "title": "Womens Dress Short Sleeve",
  "title_original": "Anna-Kaci Women's Short Sleeve V-Neck Sequin Shift T-Shirt Mini Dress",
  "brand": "Visit the Anna-Kaci Store",
  "price": 54.99,
  "social_proof": {
    "bought_past_month": 202,
    "text": "202+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/61UMw3TncmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61d0C4gTf3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61oRxAq7c+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/618149U8+vL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/711TGDMHP+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71CB4j0CCYL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Z1l1702SL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Ud36H5OrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71LGtqLecdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81CaWF9v9AL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61KtJvLHxhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61NBMQp-+1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61SdG5lL3cL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/615iGWj0R7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81GVQvWgEFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71B514qSvdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71GQoAm1sFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71xrIOz1bKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71A6s6tcHTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/814s9aOAmxL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/61UMw3TncmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61d0C4gTf3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61oRxAq7c+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/618149U8+vL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/711TGDMHP+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71CB4j0CCYL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Z1l1702SL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Ud36H5OrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71LGtqLecdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81CaWF9v9AL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61KtJvLHxhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61NBMQp-+1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61SdG5lL3cL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/615iGWj0R7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81GVQvWgEFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71B514qSvdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71GQoAm1sFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71xrIOz1bKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71A6s6tcHTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/814s9aOAmxL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ January 14, 2020",
    "Manufacturer ‏": "‎ Anna-Kaci",
    "ASIN ‏": "‎ B083TW9F1T",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#114,500 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #729 in Women's Club & Night Out Dresses",
    "Customer Reviews": "4.0 4.0 out of 5 stars (368)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Gold",
      "Silver",
      "Black",
      "Green"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.0,
    "count": 368,
    "customers_say": "Customers find the dress looks exactly like the image and appreciate its quality, comfort, and value for money. Moreover, they consider it a good party dress, with one mentioning it's perfect for bachelorette parties. However, the fit and size receive mixed feedback - while some find it perfect, others say it's too short, and while some find it flattering, others disagree. Generated from the text of customer reviews Select to learn more Appearance (30) Quality (28) Comfort (10) Value for money (6) Dress size (5) Fit (32) Size (15) Flattering (5) 30 customers mention appearance, 29 positive, 1 negative 30 customers mention \"Appearance\" 29 positive 1 negative Customers find the dress pretty and sparkly, noting that it looks exactly like the image. \" its very cute but very short. for a younger person than me. I liked it a lot and it was flattering \" Read more \" Beautiful , well made garment fit great all over - EXCEPT the teeny chest area. I bought XL and I wear a 14 with D cup.... \" Read more \" The dress is very good quality and pretty . I had to return it unfortunately because it runs small. XL is the biggest size I’m 5 2 and 190lbs.... \" Read more \" Gorgeous dress !... \" Read more 28 customers mention quality, 24 positive, 4 negative 28 customers mention \"Quality\" 24 positive 4 negative Customers find the dress to be of good quality. \" ...This dress is adorable and well made . I didn’t expect much from it, but I will wear again and again whenever I can.... \" Read more \" Got this to wear to a concert and it did NOT disappoint! Really good quality ! Was so comfortable!... \" Read more \" This dress is stunning. Great quality ! The sizes are probably true, but I just don’t like things to hug my mid section. That is why I returned this!... \" Read more \" ...It was also very good quality and the sequins didn't bother me. \" Read more 10 customers mention comfort, 9 positive, 1 negative 10 customers mention \"Comfort\" 9 positive 1 negative Customers find the dress comfortable and appreciate that it doesn't feel itchy. \" Wore this dress to an event and not only was it comfortable but I received many compliments. Pretty and inexpensive. \" Read more \" ...Really good quality! Was so comfortable ! It does run a little on the short side… but a pair of spandex shorts under was the way to go!!... \" Read more \" ...Looks exactly like it does in the picture fit and all! It is super comfy , not itchy at all. Highly recommend! \" Read more \" Very cute, I was afraid it was going to be boxy and it’s not at all. Not scratchy either \" Read more 6 customers mention value for money, 6 positive, 0 negative 6 customers mention \"Value for money\" 6 positive 0 negative Customers find the dress worth its price. \" ...Pretty and inexpensive . \" Read more \" ... Great dress for the price \" Read more \" Great price for a cute dress. A little snug in bust but fit in all other areas. \" Read more \" ...The quality and price is amazing . I’m saving this dress for my next cruise and look forward to wearing it. Highly recommend purchasing this dress!!!! \" Read more 5 customers mention dress size, 5 positive, 0 negative 5 customers mention \"Dress size\" 5 positive 0 negative Customers find the dress suitable for parties, with one mentioning it's perfect for bachelorette parties and another noting it's ideal for Halloween. \" ...It was used for a Bachelorette Disco Night, and it was the perfect dress for the occasion and on a budget! \" Read more \" Perfect for Nashville ! I wore it for my bachelorette and got many compliments. \" Read more \" This dress fit me perfect and was the best purchase for my bachelorette party ! I’m short and thick and I loved the was this fit me. \" Read more \" Good party dress .... \" Read more 32 customers mention fit, 21 positive, 11 negative 32 customers mention \"Fit\" 21 positive 11 negative Customers have mixed opinions about the dress's length, with some finding it perfect while others say it's too short. \" This dress fit me perfect and was the best purchase for my bachelorette party! I’m short and thick and I loved the was this fit me. \" Read more \" This dress was really cute and great quality, but was very short . I returned it and will order the next size up to hopefully add some length. \" Read more \" ...My dress size is probably a 4/6. I got a med and it’s definitely fitted up top .... \" Read more \" This dress fits true to size . I got lots of compliments on it. Perfect length. For reference I’m almost 5’2” and it hits a little above the knee.... \" Read more 15 customers mention size, 6 positive, 9 negative 15 customers mention \"Size\" 6 positive 9 negative Customers have mixed opinions about the dress's size, with some finding the small size perfect while others report it runs too small. \" ...I had to return it unfortunately because it runs small . XL is the biggest size I’m 5 2 and 190lbs.... \" Read more \" ...I am a pretty fit person with 34 C chest and the small was PERFECT . I love how the top wasn’t low cut too.... \" Read more \" ...The fit is also awkward af- it's both too big and too small in all of the wrong places- I got a sparkly belt to blend in with the dress so I can... \" Read more \" Nice dress - made well - runs Small through the chest area and arms \" Read more 5 customers mention flattering, 3 positive, 2 negative 5 customers mention \"Flattering\" 3 positive 2 negative Customers have mixed opinions about the dress's appearance, with some finding it flattering while others disagree. \" ...for a younger person than me. I liked it a lot and it was flattering \" Read more \" Too short to wear as a dress boxy and not flattering . \" Read more \" ...trapeze - it covers all unpleasant unevenness of my body but shows my best parts . I bought silver and green - I keep both of them \" Read more \" Not flattering ... \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Very cute",
        "body": "Very cute, I was afraid it was going to be boxy and it’s not at all. Not scratchy either Read more",
        "author": "Jerry Kessler",
        "rating": 5.0,
        "date": "November 30, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/810104VqryL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Cute, comfy, and fun!",
        "body": "Got this to wear to a concert and it did NOT disappoint! Really good quality! Was so comfortable! It does run a little on the short side… but a pair of spandex shorts under was the way to go!! Would definitely order again in another color as well! Read more",
        "author": "Dayna Peiffer",
        "rating": 5.0,
        "date": "March 4, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61FgI8rCH9L._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/81EIh7S7aML._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "4.0 out of 5 stars Nice quality for a low price!",
        "body": "The dress wasn't as form fitting as expected, but the fit was right, it wasn't damaged and the sequins stayed on. Found dresses almost identical on other sites for double, or triple the price. It was used for a Bachelorette Disco Night, and it was the perfect dress for the occasion and on a budget! Read more",
        "author": "Kara H.",
        "rating": 4.0,
        "date": "January 6, 2022",
        "verified": false,
        "images": []
      },
      {
        "title": "1.0 out of 5 stars Don’t buy",
        "body": "Color and dress poor quality. Don’t waste your money Read more",
        "author": "Customer",
        "rating": 1.0,
        "date": "December 15, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars So much better than expected!",
        "body": "I had to buy as a last minute replacement dress for a Christmas party. This dress is adorable and well made. I didn’t expect much from it, but I will wear again and again whenever I can. I’ve read reviews saying the cheat was tight. I am a pretty fit person with 34 C chest and the small was PERFECT. I love how the top wasn’t low cut too. It was shorter but that’s pretty obvious with all the measurements but perfect for me. Read more",
        "author": "Heather R.",
        "rating": 5.0,
        "date": "December 28, 2022",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/81-SgbzkTUL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "3.0 out of 5 stars Only for members of the IBTC!",
        "body": "Beautiful, well made garment fit great all over - EXCEPT the teeny chest area. I bought XL and I wear a 14 with D cup. This thing squashed me flat even with a padded push up. Read more",
        "author": "Customer",
        "rating": 3.0,
        "date": "December 15, 2022",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Nice appearance, fast delivery",
        "body": "Very good quality of sewing and fabric, soft lining. I'm 5'2\" and the length is just above the knees -it works very well for me, not too short. The shape is trapeze - it covers all unpleasant unevenness of my body but shows my best parts. I bought silver and green - I keep both of them Read more",
        "author": "Laura",
        "rating": 5.0,
        "date": "December 22, 2023",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Great fit",
        "body": "Worked perfect. I am 5’9” 170 and got an extra large. Washed it inside out and was still perfect. Also, the length was great. Read more",
        "author": "Shannon Lee Coates",
        "rating": 5.0,
        "date": "July 16, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71QVHKuw9VL._SY88._SL1500_.jpg"
        ]
      }
    ]
  },
  "short_description": "Womens Dress Short Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.",
  "about_this_item": "Womens Dress Short Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.",
  "long_description": "Womens Dress Short Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Gold, Silver, Black, Green. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Dress Short Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Gold, Silver, Black, Green. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "4b7602e3-7e23-4a33-b72e-91273b964a24",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4b7602e3-7e23-4a33-b72e-91273b964a24/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4b7602e3-7e23-4a33-b72e-91273b964a24/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "00aefbcb-2e02-49ec-9be9-a4180056cc5a",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/00aefbcb-2e02-49ec-9be9-a4180056cc5a/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/00aefbcb-2e02-49ec-9be9-a4180056cc5a/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "8eba819c-011c-4b8a-a28f-4f917ad9f066",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8eba819c-011c-4b8a-a28f-4f917ad9f066/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8eba819c-011c-4b8a-a28f-4f917ad9f066/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "eb49a59b-dddf-447f-9b62-1e957f703791",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/eb49a59b-dddf-447f-9b62-1e957f703791/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/eb49a59b-dddf-447f-9b62-1e957f703791/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "6b5b63b4-c43b-44f3-9006-b93746525524",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6b5b63b4-c43b-44f3-9006-b93746525524/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6b5b63b4-c43b-44f3-9006-b93746525524/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "018d062f-1797-409a-9d47-2132eb7745a6",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/018d062f-1797-409a-9d47-2132eb7745a6/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/018d062f-1797-409a-9d47-2132eb7745a6/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "d8abcf71-0afb-4469-bc07-21af46768b13",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d8abcf71-0afb-4469-bc07-21af46768b13/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d8abcf71-0afb-4469-bc07-21af46768b13/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "3611eab2-da5b-4d56-b8a7-fcef9ea5a73c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3611eab2-da5b-4d56-b8a7-fcef9ea5a73c/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3611eab2-da5b-4d56-b8a7-fcef9ea5a73c/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Gold": "https://m.media-amazon.com/images/I/41Eqf+KcNfL._AC_SR38,50_.jpg",
    "Silver": "https://m.media-amazon.com/images/I/41p71I+sEDL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/417ZiuSzm3L._AC_SR38,50_.jpg",
    "Green": "https://m.media-amazon.com/images/I/41WGNmkoUfL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Gold": "71CB4j0CCYL",
    "Silver": "61KtJvLHxhL",
    "Black": "61UMw3TncmL",
    "Green": "71B514qSvdL"
  },
  "color_images": {
    "Gold": [
      "https://m.media-amazon.com/images/I/71CB4j0CCYL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71Z1l1702SL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71Ud36H5OrL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71LGtqLecdL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81CaWF9v9AL._SL1500_.jpg"
    ],
    "Silver": [
      "https://m.media-amazon.com/images/I/61KtJvLHxhL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61NBMQp-+1L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61SdG5lL3cL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/615iGWj0R7L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81GVQvWgEFL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/61UMw3TncmL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61d0C4gTf3L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61oRxAq7c+L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/618149U8+vL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/711TGDMHP+L._SL1500_.jpg"
    ],
    "Green": [
      "https://m.media-amazon.com/images/I/71B514qSvdL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71GQoAm1sFL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71xrIOz1bKL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71A6s6tcHTL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/814s9aOAmxL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 44.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/813GmOhQ3+L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-v-neck-long-sleeve",
      "title": "Womens Maxi Dress V Neck Long Sleeve",
      "price": 28.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71K7SViYxIL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi",
      "title": "Womens Maxi Dress Maxi",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51wgEJMRyXL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-short-sleeve",
      "title": "Womens Maxi Dress Formal Short Sleeve",
      "price": 74.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61323sb10xL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-v-neck-bodycon",
      "title": "Womens Dress V Neck Bodycon",
      "price": 71.36,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71Y6PrsU2WL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-sleeveless-maxi-evening-formal",
      "title": "Womens Maxi Dress Sleeveless Maxi Evening Formal",
      "price": 69.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61oUnVj-05L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-sleeveless-v-neck",
      "title": "Womens Dress Sleeveless V Neck",
      "price": 35.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51DAlqSWLsL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 46.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/615rmgyupRL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-short-sleeve-off-shoulder-formal-high-split-v-neck-evening",
      "title": "Womens Maxi Dress Short Sleeve Off Shoulder Formal High Split V Neck Evening",
      "price": 44.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61gNNmMSaoL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-cocktail-maxi-long-sleeve-formal-ruched",
      "title": "Womens Maxi Dress Bodycon Cocktail Maxi Long Sleeve Formal Ruched",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51Q-kYjWqFL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-long-sleeve-maxi",
      "title": "Womens Maxi Dress Bodycon Long Sleeve Maxi",
      "price": 14.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/5122JE3lxEL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-off-shoulder",
      "title": "Womens Dress Off Shoulder",
      "price": 123.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/81UP9NAqKaL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail-bodycon",
      "title": "Womens Dress Cocktail Bodycon",
      "price": 42.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61pBXGPf12L._SL1500_.jpg"
      ]
    }
  ]
}