{
  "id": "womens-maxi-dress-long-sleeve",
  "handle": "womens-maxi-dress-long-sleeve",
  "sku": "JC1997",
  "asin": "B088RKDC67",
  "title": "Womens Maxi Dress Long Sleeve",
  "title_original": "MEROKEETY Women's Long Sleeve Sweater Dress 2025 High Neck Slim Fit Ribbed Knit Midi Winter Dresses",
  "brand": "Visit the MEROKEETY Store",
  "price": 57.99,
  "social_proof": {
    "bought_past_month": 1472,
    "text": "1472+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/51dp37i5nWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51Y4i3EeElL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81FXn1qpD4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81hd18fVEqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81M0Qv0DW+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81c51+5TXEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71KGa3-nCRL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71vwSJyVGaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/517gA1Cd1yL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51Gu2tr9CqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51HfNkU40EL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51HcxuyOucL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/517HORUJ2WL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61OizteOjcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51hDuwEd87L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61SDE0vHcLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61MypbHmOFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61aH6rRNM-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61HDmDJseLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61hqOe93tiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61+UJDj1wyL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/51dp37i5nWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51Y4i3EeElL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81FXn1qpD4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81hd18fVEqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81M0Qv0DW+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81c51+5TXEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71KGa3-nCRL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71vwSJyVGaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/517gA1Cd1yL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51Gu2tr9CqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51HfNkU40EL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51HcxuyOucL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/517HORUJ2WL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61OizteOjcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51hDuwEd87L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61SDE0vHcLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61MypbHmOFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61aH6rRNM-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61HDmDJseLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61hqOe93tiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61+UJDj1wyL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Item model number ‏": "‎ sweater dress",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ July 1, 2020",
    "ASIN ‏": "‎ B088RH4HQB",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#25,897 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #206 in Women's Casual Dresses",
    "Customer Reviews": "4.4 4.4 out of 5 stars (3,756)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Wine",
      "Brown",
      "Black",
      "Coffee",
      "Orange",
      "Camel Color",
      "Navy",
      "Plum",
      "Khaki",
      "Pink",
      "White",
      "Caramel",
      "Green",
      "Grey"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.4,
    "count": 3756,
    "customers_say": "Customers find the sweater dress fits well below the knees and is well-made, with one noting it's thick enough for cold weather layering. The dress is comfortable without being see-through, and customers find it flattering, particularly on curves, with one mentioning it shows off the figure well. They appreciate the soft material and color, with one customer noting it works well with their skin tone. Select to learn more Fit Quality Looks good Comfort Flattering Material quality Color Thickness 211 customers mention \"Fit\" 179 positive 32 negative Customers are satisfied with how the dress fits, noting that the turtleneck collar isn't too tight and it sits perfectly below the knees. \"...and throw it on with boots or pumps or flats...a necklace or belt.. Great fit ..wash and hang dry for me.\" Read more \"Beautiful and deep color. Ordered regular size in Large. Perfect fit . 5.3ft in no shoes. Weight 142. Will curve to your figure\" Read more \"Has plenty of stretch. Fits great . It’s soft and it’s thick. The color is a dark but not overly dark like some greens can be....\" Read more \" Fits perfectly , so flattering and comfortable! Wore it all night and danced a lot and it was comfortable and didn’t ride up or get itchy or anything....\" Read more 143 customers mention \"Quality\" 139 positive 4 negative Customers find the dress well-made and fabulous. \"It’s a great dress , love the fabric and design. The problem is that it runs extremely small. I can’t emphasize that enough. My daughter is small....\" Read more \"This dress is so nice and great quality ! I’m pregnant and this dress is perfect. Thick material and stretchy. Fits true to size\" Read more \"I purchase this beautiful garment for winter season, is really nice, good quality , not heavy not light, stretchy but was to small for my hourglass...\" Read more \"...It is warm. It is not a true navy blue if that matters. But it is nice and thick I would suggest wearing something like a teeshirt underneath if you...\" Read more 139 customers mention \"Looks good\" 134 positive 5 negative Customers find the dress visually appealing, describing it as cute and classy, particularly suitable for the winter season. One customer notes that it accentuates all the right features. \"...It'll wear down about as expected for the price. But cute ! It will show curvature. Maybe consider light shape wear\" Read more \"Fits fantastic! It is beautiful and fits really well but definitely shows off every cube but for some reason it looks good in this dress....\" Read more \"I love the color and material. Beautiful dress . Can't wait for the black one to arrive tomorrow.\" Read more \" Looks great . Returned for a different color but the dress was soft and stretchy. For wonderful and I felt lovely.\" Read more 110 customers mention \"Comfort\" 86 positive 24 negative Customers find the dress comfortable and not scratchy, with one mentioning it's not see-through. \"Fits perfectly, so flattering and comfortable ! Wore it all night and danced a lot and it was comfortable and didn’t ride up or get itchy or anything....\" Read more \"I wore this dress for my baby shower. It was very comfortable and showed off the bump perfectly. Im sure it will be great post-baby too.\" Read more \"...It was so comfy and sexy! When I got back from my trip I wore it again lol! I finally caved in and bought it in two other colors....\" Read more \"...Sleeves are a bit short for me. I would not say that fabric is itchy but not very pleasant to touch....\" Read more 87 customers mention \"Flattering\" 79 positive 8 negative Customers find the dress flattering, particularly noting how it hugs and shows off their curves. \"I love the fit and the color. It is very flattering . I am 5’7” and 135 lbs. Looking forward to wearing it in March for a wedding. It’s a great dress.\" Read more \"A flattering and easy dress. Wore to a Christmas dinner with my company’s owners. Paired with a fitter dark grey jean jacket and black heels....\" Read more \"Fits perfectly, so flattering and comfortable! Wore it all night and danced a lot and it was comfortable and didn’t ride up or get itchy or anything....\" Read more \"The dress is flattering , and soft....love the material (just be careful of things that can snag the thread)....\" Read more 73 customers mention \"Material quality\" 62 positive 11 negative Customers love the material of the dress, describing it as wonderful and soft, with one customer noting that the neck has just the right amount of fabric. \"This is a must!!! Beautiful color great material . Feels like a higher end piece. Goes perfect with my new boots.\" Read more \"It’s a great dress, love the fabric and design. The problem is that it runs extremely small. I can’t emphasize that enough. My daughter is small....\" Read more \"The material is nice and thick. Dress is super comfortable. I’m 5’5 and about 140. Perfect length and fit.\" Read more \"Love this dress. Soft material and color is beautiful.. True to size.\" Read more 67 customers mention \"Color\" 63 positive 4 negative Customers love the color of the dress, with one mentioning it works well with their skin tone. \"...I love the color and the neckline( It is a turtle neck, but it is not too tight or too high cut.) I am very happy with this purchase.\" Read more \"This is a must!!! Beautiful color great material. Feels like a higher end piece. Goes perfect with my new boots.\" Read more \"This dress was exactly what I was looking for. Color , fit and stretch are all very complementary. I will be purchasing other colors!\" Read more \"Very nice fabric and great color , excellent package. Will buy again.\" Read more 57 customers mention \"Thickness\" 46 positive 11 negative Customers like the dress's thickness, with one mentioning it's thick enough for cold weather layering, while another notes it's thin enough to prevent sweating. \"...It is not a true navy blue if that matters. But it is nice and thick I would suggest wearing something like a teeshirt underneath if you are...\" Read more \"...I bought this dress for a winter wedding in Detroit. The material is thick and it’s not see through at all. I bought a medium and it fit perfectly....\" Read more \"Impressed by the quality of this dress. It is a thicker material and keeps me warm in the winter. I like the neck....\" Read more \"...I’m pregnant and this dress is perfect. Thick material and stretchy. Fits true to size\" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Beautiful dress.",
        "body": "Love this coffee color dress, true to size. I got a size small and fits me perfectly, I am 5'3\" 120 lbs. Made well and good quality. Bought another one in black. Read more",
        "author": "VW",
        "rating": 5.0,
        "date": "November 30, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Nice and comfortable",
        "body": "I am 5'4\" and 110#. I usually wear a XS/S. After reading reviews, I ordered this in a XS. I should have gotten the S. To be fair, the dress fits well, but it's too tight for my preference. I have long arms and usually struggle with sleeves being too short. These sleeves fit well. The length of the dress hits ~2\" below my knees. The material is very comfortable, thick enough that it's not see through, but not too heavy. I could wear a cardigan over it. I ordered the wine color and it is as shown in the photos. I got this dress during a sale and paid $34.19. While the quality of this dress is nice, I don't think I would pay the full price of $53. Read more",
        "author": "CSG",
        "rating": 5.0,
        "date": "October 29, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Best sweater dress",
        "body": "This sweater dress is perfect! The fit and fabric quality was amazing. No see through issues. I would have given 5 stars except the color was more pumpkin than caramel. Read more",
        "author": "TamCos",
        "rating": 4.0,
        "date": "November 30, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Fabulous",
        "body": "I’ve had this dress for a while about 2, almost 3 years and it’s been a reliable go to every time I want to look nice. It’s figure hugging but the length of it and the fact that it’s a turtle neck makes it look effortlessly elegant and classy. However, the sleeves have always been too short for my arms. Beautiful nonetheless Read more",
        "author": "Hannah",
        "rating": 5.0,
        "date": "December 14, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/41KcvCfNqbL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Fabulous sweater dress",
        "body": "The fit is perfect. It’s lighter weight than I thought but I love how it fits and the length is great too! The color is nice and is a true brown. Read more",
        "author": "TWood",
        "rating": 5.0,
        "date": "December 10, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Significantly too small",
        "body": "It’s a great dress, love the fabric and design. The problem is that it runs extremely small. I can’t emphasize that enough. My daughter is small. Usually between a 4 and an 8 in women’s sizes. So I got her the small (6-8) per the mfg. The dress doesn’t even come close. Im going to re-order but I’m getting her a large and I hope it works. Read more",
        "author": "JenLevine",
        "rating": 3.0,
        "date": "December 8, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Soft material and beautiful color",
        "body": "Love this dress!!! Beautiful color and super soft and comfortable!!! Read more",
        "author": "Brea Shay Politte",
        "rating": 5.0,
        "date": "November 30, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Fantastic fit!",
        "body": "I was not expecting a dress of this quality and fit at such a great price. I highly recommend it especially for petites! Read more",
        "author": "Janny",
        "rating": 5.0,
        "date": "December 2, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.",
  "about_this_item": "Womens Maxi Dress Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.",
  "long_description": "Womens Maxi Dress Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Wine, Brown, Black, Coffee, Orange, Camel Color, Navy, Plum, Khaki, Pink, White, Caramel, Green, Grey. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Wine, Brown, Black, Coffee, Orange, Camel Color, Navy, Plum, Khaki, Pink, White, Caramel, Green, Grey. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "da7ed7aa-140a-4f18-afe7-2c986f2f4684",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/da7ed7aa-140a-4f18-afe7-2c986f2f4684/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/da7ed7aa-140a-4f18-afe7-2c986f2f4684/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "f6a26588-e9b3-4596-a826-e2317e39c2ad",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f6a26588-e9b3-4596-a826-e2317e39c2ad/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f6a26588-e9b3-4596-a826-e2317e39c2ad/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "5ebf799f-a7e8-4da2-af81-42da9d6bc509",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5ebf799f-a7e8-4da2-af81-42da9d6bc509/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5ebf799f-a7e8-4da2-af81-42da9d6bc509/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "8911f146-9336-4c7a-a1d7-3be0c9fd6082",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8911f146-9336-4c7a-a1d7-3be0c9fd6082/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8911f146-9336-4c7a-a1d7-3be0c9fd6082/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "dcf5c4bb-21da-4ed9-a7e3-fffb113c26ec",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/dcf5c4bb-21da-4ed9-a7e3-fffb113c26ec/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/dcf5c4bb-21da-4ed9-a7e3-fffb113c26ec/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "447b64c4-21b6-4a02-9903-d4866146ff5e",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/447b64c4-21b6-4a02-9903-d4866146ff5e/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/447b64c4-21b6-4a02-9903-d4866146ff5e/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "00f0a132-7141-4869-9e13-a637d87d7418",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/00f0a132-7141-4869-9e13-a637d87d7418/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/00f0a132-7141-4869-9e13-a637d87d7418/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "14ba7cc3-d2fe-4b30-b343-701325e3d0a1",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/14ba7cc3-d2fe-4b30-b343-701325e3d0a1/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/14ba7cc3-d2fe-4b30-b343-701325e3d0a1/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "e7330bb5-7a8a-47e2-bca0-3a6530a90c0c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e7330bb5-7a8a-47e2-bca0-3a6530a90c0c/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e7330bb5-7a8a-47e2-bca0-3a6530a90c0c/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "43b2e20a-53ab-4f1f-86fe-25773b52c5fc",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/43b2e20a-53ab-4f1f-86fe-25773b52c5fc/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/43b2e20a-53ab-4f1f-86fe-25773b52c5fc/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "49e34e49-b4a9-40d3-a38b-03df19728678",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/49e34e49-b4a9-40d3-a38b-03df19728678/videopreview.jobtemplate.mp4.342X192P_20HZ_350KBPS_VER_1_0.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/49e34e49-b4a9-40d3-a38b-03df19728678/videopreview.jobtemplate.mp4.342X192P_20HZ_350KBPS_VER_1_0.mp4"
        }
      ]
    },
    {
      "id": "e2dc6a8e-46b5-43ad-b528-d6bfbf0ec2b4",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e2dc6a8e-46b5-43ad-b528-d6bfbf0ec2b4/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e2dc6a8e-46b5-43ad-b528-d6bfbf0ec2b4/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Wine": "https://m.media-amazon.com/images/I/31K65V0z08L._AC_SR38,50_.jpg",
    "Brown": "https://m.media-amazon.com/images/I/31FPf9t8hbL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31bKNZf982L._AC_SR38,50_.jpg",
    "Coffee": "https://m.media-amazon.com/images/I/318AINKFxML._AC_SR38,50_.jpg",
    "Orange": "https://m.media-amazon.com/images/I/31fGPF2XyqL._AC_SR38,50_.jpg",
    "Camel Color": "https://m.media-amazon.com/images/I/314Wlrw88sL._AC_SR38,50_.jpg",
    "Navy": "https://m.media-amazon.com/images/I/31rd7avSYEL._AC_SR38,50_.jpg",
    "Plum": "https://m.media-amazon.com/images/I/31LMXhrC3mL._AC_SR38,50_.jpg",
    "Khaki": "https://m.media-amazon.com/images/I/31L7BrSYw8L._AC_SR38,50_.jpg",
    "Pink": "https://m.media-amazon.com/images/I/31cLMwD6MRL._AC_SR38,50_.jpg",
    "White": "https://m.media-amazon.com/images/I/31XnKCVPpeL._AC_SR38,50_.jpg",
    "Caramel": "https://m.media-amazon.com/images/I/31d-BCz6--L._AC_SR38,50_.jpg",
    "Green": "https://m.media-amazon.com/images/I/31dQ4FspWFL._AC_SR38,50_.jpg",
    "Grey": "https://m.media-amazon.com/images/I/317ZJ+4roGL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Wine": "51dp37i5nWL",
    "Brown": "517gA1Cd1yL",
    "Black": "51Gu2tr9CqL",
    "Coffee": "51HfNkU40EL",
    "Orange": "51HcxuyOucL",
    "Camel Color": "517HORUJ2WL",
    "Navy": "61OizteOjcL",
    "Plum": "51hDuwEd87L",
    "Khaki": "61SDE0vHcLL",
    "Pink": "61MypbHmOFL",
    "White": "61aH6rRNM-L",
    "Caramel": "61HDmDJseLL",
    "Green": "61hqOe93tiL",
    "Grey": "61+UJDj1wyL"
  },
  "color_images": {
    "Wine": [
      "https://m.media-amazon.com/images/I/51dp37i5nWL._SL1500_.jpg"
    ],
    "Brown": [
      "https://m.media-amazon.com/images/I/517gA1Cd1yL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/51Gu2tr9CqL._SL1500_.jpg"
    ],
    "Coffee": [
      "https://m.media-amazon.com/images/I/51HfNkU40EL._SL1500_.jpg"
    ],
    "Orange": [
      "https://m.media-amazon.com/images/I/51HcxuyOucL._SL1500_.jpg"
    ],
    "Camel Color": [
      "https://m.media-amazon.com/images/I/517HORUJ2WL._SL1500_.jpg"
    ],
    "Navy": [
      "https://m.media-amazon.com/images/I/61OizteOjcL._SL1500_.jpg"
    ],
    "Plum": [
      "https://m.media-amazon.com/images/I/51hDuwEd87L._SL1500_.jpg"
    ],
    "Khaki": [
      "https://m.media-amazon.com/images/I/61SDE0vHcLL._SL1500_.jpg"
    ],
    "Pink": [
      "https://m.media-amazon.com/images/I/61MypbHmOFL._SL1500_.jpg"
    ],
    "White": [
      "https://m.media-amazon.com/images/I/61aH6rRNM-L._SL1500_.jpg"
    ],
    "Caramel": [
      "https://m.media-amazon.com/images/I/61HDmDJseLL._SL1500_.jpg"
    ],
    "Green": [
      "https://m.media-amazon.com/images/I/61hqOe93tiL._SL1500_.jpg"
    ],
    "Grey": [
      "https://m.media-amazon.com/images/I/61+UJDj1wyL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress-cocktail-bodycon",
      "title": "Womens Dress Cocktail Bodycon",
      "price": 47.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61NfEwzl3xL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-one-shoulder-maxi-formal",
      "title": "Womens Maxi Dress Evening One Shoulder Maxi Formal",
      "price": 69.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/5150AIQL4eL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail",
      "title": "Womens Dress Cocktail",
      "price": 103.54,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61JApwce25L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-formal-bodycon-evening-sleeveless",
      "title": "Womens Maxi Dress Maxi Formal Bodycon Evening Sleeveless",
      "price": 61.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61s8qg6u1VL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 158.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71PmRANW40L._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress-bodycon-split-ruched-off-shoulder",
      "title": "Womens Dress Bodycon Split Ruched Off Shoulder",
      "price": 38.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/41JjYcPgcpL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 95.61,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Work",
      "images": [
        "https://m.media-amazon.com/images/I/71hVgSIB1jL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 138.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51PZNrlyY9L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-split-evening-formal",
      "title": "Womens Maxi Dress Split Evening Formal",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51BZ1BqPx8L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 65.97,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/81wr8PDg55L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-v-neck",
      "title": "Womens Dress V Neck",
      "price": 82.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/710bSTpZ9hL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 278.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/91YXeyW506L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening-long-sleeve",
      "title": "Womens Maxi Dress Formal Evening Long Sleeve",
      "price": 87.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61nnk+flvaL._SL1500_.jpg"
      ]
    }
  ]
}