{
  "id": "womens-maxi-dress-v-neck-cocktail-evening-long-sleeve",
  "handle": "womens-maxi-dress-v-neck-cocktail-evening-long-sleeve",
  "sku": "JC1026",
  "asin": "B08HCP8K6Z",
  "title": "Womens Maxi Dress V Neck Cocktail Evening Long Sleeve",
  "title_original": "828 - Plus Size Long Sleeves Wrapped V Neck Sequins Skater Style Cocktail Evening Club Dress",
  "brand": "Visit the RED DOT BOUTIQUE Store",
  "price": 64.99,
  "social_proof": {
    "bought_past_month": 450,
    "text": "450+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/71jdGTmoWkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71WVfHL7YFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81SyYlRwKNL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71eQWdrlr2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71GKljY++4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71GkMLq1SxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Fp9iP7hOL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61RFrPnGL-L._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/71jdGTmoWkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71WVfHL7YFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81SyYlRwKNL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71eQWdrlr2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71GKljY++4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71GkMLq1SxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Fp9iP7hOL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61RFrPnGL-L._SL1500_.jpg"
  ],
  "aplus_images": [
    "https://m.media-amazon.com/images/I/51WZj0wowpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51NqvFf5oXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/418EVTKb-DL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/511z2aKqwBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51QueieViSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/518PKm%2B%2B6zL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/512kYkMaf7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51ez-aC4q8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31N5oyTlDsL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31QjYnmD69L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/410QopRU6wS._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31YTDnNuOLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41WU6PAKf5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51kgJOAPTYL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51ZWAlBZ-LL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51wDejGwiqL._SL1500_.jpg"
  ],
  "description_images": [
    "https://m.media-amazon.com/images/I/51WZj0wowpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51NqvFf5oXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/418EVTKb-DL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/511z2aKqwBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51QueieViSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/518PKm%2B%2B6zL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/512kYkMaf7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51ez-aC4q8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31N5oyTlDsL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31QjYnmD69L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/410QopRU6wS._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31YTDnNuOLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41WU6PAKf5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51kgJOAPTYL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51ZWAlBZ-LL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51wDejGwiqL._SL1500_.jpg"
  ],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ February 14, 2023",
    "ASIN ‏": "‎ B0D7STYKN3",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#78,694 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #1,828 in Women's Dresses",
    "Customer Reviews": "4.0 4.0 out of 5 stars (330)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Black Black",
      "Black Gold",
      "Black Silver"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.0,
    "count": 330,
    "customers_say": "Customers find the dress gorgeous and full of sparkle, with high-quality construction and comfort that's not too itchy. Moreover, the dress is perfect for various events, with one customer noting it can be worn for multiple special occasions. However, the fit receives mixed feedback, with some finding it perfect while others say it's too large. Additionally, the sequin shedding is a concern, with customers reporting that the sequins stick to everything. Generated from the text of customer reviews Select to learn more Beauty (53) Comfort (22) Quality (22) Event fit (12) Figure flattering (9) Fit (42) Size (9) Sequin shedding (11) 53 customers mention beauty, 47 positive, 6 negative 53 customers mention \"Beauty\" 47 positive 6 negative Customers find the dress gorgeous and full of sparkle, with one mentioning it effectively hid imperfections without looking frumpy. \" This dress is beautiful . It is also very comfortable. If you are taller than 5'7 you will probably need some booty shorts though.... \" Read more \" Dress runs a little big but beautiful dress , I got a lot of compliments, well made not cheap looking, the back was open more than I expected but you... \" Read more \" This dress is cute and VERY flattering. I was pleasantly surprised. The dress is a little on the bigger side, so you might want to size down.... \" Read more \" Super cute ! Black and gold, just like it says... yes, the pic looks very navy.... \" Read more 22 customers mention comfort, 20 positive, 2 negative 22 customers mention \"Comfort\" 20 positive 2 negative Customers find the dress comfortable and not itchy, with one mentioning it's not scratchy. \" This dress is so comfortable and sparkly. I received so many compliments. Issue - these sequins stick to everything, including each other.... \" Read more \" My wife was very comfortable . She said the sequence kept snagging on different parts of the dress and sleeves but overall she loved it. \" Read more \" ...I am 5'3\" and 156 lbs, and it fits perfectly! It is not itchy , or heavy because it has a silky lining.... \" Read more \" ...Once I got this size, it fit PERFECTLY and is so comfortable . And well made! Looking forward to wearing this for a cruise and an upcoming wedding. \" Read more 22 customers mention quality, 18 positive, 4 negative 22 customers mention \"Quality\" 18 positive 4 negative Customers are satisfied with the dress's quality, finding it better than expected, with one customer noting it is well-sewn. \" ...runs a little big but beautiful dress, I got a lot of compliments, well made not cheap looking, the back was open more than I expected but you can’t... \" Read more \" ...are broad so this part didn’t fit but the dress was very nice and good quality \" Read more \" This dress is adorable and very well made ! BUT if you are big busted and you don't like babydoll shirts DO NOT PURCHASE YOU WILL BE DISAPPOINTED.... \" Read more \" Dress is great and better than expected. For context I'm 5'2\" and about 185lbs with a small chest.... \" Read more 12 customers mention event fit, 12 positive, 0 negative 12 customers mention \"Event fit\" 12 positive 0 negative Customers find the dress suitable for various events, with one mentioning it can be worn for multiple special occasions. \" ...for my friends benefit show, I was trynna give classy and cute but also fun and fancy since it was at a drag show!... \" Read more \" ...Got lots of compliments and loved wearing it ! I could have gone a size smaller but my actual size worked too! \" Read more \" Let me start with I do love this dress. Perfect for my holiday party .... \" Read more \" Was perfect for the event I ordered it for. Fit true to size. Definitely cut for larger busted people.... \" Read more 9 customers mention figure flattering, 7 positive, 2 negative 9 customers mention \"Figure flattering\" 7 positive 2 negative Customers find the dress flattering, with one mentioning it is supercurvy friendly. \" Don’t hesitate, but this dress! The fit was perfect and flattering !!! I can’t wait to wear this one again!!! \" Read more \" So flattering and I got SO many compliments! It seems high quality and I didn’t experience any sequin shedding.... \" Read more \" ...It is light weight, lined so it's not scratchy, supercurvy friendly . I felt confident the whole time.... \" Read more \" ...For context I'm 5'2\" and about 185lbs with a small chest. It hits at the knee and the sleeve kind of hit an odd place but I pulled them up slightly... \" Read more 42 customers mention fit, 21 positive, 21 negative 42 customers mention \"Fit\" 21 positive 21 negative Customers have mixed experiences with the dress's fit, with some finding it perfect while others report it being too large, particularly in the bust area. \" This dress is so cute. Its bright colors and fits well . I didn't keep it because the back is open and I can't get away with this dress without a bra. \" Read more \" I should have ordered a size smaller. It is very pretty though. Just too big and had to return it \" Read more \" I absolutely LOVE this dress! I am 5'3\" and 156 lbs, and it fits perfectly ! It is not itchy, or heavy because it has a silky lining.... \" Read more \" Dress runs a little big but beautiful dress, I got a lot of compliments, well made not cheap looking, the back was open more than I expected but you... \" Read more 9 customers mention size, 5 positive, 4 negative 9 customers mention \"Size\" 5 positive 4 negative Customers have mixed opinions about the dress's size, with some finding it perfect while others say it runs a bit bigger than expected. \" Lots of compliments on this dress. True to size .... \" Read more \" ...Lastly, the dress runs big . \" Read more \" Very large fit overall. Cute but size down . Very sparkly just like the picture! \" Read more \" This dress is beautiful, it definitely runs small I bought a 2x and I usually wear a 14/16 but it is a little loose.... \" Read more 11 customers mention sequin shedding, 3 positive, 8 negative 11 customers mention \"Sequin shedding\" 3 positive 8 negative Customers report issues with the sequins on the dress, noting that they stick to everything and are too irritating around the neck. \" The sequins catch on each other when worn and move around. Snagging continuously. Sad because it’s a beautiful dress. \" Read more \" The dress is pretty but the sequins get caught on everything and break easily and I only just tried it on.... \" Read more \" ...I washed this dress after a night of dancing and non of the sequins came off . A must buy for sure. \" Read more \" Dress shed sequins profusely . couldnt wears for more than 30 minutes before having to change into another dress. very disappointing.... \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Comfortable Glamour",
        "body": "It’s always fun to play “dress-ups” and be sparkly in sequins when the opportunity arises. The quality of this dress is like what one would expect from a dress shop; not a costume store. Classy and well-sewn. It is completely lined so my fat grandma arms didn’t show through the sheer, sparkly sleeves. It is also stretchy so it was comfortable and easy to move in. This is a 2X. I’m in my 60’s, weigh about 230, and 5’4” tall. The length was perfect for my height. Just above the knee. Plenty of room in the bust, and swishy on the hips. Good luck and have fun dressing to the nines! Read more",
        "author": "P. S. Butterweck",
        "rating": 5.0,
        "date": "September 4, 2023",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/81Lpij4o+oL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Good return policy",
        "body": "Didn’t fit as expected, I returned. Great easy return policy and was no hassle - while it didn’t fit my body style it was a really nice dress!! Read more",
        "author": "T",
        "rating": 5.0,
        "date": "November 9, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Black, JUST like the DESCRIPTION",
        "body": "Super cute! Black and gold, just like it says... yes, the pic looks very navy. The sash is not attached and awkwardly slips down but the dress looks cute without it. It IS backless but I have a smooth front closure bra that looks great underneath. I'm 5ft 7in, 180 lbs 40DD and the 1X fits very comfortably (I typically wear a size 12 dress). Length skims just above my knee which I think is long enough \"for my age\". Sexy, modest and flattering all in one. I was pleasantly surprised to find the sleeves are lined so you can wear this to winter parties without freezing! It looks sheer in the pic but is lined top and bottom and pretty nice quality for the price. Read more",
        "author": "Mixee Bee",
        "rating": 4.0,
        "date": "November 11, 2022",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Snagging",
        "body": "The sequins catch on each other when worn and move around. Snagging continuously. Sad because it’s a beautiful dress. Read more",
        "author": "Eric Fischesser",
        "rating": 3.0,
        "date": "May 3, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Lovely, flowy dress!",
        "body": "I absolutely LOVE this dress! I am 5'3\" and 156 lbs, and it fits perfectly! It is not itchy, or heavy because it has a silky lining. The ribbon belt is not attached, so you can use it, or not, or use a different belt of your choice. Flowy, stretchy and beautiful! Read more",
        "author": "April R.",
        "rating": 5.0,
        "date": "June 5, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "1.0 out of 5 stars All pieces didn’t come",
        "body": "Did not come with the black belt in picture I honestly don’t know if the belt will make that much of A difference but without it it forsure does not look well Read more",
        "author": "Customer",
        "rating": 1.0,
        "date": "August 31, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Well made & beautiful fit!",
        "body": "This dress is so comfortable and very well made. I love the clasp at the bust for modesty (if desired). It's flowing and so sparkly! It's got a bit of stretch which is nice and fit like a glove. I'm 5'3\" and about 160 lbs with a DDD bust. Great value for the money! Love it! Read more",
        "author": "Heather Dickerson",
        "rating": 5.0,
        "date": "November 23, 2024",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71xvnv4os7L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "2.0 out of 5 stars Disappointed",
        "body": "The dress is pretty but the sequins get caught on everything and break easily and I only just tried it on. Also in the description they say: “Long sleeves, comes with matching waist ties. With pockets.” But it does not come with a waist tie nor does it have pockets do they should update the description and not be deceptive. Not worth the price so I will likely return. Read more",
        "author": "Ren",
        "rating": 2.0,
        "date": "February 8, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress V Neck Cocktail Evening Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.",
  "about_this_item": "Womens Maxi Dress V Neck Cocktail Evening Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.",
  "long_description": "Womens Maxi Dress V Neck Cocktail Evening Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Black Black, Black Gold, Black Silver. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress V Neck Cocktail Evening Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/51WZj0wowpL._SL1500_.jpg",
      "alt": "Womens Maxi Dress V Neck Cocktail Evening Long Sleeve details image 1"
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/51NqvFf5oXL._SL1500_.jpg",
      "alt": "Womens Maxi Dress V Neck Cocktail Evening Long Sleeve details image 2"
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/418EVTKb-DL._SL1500_.jpg",
      "alt": "Womens Maxi Dress V Neck Cocktail Evening Long Sleeve details image 3"
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/511z2aKqwBL._SL1500_.jpg",
      "alt": "Womens Maxi Dress V Neck Cocktail Evening Long Sleeve details image 4"
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Black Black, Black Gold, Black Silver. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/51QueieViSL._SL1500_.jpg",
      "alt": "Womens Maxi Dress V Neck Cocktail Evening Long Sleeve details image 5"
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "8e321858-4244-4be9-961e-544b23ff789f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8e321858-4244-4be9-961e-544b23ff789f/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8e321858-4244-4be9-961e-544b23ff789f/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/870f0bdd-8a26-4208-ad62-b7a1f2fd7dac.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "5aaf0ba3-c508-44cb-87bc-21574189a82e",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5aaf0ba3-c508-44cb-87bc-21574189a82e/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5aaf0ba3-c508-44cb-87bc-21574189a82e/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/870f0bdd-8a26-4208-ad62-b7a1f2fd7dac.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Black Black": "https://m.media-amazon.com/images/I/41VuJkIP9nL._AC_SR38,50_.jpg",
    "Black Gold": "https://m.media-amazon.com/images/I/51uScFXnkKL._AC_SR38,50_.jpg",
    "Black Silver": "https://m.media-amazon.com/images/I/512kYkMaf7L._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Black Black": "71GKljY++4L",
    "Black Gold": "71jdGTmoWkL",
    "Black Silver": "61RFrPnGL-L"
  },
  "color_images": {
    "Black Black": [
      "https://m.media-amazon.com/images/I/71GKljY++4L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71GkMLq1SxL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71Fp9iP7hOL._SL1500_.jpg"
    ],
    "Black Gold": [
      "https://m.media-amazon.com/images/I/71jdGTmoWkL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71WVfHL7YFL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81SyYlRwKNL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71eQWdrlr2L._SL1500_.jpg"
    ],
    "Black Silver": [
      "https://m.media-amazon.com/images/I/61RFrPnGL-L._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61gWE-dhQNL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-off-shoulder-bodycon-long-sleeve-maxi",
      "title": "Womens Maxi Dress Off Shoulder Bodycon Long Sleeve Maxi",
      "price": 53.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/611pJhxTuIL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-sleeveless",
      "title": "Womens Dress Sleeveless",
      "price": 19.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71nuuzdxpsL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-v-neck-long-sleeve",
      "title": "Womens Maxi Dress V Neck Long Sleeve",
      "price": 53.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/71tuMFPcI4L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-v-neck-formal-evening",
      "title": "Womens Maxi Dress V Neck Formal Evening",
      "price": 89.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61a9OZMe+iL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-long-sleeve-maxi",
      "title": "Womens Maxi Dress Long Sleeve Maxi",
      "price": 42.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61YAPXl8WZL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-long-sleeve-ruched-bodycon",
      "title": "Womens Maxi Dress Cocktail Long Sleeve Ruched Bodycon",
      "price": 27.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61kxACexcRL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-v-neck-formal",
      "title": "Womens Dress V Neck Formal",
      "price": 89.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/6162W1S6FuL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-evening-formal-v-neck",
      "title": "Womens Maxi Dress Long Sleeve Evening Formal V Neck",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61uwl+MjMcL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-long-sleeve-v-neck",
      "title": "Womens Maxi Dress Cocktail Long Sleeve V Neck",
      "price": 44.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/71TEVCKMF+L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 26.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61RmKCKVLLL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-mermaid-evening-formal",
      "title": "Womens Maxi Dress Long Sleeve Mermaid Evening Formal",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/41BnnC+jJ8L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening",
      "title": "Womens Maxi Dress Formal Evening",
      "price": 99.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61nB1Q-leJL._SL1500_.jpg"
      ]
    }
  ]
}