{
  "id": "womens-maxi-dress",
  "handle": "womens-maxi-dress",
  "sku": "JC1135",
  "asin": "B08JPXKQKK",
  "title": "Womens Maxi Dress",
  "title_original": "BABEYOND Womens 1920s Flapper Dress Vintage Long Fringe Dress Roaring 20s Sequins Beaded Dress",
  "brand": "Visit the BABEYOND Store",
  "price": 69.99,
  "social_proof": {
    "bought_past_month": 144,
    "text": "144+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/8186oIqQw6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71-1xM3KXpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81dyMHYKyaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91tHQlTY1gL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/915NOXJyOaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91OlZWihfuL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/9137puRJPGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81OPkdH8hZL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/8186oIqQw6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71-1xM3KXpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81dyMHYKyaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91tHQlTY1gL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/915NOXJyOaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91OlZWihfuL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/9137puRJPGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81OPkdH8hZL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ May 17, 2024",
    "ASIN ‏": "‎ B0D4DZVF9P",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#81,088 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #2,578 in Women's Dresses",
    "Customer Reviews": "4.3 4.3 out of 5 stars (383)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Blacksilver",
      "Blackgold",
      "Rosegold"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.3,
    "count": 383,
    "customers_say": "Customers find the 1920s dress well-made with a stunning design, comfortable, and amazing for its price. They appreciate its perfect fit, with one noting the length is appropriate for the era. The dress receives mixed feedback about its size, with some finding it true to size while others say the small size is too big. While many find it flattering, one customer notes it's extremely unflattering on fairer-skinned women. The dress's fragility is a concern, with several customers describing it as extremely fragile. Generated from the text of customer reviews Select to learn more Quality (34) Beauty (32) Fit (32) Value for money (11) Comfort (10) Size (9) Flattering (5) Fragility (5) 34 customers mention quality, 33 positive, 1 negative 34 customers mention \"Quality\" 33 positive 1 negative Customers praise the dress's amazing quality and stunning design, noting it is well made. \" This dress was beautiful and well made ! The rose gold color was stunning. I loved the back of the dress with the deep V to show off the backside.... \" Read more \" Great dress and not a costume... \" Read more \" Fit, size, quality , stretchiness, comfort, zipper and color was such a great value. Loved it and felt great all evening. \" Read more \" Very pretty dress . Nice beadwork. But very small and short. Could barely get it over the upper half and when I did, it barely made it over my bum! \" Read more 32 customers mention beauty, 29 positive, 3 negative 32 customers mention \"Beauty\" 29 positive 3 negative Customers find the dress gorgeous, with one customer particularly impressed with its design quality, while another appreciates that it's not too pale. \" ...Probably the most beautiful dress I have ever owned when I bought it. \" Read more \" This dress was beautiful and well made! The rose gold color was stunning. I loved the back of the dress with the deep V to show off the backside.... \" Read more \" Just gorgeous ! Well made and I can not count the people that complimented me.... \" Read more \" Pretty but very small... \" Read more 32 customers mention fit, 24 positive, 8 negative 32 customers mention \"Fit\" 24 positive 8 negative Customers find that the dress fits nicely and is true to size, with one customer noting that the length is great for the era. \" I am so happy with this dress! It is beautiful, fits perfectly and it arrived a day early. \" Read more \" ...with the quality of the design, sequence and material, the fit of the dress .... \" Read more \" ...I returned this because it was a little too tight for my liking . But the fabric was amazing and well made for the price! \" Read more \" ...Lots of compliments. Dress fit perfect . \" Read more 11 customers mention value for money, 10 positive, 1 negative 11 customers mention \"Value for money\" 10 positive 1 negative Customers find the dress to be amazing for its price, with one mentioning that the color was a great value. \" ...Also, extremely comfortable, sequins do not come off and a great dress for the money ! \" Read more \" Great dress for the price ! \" Read more \" Item was perfect on sizing and material. The quality was great for the price . \" Read more \" ...But the fabric was amazing and well made for the price ! \" Read more 10 customers mention comfort, 10 positive, 0 negative 10 customers mention \"Comfort\" 10 positive 0 negative Customers find the dress extremely comfortable. \" ...It was loose in places such as my shoulders and waist, but comfortable . Had many compliments on my costume for a Gatsby party. \" Read more \" ...It was very comfortable and I got a lot of compliments For reference I am 5'4\" weigh 150 and wore a medium \" Read more \" ...Also, extremely comfortable , sequins do not come off and a great dress for the money! \" Read more \" Fit, size, quality, stretchiness, comfort , zipper and color was such a great value. Loved it and felt great all evening. \" Read more 9 customers mention size, 4 positive, 5 negative 9 customers mention \"Size\" 4 positive 5 negative Customers have mixed opinions about the dress size, with some finding it true to size while others report that the small size runs too big. \" Very pretty dress. Nice beadwork. But very small and short. Could barely get it over the upper half and when I did, it barely made it over my bum! \" Read more \" This dress was gorgeous. It fit me very well and according to the measurements . It was comfortable and looked great. \" Read more \" This dress is too large and I would like to exchange it for a smaller size, but there was no return label included with the delivery. \" Read more \" Fit, size , quality, stretchiness, comfort, zipper and color was such a great value. Loved it and felt great all evening. \" Read more 5 customers mention flattering, 3 positive, 2 negative 5 customers mention \"Flattering\" 3 positive 2 negative Customers have mixed opinions about the dress's appearance, with some finding it flattering, while one customer notes it is extremely unflattering on fairer skinned women. \" Comfortable, looks as advertised. So much fun and very flattering . I adore this dress! \" Read more \" Very pretty dress, but extremely fragile. I lost a lot of bangs , whereas my sister, who had a dress of the same brand, had no problems at all.... \" Read more \" This dress was beautiful!! It was comfortable and flattering . I loved wearing it and got so many compliments. \" Read more \" ...Also extremely unflattering on fairer skinned women . \" Read more 5 customers mention fragility, 1 positive, 4 negative 5 customers mention \"Fragility\" 1 positive 4 negative Customers report that the dress is extremely fragile, with one mentioning that it literally came apart and another noting that the shoulders kept slipping off. \" ...Two, the tassels on the bottom of mine are very fragile and come out easily, but as long as your careful not to step on them while putting the dress... \" Read more \" Gave it 4 stars instead of 5 because it came with a tear . Other than that, it was a beautiful dress. \" Read more \" ...The first dress literally came apart as we were heading out the driveway. I love the pattern and the low back. two things to note.... \" Read more \" Fantastic quality! Fit TO THE T... perfect. It held up beautifully all night , dancing and everything.... \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars 1920 Era Dress",
        "body": "I’m absolutely in love with this 1920s Great Gatsby-style dress! The design is stunning, capturing the glamour and elegance of the era perfectly. The quality is fantastic, with beautiful detailing and a flattering fit. It’s perfect for any vintage-inspired event or costume party. I felt like I stepped straight out of the Roaring Twenties! Highly recommend! Read more",
        "author": "Natty",
        "rating": 5.0,
        "date": "December 19, 2024",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Fantastic quality! Fit perfectly and received a lot of compliments. Happy I chose this one.",
        "body": "Fantastic quality! Fit TO THE T... perfect. It held up beautifully all night, dancing and everything. I did a lot of research and looking before I decided on this one. VERY happy I chose this one. Received many compliments and it was a little different than the other ladies outfits, so it stood out. I am ready to wear it again! Read more",
        "author": "Hannah",
        "rating": 5.0,
        "date": "September 12, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Overall great dress!",
        "body": "The color is beautiful and not too pale, and the dress itself is much higher quality than I expected. It feels less like a costume, and more like an actual dress which is nice. There are a couple of small issues though. One, the straps are just a tad too big so they have a tendency to fall down sometimes, but it’s not that bad. Two, the tassels on the bottom of mine are very fragile and come out easily, but as long as your careful not to step on them while putting the dress on it’s not a big deal. Overall the dress is beautiful and is perfect for any 1920s themed event that you could possibly go to!!! Read more",
        "author": "Christina Garlock",
        "rating": 5.0,
        "date": "January 28, 2024",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71bFneXCDWL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "4.0 out of 5 stars Great price for a themed wedding",
        "body": "this was my back up dress for a 1920s themed wedding. The first dress literally came apart as we were heading out the driveway. I love the pattern and the low back. two things to note. The shoulders kept slipping off and the back is low so a normal bra will not work. It was very comfortable and I got a lot of compliments For reference I am 5'4\" weigh 150 and wore a medium Read more",
        "author": "Julie Des Lauriers",
        "rating": 4.0,
        "date": "November 6, 2023",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars I usually wear a 2x got one size up and it worked.",
        "body": "Love it! Love it! Beautiful dress! Fits perfectly. Read more",
        "author": "Linda S.",
        "rating": 5.0,
        "date": "June 12, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Pretty but very small",
        "body": "Very pretty dress. Nice beadwork. But very small and short. Could barely get it over the upper half and when I did, it barely made it over my bum! Read more",
        "author": "Donna",
        "rating": 3.0,
        "date": "May 30, 2023",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars The price",
        "body": "I love the dress! Read more",
        "author": "Olga B.",
        "rating": 5.0,
        "date": "September 4, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "1.0 out of 5 stars Look elsewhere",
        "body": "So cheap in person, don’t even bother wasting your money. The price is way too expensive for the terrible quality it is. Also extremely unflattering on fairer skinned women. Read more",
        "author": "ynelem",
        "rating": 1.0,
        "date": "October 29, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.",
  "about_this_item": "Womens Maxi Dress is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.",
  "long_description": "Womens Maxi Dress is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Blacksilver, Blackgold, Rosegold. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Blacksilver, Blackgold, Rosegold. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "1d50f384-1887-4e72-bf04-f9051b3f4c2f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1d50f384-1887-4e72-bf04-f9051b3f4c2f/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1d50f384-1887-4e72-bf04-f9051b3f4c2f/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "247c9a69-18f6-489d-ad52-63287d05abdd",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/247c9a69-18f6-489d-ad52-63287d05abdd/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/247c9a69-18f6-489d-ad52-63287d05abdd/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Blacksilver": "https://m.media-amazon.com/images/I/51weDsjE6WL._AC_SR38,50_.jpg",
    "Blackgold": "https://m.media-amazon.com/images/I/41xC17xr1bL._AC_SR38,50_.jpg",
    "Rosegold": "https://m.media-amazon.com/images/I/41eimys91hL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Blacksilver": "9137puRJPGL",
    "Blackgold": "8186oIqQw6L",
    "Rosegold": "81OPkdH8hZL"
  },
  "color_images": {
    "Blacksilver": [
      "https://m.media-amazon.com/images/I/9137puRJPGL._SL1500_.jpg"
    ],
    "Blackgold": [
      "https://m.media-amazon.com/images/I/8186oIqQw6L._SL1500_.jpg"
    ],
    "Rosegold": [
      "https://m.media-amazon.com/images/I/81OPkdH8hZL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-bodycon-long-sleeve",
      "title": "Womens Maxi Dress Bodycon Long Sleeve",
      "price": 41.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/81B0EWBbxbL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 295.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51tOCtnN9ML._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-formal-cocktail-evening",
      "title": "Womens Dress Formal Cocktail Evening",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71ctK4kwdWL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-mermaid-short-sleeve-formal",
      "title": "Womens Maxi Dress Mermaid Short Sleeve Formal",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61ODaWZ8uJL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 95.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/41vU0V-3D0L._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-maxi",
      "title": "Womens Maxi Dress Maxi",
      "price": 59.9,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61-GMo0HHjL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-sleeveless-off-shoulder",
      "title": "Womens Maxi Dress Sleeveless Off Shoulder",
      "price": 42.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51oz3E7J01L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-long-sleeve-cocktail",
      "title": "Womens Maxi Dress Bodycon Long Sleeve Cocktail",
      "price": 37.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71d0VKSCOzL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-sleeveless-v-neck-mermaid",
      "title": "Womens Maxi Dress Sleeveless V Neck Mermaid",
      "price": 98.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/619RXI5CEML._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-long-sleeve-maxi",
      "title": "Womens Maxi Dress Cocktail Long Sleeve Maxi",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/615VfveT48L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 126.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/714Cs9MTO9L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-maxi-v-neck",
      "title": "Womens Maxi Dress Long Sleeve Maxi V Neck",
      "price": 53.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/713UUM+RilL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 47.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71uTg9+55yL._SL1500_.jpg"
      ]
    }
  ]
}