{
  "id": "womens-maxi-dress-maxi",
  "handle": "womens-maxi-dress-maxi",
  "sku": "JC2184",
  "asin": "B08T7J9RHJ",
  "title": "Womens Maxi Dress Maxi",
  "title_original": "Oussum Women Polyester Casual Kaftan Long Plus Size Summer Beach Caftan Cover Ups Maxi Dresse for Ladies Boho Lounge Outfit",
  "brand": "Visit the Oussum Store",
  "price": 14.99,
  "social_proof": {
    "bought_past_month": 436,
    "text": "436+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/71h2F7y90hL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/613O8Uv75-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/715gqsL-lbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71aHPkWSbmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71nzqupd5XL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71lQ9YhzdEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81UjtOHqfZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81eTlfPaoxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81J1VsE9XKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81eeLMC8ayL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81rgCMr0EqS._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/611iAvt8ywS._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61f-D8BSBwS._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81hRimq-MiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81yyoO4f8zL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Ay7v9ky+S._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81g4WJZEQvL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61hf1EPxYRS._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81s0U9cM-SS._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/611-t08JHAS._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71fhpmpN38S._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91hGzgEWsvL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91a5nHunyeL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81X-osJioZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/7131pjVA3wL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81uWvBCo5kL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91EYdRVNvgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/812OK3W8koS._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81bb3QYIf9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/6120+Rc4zcS._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81cwsIg0rXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91p8enekR6L._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/71h2F7y90hL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/613O8Uv75-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/715gqsL-lbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71aHPkWSbmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71nzqupd5XL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71lQ9YhzdEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81UjtOHqfZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81eTlfPaoxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81J1VsE9XKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81eeLMC8ayL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81rgCMr0EqS._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/611iAvt8ywS._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61f-D8BSBwS._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81hRimq-MiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81yyoO4f8zL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Ay7v9ky+S._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81g4WJZEQvL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61hf1EPxYRS._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81s0U9cM-SS._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/611-t08JHAS._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71fhpmpN38S._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91hGzgEWsvL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91a5nHunyeL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81X-osJioZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/7131pjVA3wL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81uWvBCo5kL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91EYdRVNvgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/812OK3W8koS._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81bb3QYIf9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/6120+Rc4zcS._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81cwsIg0rXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91p8enekR6L._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Product Dimensions ‏": "‎ 52 x 36 x 0.5 inches; 5.82 ounces",
    "Item model number ‏": "‎ LKG-003",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ June 7, 2024",
    "Manufacturer ‏": "‎ Oussum",
    "ASIN ‏": "‎ B0D6GQ4VC4",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#52,303 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #684 in Women's Casual Dresses",
    "Customer Reviews": "4.5 4.5 out of 5 stars (1,592)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Cream Geometric Print Caftan",
      "Pink Floral",
      "Black Floral",
      "Red Paisley",
      "Red Animal",
      "Multicolor One Size Maxi Caftan",
      "Black",
      "White Floral",
      "Black Flower",
      "Multi-color",
      "Multicolor Floral",
      "Golden Yellow",
      "Black & Rust",
      "Blue",
      "Navy Blue",
      "Red",
      "White Tropical Leaf",
      "Bright Blue",
      "White Geometric",
      "Navy Blue Floral",
      "Multicolor Paisley Pattern",
      "Purple Paisley",
      "Orange Paisley",
      "Purple",
      "Multicolor Lady Printed Caftan",
      "Black Paisley",
      "White Floral & Paisley"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.5,
    "count": 1592,
    "customers_say": "Customers find this kaftan comfortable in the heat and appreciate its generous fit with room to spare. The garment features vibrant colors and a lightweight fabric that provides modesty without bulk, making it perfect for lounging around the house. They like its design, with one customer noting it's not frumpy, and consider it a great quality piece. Generated from the text of customer reviews Select to learn more Comfort (67) Design (61) Fit (52) Quality (51) Color quality (39) Fabric weight (27) Wearability (25) Fabric quality (19) 67 customers mention comfort, 65 positive, 2 negative 67 customers mention \"Comfort\" 65 positive 2 negative Customers find the kaftan comfortable, particularly in hot weather. \" Very soft and comfortable . It is lightweight but with my winter robe it is just right. I received my first on and immediately ordered a second. \" Read more \" ...coming undone on the left bottom opening so not great quality but very comfortable . \" Read more \" I received this caftan as a Christmas gift. So comfortable & washes beautifully. Love it so much, I just ordered 2 more in different prints!... \" Read more \" ...Standing and sitting is slightly fitted, but comfy . Nice little Mumu for the upcoming summer! \" Read more 61 customers mention design, 60 positive, 1 negative 61 customers mention \"Design\" 60 positive 1 negative Customers like the design of the kaftan, finding it pretty and appreciating its pattern, with one customer noting it's not frumpy. \" ...Do get me wrong this is beautiful and there’s a good chance I’ll keep it. Also I’m a tall girl. The last time I checked it’s 5’9 and I am 260+.... \" Read more \" The colors are so vibrant and pretty . I am a moo moo type of girl. After working all day, feeling free from the clothes and the heels is everything! \" Read more \" Very pretty , exactly as the picture presents. They were a gift for a niece and she was very happy with them. \" Read more \" Comfortable and cute , feeling like a African Goddess \" Read more 52 customers mention fit, 45 positive, 7 negative 52 customers mention \"Fit\" 45 positive 7 negative Customers appreciate the kaftan's generous fit, noting it has room to spare and is not too long, with one customer mentioning it comes slightly above the ankles. \" ...I could live in it because it is so comfortable. It fits well and the design in captivating. \" Read more \" ...Not this time! I got XL and it’s perfect fit . The colors are prettier than the picture. And the material is light but not see-through.... \" Read more \" ...Anyways the prints are beautiful and as pictured. One size fits all .The fabric is light and it is very roomy .It's a little longer than I'd like... \" Read more \" ...I'm 5'6, 250lbs, and it fits great , with plenty of room for movement. The sides are closed, I was afraid they were going to be open.... \" Read more 51 customers mention quality, 44 positive, 7 negative 51 customers mention \"Quality\" 44 positive 7 negative Customers find the kaftan to be of great quality, with one customer noting it's nicer than yoga pants. \" I love this. It nice and silky feeling. It can be worn for any occasion from pj's to formal. I love the bright colors. It washes up well too. \" Read more \" ...I just bought 3 more! They’re cool , comfortable, lightweight, swishy, colorful, feminine, dry quickly and take up very little closet space -... \" Read more \" Perfect kaftan, good quality and most importantly comfy carefree lounging. \" Read more \" I love the colors and the lightness of the fabric. It is well made and extremely comfortable! \" Read more 39 customers mention color quality, 36 positive, 3 negative 39 customers mention \"Color quality\" 36 positive 3 negative Customers like the vibrant colors of the kaftan. \" Beautiful colors and comfortable. I'm 165 cm and the length looks right for me. Will buy more. The delivery was very fast as well. \" Read more \" I love the colors and the lightness of the fabric. It is well made and extremely comfortable! \" Read more \" ...It can be worn for any occasion from pj's to formal. I love the bright colors . It washes up well too. \" Read more \" I really like this caftan it looks just like the picture. The colors are beautiful . \" Read more 27 customers mention fabric weight, 26 positive, 1 negative 27 customers mention \"Fabric weight\" 26 positive 1 negative Customers appreciate the kaftan's lightweight fabric, noting that it provides modesty without adding bulk. \" Very soft and comfortable. It is lightweight but with my winter robe it is just right. I received my first on and immediately ordered a second. \" Read more \" The fabric is nice and light , but it snags easily. They also can shrink a little after the first wash. Keeps me nice and cool on the hotter days.... \" Read more \" ...The colors are prettier than the picture. And the material is light but not see-through. This was definitely a great buy. Good price. Good value. \" Read more \" Very lightweight . Helps me stay cool during the night. \" Read more 25 customers mention wearability, 22 positive, 3 negative 25 customers mention \"Wearability\" 22 positive 3 negative Customers find the kaftan perfect for lounging around the house, with one mentioning it works well as a swim cover-up for travel. \" Good quality. Great coverup. Perfect for lounging . \" Read more \" Very comfortable and perfect for wearing around the house in the summer.... \" Read more \" Design worked for purpose and now wear around the house , very loose and comfortable. \" Read more \" This was so comfortable and perfect house dress ! \" Read more 19 customers mention fabric quality, 15 positive, 4 negative 19 customers mention \"Fabric quality\" 15 positive 4 negative Customers like the fabric of the kaftan, describing it as nice and comfortable. \" Love the fabric . Very soft and flowing. It is very well made. The pattern actually matches up better than any other I have purchased for my mother.... \" Read more \" The fabric is nice and light, but it snags easily. They also can shrink a little after the first wash. Keeps me nice and cool on the hotter days.... \" Read more \" Very nice fabric with vibrant colors and cool & comfortable for around the town. \" Read more \" Thread loose all over, very thin and cheap material , l owed 15 caftan and this is the first l bought thru Amazon, and my last..... \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Softer than a pricier option",
        "body": "Bought two of these along with one from Miss Lavish London, which are pricier. I actually like these better, as the fabric has a softer hand. I just bought 3 more! They’re cool, comfortable, lightweight, swishy, colorful, feminine, dry quickly and take up very little closet space - perfect for puttering around the house/work from home. Not embarrassed to answer the door in them. Never thought I’d be a caftan wearer (calls to mind Mrs. Roper and my extremely heavy aunt) - but I’m a convert! They’re pretty enough and opaque enough that you could wear them in public. Much nicer imo than yoga pants, and that’s been my go-to casual wear over sweats. Based on other reviews, I was concerned about puckered stitching at the neckline and popping seams with normal use, but I’ve lolled in a hammock and sat in bed with them on with no issues. Being 5’4” and 165 lbs, I was concerned the hem might drag on the ground or be so enormous the sleeves would catch handles and drape into the dishwater while washing up. The hem just brushes the tops of my feet and sleeves aren’t in the way while doing light housework. Highly recommend! Read more",
        "author": "D. Eccles",
        "rating": 5.0,
        "date": "July 16, 2023",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars comfortable and pretty",
        "body": "I haven't washed this yet and it does say to launder it alone, due to the dyeying process. That said, the garment is attractive and comfortable. I wear this around the house when it's hot because it's loose. Another option is that this will make a good travel robe. Thin, easy to pack and perfect cover up to go to the pool, lounge in hotel room, etc. Read more",
        "author": "NG",
        "rating": 5.0,
        "date": "July 2, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Very lovely.",
        "body": "This is a lovely garment. Have worn it outside walking the dog. Received many compliments. Will be excellent for the summer days and warm nights. Also fab in the house as well. Generous fit and comfortable. Excellent buy!! Read more",
        "author": "Della Mac",
        "rating": 5.0,
        "date": "March 26, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars comfortable can be dressed up or down",
        "body": "beautiful n comfy♥️ Read more",
        "author": "carole",
        "rating": 4.0,
        "date": "October 8, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Regal Comfort: The Perfect Lounge Wear for Queens!",
        "body": "Great quality Kaftan! I bought two for my mother, and she looks like a queen in them. They are perfect for lounging around while writing, cozy on a cold day, and they look fantastic. The length is ideal for a tall woman, and with the design, I think most of the colors will look wonderful. I definitely plan to buy more in the future Read more",
        "author": "Mrbillium",
        "rating": 5.0,
        "date": "April 14, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Pretty but Rips easy.",
        "body": "Pretty design, lots of compliments by ladies, BUT be warned… it rips easy… I have only worn it 1 time, bought for a Friend’s destination event that called for “Kaftan dress attire” the leg area seam opening & the fabric ripped all the way up to my thighs first time on the tour bus, good thing I wore black capri leggings underneath! Fun event, good thing I was with my close friends or it could have been embarrassing LOL Read more",
        "author": "Alex Morales",
        "rating": 3.0,
        "date": "December 9, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Perfection!!!",
        "body": "I love this. I purchased three more, different styles. I don't wear them as they are styled, I wear them around the house for comfort, to the bus stop etc . . . I always get lots of praise from anyone who sees me. I highly recommend this product and I will be ordering more. Read more",
        "author": "Sunshine smiles",
        "rating": 5.0,
        "date": "December 9, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Perfect For Comfort!",
        "body": "I am an elderly woman and this is my first year wearing kaftans. I love the comfort they bring. They are cool and I feel great wearing them. Gypsy Blue, is one of my favorite brands, the fit perfectly. I will buy more for sure. ♥️ Read more",
        "author": "grandma",
        "rating": 5.0,
        "date": "August 6, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Maxi is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.",
  "about_this_item": "Womens Maxi Dress Maxi is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.",
  "long_description": "Womens Maxi Dress Maxi is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Cream Geometric Print Caftan, Pink Floral, Black Floral, Red Paisley, Red Animal, Multicolor One Size Maxi Caftan, Black, White Floral, Black Flower, Multi-color, Multicolor Floral, Golden Yellow, Black & Rust, Blue. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Maxi is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Cream Geometric Print Caftan, Pink Floral, Black Floral, Red Paisley, Red Animal, Multicolor One Size Maxi Caftan, Black, White Floral, Black Flower, Multi-color, Multicolor Floral, Golden Yellow, Black & Rust, Blue. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "f2c4e305-eb06-4e13-af3a-e9364a21972f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f2c4e305-eb06-4e13-af3a-e9364a21972f/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f2c4e305-eb06-4e13-af3a-e9364a21972f/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/5b9b9504-580a-4372-8ed8-38c38209de99.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "e0ef341f-a5d6-471d-8eb3-cca91817c421",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e0ef341f-a5d6-471d-8eb3-cca91817c421/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e0ef341f-a5d6-471d-8eb3-cca91817c421/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/5b9b9504-580a-4372-8ed8-38c38209de99.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Cream Geometric Print Caftan": "https://m.media-amazon.com/images/I/412MDqhYR2L._AC_SR38,50_.jpg",
    "Pink Floral": "https://m.media-amazon.com/images/I/41IE0UaiouL._AC_SR38,50_.jpg",
    "Black Floral": "https://m.media-amazon.com/images/I/41KZ+JrUhrL._AC_SR38,50_.jpg",
    "Red Paisley": "https://m.media-amazon.com/images/I/41LV-mWP2sL._AC_SR38,50_.jpg",
    "Red Animal": "https://m.media-amazon.com/images/I/41Gxzd9ginS._AC_SR38,50_.jpg",
    "Multicolor One Size Maxi Caftan": "https://m.media-amazon.com/images/I/41krDw5RD9S._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/319bPEprcLS._AC_SR38,50_.jpg",
    "White Floral": "https://m.media-amazon.com/images/I/41qoFMeJXML._AC_SR38,50_.jpg",
    "Black Flower": "https://m.media-amazon.com/images/I/41cL+inBaiL._AC_SR38,50_.jpg",
    "Multi-color": "https://m.media-amazon.com/images/I/41+bBbNFK6S._AC_SR38,50_.jpg",
    "Multicolor Floral": "https://m.media-amazon.com/images/I/41DgpzdmerL._AC_SR38,50_.jpg",
    "Golden Yellow": "https://m.media-amazon.com/images/I/417YUwcZSPS._AC_SR38,50_.jpg",
    "Black & Rust": "https://m.media-amazon.com/images/I/51i-4YgWLNS._AC_SR38,50_.jpg",
    "Blue": "https://m.media-amazon.com/images/I/41LaXC-gnAS._AC_SR38,50_.jpg",
    "Navy Blue": "https://m.media-amazon.com/images/I/414CREjuTTS._AC_SR38,50_.jpg",
    "Red": "https://m.media-amazon.com/images/I/51Hhkvx7QLL._AC_SR38,50_.jpg",
    "White Tropical Leaf": "https://m.media-amazon.com/images/I/51204V-8HGL._AC_SR38,50_.jpg",
    "Bright Blue": "https://m.media-amazon.com/images/I/419EHVyeHGL._AC_SR38,50_.jpg",
    "White Geometric": "https://m.media-amazon.com/images/I/41f73LKXMNL._AC_SR38,50_.jpg",
    "Navy Blue Floral": "https://m.media-amazon.com/images/I/41oufjBzqZL._AC_SR38,50_.jpg",
    "Multicolor Paisley Pattern": "https://m.media-amazon.com/images/I/41nw0ywZQcL._AC_SR38,50_.jpg",
    "Purple Paisley": "https://m.media-amazon.com/images/I/41LoFRptdBS._AC_SR38,50_.jpg",
    "Orange Paisley": "https://m.media-amazon.com/images/I/41bI2HKzPbL._AC_SR38,50_.jpg",
    "Purple": "https://m.media-amazon.com/images/I/41ptVgGSUMS._AC_SR38,50_.jpg",
    "Multicolor Lady Printed Caftan": "https://m.media-amazon.com/images/I/41KN1MI+CWL._AC_SR38,50_.jpg",
    "Black Paisley": "https://m.media-amazon.com/images/I/41eEhqupMtL._AC_SR38,50_.jpg",
    "White Floral & Paisley": "https://m.media-amazon.com/images/I/51g0zYQgw3L._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Cream Geometric Print Caftan": "81UjtOHqfZL",
    "Pink Floral": "81eTlfPaoxL",
    "Black Floral": "81J1VsE9XKL",
    "Red Paisley": "81eeLMC8ayL",
    "Red Animal": "81rgCMr0EqS",
    "Multicolor One Size Maxi Caftan": "611iAvt8ywS",
    "Black": "61f-D8BSBwS",
    "White Floral": "81hRimq-MiL",
    "Black Flower": "81yyoO4f8zL",
    "Multi-color": "71Ay7v9ky+S",
    "Multicolor Floral": "81g4WJZEQvL",
    "Golden Yellow": "61hf1EPxYRS",
    "Black & Rust": "81s0U9cM-SS",
    "Blue": "611-t08JHAS",
    "Navy Blue": "71fhpmpN38S",
    "Red": "91hGzgEWsvL",
    "White Tropical Leaf": "91a5nHunyeL",
    "Bright Blue": "81X-osJioZL",
    "White Geometric": "7131pjVA3wL",
    "Navy Blue Floral": "81uWvBCo5kL",
    "Multicolor Paisley Pattern": "91EYdRVNvgL",
    "Purple Paisley": "812OK3W8koS",
    "Orange Paisley": "81bb3QYIf9L",
    "Purple": "6120+Rc4zcS",
    "Multicolor Lady Printed Caftan": "71h2F7y90hL",
    "Black Paisley": "81cwsIg0rXL",
    "White Floral & Paisley": "91p8enekR6L"
  },
  "color_images": {
    "Cream Geometric Print Caftan": [
      "https://m.media-amazon.com/images/I/81UjtOHqfZL._SL1500_.jpg"
    ],
    "Pink Floral": [
      "https://m.media-amazon.com/images/I/81eTlfPaoxL._SL1500_.jpg"
    ],
    "Black Floral": [
      "https://m.media-amazon.com/images/I/81J1VsE9XKL._SL1500_.jpg"
    ],
    "Red Paisley": [
      "https://m.media-amazon.com/images/I/81eeLMC8ayL._SL1500_.jpg"
    ],
    "Red Animal": [
      "https://m.media-amazon.com/images/I/81rgCMr0EqS._SL1500_.jpg"
    ],
    "Multicolor One Size Maxi Caftan": [
      "https://m.media-amazon.com/images/I/611iAvt8ywS._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/61f-D8BSBwS._SL1500_.jpg"
    ],
    "White Floral": [
      "https://m.media-amazon.com/images/I/81hRimq-MiL._SL1500_.jpg"
    ],
    "Black Flower": [
      "https://m.media-amazon.com/images/I/81yyoO4f8zL._SL1500_.jpg"
    ],
    "Multi-color": [
      "https://m.media-amazon.com/images/I/71Ay7v9ky+S._SL1500_.jpg"
    ],
    "Multicolor Floral": [
      "https://m.media-amazon.com/images/I/81g4WJZEQvL._SL1500_.jpg"
    ],
    "Golden Yellow": [
      "https://m.media-amazon.com/images/I/61hf1EPxYRS._SL1500_.jpg"
    ],
    "Black & Rust": [
      "https://m.media-amazon.com/images/I/81s0U9cM-SS._SL1500_.jpg"
    ],
    "Blue": [
      "https://m.media-amazon.com/images/I/611-t08JHAS._SL1500_.jpg"
    ],
    "Navy Blue": [
      "https://m.media-amazon.com/images/I/71fhpmpN38S._SL1500_.jpg"
    ],
    "Red": [
      "https://m.media-amazon.com/images/I/91hGzgEWsvL._SL1500_.jpg"
    ],
    "White Tropical Leaf": [
      "https://m.media-amazon.com/images/I/91a5nHunyeL._SL1500_.jpg"
    ],
    "Bright Blue": [
      "https://m.media-amazon.com/images/I/81X-osJioZL._SL1500_.jpg"
    ],
    "White Geometric": [
      "https://m.media-amazon.com/images/I/7131pjVA3wL._SL1500_.jpg"
    ],
    "Navy Blue Floral": [
      "https://m.media-amazon.com/images/I/81uWvBCo5kL._SL1500_.jpg"
    ],
    "Multicolor Paisley Pattern": [
      "https://m.media-amazon.com/images/I/91EYdRVNvgL._SL1500_.jpg"
    ],
    "Purple Paisley": [
      "https://m.media-amazon.com/images/I/812OK3W8koS._SL1500_.jpg"
    ],
    "Orange Paisley": [
      "https://m.media-amazon.com/images/I/81bb3QYIf9L._SL1500_.jpg"
    ],
    "Purple": [
      "https://m.media-amazon.com/images/I/6120+Rc4zcS._SL1500_.jpg"
    ],
    "Multicolor Lady Printed Caftan": [
      "https://m.media-amazon.com/images/I/71h2F7y90hL._SL1500_.jpg"
    ],
    "Black Paisley": [
      "https://m.media-amazon.com/images/I/81cwsIg0rXL._SL1500_.jpg"
    ],
    "White Floral & Paisley": [
      "https://m.media-amazon.com/images/I/91p8enekR6L._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-bodycon-long-sleeve-ruched",
      "title": "Womens Maxi Dress Bodycon Long Sleeve Ruched",
      "price": 38.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/718YKBFbs3L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-off-shoulder-mermaid-evening",
      "title": "Womens Maxi Dress Formal Off Shoulder Mermaid Evening",
      "price": 86.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71C+AFY6HAL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-formal",
      "title": "Womens Maxi Dress Evening Formal",
      "price": 69.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71amdzuBfbL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-bodycon-sleeveless",
      "title": "Womens Dress Bodycon Sleeveless",
      "price": 29.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51UthcjfRfL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 38.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71l8OE0DiEL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress-sleeveless",
      "title": "Womens Dress Sleeveless",
      "price": 41.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71QMCW+8CcL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-ruched-v-neck-cocktail-bodycon",
      "title": "Womens Dress Ruched V Neck Cocktail Bodycon",
      "price": 45.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/51TCVhb-WzL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 298.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71Jq8YdpWeL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-split",
      "title": "Womens Dress Split",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61PPeTKsusL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-maxi-cocktail",
      "title": "Womens Maxi Dress Long Sleeve Maxi Cocktail",
      "price": 62.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71u2Xray0mL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-long-sleeve-ruched-cocktail-bodycon-formal",
      "title": "Womens Maxi Dress Maxi Long Sleeve Ruched Cocktail Bodycon Formal",
      "price": 28.3,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/81e1pG2+yqL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening-long-sleeve",
      "title": "Womens Maxi Dress Formal Evening Long Sleeve",
      "price": 75.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61e8WX2EcaL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-v-neck",
      "title": "Womens Dress V Neck",
      "price": 69.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/81MCqkA-7cL._SL1500_.jpg"
      ]
    }
  ]
}