{
  "id": "womens-maxi-dress-long-sleeve",
  "handle": "womens-maxi-dress-long-sleeve",
  "sku": "JC3119",
  "asin": "B08XN66GYW",
  "title": "Womens Maxi Dress Long Sleeve",
  "title_original": "Xscape Women's Long Sleeve V-Neck Floral Skirted Gown",
  "brand": "Visit the Xscape Store",
  "price": 279.0,
  "social_proof": {
    "bought_past_month": 82,
    "text": "82+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/51OU0vlXStL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71AZrUw4FEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71e5JJ+h6EL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71y23xIHk8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/615ta3AYSIL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/51OU0vlXStL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71AZrUw4FEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71e5JJ+h6EL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71y23xIHk8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/615ta3AYSIL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Item model number ‏": "‎ 3279X",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ May 1, 2025",
    "Manufacturer ‏": "‎ Xscape",
    "ASIN ‏": "‎ B0F76TV7GN",
    "Best Sellers Rank": "#337,633 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #2,056 in Women's Formal Dresses",
    "Customer Reviews": "4.2 4.2 out of 5 stars (92)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Black"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.2,
    "count": 92,
    "customers_say": "Customers find the dress beautiful and well-made, with a flattering fit and comfortable feel. The material is soft on the arms and has a lightweight fabric, and one customer mentions it's perfect for formal occasions like black tie weddings. The size receives mixed feedback, with some finding the petite length perfect while others say it runs small. The slit receives criticism for being too high, and one customer notes the bottom of the dress is see-through. Generated from the text of customer reviews Select to learn more Beauty (26) Fit (16) Comfort (13) Quality (9) Material softness (4) Fabric weight (3) Size (12) Slit (8) 26 customers mention beauty, 26 positive, 0 negative 26 customers mention \"Beauty\" 26 positive 0 negative Customers find the dress beautiful, with one mentioning it's perfect for a black tie wedding. \" Beautiful dress . 5'5\" 160lbs. Pear Shape. Generally in-between a 12-14 depending on the dress.... \" Read more \" It’s a beautiful and very comfortable dress. I was surprised by how lightweight the fabric and dress is overall.... \" Read more \" Excellent. A very beautiful dress for a formal event. \" Read more \" Pretty dress but too long for the shoes I have. I returned and wore one of the other dresses I bought. \" Read more 16 customers mention fit, 13 positive, 3 negative 16 customers mention \"Fit\" 13 positive 3 negative Customers find the dress has a flattering fit. \" This was a very beautiful dress, form fitting on top with a flowing 3 D flower skirt, very nice quality material however the slit in the skirt was... \" Read more \" This dress. One of my favorites. It fits pretty true to size . I have a smaller chest, so just to be safe, I taped the chest part down.... \" Read more \" ...Pear Shape. Generally in-between a 12-14 depending on the dress. Gorgeous fit , comfortable, soft (fully lined) I have a short torso so would have... \" Read more \" Really flattering fit . I wore it to a wedding and got so many compliments \" Read more 13 customers mention comfort, 13 positive, 0 negative 13 customers mention \"Comfort\" 13 positive 0 negative Customers find the dress comfortable. \" ...Generally in-between a 12-14 depending on the dress. Gorgeous fit, comfortable , soft (fully lined) I have a short torso so would have needed... \" Read more \" It’s a beautiful and very comfortable dress . I was surprised by how lightweight the fabric and dress is overall.... \" Read more \" BEAUTIFUL dress! I was in love with this dress! So comfortable & received so many compliments! \" Read more \" ...A bit long, but my heels made it work. Super comfortable , very flowy when walking. Has built in bra pads.... \" Read more 9 customers mention quality, 9 positive, 0 negative 9 customers mention \"Quality\" 9 positive 0 negative Customers find the dress beautifully made and excellent in quality. \" Perfect dress !... \" Read more \" A beautiful, well made dress ! Very comfortable and nice fit! So glad it came in a petite size! \" Read more \" This dress is so pretty yet simple and ultra comfortable. Great quality and I got so many compliments on it! \" Read more \" ...I have curves but this was giving choir dress. Beautifully made , just didn’t fit right. \" Read more 4 customers mention material softness, 4 positive, 0 negative 4 customers mention \"Material softness\" 4 positive 0 negative Customers appreciate the dress's soft material, particularly noting how it feels comfortable on the arms. \" I like it. It feels great on . It’s not too heavy \" Read more \" ...Gorgeous fit, comfortable, soft (fully lined) I have a short torso so would have needed larger bust or a smaller size dress to make this work.... \" Read more \" Loved the way it looked, moved and felt , danced all night long, can’t wait to wear it again one day.... \" Read more \" Fits amazing, material is so soft on the arms and comfy all over. So flattering, I got so many compliments!... \" Read more 3 customers mention fabric weight, 3 positive, 0 negative 3 customers mention \"Fabric weight\" 3 positive 0 negative Customers like the fabric weight of the dress, describing it as lightweight, with one customer noting it has the perfect amount of heft. \" ...I was surprised by how lightweight the fabric and dress is overall.... \" Read more \" I like it. It feels great on. It’s not too heavy \" Read more \" ...Not too tight it the waist. Lots of stretch up top. Material is the perfect amount of heavy and light combined. \" Read more 12 customers mention size, 8 positive, 4 negative 12 customers mention \"Size\" 8 positive 4 negative Customers have mixed opinions about the dress's size, with some finding it perfect, particularly noting the petite length, while others report it runs small. \" ...Overall though, a great fit and true to size . Form fitting but a little stretchy.... \" Read more \" ... Top is a little big , but could also be pinned if needed. \" Read more \" ...I’m 5’4” petite & length was also perfect . \" Read more \" ...I especially love that the petite length was perfect and no hemming needed. There is a little stretch on the top for some give but not too much.... \" Read more 8 customers mention slit, 0 positive, 8 negative 8 customers mention \"Slit\" 0 positive 8 negative Customers have mixed opinions about the dress's slit, with some finding it too high, while one customer notes that the bottom is see-through. \" ...Wasn’t sure if I’d love the 3D flowers, but I do! The slit is very high and I was wearing it for a performance, so I just safety pinned it closed a... \" Read more \" ...The slit was a little high for me but that was an easy fix, it was comfortable and the sleeves, worth the $ right there!... \" Read more \" The whole bottom of the dress is see through and it also ran very small. \" Read more \" ...it is made well. I made one small adjustment bc I felt the slit was a tad too high .... \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Beautiful, more lightweight than expected",
        "body": "It’s a beautiful and very comfortable dress. I was surprised by how lightweight the fabric and dress is overall. I was actually looking for something a little more heavy for winter, but this would be really versatile for multiple seasons. It makes more of a statement than other formal dresses, but while remaining classy. I wasn’t a huge fan of the built in bra - the pads seem a little thick and stand out more than I’d like. Overall though, a great fit and true to size. Form fitting but a little stretchy. I’m 5’1 and with 2-inch heels (in the photos) the petite size was skimming the floor. Read more",
        "author": "Mae McCaffrey",
        "rating": 5.0,
        "date": "December 5, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/711hz0Hi42L._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71UKaJGGsWL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71kJVoplPML._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Beautiful dress -",
        "body": "Beautiful dress. 5'5\" 160lbs. Pear Shape. Generally in-between a 12-14 depending on the dress. Gorgeous fit, comfortable, soft (fully lined) I have a short torso so would have needed larger bust or a smaller size dress to make this work. Could have altered the top shoulder and torso fairly easily or tried for a smaller size but no time so will be returning and going with my other choice for this event. Read more",
        "author": "Lisa Marney",
        "rating": 5.0,
        "date": "December 7, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars The Perfect formal",
        "body": "This dress is gorgeous. I had so many compliments on the cruise! I'm 5,4 148 and it fit beautifully. A bit long, but my heels made it work. Super comfortable, very flowy when walking. Has built in bra pads. I used some bra tape to keep myself in place with the low cut. The dress traveled nicely in a folded garment bag and did not wrinkle. Read more",
        "author": "V",
        "rating": 5.0,
        "date": "May 17, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Stunning Gown",
        "body": "this gown is stunning! it fit perfect true to size. it is made well. I made one small adjustment bc I felt the slit was a tad too high. I don’t sew anything but buttons back on but it was super easy to just sew the slit about an inch down the seam to make it slightly more modest. I received so many compliments! I just hope I have an occasion to wear it again! Read more",
        "author": "LeaF3",
        "rating": 5.0,
        "date": "July 21, 2024",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71fgCj1afhL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "1.0 out of 5 stars See through and small",
        "body": "The whole bottom of the dress is see through and it also ran very small. Read more",
        "author": "Elle",
        "rating": 1.0,
        "date": "December 8, 2024",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Pretty",
        "body": "Pretty dress but too long for the shoes I have. I returned and wore one of the other dresses I bought. Read more",
        "author": "Melanie Brumfield",
        "rating": 3.0,
        "date": "June 25, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Elegant",
        "body": "Love it! It was comfortable and elegant at a black tie event I attended. Many, many compliments. The dress was a little low cut for me so I had my seamstress add a little piece across the bust. I just felt more comfortable with that addition. I added a gold belt to embellish the dress. True to size Read more",
        "author": "Jill P.",
        "rating": 5.0,
        "date": "June 28, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "2.0 out of 5 stars Pretty dress, odd fit",
        "body": "I wanted to love this dress but I’d did nothing at all in the form of flattering my figure. I have curves but this was giving choir dress. Beautifully made, just didn’t fit right. Read more",
        "author": "Rene",
        "rating": 2.0,
        "date": "November 23, 2024",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.",
  "about_this_item": "Womens Maxi Dress Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.",
  "long_description": "Womens Maxi Dress Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Black. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Black. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "3e35a115-c377-4ea4-bf1f-7ef9a73c8400",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3e35a115-c377-4ea4-bf1f-7ef9a73c8400/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3e35a115-c377-4ea4-bf1f-7ef9a73c8400/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "7ff9f700-53f5-4d51-9e49-41415435e702",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7ff9f700-53f5-4d51-9e49-41415435e702/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7ff9f700-53f5-4d51-9e49-41415435e702/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Black": "https://m.media-amazon.com/images/I/31eofwke2EL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Black": "51OU0vlXStL"
  },
  "color_images": {
    "Black": [
      "https://m.media-amazon.com/images/I/51OU0vlXStL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress-cocktail-bodycon",
      "title": "Womens Dress Cocktail Bodycon",
      "price": 47.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61NfEwzl3xL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-one-shoulder-maxi-formal",
      "title": "Womens Maxi Dress Evening One Shoulder Maxi Formal",
      "price": 69.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/5150AIQL4eL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail",
      "title": "Womens Dress Cocktail",
      "price": 103.54,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61JApwce25L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-formal-bodycon-evening-sleeveless",
      "title": "Womens Maxi Dress Maxi Formal Bodycon Evening Sleeveless",
      "price": 61.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61s8qg6u1VL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 158.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71PmRANW40L._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress-bodycon-split-ruched-off-shoulder",
      "title": "Womens Dress Bodycon Split Ruched Off Shoulder",
      "price": 38.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/41JjYcPgcpL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 95.61,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Work",
      "images": [
        "https://m.media-amazon.com/images/I/71hVgSIB1jL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 138.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51PZNrlyY9L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-split-evening-formal",
      "title": "Womens Maxi Dress Split Evening Formal",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51BZ1BqPx8L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 65.97,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/81wr8PDg55L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-v-neck",
      "title": "Womens Dress V Neck",
      "price": 82.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/710bSTpZ9hL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 278.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/91YXeyW506L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening-long-sleeve",
      "title": "Womens Maxi Dress Formal Evening Long Sleeve",
      "price": 87.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61nnk+flvaL._SL1500_.jpg"
      ]
    }
  ]
}