{
  "id": "womens-maxi-dress-long-sleeve",
  "handle": "womens-maxi-dress-long-sleeve",
  "sku": "JC1068",
  "asin": "B09H2T7FR6",
  "title": "Womens Maxi Dress Long Sleeve",
  "title_original": "Amazon Essentials Women's Long Sleeve Classic Wrap Dress (Available in Plus Size)",
  "brand": "Visit the Amazon Essentials Store",
  "price": 12.6,
  "social_proof": {
    "bought_past_month": 562,
    "text": "562+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/61Xhe0Mbt4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61yqXms6hcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61vQK57y8wL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61azvXGRukL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/7177pUbv2pL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71+MPSUjUbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/613XFSVjD5L._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/61Xhe0Mbt4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61yqXms6hcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61vQK57y8wL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61azvXGRukL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/7177pUbv2pL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71+MPSUjUbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/613XFSVjD5L._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Item model number ‏": "‎ AEWP30130SS22",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ April 24, 2022",
    "Manufacturer ‏": "‎ Amazon Essentials",
    "ASIN ‏": "‎ B09H2SKPCQ",
    "Best Sellers Rank": "#1,767 in Our Brands ( See Top 100 in Our Brands ) #106 in Women's Casual Dresses",
    "Customer Reviews": "4.2 4.2 out of 5 stars (1,064)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Burgundy",
      "Black"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.2,
    "count": 1064,
    "customers_say": "Customers find the dress well-made with decently thick fabric that feels wonderful, and appreciate its flattering wrap style that's not too dressy. The dress is comfortable and offers good value for money, with one customer noting it hides figure flaws. The fit receives mixed feedback, with some finding it awesome while others say the arms are too tight for the size. The fabric weight is also mixed, with some appreciating its weight while others find it hangs too heavily. Select to learn more Quality Style Fabric thickness Flattering Comfort Value for money Fit Fabric weight 87 customers mention \"Quality\" 83 positive 4 negative Customers find the dress well-made, with one customer noting it's a steal for its quality. \"I wore this to a wedding. Great dress at a great price, flattering even as maternity. Washed well. Very opaque and good thick fabric....\" Read more \"It’s a nice dress , however, I felt the knot weighed the dress down in that area - not what I expected or wanted....\" Read more \" Great quality and fit dress - a little thicker material, so may not work for outdoor events in warm weather....\" Read more \"This dress is well made , runs true to size, and is flattering...but I can't wear it for work as planned. The fabric is nice, but it's HEAVY....\" Read more 72 customers mention \"Style\" 64 positive 8 negative Customers find the dress pretty and not too dressy, with an appropriate amount of understated sexiness. One customer mentions it pairs well with cute boots. \"...is comfortable, hugs curves in all the right places, it’s modest, stylish , and appropriate for a date night or the office as well....\" Read more \" beautiful dress . Fits perfectly.\" Read more \"...It’s formal, yet sexy and mature. I would say to stay true to size with this dress, it fit me just as expected.\" Read more \" Cute but for me bad fit- sleeves were too tight body too loose and I prefer a faux wrap anyway and thinner material....\" Read more 71 customers mention \"Fabric thickness\" 60 positive 11 negative Customers appreciate the dress's fabric thickness, describing it as good and not too thin, with a wonderful feel. \"Love!!!!!!!! Great material , great quality and color. Veryyy comfortable. I have it in two colors!\" Read more \"I really like this dress. I was pleasantly surprised that the fabric is thick and of good quality. A flattering line....\" Read more \" Low quality fabric and strange fit.\" Read more \"...I would describe the dress as flattering, good quality fabric and fitting as described. I may buy another.\" Read more 60 customers mention \"Flattering\" 57 positive 3 negative Customers find the dress flattering, particularly appreciating its wrap style, with one customer noting how it frames the waist and another mentioning how it evens out hips. \"Purchased recently for a fall wedding and it was so comfortable and flattering . We had to travel but the dress packed well with minimal wrinkling....\" Read more \"...The drape of this slightly heavy fabric is very flattering , the neckline is just right - a nice v-neck without being unnecessarily revealing,...\" Read more \"...This fitted perfectly, so flattering and impressive quality for the price. It is on the heavy fabric side but I guess that’s good. Really recommend it\" Read more \"Such a flattering dress ! I need to buy one in every color! Very nice weight. The fit is so flattering! I ordered a size 8 in burgundy....\" Read more 40 customers mention \"Comfort\" 38 positive 2 negative Customers find the dress comfortable, with one mentioning it's suitable for everyday office and business wear. \"Purchased recently for a fall wedding and it was so comfortable and flattering. We had to travel but the dress packed well with minimal wrinkling....\" Read more \"The material is similar to sports clothes. It’s very comfortable and feels cool, but it might absorb sweat if it’s hot or you have a more active...\" Read more \"...I didn't expect much. So I was blown away by the look, comfort and security (I'm quite busty) of this dress....\" Read more \" super comfortable and stylish dress for work...\" Read more 27 customers mention \"Value for money\" 26 positive 1 negative Customers find the dress offers good value for money, describing it as very nice and absolutely gorgeous for the price. \"I wore this to a wedding. Great dress at a great price , flattering even as maternity. Washed well. Very opaque and good thick fabric....\" Read more \"...I really don't know how you can afford to sell this at such a low price ....\" Read more \"This dress is such a timeless piece and great quality for the price . I bought it in burgundy and the color is absolutely beautiful....\" Read more \"Absolutely amazing dress for the value . Very thick material. It hides problem tummy areas and back rolls. I’m 5 ft 11 inches tall. Length was great....\" Read more 129 customers mention \"Fit\" 82 positive 47 negative Customers have mixed opinions about the dress's fit, with some finding it perfect while others report that the arms are too tight and the wrap around is too big. \" Perfect fit ! Classy look for a great price! Purchased size small..for reference, I’ll 5’3…117 lbs\" Read more \"The sleeves are very tight and due to modesty I definitely should have went up a size....\" Read more \"... Fits well and falls below the knees of a 5’5” person.\" Read more \"...Such great quality for the price. True to size and a great fit ! You won’t be disappointed.\" Read more 35 customers mention \"Fabric weight\" 18 positive 17 negative Customers have mixed opinions about the fabric weight of the dress, with some loving it while others find it too heavy. \"...for my girlfriend and it fit well and she liked the feel and weight of the fabric . She said it washed well. She is really happy with the dress.\" Read more \"...The fabric is nice, but it's HEAVY . I was looking for a spring/summer work dress but this is THICK and would be too warm when outdoors or not in AC....\" Read more \"...The wine color is just gorgeous, the fabric is lightweight yet it seemed to hide all my figure imperfections because of the style....\" Read more \"...Don't bother. Much better wrap dress options out there. Fabric was heavy and color leaned more to the purple side than burgundy.\" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Beautiful dress!",
        "body": "This dress is such a timeless piece and great quality for the price. I bought it in burgundy and the color is absolutely beautiful. It is incredibly flattering, smooths and hides imperfections, and the material is both comfortable and well-made. Read more",
        "author": "Customer",
        "rating": 5.0,
        "date": "December 22, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Impressed!",
        "body": "For the price, I wasn't expecting much but this is actually a great dress! The fabric is thick. I love the huddeb button at the waist to help keep the skirt in place. I'm 5' and it hits just above my knee which is perfect for me, but if you're taller, it may be shorter than you'd like. I ordered medium which is my usual size and it fits great! Read more",
        "author": "Kristen Peterson",
        "rating": 5.0,
        "date": "December 5, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Looks like you paid much more!!",
        "body": "This dress is adorable and the weight of the material is perfect--won't be flying up in the wind!! The only reason I rated it 4 stars instead of 5 is because it is tight in the arms--it does stretch, but fits snug. The wrap style is very flattering, but if you are larger in the bust area, size up for coverage. Love the Burgundy color--perfect for Fall. Read more",
        "author": "Deb",
        "rating": 4.0,
        "date": "October 23, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Classy dress worth the price.",
        "body": "This was nicer than expected. True to size. Nice length, material was better than expected for the price. Looks expensive. Read more",
        "author": "Alexa Brocklehurst",
        "rating": 5.0,
        "date": "December 20, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Long",
        "body": "Im 5’5 and 160 lbs with large breasts. The top fits nicely and the dress is good quality but very long. So long. Read more",
        "author": "Tara",
        "rating": 3.0,
        "date": "October 26, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars If there’s such a thing as the perfect dress, this is it!",
        "body": "What a great dress for this price point! The dress is beautifully designed and crafted. It is an actual wrap dress and the coverage is perfect! The bust is designed for a modest look - not overly conservative but not overly revealing either. The ruching on the skirt is the perfect tummy coverage and the fabric is durable, not flimsy or see through. Easy to put on and take off and perfect for the office, after 5 or church. Read more",
        "author": "Deborah F",
        "rating": 5.0,
        "date": "November 6, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "1.0 out of 5 stars Cheaply made!",
        "body": "Runs small and cheaply made. Returning right away… when I tried it on, you can see my skin through the belt hole on the side. Don’t waste your time buying this! Read more",
        "author": "Jens",
        "rating": 1.0,
        "date": "November 15, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Beautiful, comfortable and affordable",
        "body": "Best dress that I bought in a long time! Fits great!! Super comfortable and amazing price! Read more",
        "author": "Jennifer",
        "rating": 5.0,
        "date": "November 19, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.",
  "about_this_item": "Womens Maxi Dress Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.",
  "long_description": "Womens Maxi Dress Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Burgundy, Black. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Burgundy, Black. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "37aba9f1-3e4f-4c15-85b3-aa0bc16987f0",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/37aba9f1-3e4f-4c15-85b3-aa0bc16987f0/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/37aba9f1-3e4f-4c15-85b3-aa0bc16987f0/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/84274438-11a4-4d9b-b598-f5549938c190.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "65470cad-f5f7-473f-95da-5190161080a3",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/65470cad-f5f7-473f-95da-5190161080a3/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/65470cad-f5f7-473f-95da-5190161080a3/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/84274438-11a4-4d9b-b598-f5549938c190.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "1d1ae3ba-a03d-4b3a-9063-b61b495bf2ea",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1d1ae3ba-a03d-4b3a-9063-b61b495bf2ea/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1d1ae3ba-a03d-4b3a-9063-b61b495bf2ea/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/84274438-11a4-4d9b-b598-f5549938c190.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "7eaf0dc8-ca43-422e-9793-3d844cb4b286",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7eaf0dc8-ca43-422e-9793-3d844cb4b286/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7eaf0dc8-ca43-422e-9793-3d844cb4b286/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/84274438-11a4-4d9b-b598-f5549938c190.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "19c344ef-0caf-47f9-9a5b-749679a8f4f2",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/19c344ef-0caf-47f9-9a5b-749679a8f4f2/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/19c344ef-0caf-47f9-9a5b-749679a8f4f2/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/84274438-11a4-4d9b-b598-f5549938c190.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Burgundy": "https://m.media-amazon.com/images/I/31Ounf7VfNL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31e1XXbaIXL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Burgundy": "61Xhe0Mbt4L",
    "Black": "613XFSVjD5L"
  },
  "color_images": {
    "Burgundy": [
      "https://m.media-amazon.com/images/I/61Xhe0Mbt4L._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/613XFSVjD5L._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress-cocktail-bodycon",
      "title": "Womens Dress Cocktail Bodycon",
      "price": 47.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61NfEwzl3xL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-one-shoulder-maxi-formal",
      "title": "Womens Maxi Dress Evening One Shoulder Maxi Formal",
      "price": 69.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/5150AIQL4eL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail",
      "title": "Womens Dress Cocktail",
      "price": 103.54,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61JApwce25L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-formal-bodycon-evening-sleeveless",
      "title": "Womens Maxi Dress Maxi Formal Bodycon Evening Sleeveless",
      "price": 61.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61s8qg6u1VL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 158.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71PmRANW40L._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress-bodycon-split-ruched-off-shoulder",
      "title": "Womens Dress Bodycon Split Ruched Off Shoulder",
      "price": 38.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/41JjYcPgcpL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 95.61,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Work",
      "images": [
        "https://m.media-amazon.com/images/I/71hVgSIB1jL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 138.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51PZNrlyY9L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-split-evening-formal",
      "title": "Womens Maxi Dress Split Evening Formal",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51BZ1BqPx8L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 65.97,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/81wr8PDg55L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-v-neck",
      "title": "Womens Dress V Neck",
      "price": 82.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/710bSTpZ9hL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 278.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/91YXeyW506L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening-long-sleeve",
      "title": "Womens Maxi Dress Formal Evening Long Sleeve",
      "price": 87.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61nnk+flvaL._SL1500_.jpg"
      ]
    }
  ]
}