{
  "id": "womens-maxi-dress-off-shoulder-maxi",
  "handle": "womens-maxi-dress-off-shoulder-maxi",
  "sku": "JC3225",
  "asin": "B09NXMGN3J",
  "title": "Womens Maxi Dress Off Shoulder Maxi",
  "title_original": "ZESICA Women's 2026 Summer Bohemian Strapless Off Shoulder Lace Trim Backless Flowy A Line Beach Long Maxi Dress",
  "brand": "Visit the ZESICA Store",
  "price": 49.99,
  "social_proof": {
    "bought_past_month": 338,
    "text": "338+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/614D5aqjBGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ZE73F+gQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/714DGaFp0AL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61T8u-25rML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71jP1MIewEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71PYUdP839L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81YjCyprgJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71P9e1prIiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/811ipnUpgsL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61837LhUvSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ccr8Nz+eL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61bQYHVjfeL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61KOY6oIH1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61izvKg61KL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61YPZ4m5b2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61-59kirHpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61SE49k52sL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61NRo+lik7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61b9fnwG+nL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61WLjjLw8PL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61nZMxg9XFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Bu4NapVhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61EnS2kjCxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61lZwxKq2LL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/6187DMK7P8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61voLEVNxKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61sPVZ0yRfL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/614D5aqjBGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ZE73F+gQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/714DGaFp0AL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61T8u-25rML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71jP1MIewEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71PYUdP839L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81YjCyprgJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71P9e1prIiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/811ipnUpgsL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61837LhUvSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ccr8Nz+eL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61bQYHVjfeL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61KOY6oIH1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61izvKg61KL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61YPZ4m5b2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61-59kirHpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61SE49k52sL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61NRo+lik7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61b9fnwG+nL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61WLjjLw8PL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61nZMxg9XFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Bu4NapVhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61EnS2kjCxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61lZwxKq2LL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/6187DMK7P8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61voLEVNxKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61sPVZ0yRfL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Product Dimensions ‏": "‎ 1.97 x 0.79 x 0.39 inches; 3.53 ounces",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ December 21, 2021",
    "ASIN ‏": "‎ B0D49NW661",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#35,376 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #446 in Women's Casual Dresses",
    "Customer Reviews": "4.4 4.4 out of 5 stars (3,925)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Aqua",
      "Blue",
      "Watermelon",
      "Peach",
      "Fuchsia",
      "Skyblue",
      "Rose",
      "Black",
      "Darkorange",
      "Sage",
      "Coffee",
      "Firered",
      "Cobalt",
      "Armygreen",
      "Navy",
      "Pink",
      "White",
      "Purple",
      "Yellow"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.4,
    "count": 3925,
    "customers_say": "Customers find this dress beautiful, comfortable, and flattering for many body types, with one noting it's particularly suitable for larger women. The dress receives positive feedback for its soft blue color and versatility for both day and evening wear, with one customer mentioning it's perfect for a nice sunset on the beach. While some the length is perfect, others find it too long. Select to learn more Beauty Fit Quality Comfort Flattering Color Summer dress Length 320 customers mention \"Beauty\" 311 positive 9 negative Customers find the dress gorgeous and appreciate its nice quality, with one customer noting it looks great both with and without a belt. \"Recommend and cute . The top part had no shape for my boobs so I did the bracelet and elastic trick to look better.\" Read more \"This dress style is beautiful . It's fitted on top and flowy below the bust. Perfect for hiding a tummy. The material is a gauze-type rayon fabric....\" Read more \" Beautiful dress . Soft material. Extremely comfortable. Not see through. I have on a black bra and panties and you can't see them. Stays up all day....\" Read more \"Very comfortable and super cute ! For reference, I’m 5’4” 135 lbs, 38DD and usually a size 6/7Ish. I ordered a size small and there’s plenty of room....\" Read more 252 customers mention \"Fit\" 209 positive 43 negative Customers are satisfied with how the dress fits, with one mentioning it goes to their ankles and another noting it hits at the tops of their feet. \"I’m so happy I got this dress, it’s so comfortable and fits great . I have a very big chest and it stays on perfectly and the perfect length at 5’4”.\" Read more \"I bought this dress for family photos. It looked so good on and it fit perfectly !!! Definitely recommend buying. You won’t be disappointed.\" Read more \"Love the color. Fits well , but was a little too long I wasn’t able to wear flats without stepping on the hem, but after I washed it it shrunk...\" Read more \" Great fit good quality. Dress up or down. Great w my county boots and Jean jacket.\" Read more 208 customers mention \"Quality\" 189 positive 19 negative Customers find the dress to be of good quality and beautiful. \" Great dress for my upcoming trip to Cabo! I am 5’2 and the length was perfect. Not too long. Fit was great! I found it true to size\" Read more \"Super cute dress, great quality . I’m currently a nursing mama, 36 C when not nursing and this dress sagged on my chest area making it look sloppy.\" Read more \" Love this dress !! Wore it for a white party but could also wear with flip flops during the day!! Don’t dry it!!...\" Read more \"...It's flowy, flattering, and feminine. It's a good quality and the liner prevents it from being see-through.\" Read more 151 customers mention \"Comfort\" 146 positive 5 negative Customers find the dress comfortable, describing it as beautiful and suitable for summer wear, with one customer noting it's not suffocating and another mentioning it's not scratchy. \"...It was light & airy, flattering & comfortable . It wasn’t sheer or too thin, there’s lining. Washes well & packed well without getting too wrinkly....\" Read more \" Very comfortable and super cute! For reference, I’m 5’4” 135 lbs, 38DD and usually a size 6/7Ish. I ordered a size small and there’s plenty of room....\" Read more \"Soft - comfy - my go to throw on for summer shenanigans. The seams fell apart quickly though so that’s not acceptable at this price point....\" Read more \"This dress is perfect. Super comfy , perfect length and weight of fabric. The elastic is plenty on top and I am small there.\" Read more 101 customers mention \"Flattering\" 88 positive 13 negative Customers find the dress flattering, particularly noting that it works well for various body types, with one customer mentioning it's perfect for curvy hips and another highlighting how it accentuates the upper waist area. \"Liked it so much I bought it in other colors. Lightweight and flattering . The red color is so pretty! I always get compliments when I wear it :)\" Read more \"I ordered this for beach pictures and it was perfect! It is very flattering . The fit was comfortable and I love the color....\" Read more \" Very flattering dress ! So cute and flowy. True to size.\" Read more \" Flattering summer dress \" Read more 90 customers mention \"Color\" 79 positive 11 negative Customers love the dress's color, particularly its soft blue and pure white options, with one customer noting that the black version can be dressed up or down. \"Wear it to an evening get-together I love the color it's just as advertised...I got lots of compliments...very nice dress love it....fits nicely.....\" Read more \" beautiful color and fit..Top not as stretchy as most but fits good and tight. Has lining which makes it perfect for a quality dress\" Read more \"Beautiful fit, color and material. It was true to size. I'm 5.5\" and about 145 pounds, with size B/C chest. Size medium fit me perfectly.\" Read more \"Great quality! It’s heavy and thick and not cheaply made. The color is beautiful and suits so many skin tones, but it’s a bit long and would suit a...\" Read more 78 customers mention \"Summer dress\" 78 positive 0 negative Customers love this dress as a summer option, finding it perfect for both day and evening wear, particularly noting its suitability for hot days on the boat and nice sunsets on the beach. \" Perfect summer dress and I think it will also be perfect for fall! Only down fall is that It did shrink a tad after I washed it but not too bad\" Read more \"... Great summer dress though. Got it in dark brown and looks really nice for casual wear....\" Read more \"Cute dress. Pretty comfortable and perfect for summer . I got white and definitely need to wear a bra under it....\" Read more \"I absolutely love this dress! Perfect for the summer , makes me feel so beautiful!\" Read more 86 customers mention \"Length\" 50 positive 36 negative Customers have mixed opinions about the dress's length, with some finding it perfect and suitable for short girls, while others report it being too short and not optimal for tall women. \"I’m short and this dress was the perfect length ! Such a rarity when you’re 5’2”. Really pretty and fits so well. Thrilled with this purchase.\" Read more \"...5 to 6” shorter than the expensive ZESICA dress and she said it was too short ....\" Read more \"...plenty of room in the dress and if I wore heels or wedges the length was perfect (I am 5'3\"). If you are thinking about buying this, do it!\" Read more \" To short and the fabric around the chest isn’t stretchy if you are a tall woman or like a dress long it’s not for you\" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Cute!",
        "body": "I'm 5'7, 199 lbs and ordered a large. Love the quality of the fabric, and it fits perfectly. Received many compliments! Read more",
        "author": "LaCretia Ward",
        "rating": 5.0,
        "date": "December 18, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Perfect for summer!",
        "body": "True to size! I also loved this color, I got it in the sage green. I am tall - but I thought the length was great. Can dress up or down. Good quality and not see through. Would recommend and would buy again! Read more",
        "author": "Sophie",
        "rating": 5.0,
        "date": "October 6, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars So cute!",
        "body": "Bought this for my bridal shower it is so cute and comfortable! Read more",
        "author": "Kiarra Patasius",
        "rating": 5.0,
        "date": "November 11, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/81hzD91I27L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "4.0 out of 5 stars Tall but SO CUTE a",
        "body": "Great quality! It’s heavy and thick and not cheaply made. The color is beautiful and suits so many skin tones, but it’s a bit long and would suit a taller frame or with heels. Read more",
        "author": "KZ",
        "rating": 4.0,
        "date": "September 21, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Very summery",
        "body": "Perfect for my daughter in laws summer baby shower. Perfect fit. I had alot of compliments on it . Read more",
        "author": "sue",
        "rating": 5.0,
        "date": "November 5, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars So cute",
        "body": "Such a cute dress! Fits perfect and makes me feel very girly! Read more",
        "author": "Katie",
        "rating": 5.0,
        "date": "October 20, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Nice dress",
        "body": "Dress is very expensive at $59.99 or $49.99 being that it is not from a name brand. It is also comfortable, flowy, and looks nice on. You can use it as a skirt or dress. Has an inner liner on the bottom half only. Color options are good. Read more",
        "author": "All_Good",
        "rating": 3.0,
        "date": "September 8, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Love this dress",
        "body": "Love this dress! Bought for pictures on the beach and the color was perfect and fit the vibe I was going for nicely. I recently had a baby and I felt that it was very forgiving since I do have a bit of a postpartum body. It’s nice and stretchy and i felt that it was really flattering. Read more",
        "author": "ReviewWithMe",
        "rating": 5.0,
        "date": "April 17, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Off Shoulder Maxi is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.",
  "about_this_item": "Womens Maxi Dress Off Shoulder Maxi is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.",
  "long_description": "Womens Maxi Dress Off Shoulder Maxi is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Aqua, Blue, Watermelon, Peach, Fuchsia, Skyblue, Rose, Black, Darkorange, Sage, Coffee, Firered, Cobalt, Armygreen. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Off Shoulder Maxi is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Aqua, Blue, Watermelon, Peach, Fuchsia, Skyblue, Rose, Black, Darkorange, Sage, Coffee, Firered, Cobalt, Armygreen. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "4600a9ad-2f7e-4765-a098-570fc425e0bf",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4600a9ad-2f7e-4765-a098-570fc425e0bf/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4600a9ad-2f7e-4765-a098-570fc425e0bf/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "0f34f0eb-476a-4afd-80d7-1b698c35d2c1",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0f34f0eb-476a-4afd-80d7-1b698c35d2c1/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0f34f0eb-476a-4afd-80d7-1b698c35d2c1/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "f72a6135-e858-438e-bd49-dc16d37833e1",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f72a6135-e858-438e-bd49-dc16d37833e1/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f72a6135-e858-438e-bd49-dc16d37833e1/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "41ec7fb6-18ef-4129-b7e0-67c3a4a43fde",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/41ec7fb6-18ef-4129-b7e0-67c3a4a43fde/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/41ec7fb6-18ef-4129-b7e0-67c3a4a43fde/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "8ec7e836-7b86-45c1-b169-1d876c276c09",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8ec7e836-7b86-45c1-b169-1d876c276c09/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8ec7e836-7b86-45c1-b169-1d876c276c09/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "4ba5c932-90ed-4659-b42b-ccdbfcb6d480",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4ba5c932-90ed-4659-b42b-ccdbfcb6d480/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4ba5c932-90ed-4659-b42b-ccdbfcb6d480/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "1b8fcb24-a518-499b-b140-2082b012dfb0",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1b8fcb24-a518-499b-b140-2082b012dfb0/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1b8fcb24-a518-499b-b140-2082b012dfb0/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "f0e2d07c-90f1-4ba0-9e93-54e71256eb5f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f0e2d07c-90f1-4ba0-9e93-54e71256eb5f/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f0e2d07c-90f1-4ba0-9e93-54e71256eb5f/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "820d6766-c7c8-4b6a-8901-cec6d6e1e1f0",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/820d6766-c7c8-4b6a-8901-cec6d6e1e1f0/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/820d6766-c7c8-4b6a-8901-cec6d6e1e1f0/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "560cd004-a242-4534-ba97-ac79b530d92c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/560cd004-a242-4534-ba97-ac79b530d92c/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/560cd004-a242-4534-ba97-ac79b530d92c/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "4598acc8-0535-4b78-aad7-9c6f74832379",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4598acc8-0535-4b78-aad7-9c6f74832379/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4598acc8-0535-4b78-aad7-9c6f74832379/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "20a2976f-a819-4ecd-b495-dae422a7f698",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/20a2976f-a819-4ecd-b495-dae422a7f698/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/20a2976f-a819-4ecd-b495-dae422a7f698/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Aqua": "https://m.media-amazon.com/images/I/31JNYfSJ8xL._AC_SR38,50_.jpg",
    "Blue": "https://m.media-amazon.com/images/I/31grTX69MrL._AC_SR38,50_.jpg",
    "Watermelon": "https://m.media-amazon.com/images/I/31o8+3Kb8kL._AC_SR38,50_.jpg",
    "Peach": "https://m.media-amazon.com/images/I/31Xt3Mpb1jL._AC_SR38,50_.jpg",
    "Fuchsia": "https://m.media-amazon.com/images/I/31rbFjRi4oL._AC_SR38,50_.jpg",
    "Skyblue": "https://m.media-amazon.com/images/I/31ZYhElP1PL._AC_SR38,50_.jpg",
    "Rose": "https://m.media-amazon.com/images/I/31XLJ+uaDUL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31CFQe20DVL._AC_SR38,50_.jpg",
    "Darkorange": "https://m.media-amazon.com/images/I/31dDBVMpP7L._AC_SR38,50_.jpg",
    "Sage": "https://m.media-amazon.com/images/I/31ot8L3mdML._AC_SR38,50_.jpg",
    "Coffee": "https://m.media-amazon.com/images/I/31FGOrQRIBL._AC_SR38,50_.jpg",
    "Firered": "https://m.media-amazon.com/images/I/31RVdIuLylL._AC_SR38,50_.jpg",
    "Cobalt": "https://m.media-amazon.com/images/I/31BJ23iAxUL._AC_SR38,50_.jpg",
    "Armygreen": "https://m.media-amazon.com/images/I/31rjGIUl3CL._AC_SR38,50_.jpg",
    "Navy": "https://m.media-amazon.com/images/I/31xpu3uqPNL._AC_SR38,50_.jpg",
    "Pink": "https://m.media-amazon.com/images/I/31pZK9RdfwL._AC_SR38,50_.jpg",
    "White": "https://m.media-amazon.com/images/I/31DJphket9L._AC_SR38,50_.jpg",
    "Purple": "https://m.media-amazon.com/images/I/31T6txAAV8L._AC_SR38,50_.jpg",
    "Yellow": "https://m.media-amazon.com/images/I/31vWC8-3XnL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Aqua": "61837LhUvSL",
    "Blue": "61ccr8Nz+eL",
    "Watermelon": "61bQYHVjfeL",
    "Peach": "61KOY6oIH1L",
    "Fuchsia": "61izvKg61KL",
    "Skyblue": "61YPZ4m5b2L",
    "Rose": "61-59kirHpL",
    "Black": "61SE49k52sL",
    "Darkorange": "61NRo+lik7L",
    "Sage": "61b9fnwG+nL",
    "Coffee": "61WLjjLw8PL",
    "Firered": "61nZMxg9XFL",
    "Cobalt": "61Bu4NapVhL",
    "Armygreen": "61EnS2kjCxL",
    "Navy": "61lZwxKq2LL",
    "Pink": "6187DMK7P8L",
    "White": "614D5aqjBGL",
    "Purple": "61voLEVNxKL",
    "Yellow": "61sPVZ0yRfL"
  },
  "color_images": {
    "Aqua": [
      "https://m.media-amazon.com/images/I/61837LhUvSL._SL1500_.jpg"
    ],
    "Blue": [
      "https://m.media-amazon.com/images/I/61ccr8Nz+eL._SL1500_.jpg"
    ],
    "Watermelon": [
      "https://m.media-amazon.com/images/I/61bQYHVjfeL._SL1500_.jpg"
    ],
    "Peach": [
      "https://m.media-amazon.com/images/I/61KOY6oIH1L._SL1500_.jpg"
    ],
    "Fuchsia": [
      "https://m.media-amazon.com/images/I/61izvKg61KL._SL1500_.jpg"
    ],
    "Skyblue": [
      "https://m.media-amazon.com/images/I/61YPZ4m5b2L._SL1500_.jpg"
    ],
    "Rose": [
      "https://m.media-amazon.com/images/I/61-59kirHpL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/61SE49k52sL._SL1500_.jpg"
    ],
    "Darkorange": [
      "https://m.media-amazon.com/images/I/61NRo+lik7L._SL1500_.jpg"
    ],
    "Sage": [
      "https://m.media-amazon.com/images/I/61b9fnwG+nL._SL1500_.jpg"
    ],
    "Coffee": [
      "https://m.media-amazon.com/images/I/61WLjjLw8PL._SL1500_.jpg"
    ],
    "Firered": [
      "https://m.media-amazon.com/images/I/61nZMxg9XFL._SL1500_.jpg"
    ],
    "Cobalt": [
      "https://m.media-amazon.com/images/I/61Bu4NapVhL._SL1500_.jpg"
    ],
    "Armygreen": [
      "https://m.media-amazon.com/images/I/61EnS2kjCxL._SL1500_.jpg"
    ],
    "Navy": [
      "https://m.media-amazon.com/images/I/61lZwxKq2LL._SL1500_.jpg"
    ],
    "Pink": [
      "https://m.media-amazon.com/images/I/6187DMK7P8L._SL1500_.jpg"
    ],
    "White": [
      "https://m.media-amazon.com/images/I/614D5aqjBGL._SL1500_.jpg"
    ],
    "Purple": [
      "https://m.media-amazon.com/images/I/61voLEVNxKL._SL1500_.jpg"
    ],
    "Yellow": [
      "https://m.media-amazon.com/images/I/61sPVZ0yRfL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 36.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61Uh0mHFneL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-cocktail-split-high-split-v-neck-maxi",
      "title": "Womens Maxi Dress Formal Cocktail Split High Split V Neck Maxi",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/41VDLIoXEvL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-one-shoulder-evening-formal",
      "title": "Womens Maxi Dress One Shoulder Evening Formal",
      "price": 74.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61c-8Xfw+kL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-ruched-cocktail",
      "title": "Womens Maxi Dress Long Sleeve Ruched Cocktail",
      "price": 37.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61++AVDEcML._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-off-shoulder",
      "title": "Womens Dress Off Shoulder",
      "price": 93.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71+G9PIEq1L._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 76.9,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Wedding Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/514+blcsiGL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-v-neck-long-sleeve",
      "title": "Womens Maxi Dress V Neck Long Sleeve",
      "price": 149.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61fW8fAbNDL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 39.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71vtAwYcALL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-v-neck-maxi-long-sleeve",
      "title": "Womens Maxi Dress V Neck Maxi Long Sleeve",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71sKNyjrUTL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-ruched",
      "title": "Womens Dress Ruched",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61IBJWrdA9L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-ruched-mermaid-formal",
      "title": "Womens Maxi Dress Ruched Mermaid Formal",
      "price": 72.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Wedding Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/51vkgB4rAzL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/41Kk3d-Y48L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 298.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51nn4ppekDL._SL1500_.jpg"
      ]
    }
  ]
}