{
  "id": "womens-dress-cocktail-sleeveless",
  "handle": "womens-dress-cocktail-sleeveless",
  "sku": "JC3185",
  "asin": "B09P4X6KD8",
  "title": "Womens Dress Cocktail Sleeveless",
  "title_original": "ZAFUL Women's Satin Sleeveless Spaghetti Strap Mini Dress Sexy Slip Cowl Neck Silky Cocktail Party Dresses",
  "brand": "Visit the ZAFUL Store",
  "price": 48.99,
  "social_proof": {
    "bought_past_month": 155,
    "text": "155+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/61VFjyh22OL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61LJWfn13eL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81Ap5mMqV3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71-BBV+Jf3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61lZRtkwooL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61CY0d1vO9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71L-ZZXSi+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61fuzTm6BQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61D-Ks1sO2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61SvGyGk0VL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61X7Zk5SuZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61UXd0xfdbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/611o2TsPNwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Vd8ed2n2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ttZ8I-6FL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ELLSvqOFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61pebj3UJpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61sExdw12KL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61+yGOtVkqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51SRBMAwNSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61OQGpW01OL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61PDOeSoo+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61rVSz7LqaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61r3covc1VL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ZuorlDDWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51bl47YbRPL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/61VFjyh22OL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61LJWfn13eL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81Ap5mMqV3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71-BBV+Jf3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61lZRtkwooL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61CY0d1vO9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71L-ZZXSi+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61fuzTm6BQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61D-Ks1sO2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61SvGyGk0VL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61X7Zk5SuZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61UXd0xfdbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/611o2TsPNwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Vd8ed2n2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ttZ8I-6FL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ELLSvqOFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61pebj3UJpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61sExdw12KL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61+yGOtVkqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51SRBMAwNSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61OQGpW01OL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61PDOeSoo+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61rVSz7LqaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61r3covc1VL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ZuorlDDWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51bl47YbRPL._SL1500_.jpg"
  ],
  "aplus_images": [
    "https://m.media-amazon.com/images/I/31D3Zml%2BiGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41ovGTrVbwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31keF77KHhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41092VrDSzL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31WsxFbSBGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31E60wE0%2BrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31I8S1v%2ByiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31i1ANz9w7L._SL1500_.jpg"
  ],
  "description_images": [
    "https://m.media-amazon.com/images/I/31D3Zml%2BiGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41ovGTrVbwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31keF77KHhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41092VrDSzL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31WsxFbSBGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31E60wE0%2BrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31I8S1v%2ByiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31i1ANz9w7L._SL1500_.jpg"
  ],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ June 28, 2024",
    "ASIN ‏": "‎ B0DXFBMZJ5",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#18,962 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #75 in Women's Club & Night Out Dresses",
    "Customer Reviews": "3.9 3.9 out of 5 stars (2,092)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "1-royal Blue",
      "1-mustard Green",
      "1-green-christmas",
      "1-silver Gray",
      "1-navy Blue",
      "1-brown",
      "1-purple Red",
      "1-army Green",
      "Red",
      "1-black",
      "Pink-f",
      "1-red-christmas",
      "1-rose Pink",
      "1-blue",
      "1-champagne",
      "1-gold",
      "1-white",
      "1-mint Green",
      "1-brick Brown",
      "1-lake Blue",
      "1-hot Pink",
      "1-orange",
      "1-green"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 3.9,
    "count": 2092,
    "customers_say": "Customers find the dress well-made and insanely pretty, with one noting it goes perfectly with their skin tone. The fit and material quality receive mixed feedback - while some say it's true to size with nice fabric, others mention it runs large and the material feels cheap. The tie length and flattering aspects also get mixed reviews, with some appreciating the back ties while others find the neckline weird, and some saying it's flattering while others note it's not very flattering in the chest. Value for money opinions are divided between those who find it great quality for the price and those who say it's not worth the price. Generated from the text of customer reviews Select to learn more Quality (186) Looks (69) Color (55) Fit (153) Material quality (100) Tie length (49) Value for money (47) Flattering (41) 186 customers mention quality, 137 positive, 49 negative 186 customers mention \"Quality\" 137 positive 49 negative Customers find the dress well-made and better than expected quality, with one customer noting it doesn't feel cheap. \" Beautiful dress but runs big ,I order a XS for my daughter and it looks like they send me a S (I don’t even know because it doesn’t have a size tag )... \" Read more \" Very cute and flattering when tied properly. A bit bigger than expected and not terribly cute from behind, but otherwise great. \" Read more \" Poor quality and very cheap material that started to pill immediately. \" Read more \" ...this when I first took it out of the bag, but it ended up being super cute . there’s a ribbon on there to cinch it and tighten however you want.... \" Read more 69 customers mention looks, 53 positive, 16 negative 69 customers mention \"Looks\" 53 positive 16 negative Customers find the dress incredibly pretty, with one mentioning that the back straps enhance its appearance, while another notes it has an expensive look. \" This dress is so cute but I was deeply disappointed when just after 6 hours of being worn, it is already looking like it was worn100 times.... \" Read more \" Beautiful but received different color than ordered , returned it and will re order \" Read more \" I unfortunately never received the dress. Looked beautiful and the reviews looked really good. Oh well, things happen. \" Read more \" Really cheap material that almost looked like a costume .... \" Read more 55 customers mention color, 50 positive, 5 negative 55 customers mention \"Color\" 50 positive 5 negative Customers love the color of the dress, with one mentioning it matches their eyes, while another notes it complements their skin tone. \" ...She loves the dress, it's flattering, the color is beautiful and not sheer BUT it snags easily. It ended up with 2 snags before we even left home. \" Read more \" “This is a really pretty dress — the fabric, color , and fit were all perfect. It looks exactly like the pictures and is very flattering.... \" Read more \" Dress arrived early. Its a beautiful color and material. However my only issue is that the top is a little loose.... \" Read more \" Absolutely love the color and fit. Incredibly Flattering and stretchy. I’m so happy with this purchase \" Read more 153 customers mention fit, 102 positive, 51 negative 153 customers mention \"Fit\" 102 positive 51 negative Customers have mixed opinions about the dress's fit, with some finding it appropriate and true to size, while others report that the top is too big, the skirt isn't very fitted, and it runs large. \" Very disappointed. Has the potential of being a nice dress and true to size but the dress already had a snag that was very visible and I didn't have... \" Read more \" The quality is cheap it’s thick and feels like a swimsuit and it’s too big and doesn’t fit at all and doesn’t even look good and it looks nothing... \" Read more \" ...My daughter loves it! It fits true to size . She is a size small. The straps adjust, which is nice.... \" Read more \" ...I'm 4\"11 & roughly 119lbs with DDs and I got a small and it fits great . Very complimentary. Love it \" Read more 100 customers mention material quality, 65 positive, 35 negative 100 customers mention \"Material quality\" 65 positive 35 negative Customers have mixed opinions about the dress's material, with some finding it nice and well-made, while others describe it as cheap and of poor quality. \" ...I loved how it fit, the material , etc. It looked just like the picture and was very flattering. It was also comfortable!... \" Read more \" Item is very bad quality very cheap material for $40 doesn’t look as flattering as the pictures \" Read more \" This was a lovely color, nice material , fit her perfectly as described per body measurements. great value and quality \" Read more \" Amazing. Comfy, great material , length is perfect, not see through, the color is BEAUTIFUL (light blue), and I will be wearing this a LOT.... \" Read more 49 customers mention tie length, 25 positive, 24 negative 49 customers mention \"Tie length\" 25 positive 24 negative Customers have mixed opinions about the dress's tie length, with some appreciating that it can be tied in the back and around the middle, while others find the neckline problematic. \" This is a shiny and stretchy material, the dress ties in the back . \" Read more \" ...it's not poorly put together, and it's not see-through but the neckline is weird .... \" Read more \" ...& the color is beautiful and shiny , the length is decent and its not to clingy . The price is decent aswell \" Read more \" The material was OK, seemed a little cheap. It clung to my stomach and showed my belly button and belly button ring through the fabric, not... \" Read more 47 customers mention value for money, 31 positive, 16 negative 47 customers mention \"Value for money\" 31 positive 16 negative Customers have mixed opinions about the dress's value for money, with some finding it great quality for the price while others feel it's not worth the cost. \" ...Fits me perfectly (5-1”, 112lbs). Great for the price !!!! Will upload a picture later if i can \" Read more \" ...Definitely not worth the price . The dress does have some stretch, but not what I expected. I did return the dress and receive a full refund. \" Read more \" Looks great! Definitely worth the money ! She loves it! \" Read more \" Great product my niece loved it. Well made with a great price . \" Read more 41 customers mention flattering, 27 positive, 14 negative 41 customers mention \"Flattering\" 27 positive 14 negative Customers have mixed opinions about the dress's appearance, with some finding it flattering while others note it doesn't look good in the chest area. \" I ordered this dress for a school formal and looks very nice and flattering , comfortable and good quality and it completely covers your butt which I... \" Read more \" ...showed my belly button and belly button ring through the fabric, not flattering unless you have a completely flat stomach. Straps seemed cheap.... \" Read more \" God I love this dress! So flattering and it stretches and still looks satiny smooth 10/10 \" Read more \" ...It looked just like the picture and was very flattering . It was also comfortable! Super cute and the size chart is accurate. \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Nice dress",
        "body": "“This is a really pretty dress — the fabric, color, and fit were all perfect. It looks exactly like the pictures and is very flattering. I returned it only because it wasn’t quite what I needed for the occasion I had in mind, but the dress itself is excellent quality. I would definitely recommend it.” Read more",
        "author": "Customer",
        "rating": 5.0,
        "date": "November 14, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Amazing",
        "body": "Very pretty dress. Not revealing but very nice. It snatches you waist well and is a perfect length. The fabric is good quality and nice and soft. Read more",
        "author": "Chaitanya",
        "rating": 5.0,
        "date": "December 18, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Great fit and sexy",
        "body": "Really cute and sexy. Nice material Read more",
        "author": "lori",
        "rating": 4.0,
        "date": "December 2, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61YfZsLThPL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Nice",
        "body": "Beautiful dress, fabric is nice & the color is beautiful and shiny , the length is decent and its not to clingy . The price is decent aswell Read more",
        "author": "Butterfly",
        "rating": 5.0,
        "date": "October 4, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Cute Dress…short!",
        "body": "Purchased this dress for our daughter to wear to a sports banquet. It was a cute fit and the tie in the back helped define a waist. Daughter is super petite and an XS was even too big. We liked the flare skirt as so many other slip style dresses are body con. This dress is SHORT! It was only an acceptable length for us because daughter is very petite. Wrinkles easily. She’s only worn it once with no problems, but fabric looks and feels like it’s going to pile and snag easily. Overall, cute dress. Not in love with how the back looks. Definitely cuter from the front. Needs some improvement to justify this price point. Read more",
        "author": "Cheryl Pratt",
        "rating": 3.0,
        "date": "May 18, 2024",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71-D9rAakcL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars True to size. Pretty",
        "body": "This was for Granddaughter. She loved it, and it looked super cute on. Read more",
        "author": "jgirl",
        "rating": 5.0,
        "date": "December 24, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Satisfied",
        "body": "I bought this dress for my daughter homecoming and she loved. My daughter is more of the petite size and it fit lovely. Read more",
        "author": "Me(May) Yang",
        "rating": 5.0,
        "date": "November 11, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Good quality but was a little big",
        "body": "The material was great and comfortable it also looked just like the pictures but it was a little big. Read more",
        "author": "Kennedy Fickes",
        "rating": 4.0,
        "date": "September 16, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Dress Cocktail Sleeveless is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.",
  "about_this_item": "Womens Dress Cocktail Sleeveless is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.",
  "long_description": "Womens Dress Cocktail Sleeveless is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: 1-royal Blue, 1-mustard Green, 1-green-christmas, 1-silver Gray, 1-navy Blue, 1-brown, 1-purple Red, 1-army Green, Red, 1-black, Pink-f, 1-red-christmas, 1-rose Pink, 1-blue. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Dress Cocktail Sleeveless is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/31D3Zml%2BiGL._SL1500_.jpg",
      "alt": "Womens Dress Cocktail Sleeveless details image 1"
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/41ovGTrVbwL._SL1500_.jpg",
      "alt": "Womens Dress Cocktail Sleeveless details image 2"
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/31keF77KHhL._SL1500_.jpg",
      "alt": "Womens Dress Cocktail Sleeveless details image 3"
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/41092VrDSzL._SL1500_.jpg",
      "alt": "Womens Dress Cocktail Sleeveless details image 4"
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: 1-royal Blue, 1-mustard Green, 1-green-christmas, 1-silver Gray, 1-navy Blue, 1-brown, 1-purple Red, 1-army Green, Red, 1-black, Pink-f, 1-red-christmas, 1-rose Pink, 1-blue. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/31WsxFbSBGL._SL1500_.jpg",
      "alt": "Womens Dress Cocktail Sleeveless details image 5"
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "6b67ebb8-7610-48f5-9945-1f366c830f09",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6b67ebb8-7610-48f5-9945-1f366c830f09/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6b67ebb8-7610-48f5-9945-1f366c830f09/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "dadc490c-074c-4997-a102-d29251c51e97",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/dadc490c-074c-4997-a102-d29251c51e97/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/dadc490c-074c-4997-a102-d29251c51e97/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "77acafc5-beb5-49e0-907e-611736ed8063",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/77acafc5-beb5-49e0-907e-611736ed8063/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/77acafc5-beb5-49e0-907e-611736ed8063/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "6bc7c816-aa35-47ac-80d3-d494465173b4",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6bc7c816-aa35-47ac-80d3-d494465173b4/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6bc7c816-aa35-47ac-80d3-d494465173b4/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "bd9063f9-32bd-4690-89bf-366b315a7a12",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bd9063f9-32bd-4690-89bf-366b315a7a12/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bd9063f9-32bd-4690-89bf-366b315a7a12/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "ac0f83c4-7afb-4e4d-9980-6f982b00910e",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ac0f83c4-7afb-4e4d-9980-6f982b00910e/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ac0f83c4-7afb-4e4d-9980-6f982b00910e/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "c701f334-5e41-4d0a-9a7f-b45d3abf1479",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c701f334-5e41-4d0a-9a7f-b45d3abf1479/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c701f334-5e41-4d0a-9a7f-b45d3abf1479/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "891c3ff6-e345-47d9-a50f-0705cadcd8c4",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/891c3ff6-e345-47d9-a50f-0705cadcd8c4/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/891c3ff6-e345-47d9-a50f-0705cadcd8c4/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "23292849-7919-405d-ba69-7ae3e1241f53",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/23292849-7919-405d-ba69-7ae3e1241f53/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/23292849-7919-405d-ba69-7ae3e1241f53/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "764e40d6-67ce-485d-a99a-26e99206413a",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/764e40d6-67ce-485d-a99a-26e99206413a/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/764e40d6-67ce-485d-a99a-26e99206413a/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "372581f4-474a-4b85-837b-d511765a3cbc",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/372581f4-474a-4b85-837b-d511765a3cbc/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/372581f4-474a-4b85-837b-d511765a3cbc/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "10094cd6-16f4-4bd8-8400-1e8ff94bff7b",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/10094cd6-16f4-4bd8-8400-1e8ff94bff7b/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/10094cd6-16f4-4bd8-8400-1e8ff94bff7b/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "1-royal Blue": "https://m.media-amazon.com/images/I/31bFxfnPtHL._AC_SR38,50_.jpg",
    "1-mustard Green": "https://m.media-amazon.com/images/I/31Jr8ALdNEL._AC_SR38,50_.jpg",
    "1-green-christmas": "https://m.media-amazon.com/images/I/41TiC6rLtYL._AC_SR38,50_.jpg",
    "1-silver Gray": "https://m.media-amazon.com/images/I/21HkstNiLZL._AC_SR38,50_.jpg",
    "1-navy Blue": "https://m.media-amazon.com/images/I/313dwtWF6WL._AC_SR38,50_.jpg",
    "1-brown": "https://m.media-amazon.com/images/I/31UCE4EnfmL._AC_SR38,50_.jpg",
    "1-purple Red": "https://m.media-amazon.com/images/I/31tnMDVKvLL._AC_SR38,50_.jpg",
    "1-army Green": "https://m.media-amazon.com/images/I/21H4nkUyaRL._AC_SR38,50_.jpg",
    "Red": "https://m.media-amazon.com/images/I/31CJketEduL._AC_SR38,50_.jpg",
    "1-black": "https://m.media-amazon.com/images/I/31tvESeBqSL._AC_SR38,50_.jpg",
    "Pink-f": "https://m.media-amazon.com/images/I/31v+xz9UHiL._AC_SR38,50_.jpg",
    "1-red-christmas": "https://m.media-amazon.com/images/I/41RosDjP+zL._AC_SR38,50_.jpg",
    "1-rose Pink": "https://m.media-amazon.com/images/I/31pTiIANQJL._AC_SR38,50_.jpg",
    "1-blue": "https://m.media-amazon.com/images/I/313PVQAV8lL._AC_SR38,50_.jpg",
    "1-champagne": "https://m.media-amazon.com/images/I/31+IsrqwucL._AC_SR38,50_.jpg",
    "1-gold": "https://m.media-amazon.com/images/I/31DacAl6CfL._AC_SR38,50_.jpg",
    "1-white": "https://m.media-amazon.com/images/I/31KmxW7KF7L._AC_SR38,50_.jpg",
    "1-mint Green": "https://m.media-amazon.com/images/I/21VMq31DjrL._AC_SR38,50_.jpg",
    "1-brick Brown": "https://m.media-amazon.com/images/I/31TW03afeOL._AC_SR38,50_.jpg",
    "1-lake Blue": "https://m.media-amazon.com/images/I/310+kynlAsL._AC_SR38,50_.jpg",
    "1-hot Pink": "https://m.media-amazon.com/images/I/31WUtccn0aL._AC_SR38,50_.jpg",
    "1-orange": "https://m.media-amazon.com/images/I/31fKI1SOu6L._AC_SR38,50_.jpg",
    "1-green": "https://m.media-amazon.com/images/I/31MFmtBI2SL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "1-royal Blue": "61lZRtkwooL",
    "1-mustard Green": "61CY0d1vO9L",
    "1-green-christmas": "71L-ZZXSi+L",
    "1-silver Gray": "61fuzTm6BQL",
    "1-navy Blue": "61D-Ks1sO2L",
    "1-brown": "61SvGyGk0VL",
    "1-purple Red": "61X7Zk5SuZL",
    "1-army Green": "61UXd0xfdbL",
    "Red": "61VFjyh22OL",
    "1-black": "611o2TsPNwL",
    "Pink-f": "61Vd8ed2n2L",
    "1-red-christmas": "71ttZ8I-6FL",
    "1-rose Pink": "61ELLSvqOFL",
    "1-blue": "61pebj3UJpL",
    "1-champagne": "61sExdw12KL",
    "1-gold": "61+yGOtVkqL",
    "1-white": "51SRBMAwNSL",
    "1-mint Green": "61OQGpW01OL",
    "1-brick Brown": "61PDOeSoo+L",
    "1-lake Blue": "61rVSz7LqaL",
    "1-hot Pink": "61r3covc1VL",
    "1-orange": "61ZuorlDDWL",
    "1-green": "51bl47YbRPL"
  },
  "color_images": {
    "1-royal Blue": [
      "https://m.media-amazon.com/images/I/61lZRtkwooL._SL1500_.jpg"
    ],
    "1-mustard Green": [
      "https://m.media-amazon.com/images/I/61CY0d1vO9L._SL1500_.jpg"
    ],
    "1-green-christmas": [
      "https://m.media-amazon.com/images/I/71L-ZZXSi+L._SL1500_.jpg"
    ],
    "1-silver Gray": [
      "https://m.media-amazon.com/images/I/61fuzTm6BQL._SL1500_.jpg"
    ],
    "1-navy Blue": [
      "https://m.media-amazon.com/images/I/61D-Ks1sO2L._SL1500_.jpg"
    ],
    "1-brown": [
      "https://m.media-amazon.com/images/I/61SvGyGk0VL._SL1500_.jpg"
    ],
    "1-purple Red": [
      "https://m.media-amazon.com/images/I/61X7Zk5SuZL._SL1500_.jpg"
    ],
    "1-army Green": [
      "https://m.media-amazon.com/images/I/61UXd0xfdbL._SL1500_.jpg"
    ],
    "Red": [
      "https://m.media-amazon.com/images/I/61VFjyh22OL._SL1500_.jpg"
    ],
    "1-black": [
      "https://m.media-amazon.com/images/I/611o2TsPNwL._SL1500_.jpg"
    ],
    "Pink-f": [
      "https://m.media-amazon.com/images/I/61Vd8ed2n2L._SL1500_.jpg"
    ],
    "1-red-christmas": [
      "https://m.media-amazon.com/images/I/71ttZ8I-6FL._SL1500_.jpg"
    ],
    "1-rose Pink": [
      "https://m.media-amazon.com/images/I/61ELLSvqOFL._SL1500_.jpg"
    ],
    "1-blue": [
      "https://m.media-amazon.com/images/I/61pebj3UJpL._SL1500_.jpg"
    ],
    "1-champagne": [
      "https://m.media-amazon.com/images/I/61sExdw12KL._SL1500_.jpg"
    ],
    "1-gold": [
      "https://m.media-amazon.com/images/I/61+yGOtVkqL._SL1500_.jpg"
    ],
    "1-white": [
      "https://m.media-amazon.com/images/I/51SRBMAwNSL._SL1500_.jpg"
    ],
    "1-mint Green": [
      "https://m.media-amazon.com/images/I/61OQGpW01OL._SL1500_.jpg"
    ],
    "1-brick Brown": [
      "https://m.media-amazon.com/images/I/61PDOeSoo+L._SL1500_.jpg"
    ],
    "1-lake Blue": [
      "https://m.media-amazon.com/images/I/61rVSz7LqaL._SL1500_.jpg"
    ],
    "1-hot Pink": [
      "https://m.media-amazon.com/images/I/61r3covc1VL._SL1500_.jpg"
    ],
    "1-orange": [
      "https://m.media-amazon.com/images/I/61ZuorlDDWL._SL1500_.jpg"
    ],
    "1-green": [
      "https://m.media-amazon.com/images/I/51bl47YbRPL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 44.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/81+PWHqLTjL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-bodycon-sleeveless-cocktail-ruched-v-neck",
      "title": "Womens Dress Bodycon Sleeveless Cocktail Ruched V Neck",
      "price": 56.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61vGL0kNJYL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-long-sleeve-ruched",
      "title": "Womens Maxi Dress Bodycon Long Sleeve Ruched",
      "price": 48.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61GxtvdkbCL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-bodycon",
      "title": "Womens Dress Bodycon",
      "price": 44.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71f2SHW7r3L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-long-sleeve-ruched-cocktail-off-shoulder-bodycon",
      "title": "Womens Maxi Dress Formal Long Sleeve Ruched Cocktail Off Shoulder Bodycon",
      "price": 46.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71xihJgY9BL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-bodycon-ruched-long-sleeve",
      "title": "Womens Maxi Dress Bodycon Ruched Long Sleeve",
      "price": 24.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61qiT1BxzSL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-cocktail-formal-off-shoulder",
      "title": "Womens Maxi Dress Evening Cocktail Formal Off Shoulder",
      "price": 115.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/81sAnoK5v1L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-mermaid-evening-formal",
      "title": "Womens Maxi Dress Mermaid Evening Formal",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71r8V4721qL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 155.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61Oyv4QLL-L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail-short-sleeve",
      "title": "Womens Dress Cocktail Short Sleeve",
      "price": 36.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/51VJVq72XsL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-v-neck-formal-long-sleeve",
      "title": "Womens Maxi Dress V Neck Formal Long Sleeve",
      "price": 84.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51LKzkO+MDL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-formal-evening",
      "title": "Womens Maxi Dress Maxi Formal Evening",
      "price": 52.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61NaRoByawL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-maxi",
      "title": "Womens Maxi Dress Long Sleeve Maxi",
      "price": 29.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/614-6WTFsKL._SL1500_.jpg"
      ]
    }
  ]
}