{
  "id": "womens-maxi-dress-maxi-evening",
  "handle": "womens-maxi-dress-maxi-evening",
  "sku": "JC1133",
  "asin": "B09S5ZW5MV",
  "title": "Womens Maxi Dress Maxi Evening",
  "title_original": "BABEYOND Women's Flapper Dress 1920s V-Neck Evening Gown Sequin Beaded Maxi Dress for Wedding Black Gold",
  "brand": "Visit the BABEYOND Store",
  "price": 89.99,
  "social_proof": {
    "bought_past_month": 117,
    "text": "117+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/71L6G0c3luL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81XwgRsG2bL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81DcnlP3jcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81d35IJB-lL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/A1iQ7xtsAwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81KUsOfvERL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81B3o1+5D-L._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/71L6G0c3luL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81XwgRsG2bL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81DcnlP3jcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81d35IJB-lL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/A1iQ7xtsAwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81KUsOfvERL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81B3o1+5D-L._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ May 21, 2024",
    "ASIN ‏": "‎ B0D4QRXLCZ",
    "Best Sellers Rank": "#67,623 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #2,374 in Women's Dresses",
    "Customer Reviews": "4.6 4.6 out of 5 stars (408)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Black Gold",
      "Black Silver"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.6,
    "count": 408,
    "customers_say": "Customers find the dress beautiful and well-made, with one noting the sequins are stitched on well. The dress is flattering with a slimming design, comfortable, and customers consider it good value for money. The fit receives mixed feedback - while some say it's perfect, others find it too long for short people. The sizing is also mixed, with some finding it true to size while others say it runs a little big. Generated from the text of customer reviews Select to learn more Quality (81) Build quality (33) Dress fit (14) Value for money (13) Flattering (12) Comfort (10) Fit (59) Size (11) 81 customers mention quality, 79 positive, 2 negative 81 customers mention \"Quality\" 79 positive 2 negative Customers find the dress beautiful and of good quality, with one customer noting it's nice enough for formal occasions and another mentioning it looks authentic as a 1920s costume. \" ...The material with all the sequence which is beautiful … has a heavy weight to it ….it is stretchy also, so it pulls the dress down a little.. I... \" Read more \" ...When I purchased it I didn’t think it would be that great. It is a beautiful dress . The quality is excellent! Love all the bead work. \" Read more \" It's gorgeous and as pictured. Wore it for my work holiday party and I was the talk of the room. I usually wear medium, got a large and it was perfect \" Read more \" Such good quality and got so many compliments all night! Very comfortable and flattering! I did have to size up one size but worth it! \" Read more 33 customers mention build quality, 31 positive, 2 negative 33 customers mention \"Build quality\" 31 positive 2 negative Customers find the dress beautifully made and perfect, with one customer noting that the sequins are stitched on well. \" This is a well made and beautiful theme dress, I'm 5'4 and even with 3inch heels the dress drug on the ground, overall well made and very beautiful. \" Read more \" Perfect . Got many compliments. I'm 5'8 and 175 lbs and large fits well. \" Read more \" This dress was even more beautiful than expected. It was also very well made . I will definitely buy from this company again. \" Read more \" Yes its cheap quality but the beads fell off, and had a strange smell from the fabric. \" Read more 14 customers mention dress fit, 14 positive, 0 negative 14 customers mention \"Dress fit\" 14 positive 0 negative Customers are satisfied with how the dress fits for events, with multiple customers noting it's perfect for their events, and one mentioning it was used for a 1920s mystery dinner party. \" Perfect for the 1920’s mystery dinner event. So well made and fun ! \" Read more \" ... Still wearable , just showed more cleavage then I wished \" Read more \" It was perfect for my event . Great quality and xs fit perfectly! \" Read more \" Won best dressed at a murder mystery party ! Love the longer length and design especially for my 2 months postpartum body.... \" Read more 13 customers mention value for money, 12 positive, 1 negative 13 customers mention \"Value for money\" 12 positive 1 negative Customers find the dress to be a great value for the money. \" Great value for the money . I received a lot of compliments on it. It fit comfortably and true to size. I ordered a small and medium.... \" Read more \" ...Is a stunning dress for the price . Well made and was easy to hem by simply cutting off layers of fringe. I ordered one size up.... \" Read more \" ...I felt festive and elegant. Great value although I did need to spend money on a professional hem. I am 5 ft 1, 143 pounds, size XL \" Read more \" ...And such a good price . The beading is beautiful and the fringe is so fun. Great purchase. \" Read more 12 customers mention flattering, 9 positive, 3 negative 12 customers mention \"Flattering\" 9 positive 3 negative Customers find the dress flattering, particularly noting that its slimming design enhances the female body. \" Oh my gosh, this dress is so cute, flattering and comfortable. I bought it as the last minute for a gala and it was perfect! And such a good price.... \" Read more \" Great fit looks very flattering and although beaded still light. I am 5,8” and without heels it would be too long. Easy to hem tho. \" Read more \" ...It was not flattering like in the stock images, especially when you weren’t moving and the tassels were just hanging straight and flat like a big... \" Read more \" ...dress doesn't fit too tightly around my curves and is actually quite flattering . BABEYOND makes beautiful and quality garments. I LOVE their items. \" Read more 10 customers mention comfort, 10 positive, 0 negative 10 customers mention \"Comfort\" 10 positive 0 negative Customers find the dress comfortable, with one mentioning it's not itchy at all. \" Oh my gosh, this dress is so cute, flattering and comfortable . I bought it as the last minute for a gala and it was perfect! And such a good price.... \" Read more \" Such good quality and got so many compliments all night! Very comfortable and flattering! I did have to size up one size but worth it! \" Read more \" ... Not itchy at all , beads were well attached and beautiful colors, zipper was well disguised and worked well.... \" Read more \" ...She absolutely loved it and was comfortable to wear . She got complements from everyone.... \" Read more 59 customers mention fit, 36 positive, 23 negative 59 customers mention \"Fit\" 36 positive 23 negative Customers have mixed opinions about the dress's fit, with some finding it perfect and noting it looks good on top and waist, while others mention it runs large on top and waist and is too long for short people. \" I was pleasantly surprised at how nice this dress is. It fit perfectly , and the quality was great, especially considering how affordable it was.... \" Read more \" Definitely value and so beautiful but too long , even with high heals. Didn't want to mess with the hemline as I was afraid of ruining the dress.... \" Read more \" ...It is beautiful. Perfect fit and lovely material made well. Perfectly happy with the dress \" Read more \" This dress is gorgeous. Fits perfect . I am a size 4, 135 and 5’6. I bought a small and it is perfect.... \" Read more 11 customers mention size, 4 positive, 7 negative 11 customers mention \"Size\" 4 positive 7 negative Customers have mixed opinions about the dress size, with some finding it true to size while others report that it runs a little big. \" ...off the size guide (I normally buy L and M in any brand), and the dress is huge ! My measurements are Bust 40-41ish\", waist 34\".... \" Read more \" ...I received a lot of compliments on it. It fit comfortably and true to size . I ordered a small and medium.... \" Read more \" Gorgeous and nice quality, but had to return, because the dress runs too large \" Read more \" ...The Medium was too big for me . The fitting of the dress it’s not as shown in the pictures. It has no good form specially in the waist area.... \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Buy it!",
        "body": "Absolutely stunning dress! It’s beautifully made, has a nice weight to it, and the beading is gorgeous. I’m 5’4”, 138 lbs, and a 32G, and the fit was incredibly flattering. I wore it to a Roaring 20’s party and got so many compliments. The quality is so good you could easily wear it to a gala or any elegant evening event. Read more",
        "author": "Siún",
        "rating": 5.0,
        "date": "December 3, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71LO6DXuz0L._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/61EmJP-ciGL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71Odl2eyeLL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Gorgeous 1920’s flapper/art deco gown.",
        "body": "This dress is stunning. The beading was on securely. The back zipper worked well, the length was perfect for my height of 5’8”. The model in the photo is probably about 5’7”, as it was about an inch shorter on me. The black slip went a bit above my ankles, but the beaded layer went to my feet but did not touch the floor. A shorter person could easily trim off a few inches of the beaded layer as the beading is sparse near the hem. The size chart was accurate for me- I ordered a Small (what it said would fit me) and it fit perfectly. For reference, I’m 5’8 and around 116 lbs It had a bit of stretch/give in the fit but I would not say it was stretchy. It is also not too heavyweight compared with other beaded dresses I own. I did not want the fringe on the sleeves, and was able to carefully cut it off with no damage to the rest of the sleeve. You could also easily cut off the entire sleeve if you wanted a sleeveless look- just ask someone who is used to working with tulle if you don’t know how to do that. This dress offers so many options for personalization. This dress was very elegant, comfortable, modest, and a nice alternative to the traditional, shorter flapper dresses out there. I received many, many compliments on the dress. Read more",
        "author": "Mom of Six",
        "rating": 5.0,
        "date": "August 3, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars LOVE This Dress!!",
        "body": "I absolutely LOVE this dress! It is well made and a great 1920s costume! I got so many compliments at the party I went to last night. The dress does run big so I fit perfectly into a medium when I thought a large was my size. I love this brand! Read more",
        "author": "Michelle Grenier",
        "rating": 5.0,
        "date": "November 2, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/81t33r9OFIL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Grateful Gala Gown",
        "body": "So many compliments on this sequined gown! The gown was very comfortable and the sequins were secure! No litter. I wore this gown to a gala celebration of community theater. It was dramatic. Still, I did not feel like I was wearing a costume. I felt festive and elegant. Great value although I did need to spend money on a professional hem. I am 5 ft 1, 143 pounds, size XL Read more",
        "author": "Customer",
        "rating": 5.0,
        "date": "November 20, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71YD3yQTkeL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71ptw95SepL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71VHlcpjksL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Well made and Beautiful",
        "body": "Well made and beautiful. Too long for this short person, but looks like it could be trimmed easy. Once I get shoes I will know better. The zipper is installed so well, barley know it has a zipper. Fit perfect. My measurements put me on the border of a med or large. After reading reviews, I chose the Medium and it fits perfect. I can't wait to wear to the fundraiser next month. Read more",
        "author": "Sue G",
        "rating": 5.0,
        "date": "May 27, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Not quite perfect",
        "body": "Gorgeous and nice quality, but had to return, because the dress runs too large Read more",
        "author": "Kelly",
        "rating": 4.0,
        "date": "December 22, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Beautiful, quality dress",
        "body": "I received many compliments on this dress at my event. Good quality. Good fit. Read more",
        "author": "Barbara Hisaw",
        "rating": 5.0,
        "date": "November 12, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71TkTmr1rwL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "3.0 out of 5 stars Pretty but damaged",
        "body": "Arrived with top layer of fringe ripped off, remainder of dress appeared fine but for $95 I would expect better quality control. Read more",
        "author": "Brendon A Ball",
        "rating": 3.0,
        "date": "December 11, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71zCegaeQ8L._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71vKFF0I8RL._SY88._SL1500_.jpg"
        ]
      }
    ]
  },
  "short_description": "Womens Maxi Dress Maxi Evening is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.",
  "about_this_item": "Womens Maxi Dress Maxi Evening is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.",
  "long_description": "Womens Maxi Dress Maxi Evening is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Black Gold, Black Silver. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Maxi Evening is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Black Gold, Black Silver. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "48dde83c-82f0-4aef-8428-a2ff8287ddcf",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/48dde83c-82f0-4aef-8428-a2ff8287ddcf/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/48dde83c-82f0-4aef-8428-a2ff8287ddcf/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/268fee11-80af-4c9c-ba18-68943b87e2bb.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "33bcea02-987d-4ed4-980e-9fdf58bced34",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/33bcea02-987d-4ed4-980e-9fdf58bced34/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/33bcea02-987d-4ed4-980e-9fdf58bced34/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/268fee11-80af-4c9c-ba18-68943b87e2bb.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Black Gold": "https://m.media-amazon.com/images/I/41imP3gR3tL._AC_SR38,50_.jpg",
    "Black Silver": "https://m.media-amazon.com/images/I/31FMuTYRQLL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Black Gold": "81B3o1+5D-L",
    "Black Silver": "71L6G0c3luL"
  },
  "color_images": {
    "Black Gold": [
      "https://m.media-amazon.com/images/I/81B3o1+5D-L._SL1500_.jpg"
    ],
    "Black Silver": [
      "https://m.media-amazon.com/images/I/71L6G0c3luL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-one-shoulder-evening-formal",
      "title": "Womens Maxi Dress One Shoulder Evening Formal",
      "price": 74.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61c-8Xfw+kL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail-bodycon",
      "title": "Womens Dress Cocktail Bodycon",
      "price": 19.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61FdFV4n0pL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-mermaid-off-shoulder",
      "title": "Womens Dress Mermaid Off Shoulder",
      "price": 149.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61zhlGIMyGL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/617237ojq1L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-sleeveless-formal",
      "title": "Womens Maxi Dress Maxi Sleeveless Formal",
      "price": 39.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51PiRCrEpPL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-long-sleeve-v-neck",
      "title": "Womens Maxi Dress Long Sleeve V Neck",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61-9zlDwyDL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-ruched-long-sleeve",
      "title": "Womens Maxi Dress Maxi Ruched Long Sleeve",
      "price": 54.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71jybg4ZruL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 47.49,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71Rc0Nk4IdL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 32.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61PAMnsaq3L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 389.55,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/717dKlwUK-L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail-bodycon",
      "title": "Womens Dress Cocktail Bodycon",
      "price": 19.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61FdFV4n0pL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-mermaid-long-sleeve",
      "title": "Womens Maxi Dress Mermaid Long Sleeve",
      "price": 128.89,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51SrkBETNNL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 62.49,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71Qz-wZTPSL._SL1500_.jpg"
      ]
    }
  ]
}