{
  "id": "womens-dress-bodycon-ruched",
  "handle": "womens-dress-bodycon-ruched",
  "sku": "JC1199",
  "asin": "B09YD4BW1Z",
  "title": "Womens Dress Bodycon Ruched",
  "title_original": "BORIFLORS Women's Sexy Club Bodycon Cut Out Halter Backless Ruched Mini Party Dresses",
  "brand": "Visit the BORIFLORS Store",
  "price": 25.99,
  "social_proof": {
    "bought_past_month": 406,
    "text": "406+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/61ZYZ+lXaKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/618DpT-Ra3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ubr9QMW8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71zML-V3UWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71hw07GRF9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/611eaqhBUfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61mUtSxuQlL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61HQR3seNjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61aDfdc8PIL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71hVy5SBmZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61G12H8dyRL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61PEdtcH7BL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/61ZYZ+lXaKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/618DpT-Ra3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ubr9QMW8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71zML-V3UWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71hw07GRF9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/611eaqhBUfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61mUtSxuQlL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61HQR3seNjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61aDfdc8PIL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71hVy5SBmZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61G12H8dyRL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61PEdtcH7BL._SL1500_.jpg"
  ],
  "aplus_images": [
    "https://m.media-amazon.com/images/I/41NX2SfKVsL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41j4lrh0E6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41mbKEZB9NL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41T9rmO%2BWHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41Z4z4pSoKS._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41t9Ouijz8S._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41KgMdgJ%2BsS._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41Hz4mxz4MS._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41I69rJDfGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41uPTMGr8KL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41jpngKziyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41vKZ68b8zL._SL1500_.jpg"
  ],
  "description_images": [
    "https://m.media-amazon.com/images/I/41NX2SfKVsL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41j4lrh0E6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41mbKEZB9NL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41T9rmO%2BWHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41Z4z4pSoKS._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41t9Ouijz8S._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41KgMdgJ%2BsS._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41Hz4mxz4MS._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41I69rJDfGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41uPTMGr8KL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41jpngKziyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41vKZ68b8zL._SL1500_.jpg"
  ],
  "bullets": [],
  "specs": {
    "Item model number ‏": "‎ BF547",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ April 20, 2022",
    "ASIN ‏": "‎ B09YCWTTZ3",
    "Best Sellers Rank": "#53,281 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #280 in Women's Club & Night Out Dresses",
    "Customer Reviews": "4.3 4.3 out of 5 stars (980)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Red",
      "Pink",
      "White",
      "Purple",
      "Rose",
      "Royal Blue",
      "Black",
      "Orange"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.3,
    "count": 980,
    "customers_say": "Customers find the dress sexy and flattering, with one noting it looks fantastic with straps parallel or crisscrossed, and another mentioning how it hugs all the right spots. The dress offers a great fit, comfort, and stretchiness, with one customer noting it's relatively forgiving for trouble spots. The fabric quality and sheerness receive mixed feedback - while some say it's good and not see-through, others find it visibly cheap and incredibly see-through. Generated from the text of customer reviews Select to learn more Sexy (67) Fit (51) Quality (43) Comfort (24) Flattering (24) Stretchiness (19) Fabric quality (21) Sheerness (19) 67 customers mention sexy, 63 positive, 4 negative 67 customers mention \"Sexy\" 63 positive 4 negative Customers find the dress sexy and pretty, with one mentioning it looks fantastic when the straps are parallel or crisscrossed, though some find it looks cheap. \" Surprising quality for what you pay. Sexy and relatively forgiving for those trouble spots you’re worried about. \" Read more \" This dress is very sexy ! I bought it in fuchsia and got so many compliments when I wore it to a club.... \" Read more \" ...It hugs all the right spots. It’s super sexy and with a matching pair of black heels it’s a knockout.... \" Read more \" ...was my body i was looking at the first time i tried it on and its so sexy ! \" Read more 51 customers mention fit, 45 positive, 6 negative 51 customers mention \"Fit\" 45 positive 6 negative Customers like how the dress fits, with one mentioning it accommodates a larger chest and another noting it pairs well with tights or stockings. \" ...It turned out to be a perfect fit . My wife is 5'-7\", large chested, and has a muscular build.... \" Read more \" Dress is thick enough to not be see through. Fits perfectly and looks hot! \" Read more \" The dress is very flattering! I’m 5’3”, 130lbs, 32DDDD and a small fit perfectly . I also ordered it in another color. Very stretchy. \" Read more \" ...It’s not see through it’s really stretchy so fits true to size . It will hug all your curves ladies. Must have!! ❤️ MzTU \" Read more 43 customers mention quality, 36 positive, 7 negative 43 customers mention \"Quality\" 36 positive 7 negative Customers have mixed opinions about the dress's quality, with some praising it as an amazing little black dress while others find it terribly made and cheaply constructed. \" Great dress !... \" Read more \" 5 5,160lb Lovely dress ! I have a bigger shoulder and long torso. L fits me well. Does ride up when walking.... \" Read more \" Fits perfectly and well made , looks how it does in the picture!... \" Read more \" I normally don’t write reviews, but this dress is such good quality for being so cheap.... \" Read more 24 customers mention comfort, 21 positive, 3 negative 24 customers mention \"Comfort\" 21 positive 3 negative Customers find the dress comfortable, with one mentioning it's not too tight across the top and another noting it's relatively forgiving for trouble spots. \" ...either is just as supportive as the other, and both ways are comfortable . The dress has a little bit of stretch, but not a lot.... \" Read more \" I got this as a gift, I tried it on so far and it fit well and was comfy … super excited to wear out! \" Read more \" ...It is not see through at all, very comfortable , and looks fantastic with the straps parallel or crisscrossed (pictures both ways are attached).... \" Read more \" ...The side boob is a little risky, without boob tape. But it’s a very comfortable dress . I love it. \" Read more 24 customers mention flattering, 23 positive, 1 negative 24 customers mention \"Flattering\" 23 positive 1 negative Customers find the dress flattering, noting that it hugs all the right spots and holds the tummy in. \" The dress is very flattering ! I’m 5’3”, 130lbs, 32DDDD and a small fit perfectly. I also ordered it in another color. Very stretchy. \" Read more \" ...to Miami for my bachelorette and needed something sexy, white, and flattering .... \" Read more \" This dress fits so good and is super flattering , I got a medium. And I prefer not to cross the straps at the top. Must have! You won’t regret it \" Read more \" 5 stars all the stars would recommend. This dress is awesome! Its so flattering so a couple notes im wearing a halter plunge bra and i used double... \" Read more 19 customers mention stretchiness, 15 positive, 4 negative 19 customers mention \"Stretchiness\" 15 positive 4 negative Customers like the dress's stretchiness, with one mentioning it is soft and durable. \" Looked as pictured, soft material, stretchy . Works well with leggings, tights or stockings. Bright beautiful red color. I absolutely love it \" Read more \" I wore this for a night out on my birthday and it was worth it! its super stretchy , im 5’9 and i could’ve probably gone a size down cause of how big... \" Read more \" ...Fit great. I’m 5’2 103 lbs and a small fit perfect. Dress has a lot of stretch . \" Read more \" It's very stretchy and runs a little large. no need to size up if your a curvy woman or have a large chest.... \" Read more 21 customers mention fabric quality, 13 positive, 8 negative 21 customers mention \"Fabric quality\" 13 positive 8 negative Customers have mixed opinions about the fabric quality of the dress, with some finding it good while others describe it as visibly cheap. \" It's cheap, and the fabric is good . I recommend it. \" Read more \" Absolutely cheap material and junk. It’s see through not sewed good. Bad quality really uneven. The color was off does not have the padding in it.... \" Read more \" ... Material was very nice ! \" Read more \" ...The fabric was of good quality and not see-through, but the tying mechanism didn't provide adequate support for the bust area, which was a drawback. \" Read more 19 customers mention sheerness, 13 positive, 6 negative 19 customers mention \"Sheerness\" 13 positive 6 negative Customers have mixed opinions about the dress's sheerness, with some finding it not see-through, while others report it being incredibly see-through. \" ...It’s not see through it’s really stretchy so fits true to size. It will hug all your curves ladies. Must have!! ❤️ MzTU \" Read more \" ...It is not see through at all , very comfortable, and looks fantastic with the straps parallel or crisscrossed (pictures both ways are attached).... \" Read more \" Sexy- but too sheer to wear outside of \"lifestyle\" type scenarios or staying in date nights ;)... \" Read more \" ...The fabric was of good quality and not see-through , but the tying mechanism didn't provide adequate support for the bust area, which was a drawback. \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Super Sexy and hot",
        "body": "This dress is actually insane. It fit like a glove and had me feeling so hot. The cutouts and halter detail are chef’s kiss. Super comfy and not see-through at all. Got a ton of compliments, 100% would wear again, and will probably order one in black. Read more",
        "author": "Angela",
        "rating": 5.0,
        "date": "September 14, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars So hot!",
        "body": "Fits perfectly and well made, looks how it does in the picture! I couldnt even believe that was my body i was looking at the first time i tried it on and its so sexy! Read more",
        "author": "Kimberly Zoe",
        "rating": 5.0,
        "date": "September 9, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Perfect Fit Order your Normal size",
        "body": "So Beautiful on Read more",
        "author": "Chevy",
        "rating": 5.0,
        "date": "November 15, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71gSE7Nk-lL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Big Confidence Boost in a Tiny Dress",
        "body": "This is such a cute, sexy dress. For the price, I'm surprised by the quality. I'm 5'5\" and weigh 125 lbs. I got a small and it fit just right. I felt so confident in this dress and got a lot of compliments. Read more",
        "author": "Keith Johnson",
        "rating": 5.0,
        "date": "August 30, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61Y2iJMImHL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "4.0 out of 5 stars Figure Flattering and Soft",
        "body": "This dress is pretty good so long as you're not expecting quality fabric (the fabric matches the price). I am 5'6\", 155lbs, and I ordered a medium. I bought it for a girls trip to Vegas with plans to wear it clubbing and I think it'd be perfect for that sort of thing. I'm in my early 30's so everything's not as perky as it once was but the way this dress is designed it actually held everything up and together without a bra better than expected. The fabric is fairly thin but it's soft and not see-through. Read more",
        "author": "Kimberly C.",
        "rating": 4.0,
        "date": "November 15, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71Htp+GCl7L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "1.0 out of 5 stars Don’t buy junk !!",
        "body": "Absolutely cheap material and junk. It’s see through not sewed good. Bad quality really uneven. The color was off does not have the padding in it. Not what’s in the picture at all. Medical part half broke when it came. If I could give it zero I would. No support whatsoever. Don’t waste ur money . It’s junk. Read more",
        "author": "Emily",
        "rating": 1.0,
        "date": "November 6, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Just as Pirctured! A Very Flattering Dress!",
        "body": "We were a little nervous about ordering this dress is a Medium, which per the description is her size. It turned out to be a perfect fit. My wife is 5'-7\", large chested, and has a muscular build. She is currently down to about 150 lbs in prep for a competition. The dress is very stretchy and conformed to her dimensions perfectly. It is not see through at all, very comfortable, and looks fantastic with the straps parallel or crisscrossed (pictures both ways are attached). Take a chance on this one, you won't regret it. EDIT: Bought another one in white and she likes this one even more. It turned a lot of heads that night! This is a must buy. Read more",
        "author": "Steve R.",
        "rating": 5.0,
        "date": "June 28, 2024",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71lNy7gI2nL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71kdPo2D74L._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71dJfFFobZL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71z+gSSZhML._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "3.0 out of 5 stars Looks cheap",
        "body": "Looks cheap Read more",
        "author": "E",
        "rating": 3.0,
        "date": "November 11, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Dress Bodycon Ruched is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.",
  "about_this_item": "Womens Dress Bodycon Ruched is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.",
  "long_description": "Womens Dress Bodycon Ruched is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Red, Pink, White, Purple, Rose, Royal Blue, Black, Orange. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Dress Bodycon Ruched is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/41NX2SfKVsL._SL1500_.jpg",
      "alt": "Womens Dress Bodycon Ruched details image 1"
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/41j4lrh0E6L._SL1500_.jpg",
      "alt": "Womens Dress Bodycon Ruched details image 2"
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/41mbKEZB9NL._SL1500_.jpg",
      "alt": "Womens Dress Bodycon Ruched details image 3"
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/41T9rmO%2BWHL._SL1500_.jpg",
      "alt": "Womens Dress Bodycon Ruched details image 4"
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Red, Pink, White, Purple, Rose, Royal Blue, Black, Orange. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/41Z4z4pSoKS._SL1500_.jpg",
      "alt": "Womens Dress Bodycon Ruched details image 5"
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "726d6861-d364-4c06-90e5-22758ee50f8c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/726d6861-d364-4c06-90e5-22758ee50f8c/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/726d6861-d364-4c06-90e5-22758ee50f8c/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/7a8b0997-510a-45fc-92a1-56282ac21f08.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "748b84a7-a345-4195-9d78-e19d44432d49",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/748b84a7-a345-4195-9d78-e19d44432d49/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/748b84a7-a345-4195-9d78-e19d44432d49/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/7a8b0997-510a-45fc-92a1-56282ac21f08.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "89b499e3-d9b1-4f95-b31e-ae66e48aac35",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/89b499e3-d9b1-4f95-b31e-ae66e48aac35/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/89b499e3-d9b1-4f95-b31e-ae66e48aac35/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/7a8b0997-510a-45fc-92a1-56282ac21f08.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "5cdbbc93-ed20-4cf0-817e-a950b4d0a16f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5cdbbc93-ed20-4cf0-817e-a950b4d0a16f/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5cdbbc93-ed20-4cf0-817e-a950b4d0a16f/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/7a8b0997-510a-45fc-92a1-56282ac21f08.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "9ab044f0-b0f4-4040-9024-6e378ba71821",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9ab044f0-b0f4-4040-9024-6e378ba71821/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9ab044f0-b0f4-4040-9024-6e378ba71821/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/7a8b0997-510a-45fc-92a1-56282ac21f08.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "3403ecc0-9401-4741-a59d-2720c067ff50",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3403ecc0-9401-4741-a59d-2720c067ff50/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3403ecc0-9401-4741-a59d-2720c067ff50/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/7a8b0997-510a-45fc-92a1-56282ac21f08.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "1954e4e4-c99c-4d21-bc38-37667fe97b39",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1954e4e4-c99c-4d21-bc38-37667fe97b39/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1954e4e4-c99c-4d21-bc38-37667fe97b39/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/7a8b0997-510a-45fc-92a1-56282ac21f08.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "229a0639-f28d-4679-8858-e989be8c857f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/229a0639-f28d-4679-8858-e989be8c857f/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/229a0639-f28d-4679-8858-e989be8c857f/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/7a8b0997-510a-45fc-92a1-56282ac21f08.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "87699a22-cc7e-4d0b-b4d6-46a96a8b3d98",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/87699a22-cc7e-4d0b-b4d6-46a96a8b3d98/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/87699a22-cc7e-4d0b-b4d6-46a96a8b3d98/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/7a8b0997-510a-45fc-92a1-56282ac21f08.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "b955254e-4db4-4be4-af8f-6e5b5cbf93b1",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b955254e-4db4-4be4-af8f-6e5b5cbf93b1/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b955254e-4db4-4be4-af8f-6e5b5cbf93b1/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/7a8b0997-510a-45fc-92a1-56282ac21f08.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "6fd473ac-c406-4911-a454-974b6c8000f1",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6fd473ac-c406-4911-a454-974b6c8000f1/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6fd473ac-c406-4911-a454-974b6c8000f1/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/7a8b0997-510a-45fc-92a1-56282ac21f08.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "7e42c75d-2f64-405f-95c2-37b37a611d3d",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7e42c75d-2f64-405f-95c2-37b37a611d3d/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7e42c75d-2f64-405f-95c2-37b37a611d3d/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/7a8b0997-510a-45fc-92a1-56282ac21f08.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Red": "https://m.media-amazon.com/images/I/41T9rmO+WHL._AC_SR38,50_.jpg",
    "Pink": "https://m.media-amazon.com/images/I/41j4lrh0E6L._AC_SR38,50_.jpg",
    "White": "https://m.media-amazon.com/images/I/41LxKjUI0NL._AC_SR38,50_.jpg",
    "Purple": "https://m.media-amazon.com/images/I/41mbKEZB9NL._AC_SR38,50_.jpg",
    "Rose": "https://m.media-amazon.com/images/I/41Qj4PE0pJL._AC_SR38,50_.jpg",
    "Royal Blue": "https://m.media-amazon.com/images/I/41KCAAHtXVL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/41NX2SfKVsL._AC_SR38,50_.jpg",
    "Orange": "https://m.media-amazon.com/images/I/41D5BnHlTgL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Red": "611eaqhBUfL",
    "Pink": "61mUtSxuQlL",
    "White": "61HQR3seNjL",
    "Purple": "61aDfdc8PIL",
    "Rose": "71hVy5SBmZL",
    "Royal Blue": "61G12H8dyRL",
    "Black": "61ZYZ+lXaKL",
    "Orange": "61PEdtcH7BL"
  },
  "color_images": {
    "Red": [
      "https://m.media-amazon.com/images/I/611eaqhBUfL._SL1500_.jpg"
    ],
    "Pink": [
      "https://m.media-amazon.com/images/I/61mUtSxuQlL._SL1500_.jpg"
    ],
    "White": [
      "https://m.media-amazon.com/images/I/61HQR3seNjL._SL1500_.jpg"
    ],
    "Purple": [
      "https://m.media-amazon.com/images/I/61aDfdc8PIL._SL1500_.jpg"
    ],
    "Rose": [
      "https://m.media-amazon.com/images/I/71hVy5SBmZL._SL1500_.jpg"
    ],
    "Royal Blue": [
      "https://m.media-amazon.com/images/I/61G12H8dyRL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/61ZYZ+lXaKL._SL1500_.jpg"
    ],
    "Orange": [
      "https://m.media-amazon.com/images/I/61PEdtcH7BL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-long-sleeve-mermaid-formal",
      "title": "Womens Maxi Dress Long Sleeve Mermaid Formal",
      "price": 80.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/4144TFf2-NL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-ruched-long-sleeve-bodycon-cocktail-off-shoulder-maxi",
      "title": "Womens Maxi Dress Ruched Long Sleeve Bodycon Cocktail Off Shoulder Maxi",
      "price": 52.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61Idn8rOrRL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-formal-evening",
      "title": "Womens Dress Formal Evening",
      "price": 79.95,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/615Qr4YN+tL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 61.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51VEsza1YAL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-formal-ruched",
      "title": "Womens Maxi Dress Evening Formal Ruched",
      "price": 67.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61XytRDkNbL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-maxi-long-sleeve-bodycon",
      "title": "Womens Maxi Dress Maxi Long Sleeve Bodycon",
      "price": 51.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/616jndkUHIL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-v-neck-formal-long-sleeve",
      "title": "Womens Maxi Dress Bodycon V Neck Formal Long Sleeve",
      "price": 74.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51DTjtOSU7L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-formal-evening",
      "title": "Womens Dress Formal Evening",
      "price": 74.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61Er9CvHl3L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-off-shoulder",
      "title": "Womens Maxi Dress Off Shoulder",
      "price": 145.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61vEt64A2DL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-ruched-bodycon-long-sleeve-cocktail-v-neck",
      "title": "Womens Maxi Dress Ruched Bodycon Long Sleeve Cocktail V Neck",
      "price": 48.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/51tgZkqvl9L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-evening-formal-v-neck",
      "title": "Womens Dress Evening Formal V Neck",
      "price": 70.89,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/41u6H0EcRlL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-jumpsuit-v-neck",
      "title": "Womens Jumpsuit V Neck",
      "price": 80.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/31udZ16+E8L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-maxi-bodycon",
      "title": "Womens Maxi Dress Long Sleeve Maxi Bodycon",
      "price": 41.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51u-03U0ZHL._SL1500_.jpg"
      ]
    }
  ]
}