{
  "id": "womens-maxi-dress-bodycon-long-sleeve-ruched-cocktail",
  "handle": "womens-maxi-dress-bodycon-long-sleeve-ruched-cocktail",
  "sku": "JC2801",
  "asin": "B09ZLJSPCL",
  "title": "Womens Maxi Dress Bodycon Long Sleeve Ruched Cocktail",
  "title_original": "Wenrine Women's Mesh Long Sleeve Square Neck Ruched Party Club Cocktail Bodycon Mini Dress",
  "brand": "Visit the Wenrine Store",
  "price": 36.99,
  "social_proof": {
    "bought_past_month": 277,
    "text": "277+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/6131pgbUc-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/617uo1LL94L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/718FGRZKQoL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61KWxAaq48L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91XnNaBdyCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61mYsXEEpXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/618v8O9svuL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61y+IP4KX7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61MzCBXgRzL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61KDDJOx+oL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/614dv3-v+hL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61jAktImdiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61JoQr5dLpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/614uSoDTIML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61mSSMdjt7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61PccaKLWiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/6110Hsatd5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51fHkFyd1PL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61PcJAFFGaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Xj10ZIJeL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61XuiiVrh5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61VKhxob22L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61itEKeTAJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61++NF3mXLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61+BVilv36L._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/6131pgbUc-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/617uo1LL94L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/718FGRZKQoL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61KWxAaq48L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91XnNaBdyCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61mYsXEEpXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/618v8O9svuL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61y+IP4KX7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61MzCBXgRzL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61KDDJOx+oL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/614dv3-v+hL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61jAktImdiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61JoQr5dLpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/614uSoDTIML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61mSSMdjt7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61PccaKLWiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/6110Hsatd5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51fHkFyd1PL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61PcJAFFGaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Xj10ZIJeL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61XuiiVrh5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61VKhxob22L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61itEKeTAJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61++NF3mXLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61+BVilv36L._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Package Dimensions ‏": "‎ 6 x 3 x 0.2 inches; 3.2 ounces",
    "Item model number ‏": "‎ D5X157-1",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ November 20, 2024",
    "ASIN ‏": "‎ B0DNNDKD62",
    "Best Sellers Rank": "#8,588 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #40 in Women's Club & Night Out Dresses",
    "Customer Reviews": "4.4 4.4 out of 5 stars (3,194)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Brown",
      "Blue",
      "Army Green",
      "Black",
      "Coffee",
      "Navy Blue",
      "Light Blue",
      "Olive",
      "Red",
      "Rose Red",
      "Wine Red",
      "Khaki",
      "Pink",
      "White",
      "Watermelon Red",
      "Light Purple",
      "Deep Purple",
      "Green",
      "Light Grey",
      "Light Khaki",
      "Pink Orange"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.4,
    "count": 3194,
    "customers_say": "Customers find the dress comfortable, true to size, and well-made, with a flattering design that shows curves perfectly. The color receives positive feedback, with one customer noting it's not too pink like Barbie. The length and see-through nature receive mixed reviews - while some find the length great, others say it's too short, and while some find it not see-through at all, others describe it as super see-through. Generated from the text of customer reviews Select to learn more Fit (287) Style (275) Quality (132) Comfort (97) Flattering (71) Color (70) Length (84) See through (78) 287 customers mention fit, 238 positive, 49 negative 287 customers mention \"Fit\" 238 positive 49 negative Customers find that the dress fits true to size and is comfortable to wear. \" True to size , bought for a dance for my 14-year-old daughter who wanted to wear something much skimpier but she actually wound up being very happy... \" Read more \" \"I bought this dress for my daughter's party and it was the perfect fit . However, I noticed that it is a bit narrow, even though my daughter is thin.... \" Read more \" ...so it’s hard to find short dresses that aren’t to short but this fit perfectly ! Dress is stretchy with sheer sleeves ! It’s absolutely stunning on ! \" Read more \" Terrific color ! Great fit BUT it is very short in length - recommend for shorter ladies (I am 4’11”) \" Read more 275 customers mention style, 265 positive, 10 negative 275 customers mention \"Style\" 265 positive 10 negative Customers like the dress's style, describing it as cute and high quality, though some find it cheap looking. \" This is cute and fits as expected. got the white and am unable to wear it due to how see through it is. very disappointing.... \" Read more \" Unfortunately, it's deceptively unflattering, because it's a beautiful dress in the pics and a wonderful, light, stretchy fabric in person.... \" Read more \" This dress is so beautiful ! It is tight! I’m 5”2 115lbs I ordered a med and it was tight I had to buy spanks for the first time bc of my belly!... \" Read more \" Omg this dress was super cute , incredibly comfortable and looked super pretty on! Received many compliments !!! \" Read more 132 customers mention quality, 110 positive, 22 negative 132 customers mention \"Quality\" 110 positive 22 negative Customers find the dress to be well-made, though some report poor quality. \" good quality , can be worn as a short dress for a party OR church bc it is so stretchy and it can be streched lower on the legs as well so it can be... \" Read more \" ...I tried to pull it down but it didn't make it any better. It's a great dress but I'm going to look for better options.... \" Read more \" Bought for my daughter for her graduation pics. Such a perfect dress . So cute. Great quality. Love it! \" Read more \" Nice dress would not specifically recommend to a friend but of she said what do you think about this dress on me i would probably say its nice.... \" Read more 97 customers mention comfort, 96 positive, 1 negative 97 customers mention \"Comfort\" 96 positive 1 negative Customers find the dress comfortable, with one mentioning it's not itchy. \" ...And I don’t really have a big belly! Once on it is comfortable . The sleeves are very fragile and this is not a dress you can wash in a machine!!... \" Read more \" ...Height 5’1 & 129 lbs. Love it! Very comfortable . Felt lovely & looked appealing. Was able to keep it at mid-thigh without having to adjusted it.... \" Read more \" I LOVED this dress - so flattering and comfy . However, I was constantly pulling it down the entire night to keep myself from flashing everyone.... \" Read more \" Great quality and super comfortable . I am 5'7 and triple D. I didn't wear a bra with it and it was totally fine.... \" Read more 71 customers mention flattering, 67 positive, 4 negative 71 customers mention \"Flattering\" 67 positive 4 negative Customers find the dress flattering, showing their curves perfectly, with one customer noting it works well for any body type. \" This dress is incredibly comfy and very flattering . I am so excited to wear this dress. The dress is very form fitting and has some stretch to it.... \" Read more \" ...This one was in the top 2. The color was very pretty, it was overall flattering , but she didn’t love the neckline because it didn’t work with any of... \" Read more \" I LOVED this dress - so flattering and comfy. However, I was constantly pulling it down the entire night to keep myself from flashing everyone.... \" Read more \" Absolutely perfect fit all the way around!! Super flattering and lots of compliments during the event! Very comfortable too!... \" Read more 70 customers mention color, 62 positive, 8 negative 70 customers mention \"Color\" 62 positive 8 negative Customers like the dress's color, particularly noting that it's not too pink like Barbie, and one customer mentions it's a great black dress. \" Grabbed size small for my 8th graders graduation . She loves it. Beautiful color . Lightweight material; size small she's 5' 2 and 100 lbs \" Read more \" ...The color is beautiful , length is good, since it is ruched you can have it short or pulled down to knee length. Very classic look, great quality. \" Read more \" The quality, color and thickness was great for the price. Fit as expected using measurement recommendations. Great dress for the price. \" Read more \" ...Well, I absolutely LOVE this dress! Very flattering, great color , and the sleeves are gorgeous! Very soft, comfortable fit.... \" Read more 84 customers mention length, 49 positive, 35 negative 84 customers mention \"Length\" 49 positive 35 negative Customers have mixed opinions about the dress length, with some finding it great and above the knee, while others consider it too short. \" ...The entire dress and color was as is in picture. It was not too short . She didn’t have to pull it down all night. The sleeves were not too short.... \" Read more \" Too short , it stopped way too high up. Wasn’t appropriate for the event I intended to wear it at. \" Read more \" ...It is not sheer and is a perfect length . I am 5'9 and I did not find myself having to pull it down or that it was riding up at all.... \" Read more \" ...It was also very short , coming to about mid thigh on her. I’m going to reorder a large size and see if that fits because the sizing is way off. \" Read more 78 customers mention see through, 42 positive, 36 negative 78 customers mention \"See through\" 42 positive 36 negative Customers have mixed opinions about the dress's transparency, with some finding it not at all see-through while others describe it as super see-through. \" ...Received tons of compliments on it! Love the ruching and sheer sleeves . Excellent quality!... \" Read more \" ...It is nice looking but it was a little too short on me and was see through . It is mesh and there is only double mesh fabric. There is no lining \" Read more \" ...Your life will thank you for this. It’s not see through , it’s really pretty and comfortable. I bought 3 of these. Would recommend and buy again. \" Read more \" ...It was very sheer and shorter for some reason, I bought it for graduation but it was far too inappropriate for that. \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Stylish, Comfortable & Flattering!",
        "body": "The Wenrine Women’s Mesh Long Sleeve Square Neck Top is such a great piece! The mesh material is soft, breathable, and feels comfortable all day. I love the square neckline — it’s flattering and adds a touch of elegance to any outfit. The fit is true to size, and it pairs well with both casual and dressy looks. Whether dressed up or down, it looks chic and stylish. Definitely a versatile wardrobe staple that’s worth adding to your closet! Read more",
        "author": "Labellemadelyn",
        "rating": 5.0,
        "date": "November 20, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Comfortable going out dress!",
        "body": "Comfortable and good quality dress! They’re my go material isn’t see through and the sizing is very forgiving. I wore this 6 months pregnant and felt really cute! Read more",
        "author": "Nic",
        "rating": 5.0,
        "date": "November 26, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71cDU9UdfmL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "4.0 out of 5 stars Comfortable and cute, but white is see through.",
        "body": "The shape of the dress is very flattering and comfortable! True to size. The fabric is soft and stretchy. However, the white is very see through, unfortunately will be returning. Read more",
        "author": "Mackenzie Blomquist",
        "rating": 4.0,
        "date": "June 25, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Halloween Alterations",
        "body": "Loved it, fits well! Great quality for the money. I altered it for Halloween and used it for a costume. It looked fantastic on me. I did alter it but would wear the dress to a party. Read more",
        "author": "Love it",
        "rating": 5.0,
        "date": "December 8, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71BidxdCxuL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Cute dress for a night out on the town!",
        "body": "Great value! Cute dress, received a ton of compliments for a dinner out with the girls. Went with the small. I’m 5’6, 125lbs and curvy figure. It came about mid/upper thigh on me so a tad shorter than I normally wear. The ruched look did a nice job of covering problem areas. I purchased the light khaki and it was not see-through, but I did wear nude undergarments. Has some stretch to it and the fabric is decent quality. Arms are sheer which was nice for fall. Considering purchasing one in black. Read more",
        "author": "Danielle Martin",
        "rating": 5.0,
        "date": "September 26, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61gWjMKoZHL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "3.0 out of 5 stars Just Ok.",
        "body": "Ok, let me just say that I was very worried when we received this in the mail. The color was NOT the same as the picture. It was actually a light blue. Fabric was also a little cheap feeling. However, it looked cute on, so my daughter kept it. She made it 15 minutes at the dance, and I got a message saying the elastic around her wrist had snapped. So, she ended up just snapping the other side, to make it look less awkward. Read more",
        "author": "Jenny",
        "rating": 3.0,
        "date": "September 21, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71R98xMFVWL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/61xNW6TI6JL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Great Top",
        "body": "This top is sooo soft! It's like a shirt/sweater hybrid... The torso part is almost suede like. Idk what I was expecting but im not that, lol... Anyway the pic doesn't do it justice. Such a great top and decent color, quality and fit. Will but from them again. Read more",
        "author": "Samantha DeFranco",
        "rating": 5.0,
        "date": "December 3, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Cute dress",
        "body": "I love this dress it is so stretchy and super comfy the size fit on the first try which Tarly happens when I shop online it is amazing quality and over I love it so much and wore so many times! Read more",
        "author": "Lauren",
        "rating": 5.0,
        "date": "August 28, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Bodycon Long Sleeve Ruched Cocktail is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.",
  "about_this_item": "Womens Maxi Dress Bodycon Long Sleeve Ruched Cocktail is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.",
  "long_description": "Womens Maxi Dress Bodycon Long Sleeve Ruched Cocktail is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Brown, Blue, Army Green, Black, Coffee, Navy Blue, Light Blue, Olive, Red, Rose Red, Wine Red, Khaki, Pink, White. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Bodycon Long Sleeve Ruched Cocktail is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Brown, Blue, Army Green, Black, Coffee, Navy Blue, Light Blue, Olive, Red, Rose Red, Wine Red, Khaki, Pink, White. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "5841ca63-fb1e-42b1-82a8-f801404254d2",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5841ca63-fb1e-42b1-82a8-f801404254d2/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5841ca63-fb1e-42b1-82a8-f801404254d2/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "5890844b-849e-4988-a9d7-5a7f3d2c07a4",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5890844b-849e-4988-a9d7-5a7f3d2c07a4/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5890844b-849e-4988-a9d7-5a7f3d2c07a4/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "154364e7-b650-4ae4-8184-0fb7c6f2988c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/154364e7-b650-4ae4-8184-0fb7c6f2988c/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/154364e7-b650-4ae4-8184-0fb7c6f2988c/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "77e0c70b-be3a-464e-af64-bd825041c946",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/77e0c70b-be3a-464e-af64-bd825041c946/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/77e0c70b-be3a-464e-af64-bd825041c946/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "6b1fb960-181a-4556-9c14-570008aaeb18",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6b1fb960-181a-4556-9c14-570008aaeb18/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6b1fb960-181a-4556-9c14-570008aaeb18/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "7c77b0dc-54e7-44cc-a993-8c42f86525e4",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7c77b0dc-54e7-44cc-a993-8c42f86525e4/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7c77b0dc-54e7-44cc-a993-8c42f86525e4/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "bcead5a1-3ff5-4802-9f74-8d81fe92a761",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bcead5a1-3ff5-4802-9f74-8d81fe92a761/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bcead5a1-3ff5-4802-9f74-8d81fe92a761/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "0b327585-79b6-4cc6-8778-2f5a3fc196d8",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0b327585-79b6-4cc6-8778-2f5a3fc196d8/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0b327585-79b6-4cc6-8778-2f5a3fc196d8/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "f5972081-7f6b-4294-bf55-92647370556d",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f5972081-7f6b-4294-bf55-92647370556d/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f5972081-7f6b-4294-bf55-92647370556d/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "d1f236d5-bea0-4c43-b5fc-3afd359dfe6c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d1f236d5-bea0-4c43-b5fc-3afd359dfe6c/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d1f236d5-bea0-4c43-b5fc-3afd359dfe6c/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "72849ef4-a7bf-4fd0-8bd5-94d35b42998f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/72849ef4-a7bf-4fd0-8bd5-94d35b42998f/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/72849ef4-a7bf-4fd0-8bd5-94d35b42998f/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "9a50569c-da12-421a-8f9b-44526e6780a8",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9a50569c-da12-421a-8f9b-44526e6780a8/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9a50569c-da12-421a-8f9b-44526e6780a8/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Brown": "https://m.media-amazon.com/images/I/31t7INROqNL._AC_SR38,50_.jpg",
    "Blue": "https://m.media-amazon.com/images/I/31F7iIuZr1L._AC_SR38,50_.jpg",
    "Army Green": "https://m.media-amazon.com/images/I/31evpzTe73L._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/3150pPUJvVL._AC_SR38,50_.jpg",
    "Coffee": "https://m.media-amazon.com/images/I/31MOCPxdCWL._AC_SR38,50_.jpg",
    "Navy Blue": "https://m.media-amazon.com/images/I/31b0J-XCvbL._AC_SR38,50_.jpg",
    "Light Blue": "https://m.media-amazon.com/images/I/31ca37Rg1nL._AC_SR38,50_.jpg",
    "Olive": "https://m.media-amazon.com/images/I/31pT1Iu77mL._AC_SR38,50_.jpg",
    "Red": "https://m.media-amazon.com/images/I/31BLFUl3OkL._AC_SR38,50_.jpg",
    "Rose Red": "https://m.media-amazon.com/images/I/41edE0dDfKL._AC_SR38,50_.jpg",
    "Wine Red": "https://m.media-amazon.com/images/I/31wQj3qgsyL._AC_SR38,50_.jpg",
    "Khaki": "https://m.media-amazon.com/images/I/31yXgVxKveL._AC_SR38,50_.jpg",
    "Pink": "https://m.media-amazon.com/images/I/41BCn9cIleL._AC_SR38,50_.jpg",
    "White": "https://m.media-amazon.com/images/I/317N2h1V5kL._AC_SR38,50_.jpg",
    "Watermelon Red": "https://m.media-amazon.com/images/I/41fdbqsbEdL._AC_SR38,50_.jpg",
    "Light Purple": "https://m.media-amazon.com/images/I/31f8ZOUXz0L._AC_SR38,50_.jpg",
    "Deep Purple": "https://m.media-amazon.com/images/I/310iO3b43VL._AC_SR38,50_.jpg",
    "Green": "https://m.media-amazon.com/images/I/315sY2WCvfL._AC_SR38,50_.jpg",
    "Light Grey": "https://m.media-amazon.com/images/I/31MciI1SI-L._AC_SR38,50_.jpg",
    "Light Khaki": "https://m.media-amazon.com/images/I/31JpCczMDiL._AC_SR38,50_.jpg",
    "Pink Orange": "https://m.media-amazon.com/images/I/31Ry2t5T8sL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Brown": "61mYsXEEpXL",
    "Blue": "618v8O9svuL",
    "Army Green": "61y+IP4KX7L",
    "Black": "61MzCBXgRzL",
    "Coffee": "61KDDJOx+oL",
    "Navy Blue": "614dv3-v+hL",
    "Light Blue": "61jAktImdiL",
    "Olive": "61JoQr5dLpL",
    "Red": "6131pgbUc-L",
    "Rose Red": "614uSoDTIML",
    "Wine Red": "61mSSMdjt7L",
    "Khaki": "61PccaKLWiL",
    "Pink": "6110Hsatd5L",
    "White": "51fHkFyd1PL",
    "Watermelon Red": "61PcJAFFGaL",
    "Light Purple": "61Xj10ZIJeL",
    "Deep Purple": "61XuiiVrh5L",
    "Green": "61VKhxob22L",
    "Light Grey": "61itEKeTAJL",
    "Light Khaki": "61++NF3mXLL",
    "Pink Orange": "61+BVilv36L"
  },
  "color_images": {
    "Brown": [
      "https://m.media-amazon.com/images/I/61mYsXEEpXL._SL1500_.jpg"
    ],
    "Blue": [
      "https://m.media-amazon.com/images/I/618v8O9svuL._SL1500_.jpg"
    ],
    "Army Green": [
      "https://m.media-amazon.com/images/I/61y+IP4KX7L._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/61MzCBXgRzL._SL1500_.jpg"
    ],
    "Coffee": [
      "https://m.media-amazon.com/images/I/61KDDJOx+oL._SL1500_.jpg"
    ],
    "Navy Blue": [
      "https://m.media-amazon.com/images/I/614dv3-v+hL._SL1500_.jpg"
    ],
    "Light Blue": [
      "https://m.media-amazon.com/images/I/61jAktImdiL._SL1500_.jpg"
    ],
    "Olive": [
      "https://m.media-amazon.com/images/I/61JoQr5dLpL._SL1500_.jpg"
    ],
    "Red": [
      "https://m.media-amazon.com/images/I/6131pgbUc-L._SL1500_.jpg"
    ],
    "Rose Red": [
      "https://m.media-amazon.com/images/I/614uSoDTIML._SL1500_.jpg"
    ],
    "Wine Red": [
      "https://m.media-amazon.com/images/I/61mSSMdjt7L._SL1500_.jpg"
    ],
    "Khaki": [
      "https://m.media-amazon.com/images/I/61PccaKLWiL._SL1500_.jpg"
    ],
    "Pink": [
      "https://m.media-amazon.com/images/I/6110Hsatd5L._SL1500_.jpg"
    ],
    "White": [
      "https://m.media-amazon.com/images/I/51fHkFyd1PL._SL1500_.jpg"
    ],
    "Watermelon Red": [
      "https://m.media-amazon.com/images/I/61PcJAFFGaL._SL1500_.jpg"
    ],
    "Light Purple": [
      "https://m.media-amazon.com/images/I/61Xj10ZIJeL._SL1500_.jpg"
    ],
    "Deep Purple": [
      "https://m.media-amazon.com/images/I/61XuiiVrh5L._SL1500_.jpg"
    ],
    "Green": [
      "https://m.media-amazon.com/images/I/61VKhxob22L._SL1500_.jpg"
    ],
    "Light Grey": [
      "https://m.media-amazon.com/images/I/61itEKeTAJL._SL1500_.jpg"
    ],
    "Light Khaki": [
      "https://m.media-amazon.com/images/I/61++NF3mXLL._SL1500_.jpg"
    ],
    "Pink Orange": [
      "https://m.media-amazon.com/images/I/61+BVilv36L._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 210.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71gHGMr--UL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 46.88,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51e7KIifeZL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 29.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/714NKRHRX2L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-one-shoulder-formal-mermaid-bodycon-evening-maxi",
      "title": "Womens Maxi Dress One Shoulder Formal Mermaid Bodycon Evening Maxi",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71mgUBuGwhL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 42.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71bqoI3Xa8L._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-v-neck-long-sleeve-bodycon",
      "title": "Womens Maxi Dress V Neck Long Sleeve Bodycon",
      "price": 30.59,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Sweaters > Pullovers",
      "images": [
        "https://m.media-amazon.com/images/I/71a0x4LTzmL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-ruched-one-shoulder-formal-cocktail-bodycon-maxi",
      "title": "Womens Maxi Dress Ruched One Shoulder Formal Cocktail Bodycon Maxi",
      "price": 47.89,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/612sxL+Ey-L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-sleeveless-off-shoulder",
      "title": "Womens Dress Sleeveless Off Shoulder",
      "price": 37.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61dMM-S4qXL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61udjSNVNzL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 57.86,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/61iiBGgPChL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 27.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/615JfwLyTTL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 38.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61im2oIlu6L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-ruched-long-sleeve-bodycon",
      "title": "Womens Maxi Dress Ruched Long Sleeve Bodycon",
      "price": 31.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51zwWMjriiL._SL1500_.jpg"
      ]
    }
  ]
}