{
  "id": "womens-maxi-dress-long-sleeve",
  "handle": "womens-maxi-dress-long-sleeve",
  "sku": "JC1243",
  "asin": "B0B151LX9Z",
  "title": "Womens Maxi Dress Long Sleeve",
  "title_original": "BTFBM Womens Long Sleeve Dress Vacation Square Neck Smocked Floral Swiss Dot Mini Boho Spring Wedding Guest Dresses 2026",
  "brand": "Visit the BTFBM Store",
  "price": 44.99,
  "social_proof": {
    "bought_past_month": 838,
    "text": "838+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/91WO-Eb4blL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91b9Uy8mg-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91aodLjVviL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/913oIkPy1cL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/916v6SwRoiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/716ynrBe+DL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91PR3K9EWcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Vv9XvsLNL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81wGbkw6kML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81qIJBAnd3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/710uDahcECL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91U9jXmX92L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/716mpYo1WHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61isc2ULG3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81SZ5VPbpAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/912BMdWdZrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81G1zc4bjIL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/9130j9d3RCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/717LXWJb0dL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71V9L4c9kcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71GdbLR43oL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71nDnGn5ymL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/612CCERgD5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81q78v9TscL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81GmaCawGgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/9141eZ29M5L._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/91WO-Eb4blL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91b9Uy8mg-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91aodLjVviL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/913oIkPy1cL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/916v6SwRoiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/716ynrBe+DL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91PR3K9EWcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Vv9XvsLNL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81wGbkw6kML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81qIJBAnd3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/710uDahcECL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91U9jXmX92L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/716mpYo1WHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61isc2ULG3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81SZ5VPbpAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/912BMdWdZrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81G1zc4bjIL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/9130j9d3RCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/717LXWJb0dL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71V9L4c9kcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71GdbLR43oL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71nDnGn5ymL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/612CCERgD5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81q78v9TscL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81GmaCawGgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/9141eZ29M5L._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Package Dimensions ‏": "‎ 8 x 5 x 2 inches; 4.8 ounces",
    "Item model number ‏": "‎ 1284",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ July 14, 2022",
    "Manufacturer ‏": "‎ BTFBM",
    "ASIN ‏": "‎ B0B14ZPM7T",
    "Best Sellers Rank": "#26,795 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #216 in Women's Casual Dresses",
    "Customer Reviews": "4.2 4.2 out of 5 stars (2,459)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Bean Paste Red",
      "Floral Red Pink",
      "Floral Royal Blue",
      "Blue",
      "Floral White Red",
      "Floral Blue Orange",
      "Grey Blue",
      "Floral Navy Purple",
      "Army Green",
      "Black",
      "Floral Purple Red",
      "Floral Brown",
      "Floral Green Blue",
      "Print Flower Red",
      "Navy",
      "Wine Red",
      "Khaki",
      "Pink",
      "White",
      "Floral Black White",
      "Print Flower Brown",
      "Floral Blue Pink"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.2,
    "count": 2459,
    "customers_say": "Customers love this dress's style, with one mentioning it brings them back to 1975, and they appreciate its perfect length that hits right at the knees. The dress is comfortable, not itchy at all, and customers find it flattering, with one noting how it accentuates curves without being too revealing. They praise its quality, material, and color accuracy, and one customer mentions the stretchiness helps it fit well. Select to learn more Style Fit Quality Comfort Flattering Length Color accuracy Material quality 260 customers mention \"Style\" 247 positive 13 negative Customers find the dress cute and feminine, with one customer noting how it hugs in all the right places, while another mentions it's adorable for pregnancy. \"This was a perfect dress for a baby shower I attended recently. It was cute and comfortable and the fabric quality and did not wrinkle!...\" Read more \"This dress is super cute , wore it for a wedding I attended. The fabric is thicker than anticipated and was a nice surprise and still ver breathable....\" Read more \"Used for my Taylor Swift concert. So cute and for very well. Can also wear my pulling sleaves down and making it a off the shoulder sleeved dress\" Read more \" Beautiful dress perfect for thicker Moms. I’m bigger busted and have a belly but this dress was super flattering....\" Read more 178 customers mention \"Fit\" 152 positive 26 negative Customers are satisfied with how the dress fits, noting it's perfect at right above the knee, and one customer mentions it provides plenty of room for a growing bump. \"...I think this is just a good classic dress to have. Fits well , seems flattering on anyone, love the sleeves, and it’s modest. Also has POCKETS!!!\" Read more \"Bought this for a 50th class reunion. I love it !!!!! It fits great , the style brought me back to 1975. The style is very flattering....\" Read more \" Fits true to size , ruched area is a little loose, may want to size down depending on your bust size. Doesn’t seem to wrinkle easy, not sheer at all.\" Read more \"Ordered this dress for fall family photos. Perfect fit and super cute with tall boots....\" Read more 115 customers mention \"Quality\" 107 positive 8 negative Customers find the dress beautiful and well-made, with one customer noting it doesn't feel cheap. \" Great dress ! super comfortable, nice length i do recommend sizing down as it does run a tad big. Got tons of compliments.\" Read more \"...This was that perfect dress ! Super cute, can be fancy as well depending on shoe attire and super cool and breezy!!\" Read more \" Great quality , fit was good , sleeve length was a little short but not a huge deal for me really loved the pockets ! Beautiful fall color.\" Read more \"beautiful, good quality , but I'm short and I don't like dresses below my knee, the sizes are a bit confusing, according to the size chart, I was L...\" Read more 109 customers mention \"Comfort\" 103 positive 6 negative Customers find the dress comfortable, with one mentioning it's not itchy at all. \"Was looking for something comfortable and lightweight for Spring and summer. Great fit, beautiful color and great to dress up or down! True to size....\" Read more \"...The material is so silky soft& buttery-Soo comfy I just wanted everyone to feel it for themselves! -the colors are very rich& way better in person!...\" Read more \"...up when it comes to clothing bought off Amazon but this dress is very comfortable and cute and oh did I mention IT HAS FREAKING POCKETS!...\" Read more \"This dress is super comfortable and beautiful, I am 5.6 ,38DD with big bottom and hips and weigh 220 I bought an XL it's perfect all around\" Read more 90 customers mention \"Flattering\" 75 positive 15 negative Customers find the dress flattering, with one mentioning that it accentuates curves without being too revealing, while another notes it's very forgiving for hiding a tummy. \"Just as described. Runs true to size and is so comfortable and flattering . I have received many compliments when I wore it. Perfect for warm weather!\" Read more \"This dress is very flattering ! Material is not clingy. I would order the size you normally wear the for was perfect for me....\" Read more \"I love this dress so much it is super flattering and comfortable I definitely recommend!\" Read more \"This dress is amazing. It’s so flattering & the colors are pretty! I ordered 6 dresses for a wedding, and this one was the winner....\" Read more 73 customers mention \"Length\" 53 positive 20 negative Customers are satisfied with the dress's length, noting that it hits right at the knees and is perfect for their age. \"...It’s stretchy and flowy where it needs to be. It’s the perfect length too. When I opened the package I immediately noticed the color was off....\" Read more \"...super comfy, not too short , and the stretchiness really helps it fit well. the material can get staticky but otherwise just fine.\" Read more \"...It was long , and bulky!\" Read more \"...Totally happy with the fit, length is perfect just a above the knee,not high thigh length. The fabric is good quality not sheer see thru cheap....\" Read more 67 customers mention \"Color accuracy\" 50 positive 17 negative Customers love the color of the dress, with one noting it is more red than pink. \"I wanted to like this so much. I love the color , the pockets, the skirt length - but the waist hit too high on me (I have a longer torso) and the...\" Read more \"I’m in love with this dress! The color , the material quality, the fit and flowiness is perfect for me!!\" Read more \"...I was a little disappointed when I received it as the color was different than expected (I ordered the print flower brown)....\" Read more \"...Great fit, beautiful color and great to dress up or down! True to size. I use a medium top and large bottom but large fit perfectly.\" Read more 60 customers mention \"Material quality\" 43 positive 17 negative Customers love the material of the dress, finding the fabric nice and flowy, with one customer noting it's not clingy. \"It’s a great material and the fabric was stretchy enough for me in the bust area. I’m a smaller frame with a larger chest and this dress fit great!\" Read more \"Fits well, comfortable and flowy . Good fabric and length. I wore it for my birthday and was satisfied and happy with the result....\" Read more \"...But, if you’re petite, skip it! There was way too much fabric and made me look bulky and even shorter than I am. I returned this immediately....\" Read more \"Great color and fabric ! A little snug in the armpits of you wear the sleeves up on your shoulders but not a big deal for me. Perfect year-round dress\" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars ⭐️⭐️⭐️⭐️⭐️ Lightweight, Flattering, and Perfect for Teachers & Summer Events!",
        "body": "I absolutely love this dress! I ordered the Swiss Dot Khaki in Medium, and it fits true to size. For reference, I’m 5’2” and 140 pounds, and the fit is just right — flattering without being tight, and the length hits just above the knee, which is perfect for both comfort and modesty. The fabric is so lightweight and breathable, making it a great option for warm spring and summer days. It’s incredibly comfortable and easy to move in, which is important to me whether I’m spending the day walking around the racetrack or teaching in the classroom. I wore it recently to a day at the racetrack and felt so put together without sacrificing comfort. What I love most is that it also makes a super cute teacher outfit — professional, stylish, and functional. Just add flats or sandals and you're good to go! This dress checks all the boxes: flattering fit, beautiful style, and versatile enough for everything from weekend plans to school days. I’m already planning to buy another color! Read more",
        "author": "kyteecher",
        "rating": 5.0,
        "date": "June 7, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Perfect dress!",
        "body": "Super cute! Perfect length for church, pictures, or everyday wear! I’m 5ft 6in and it hits me a couple inches above the knee. Has pockets also! Came wrinkled but a few minutes in the dryer solved this issue! Would definitely say it fits true to size. I’m 120 lbs, and a small was not too tight or too lose. Could be worn off shoulders also. Read more",
        "author": "Customer",
        "rating": 5.0,
        "date": "October 13, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Pretty blue dress",
        "body": "Very pretty color and dress. The material is material and light. True to size. Cleans easy. Read more",
        "author": "N.",
        "rating": 4.0,
        "date": "December 8, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars DO IT!!!!",
        "body": "I am beyond in love with this dress I wore it for my engagement party with cow girl boots it was so cute !! Fit perfect and very comfortable and stretchy ! Read more",
        "author": "Moore #Momlife Essentials",
        "rating": 5.0,
        "date": "December 9, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/81MAW1ssgFL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "3.0 out of 5 stars Doesn't fit like picture",
        "body": "I really wanted to love this dress and it looks so cute in the pictures but it is not as baggy in real life. The sleeves are much more narrow (still have some flow but not much) and the top elastic is much tighter than the picture shows. Not sure if you need to size up to get the look in the picture or if it just works better on women with less curves but not for me. Love the green color though and the pattern on it adds subtle interest which I like. Read more",
        "author": "Lior Ruiz",
        "rating": 3.0,
        "date": "October 7, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars It fits me and makes my waist look smaller",
        "body": "I adore the way this dress makes me look!!!! Read more",
        "author": "pastormom",
        "rating": 5.0,
        "date": "December 20, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Comfy, Cute, Functional",
        "body": "Super comfortable dress, perfect length, TTS, I’m 5’8, 34D, 155lbs, size L Read more",
        "author": "Lacey Goodson",
        "rating": 5.0,
        "date": "December 14, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/81nG8IEBnzL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Perfect simple dress!",
        "body": "Perfect dress for my baby’s dedication. I think this is just a good classic dress to have. Fits well, seems flattering on anyone, love the sleeves, and it’s modest. Also has POCKETS!!! Read more",
        "author": "B Family",
        "rating": 5.0,
        "date": "November 13, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71z121iCQ2L._SY88._SL1500_.jpg"
        ]
      }
    ]
  },
  "short_description": "Womens Maxi Dress Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.",
  "about_this_item": "Womens Maxi Dress Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.",
  "long_description": "Womens Maxi Dress Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Bean Paste Red, Floral Red Pink, Floral Royal Blue, Blue, Floral White Red, Floral Blue Orange, Grey Blue, Floral Navy Purple, Army Green, Black, Floral Purple Red, Floral Brown, Floral Green Blue, Print Flower Red. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Bean Paste Red, Floral Red Pink, Floral Royal Blue, Blue, Floral White Red, Floral Blue Orange, Grey Blue, Floral Navy Purple, Army Green, Black, Floral Purple Red, Floral Brown, Floral Green Blue, Print Flower Red. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "2fbb3336-7b32-460e-b7b4-ddaf02c48f10",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2fbb3336-7b32-460e-b7b4-ddaf02c48f10/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2fbb3336-7b32-460e-b7b4-ddaf02c48f10/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/2a09f5d6-d40e-4210-a6e6-e7aa598ddf16.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "9a57429e-d41e-4031-b75b-3a7472630c8f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9a57429e-d41e-4031-b75b-3a7472630c8f/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9a57429e-d41e-4031-b75b-3a7472630c8f/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/2a09f5d6-d40e-4210-a6e6-e7aa598ddf16.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "fe467a10-228a-4565-aefa-4dbc88517871",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/fe467a10-228a-4565-aefa-4dbc88517871/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/fe467a10-228a-4565-aefa-4dbc88517871/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/2a09f5d6-d40e-4210-a6e6-e7aa598ddf16.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "900ff6c3-cbc1-408f-bee9-daad8bc4e434",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/900ff6c3-cbc1-408f-bee9-daad8bc4e434/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/900ff6c3-cbc1-408f-bee9-daad8bc4e434/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/2a09f5d6-d40e-4210-a6e6-e7aa598ddf16.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "a6ad9f95-735c-4a3f-9285-83d62f7133fb",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a6ad9f95-735c-4a3f-9285-83d62f7133fb/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a6ad9f95-735c-4a3f-9285-83d62f7133fb/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/2a09f5d6-d40e-4210-a6e6-e7aa598ddf16.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "4df2c7fe-b7c9-42a4-bbaa-d7e300f2b9e4",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4df2c7fe-b7c9-42a4-bbaa-d7e300f2b9e4/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4df2c7fe-b7c9-42a4-bbaa-d7e300f2b9e4/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/2a09f5d6-d40e-4210-a6e6-e7aa598ddf16.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "430a019f-6d8f-4f97-9970-4eb96fc77f62",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/430a019f-6d8f-4f97-9970-4eb96fc77f62/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/430a019f-6d8f-4f97-9970-4eb96fc77f62/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/2a09f5d6-d40e-4210-a6e6-e7aa598ddf16.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "f53ae06d-2def-41a5-9a89-16c9d44fbdb1",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f53ae06d-2def-41a5-9a89-16c9d44fbdb1/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f53ae06d-2def-41a5-9a89-16c9d44fbdb1/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/2a09f5d6-d40e-4210-a6e6-e7aa598ddf16.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "f0e9b6c9-3e94-46f2-9881-96dd6f5641a5",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f0e9b6c9-3e94-46f2-9881-96dd6f5641a5/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f0e9b6c9-3e94-46f2-9881-96dd6f5641a5/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/2a09f5d6-d40e-4210-a6e6-e7aa598ddf16.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "cb286f91-0f16-400e-bc3a-cad5b02ae84d",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/cb286f91-0f16-400e-bc3a-cad5b02ae84d/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/cb286f91-0f16-400e-bc3a-cad5b02ae84d/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/2a09f5d6-d40e-4210-a6e6-e7aa598ddf16.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "f598e5f7-e45c-48d0-8cc9-f25082052d3e",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f598e5f7-e45c-48d0-8cc9-f25082052d3e/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f598e5f7-e45c-48d0-8cc9-f25082052d3e/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/2a09f5d6-d40e-4210-a6e6-e7aa598ddf16.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "42c2fafb-2435-4e5a-aed3-3d7e8e6c3f5b",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/42c2fafb-2435-4e5a-aed3-3d7e8e6c3f5b/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/42c2fafb-2435-4e5a-aed3-3d7e8e6c3f5b/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/2a09f5d6-d40e-4210-a6e6-e7aa598ddf16.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Bean Paste Red": "https://m.media-amazon.com/images/I/41VIfV+bylL._AC_SR38,50_.jpg",
    "Floral Red Pink": "https://m.media-amazon.com/images/I/51coOj7U1bL._AC_SR38,50_.jpg",
    "Floral Royal Blue": "https://m.media-amazon.com/images/I/61K5YRCtrLL._AC_SR38,50_.jpg",
    "Blue": "https://m.media-amazon.com/images/I/41riA5NdSIL._AC_SR38,50_.jpg",
    "Floral White Red": "https://m.media-amazon.com/images/I/51DSP-PeTuL._AC_SR38,50_.jpg",
    "Floral Blue Orange": "https://m.media-amazon.com/images/I/61SKhlTo0JL._AC_SR38,50_.jpg",
    "Grey Blue": "https://m.media-amazon.com/images/I/41WPLX5F5EL._AC_SR38,50_.jpg",
    "Floral Navy Purple": "https://m.media-amazon.com/images/I/51cN8N3DuqL._AC_SR38,50_.jpg",
    "Army Green": "https://m.media-amazon.com/images/I/41mO9I6feGL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31a9uQ5N4rL._AC_SR38,50_.jpg",
    "Floral Purple Red": "https://m.media-amazon.com/images/I/61wosPJ+khL._AC_SR38,50_.jpg",
    "Floral Brown": "https://m.media-amazon.com/images/I/613fbf-Fz+L._AC_SR38,50_.jpg",
    "Floral Green Blue": "https://m.media-amazon.com/images/I/51aSY3rMJXL._AC_SR38,50_.jpg",
    "Print Flower Red": "https://m.media-amazon.com/images/I/51ELjtJvdhL._AC_SR38,50_.jpg",
    "Navy": "https://m.media-amazon.com/images/I/41Z6OgHxrTL._AC_SR38,50_.jpg",
    "Wine Red": "https://m.media-amazon.com/images/I/41XZPTN5QGL._AC_SR38,50_.jpg",
    "Khaki": "https://m.media-amazon.com/images/I/4135A9b5wQL._AC_SR38,50_.jpg",
    "Pink": "https://m.media-amazon.com/images/I/41kcKm+JFeL._AC_SR38,50_.jpg",
    "White": "https://m.media-amazon.com/images/I/31Z8vWMz5gL._AC_SR38,50_.jpg",
    "Floral Black White": "https://m.media-amazon.com/images/I/51r-iV7P7XL._AC_SR38,50_.jpg",
    "Print Flower Brown": "https://m.media-amazon.com/images/I/51p1wY5FR5L._AC_SR38,50_.jpg",
    "Floral Blue Pink": "https://m.media-amazon.com/images/I/61VTAwJm1TL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Bean Paste Red": "716ynrBe+DL",
    "Floral Red Pink": "91WO-Eb4blL",
    "Floral Royal Blue": "91PR3K9EWcL",
    "Blue": "71Vv9XvsLNL",
    "Floral White Red": "81wGbkw6kML",
    "Floral Blue Orange": "81qIJBAnd3L",
    "Grey Blue": "710uDahcECL",
    "Floral Navy Purple": "91U9jXmX92L",
    "Army Green": "716mpYo1WHL",
    "Black": "61isc2ULG3L",
    "Floral Purple Red": "81SZ5VPbpAL",
    "Floral Brown": "912BMdWdZrL",
    "Floral Green Blue": "81G1zc4bjIL",
    "Print Flower Red": "9130j9d3RCL",
    "Navy": "717LXWJb0dL",
    "Wine Red": "71V9L4c9kcL",
    "Khaki": "71GdbLR43oL",
    "Pink": "71nDnGn5ymL",
    "White": "612CCERgD5L",
    "Floral Black White": "81q78v9TscL",
    "Print Flower Brown": "81GmaCawGgL",
    "Floral Blue Pink": "9141eZ29M5L"
  },
  "color_images": {
    "Bean Paste Red": [
      "https://m.media-amazon.com/images/I/716ynrBe+DL._SL1500_.jpg"
    ],
    "Floral Red Pink": [
      "https://m.media-amazon.com/images/I/91WO-Eb4blL._SL1500_.jpg"
    ],
    "Floral Royal Blue": [
      "https://m.media-amazon.com/images/I/91PR3K9EWcL._SL1500_.jpg"
    ],
    "Blue": [
      "https://m.media-amazon.com/images/I/71Vv9XvsLNL._SL1500_.jpg"
    ],
    "Floral White Red": [
      "https://m.media-amazon.com/images/I/81wGbkw6kML._SL1500_.jpg"
    ],
    "Floral Blue Orange": [
      "https://m.media-amazon.com/images/I/81qIJBAnd3L._SL1500_.jpg"
    ],
    "Grey Blue": [
      "https://m.media-amazon.com/images/I/710uDahcECL._SL1500_.jpg"
    ],
    "Floral Navy Purple": [
      "https://m.media-amazon.com/images/I/91U9jXmX92L._SL1500_.jpg"
    ],
    "Army Green": [
      "https://m.media-amazon.com/images/I/716mpYo1WHL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/61isc2ULG3L._SL1500_.jpg"
    ],
    "Floral Purple Red": [
      "https://m.media-amazon.com/images/I/81SZ5VPbpAL._SL1500_.jpg"
    ],
    "Floral Brown": [
      "https://m.media-amazon.com/images/I/912BMdWdZrL._SL1500_.jpg"
    ],
    "Floral Green Blue": [
      "https://m.media-amazon.com/images/I/81G1zc4bjIL._SL1500_.jpg"
    ],
    "Print Flower Red": [
      "https://m.media-amazon.com/images/I/9130j9d3RCL._SL1500_.jpg"
    ],
    "Navy": [
      "https://m.media-amazon.com/images/I/717LXWJb0dL._SL1500_.jpg"
    ],
    "Wine Red": [
      "https://m.media-amazon.com/images/I/71V9L4c9kcL._SL1500_.jpg"
    ],
    "Khaki": [
      "https://m.media-amazon.com/images/I/71GdbLR43oL._SL1500_.jpg"
    ],
    "Pink": [
      "https://m.media-amazon.com/images/I/71nDnGn5ymL._SL1500_.jpg"
    ],
    "White": [
      "https://m.media-amazon.com/images/I/612CCERgD5L._SL1500_.jpg"
    ],
    "Floral Black White": [
      "https://m.media-amazon.com/images/I/81q78v9TscL._SL1500_.jpg"
    ],
    "Print Flower Brown": [
      "https://m.media-amazon.com/images/I/81GmaCawGgL._SL1500_.jpg"
    ],
    "Floral Blue Pink": [
      "https://m.media-amazon.com/images/I/9141eZ29M5L._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress-cocktail-bodycon",
      "title": "Womens Dress Cocktail Bodycon",
      "price": 47.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61NfEwzl3xL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-one-shoulder-maxi-formal",
      "title": "Womens Maxi Dress Evening One Shoulder Maxi Formal",
      "price": 69.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/5150AIQL4eL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail",
      "title": "Womens Dress Cocktail",
      "price": 103.54,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61JApwce25L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-formal-bodycon-evening-sleeveless",
      "title": "Womens Maxi Dress Maxi Formal Bodycon Evening Sleeveless",
      "price": 61.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61s8qg6u1VL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 158.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71PmRANW40L._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress-bodycon-split-ruched-off-shoulder",
      "title": "Womens Dress Bodycon Split Ruched Off Shoulder",
      "price": 38.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/41JjYcPgcpL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 95.61,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Work",
      "images": [
        "https://m.media-amazon.com/images/I/71hVgSIB1jL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 138.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51PZNrlyY9L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-split-evening-formal",
      "title": "Womens Maxi Dress Split Evening Formal",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51BZ1BqPx8L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 65.97,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/81wr8PDg55L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-v-neck",
      "title": "Womens Dress V Neck",
      "price": 82.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/710bSTpZ9hL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 278.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/91YXeyW506L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening-long-sleeve",
      "title": "Womens Maxi Dress Formal Evening Long Sleeve",
      "price": 87.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61nnk+flvaL._SL1500_.jpg"
      ]
    }
  ]
}