{
  "id": "womens-dress-sleeveless-v-neck",
  "handle": "womens-dress-sleeveless-v-neck",
  "sku": "JC2193",
  "asin": "B0B2QX4HV2",
  "title": "Womens Dress Sleeveless V Neck",
  "title_original": "OYOANGLE Women's V Neck Sleeveless Knitted Solid Short Sweater Dress with Pockets",
  "brand": "Visit the OYOANGLE Store",
  "price": 22.59,
  "social_proof": {
    "bought_past_month": 50,
    "text": "50+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/71RQ+7X23ZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/711jnVPozCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/710FipxV8pL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71XmhOYYkZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71E1tpFIRKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/719H3YkETrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71aNrfeWJgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ti4RomgAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/716fU+dsDrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61iXRi4yhrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61vBMO459PL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61YrAizy-yL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61j4NBxQYSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71usTPCL33L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61FsE9ORY7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71jO56M8mkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61SoEJkjHaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61CWGxIXdHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61OvBi-EHAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/618TiTE4OCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61GDsdEjhEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61MUuBK9-dL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61S54KBTN9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/613mq7VvFdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61MZRFrm3rL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/71RQ+7X23ZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/711jnVPozCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/710FipxV8pL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71XmhOYYkZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71E1tpFIRKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/719H3YkETrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71aNrfeWJgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ti4RomgAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/716fU+dsDrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61iXRi4yhrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61vBMO459PL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61YrAizy-yL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61j4NBxQYSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71usTPCL33L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61FsE9ORY7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71jO56M8mkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61SoEJkjHaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61CWGxIXdHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61OvBi-EHAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/618TiTE4OCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61GDsdEjhEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61MUuBK9-dL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61S54KBTN9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/613mq7VvFdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61MZRFrm3rL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Item Weight ‏": "‎ 7.05 ounces",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ May 31, 2022",
    "Manufacturer ‏": "‎ Shein",
    "ASIN ‏": "‎ B0B2QVT4LC",
    "Best Sellers Rank": "#8,771 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #42 in Women's Casual Dresses",
    "Customer Reviews": "3.8 3.8 out of 5 stars (792)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Deep Green",
      "Blue",
      "Dark Khaki",
      "Deep Red",
      "Deep Brown",
      "Deep Black",
      "Dusty Pink",
      "Army Green",
      "Grey Solid",
      "Deep Grey",
      "Light Orange",
      "Coffee Brown",
      "Khaki",
      "Beige",
      "Lake Green",
      "Dark Blue",
      "Light Purple",
      "Denim Blue",
      "Chocolate Brown"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 3.8,
    "count": 792,
    "customers_say": "Customers find the sweater dress cute and comfortable, with soft material that's not itchy, and one customer notes it looks put-together. The fit, length, and material quality receive mixed feedback - while some say it runs large and has great length, others find it too short, and while some praise the material, others find it thin. The dress's flattering nature is also mixed, with some finding it flattering while others say it's not suitable for their body type. Generated from the text of customer reviews Select to learn more Look (94) Comfort (46) Fabric softness (42) Fit (73) Quality (57) Length (42) Material quality (26) Flattering (21) 94 customers mention look, 82 positive, 12 negative 94 customers mention \"Look\" 82 positive 12 negative Customers find the dress cute, with one mentioning it looks put-together. \" This dress is comfortable and cute , but I’m 5’7” and the V is deeper on me than I would like / deeper than it looks in pictures.... \" Read more \" This was super cute but I needed to find the perfect length black dress to just barely peak out below and be long sleeve to make this work for me \" Read more \" This dress is so cute and very versatile! I sized up, and glad I did. I wanted it to be a little baggier, but after washing is shrank.... \" Read more \" It was very cute when I wore it for the first time and then I washed it and dryed it on low and it shrunk about 2 sizes and doesnt even cover half... \" Read more 46 customers mention comfort, 43 positive, 3 negative 46 customers mention \"Comfort\" 43 positive 3 negative Customers find the dress comfortable and cozy, noting that the material is not itchy or scratchy. \" This sweater dress is seriously so soft and comfortable ! Can dress up or down. It is the perfect length, appropriate for work or going out.... \" Read more \" ...The fit is perfect: comfy and flattering without being too tight. The material is soft and warm, making it ideal for fall and winter.... \" Read more \" ...The quality is great, I love the color, it is stretchy and super comfortable . I also love that it is long enough for me to wear comfortably at 5’9”. \" Read more \" Very comfortable and wears beautifully for petite folks. The quality is soft and stretchy. Easily worn with layers. \" Read more 42 customers mention fabric softness, 41 positive, 1 negative 42 customers mention \"Fabric softness\" 41 positive 1 negative Customers find the dress soft and appreciate its nice texture. \" ...It’s soft , a good length, and the perfect loose/boxy fit without looking baggy. I wore with a fitted, black, long-sleeved top and tall black boots.... \" Read more \" ...The color matches the picture and is good quality very warm, super soft and stretchy. It's like a soft wool sweater. Length is great not too short.... \" Read more \" ...I’m only giving four stars because of quality. It’s very soft but the stitching is low quality and it doesn’t look like it will last without pulling.... \" Read more \" This is the softest material ever!! And so cute with a long sleeve under! I have gotten so many compliments & people who want the link!... \" Read more 73 customers mention fit, 40 positive, 33 negative 73 customers mention \"Fit\" 40 positive 33 negative Customers have mixed opinions about the dress's fit, with some finding it nice while others report it runs very large and wide. \" One of my favorite pieces! True to size . Great addition to your wardrobe! \" Read more \" Had to return. Runs big . \" Read more \" I LOVE this! It runs true to size , is very soft, and can easily be dressed up or down for certain occasions. \" Read more \" The idea of this dress is great but in reality, it was way oversized and the fabric was super clingy on my legs. It was an automatic return \" Read more 57 customers mention quality, 37 positive, 20 negative 57 customers mention \"Quality\" 37 positive 20 negative Customers have mixed opinions about the dress's quality, with some finding it nice and better than expected, while others report low-quality stitching. \" Super soft and comfortable and warm, easy to style up or down! Great quality and comes in other colors!! Definitely worth the buy. \" Read more \" This item is poor quality , and it arrived so wrinkled. The wrinkles would not hang out or even iron out. It’s misshapen, and not flattering. \" Read more \" ...The color matches the picture and is good quality very warm, super soft and stretchy. It's like a soft wool sweater. Length is great not too short.... \" Read more \" Exactly as pictured. Well made . Highly recommend \" Read more 42 customers mention length, 22 positive, 20 negative 42 customers mention \"Length\" 22 positive 20 negative Customers have mixed opinions about the dress's length, with some finding it great and not too short for professional wear, while others consider it too short. \" ...Can dress up or down. It is the perfect length , appropriate for work or going out.... \" Read more \" ...thin, meh quality but it’s Amazon what do you expect, really cute a little short but small fit great! \" Read more \" Love this! Great length and I’m taller. Fairly thick material. Can definitely dress up or down. Pockets are more for looks than functionality.... \" Read more \" length too short to wear as a dress \" Read more 26 customers mention material quality, 14 positive, 12 negative 26 customers mention \"Material quality\" 14 positive 12 negative Customers have mixed opinions about the dress's material, with some finding it nice while others say it's not to their liking and is thin. \" perfect dress for a cute but casual look ! Material is great and super soft !! highly recommend \" Read more \" Fabric felt cheap and the shape was very strange. Huge up top, but fit okay around hips. Seemed very cheap. Returned. \" Read more \" ...The material is the perfect thickness to wear indoors and not get too warm. \" Read more \" Longer than what was shown and fabric was not good . Returned. \" Read more 21 customers mention flattering, 12 positive, 9 negative 21 customers mention \"Flattering\" 12 positive 9 negative Customers have mixed opinions about the dress's appearance, with some finding it flattering while others disagree. \" ...It’s very flattering . But I was disappointed to flip the dress inside out and see “shein” on the tag. \" Read more \" The material was thin and not flattering on my body type . \" Read more \" ...Ordered: Khaki, Medium Likes: soft, comfortable, non-scratchy, flattering , perfect length... \" Read more \" This is huge and boxy . Not flattering at all . Feels cheap and static is BAD. Returned immediately. \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Better than I imagined!",
        "body": "I’m 5’2”, 108lbs, and typically between an XS and S. This is stinking cute!! It’s soft, a good length, and the perfect loose/boxy fit without looking baggy. I wore with a fitted, black, long-sleeved top and tall black boots. The pockets are real and usable, though it would probably weigh down the dress. The material is the perfect thickness to wear indoors and not get too warm. Read more",
        "author": "Lindsey",
        "rating": 5.0,
        "date": "November 7, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Perfect for the fall.",
        "body": "Very cute. Comfy sweater dress. Soft fabric and the length is just above the knee. Can stretch if needed. Read more",
        "author": "John Brailsford",
        "rating": 5.0,
        "date": "November 28, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Cute fall dress",
        "body": "This dress is trending and I wanted to see what the hype was about. Really cute but doesn’t really give you a shape. I’m on the shorter side and it was slightly longer than anticipated. The material and dress were flowy, soft, but not itchy. Personally I’d size down so it’s not so big but overall really liked it. Read more",
        "author": "Reli Arnold",
        "rating": 4.0,
        "date": "November 26, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/91QCF0muWXL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "1.0 out of 5 stars Looks cheap",
        "body": "I was so excited about this dress but it looks so cheap. I felt like I ordered it from temu. I sent it back. Read more",
        "author": "Perfect for what I need!!",
        "rating": 1.0,
        "date": "December 18, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Sizing discrepancies between colors .",
        "body": "Cute but sizing discrepancies. I ordered this and a black version both in Med. The black version litterally fits PERFECTLY - (145lbs / 5’6”) and this tweed color fits me like a sack of potatoes. The dress is sooooo cute , and I’m bummed because I was hoping to wear this for a get together. Read more",
        "author": "Danielle",
        "rating": 3.0,
        "date": "November 2, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/81E-71Erk0L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Dress was great. Just what I was looking for!",
        "body": "The size fit great! Soft durable material and was not too thick or too thin. The color was just what I was looking for! Read more",
        "author": "Deanna Meadows",
        "rating": 5.0,
        "date": "November 24, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71DEkBuTz7L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "2.0 out of 5 stars Boob pockets???",
        "body": "Soft material and a great color… but that’s all I can give it. I wanted to like this so much, but I’ll have to return it. The pockets are in the strangest place! I am very large chested, so maybe that’s the issue, but the pocket are literally at my boobs. They need to be like a solid 5in lower. I don’t know if I just got a bad one or if this is just how they’re suppose to look lol Read more",
        "author": "Cierra",
        "rating": 2.0,
        "date": "December 12, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/81J04+p3agL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71ocqWYNM9L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Super comfy",
        "body": "Love this shift dress. Can be styled in so many ways. Fits TTS. Read more",
        "author": "Customer",
        "rating": 5.0,
        "date": "November 28, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Dress Sleeveless V Neck is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.",
  "about_this_item": "Womens Dress Sleeveless V Neck is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.",
  "long_description": "Womens Dress Sleeveless V Neck is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Deep Green, Blue, Dark Khaki, Deep Red, Deep Brown, Deep Black, Dusty Pink, Army Green, Grey Solid, Deep Grey, Light Orange, Coffee Brown, Khaki, Beige. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Dress Sleeveless V Neck is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Deep Green, Blue, Dark Khaki, Deep Red, Deep Brown, Deep Black, Dusty Pink, Army Green, Grey Solid, Deep Grey, Light Orange, Coffee Brown, Khaki, Beige. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "13ce29f7-8394-40ca-905d-3206ada0e267",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/13ce29f7-8394-40ca-905d-3206ada0e267/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/13ce29f7-8394-40ca-905d-3206ada0e267/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/2435c414-4139-432c-9ae3-be00129614ff.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "eeeaa59b-f00f-4e06-9072-9caba6267360",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/eeeaa59b-f00f-4e06-9072-9caba6267360/embedded.cc.default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/eeeaa59b-f00f-4e06-9072-9caba6267360/embedded.cc.default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/2435c414-4139-432c-9ae3-be00129614ff.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "f9023f8c-e24a-4593-8a8a-d621572d842e",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f9023f8c-e24a-4593-8a8a-d621572d842e/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f9023f8c-e24a-4593-8a8a-d621572d842e/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/2435c414-4139-432c-9ae3-be00129614ff.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "a08093a6-398b-4ffa-9bca-24b090bc8cb6",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a08093a6-398b-4ffa-9bca-24b090bc8cb6/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a08093a6-398b-4ffa-9bca-24b090bc8cb6/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/2435c414-4139-432c-9ae3-be00129614ff.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "35528483-1948-4443-ad50-fc9119a3a681",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/35528483-1948-4443-ad50-fc9119a3a681/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/35528483-1948-4443-ad50-fc9119a3a681/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/2435c414-4139-432c-9ae3-be00129614ff.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "57b70156-01bf-42d2-b91f-c8e00fb15379",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/57b70156-01bf-42d2-b91f-c8e00fb15379/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/57b70156-01bf-42d2-b91f-c8e00fb15379/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/2435c414-4139-432c-9ae3-be00129614ff.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "e2276ffa-62ea-4c6b-bf91-eb02cece04ba",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e2276ffa-62ea-4c6b-bf91-eb02cece04ba/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e2276ffa-62ea-4c6b-bf91-eb02cece04ba/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/2435c414-4139-432c-9ae3-be00129614ff.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "3246650b-d1ac-4561-b588-64c05eb114fa",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3246650b-d1ac-4561-b588-64c05eb114fa/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3246650b-d1ac-4561-b588-64c05eb114fa/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/2435c414-4139-432c-9ae3-be00129614ff.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "91b5dbdc-aa17-4a56-9b6c-a90025a731ca",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/91b5dbdc-aa17-4a56-9b6c-a90025a731ca/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/91b5dbdc-aa17-4a56-9b6c-a90025a731ca/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/2435c414-4139-432c-9ae3-be00129614ff.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "42c124e3-5223-4df7-ab47-e8ebd1ca142d",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/42c124e3-5223-4df7-ab47-e8ebd1ca142d/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/42c124e3-5223-4df7-ab47-e8ebd1ca142d/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/2435c414-4139-432c-9ae3-be00129614ff.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "89722f56-1ed6-41e7-90ac-932c125fb417",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/89722f56-1ed6-41e7-90ac-932c125fb417/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/89722f56-1ed6-41e7-90ac-932c125fb417/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/2435c414-4139-432c-9ae3-be00129614ff.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "62b656eb-90f7-4272-aa70-5d9498d19a52",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/62b656eb-90f7-4272-aa70-5d9498d19a52/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/62b656eb-90f7-4272-aa70-5d9498d19a52/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/2435c414-4139-432c-9ae3-be00129614ff.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Deep Green": "https://m.media-amazon.com/images/I/31HgYz27-RL._AC_SR38,50_.jpg",
    "Blue": "https://m.media-amazon.com/images/I/31Yo0MHw06L._AC_SR38,50_.jpg",
    "Dark Khaki": "https://m.media-amazon.com/images/I/4198MxysgsL._AC_SR38,50_.jpg",
    "Deep Red": "https://m.media-amazon.com/images/I/413enk6rNgL._AC_SR38,50_.jpg",
    "Deep Brown": "https://m.media-amazon.com/images/I/31ETBJxx+9L._AC_SR38,50_.jpg",
    "Deep Black": "https://m.media-amazon.com/images/I/31-kAOIB33L._AC_SR38,50_.jpg",
    "Dusty Pink": "https://m.media-amazon.com/images/I/31zy16USw1L._AC_SR38,50_.jpg",
    "Army Green": "https://m.media-amazon.com/images/I/3122AD391HL._AC_SR38,50_.jpg",
    "Grey Solid": "https://m.media-amazon.com/images/I/418tamNzI4L._AC_SR38,50_.jpg",
    "Deep Grey": "https://m.media-amazon.com/images/I/31DcK5spn5L._AC_SR38,50_.jpg",
    "Light Orange": "https://m.media-amazon.com/images/I/41nQyfWQ3NL._AC_SR38,50_.jpg",
    "Coffee Brown": "https://m.media-amazon.com/images/I/41Tqm1Lga9L._AC_SR38,50_.jpg",
    "Khaki": "https://m.media-amazon.com/images/I/415MDBUA8eL._AC_SR38,50_.jpg",
    "Beige": "https://m.media-amazon.com/images/I/41fWk5OkcoL._AC_SR38,50_.jpg",
    "Lake Green": "https://m.media-amazon.com/images/I/31NfkhuDYfL._AC_SR38,50_.jpg",
    "Dark Blue": "https://m.media-amazon.com/images/I/41eh4f+J2WL._AC_SR38,50_.jpg",
    "Light Purple": "https://m.media-amazon.com/images/I/41wG6NpJtCL._AC_SR38,50_.jpg",
    "Denim Blue": "https://m.media-amazon.com/images/I/31wB4dJpwOL._AC_SR38,50_.jpg",
    "Chocolate Brown": "https://m.media-amazon.com/images/I/41DSCVNaGBL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Deep Green": "61ti4RomgAL",
    "Blue": "716fU+dsDrL",
    "Dark Khaki": "61iXRi4yhrL",
    "Deep Red": "61vBMO459PL",
    "Deep Brown": "61YrAizy-yL",
    "Deep Black": "61j4NBxQYSL",
    "Dusty Pink": "71usTPCL33L",
    "Army Green": "61FsE9ORY7L",
    "Grey Solid": "71jO56M8mkL",
    "Deep Grey": "61SoEJkjHaL",
    "Light Orange": "61CWGxIXdHL",
    "Coffee Brown": "61OvBi-EHAL",
    "Khaki": "71RQ+7X23ZL",
    "Beige": "618TiTE4OCL",
    "Lake Green": "61GDsdEjhEL",
    "Dark Blue": "61MUuBK9-dL",
    "Light Purple": "61S54KBTN9L",
    "Denim Blue": "613mq7VvFdL",
    "Chocolate Brown": "61MZRFrm3rL"
  },
  "color_images": {
    "Deep Green": [
      "https://m.media-amazon.com/images/I/61ti4RomgAL._SL1500_.jpg"
    ],
    "Blue": [
      "https://m.media-amazon.com/images/I/716fU+dsDrL._SL1500_.jpg"
    ],
    "Dark Khaki": [
      "https://m.media-amazon.com/images/I/61iXRi4yhrL._SL1500_.jpg"
    ],
    "Deep Red": [
      "https://m.media-amazon.com/images/I/61vBMO459PL._SL1500_.jpg"
    ],
    "Deep Brown": [
      "https://m.media-amazon.com/images/I/61YrAizy-yL._SL1500_.jpg"
    ],
    "Deep Black": [
      "https://m.media-amazon.com/images/I/61j4NBxQYSL._SL1500_.jpg"
    ],
    "Dusty Pink": [
      "https://m.media-amazon.com/images/I/71usTPCL33L._SL1500_.jpg"
    ],
    "Army Green": [
      "https://m.media-amazon.com/images/I/61FsE9ORY7L._SL1500_.jpg"
    ],
    "Grey Solid": [
      "https://m.media-amazon.com/images/I/71jO56M8mkL._SL1500_.jpg"
    ],
    "Deep Grey": [
      "https://m.media-amazon.com/images/I/61SoEJkjHaL._SL1500_.jpg"
    ],
    "Light Orange": [
      "https://m.media-amazon.com/images/I/61CWGxIXdHL._SL1500_.jpg"
    ],
    "Coffee Brown": [
      "https://m.media-amazon.com/images/I/61OvBi-EHAL._SL1500_.jpg"
    ],
    "Khaki": [
      "https://m.media-amazon.com/images/I/71RQ+7X23ZL._SL1500_.jpg"
    ],
    "Beige": [
      "https://m.media-amazon.com/images/I/618TiTE4OCL._SL1500_.jpg"
    ],
    "Lake Green": [
      "https://m.media-amazon.com/images/I/61GDsdEjhEL._SL1500_.jpg"
    ],
    "Dark Blue": [
      "https://m.media-amazon.com/images/I/61MUuBK9-dL._SL1500_.jpg"
    ],
    "Light Purple": [
      "https://m.media-amazon.com/images/I/61S54KBTN9L._SL1500_.jpg"
    ],
    "Denim Blue": [
      "https://m.media-amazon.com/images/I/613mq7VvFdL._SL1500_.jpg"
    ],
    "Chocolate Brown": [
      "https://m.media-amazon.com/images/I/61MZRFrm3rL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 129.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/81xqcRe24OL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-long-sleeve",
      "title": "Womens Maxi Dress Bodycon Long Sleeve",
      "price": 27.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/419lpifTakL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon",
      "title": "Womens Maxi Dress Bodycon",
      "price": 42.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51zIrDRteoL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 36.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61zhcs54aWL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-long-sleeve",
      "title": "Womens Maxi Dress Maxi Long Sleeve",
      "price": 19.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61Xl9mi8+HL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-formal",
      "title": "Womens Maxi Dress Formal",
      "price": 94.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71ZICH4P4GL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-mermaid-evening",
      "title": "Womens Maxi Dress Mermaid Evening",
      "price": 69.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51UnCUA9Q3L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-v-neck-long-sleeve",
      "title": "Womens Maxi Dress Formal V Neck Long Sleeve",
      "price": 89.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61sfANi9ghL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail-v-neck",
      "title": "Womens Dress Cocktail V Neck",
      "price": 41.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61xFkD6rBnL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-formal-evening",
      "title": "Womens Dress Formal Evening",
      "price": 82.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51nyRVAgupL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-evening",
      "title": "Womens Dress Evening",
      "price": 79.89,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61oIMymYSQL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-ruched-sleeveless-cocktail-split-bodycon-maxi",
      "title": "Womens Maxi Dress Ruched Sleeveless Cocktail Split Bodycon Maxi",
      "price": 51.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61HFY2CIRkL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail",
      "title": "Womens Dress Cocktail",
      "price": 45.95,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61Eg0ngzG4L._SL1500_.jpg"
      ]
    }
  ]
}