{
  "id": "womens-maxi-dress-maxi-sleeveless",
  "handle": "womens-maxi-dress-maxi-sleeveless",
  "sku": "JC1374",
  "asin": "B0B2P9PVGB",
  "title": "Womens Maxi Dress Maxi Sleeveless",
  "title_original": "CUPSHE Women's Summer Dresses Sleeveless Lace Casual Tassel Beach Spaghetti Straps Flowy Maxi Sun Dress",
  "brand": "Visit the CUPSHE Store",
  "price": 48.99,
  "social_proof": {
    "bought_past_month": 58,
    "text": "58+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/61C7-A2R4HL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71zGocDkaJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/719M4fE3xLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71jjj6Lw3uL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71KRJ92+0qL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71UuYg-wICL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71L+G3YNB8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71rBsDB0t8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/618TXP7WEqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71QnZY-uHSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61uLkHY-GCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61L+itUc6ML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71X0QGbSVCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61wYmSwkVyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71wKqp1xg+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Ay9o7HGvL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61khpQ6CPuL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71PtLp5d-RL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71lAaf6j36L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61eduCWiGML._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/61C7-A2R4HL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71zGocDkaJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/719M4fE3xLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71jjj6Lw3uL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71KRJ92+0qL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71UuYg-wICL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71L+G3YNB8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71rBsDB0t8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/618TXP7WEqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71QnZY-uHSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61uLkHY-GCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61L+itUc6ML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71X0QGbSVCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61wYmSwkVyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71wKqp1xg+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Ay9o7HGvL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61khpQ6CPuL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71PtLp5d-RL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71lAaf6j36L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61eduCWiGML._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Package Dimensions ‏": "‎ 5 x 4 x 3 inches; 7.04 ounces",
    "Item model number ‏": "‎ CAA05A2E063GG",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ July 8, 2022",
    "ASIN ‏": "‎ B0D427RBP1",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#26,919 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #217 in Women's Casual Dresses",
    "Customer Reviews": "4.2 4.2 out of 5 stars (6,389)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Wine",
      "Brown",
      "Blue",
      "Olive Green",
      "Black",
      "Dark Green",
      "Mint Green",
      "Pink",
      "White",
      "Beige",
      "Yellow",
      "Royal Blue",
      "Rust Red",
      "B-orange",
      "Green"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.2,
    "count": 6389,
    "customers_say": "Customers find the dress comfortable, particularly on hot days, and appreciate its flattering design that accentuates curves. Moreover, the dress receives positive feedback for its appearance, fit, and suitability for various occasions, including beach weddings and outdoor summer events. However, opinions about size and fabric quality are mixed - while some find it true to size with good fabric, others report it runs too small and describe the material as like a cheap t-shirt. Select to learn more Appearance Fit Quality Comfort Flattering Dress quality Size Fabric quality 609 customers mention \"Appearance\" 556 positive 53 negative Customers find the dress very pretty, sexy, and feminine, with one customer describing it as boho. \"This dress was so beautiful and perfect for white night on our cruise! It’s very flattering & very light weight! . I got a XL & it fit perfectly!...\" Read more \" Beautiful dress ! I ordered the XL and I wear a size US 16. It fit nicely, just needed to tighten up the straps to hold up my bust....\" Read more \"It's cute but definitely thinner material than expected. Purchased to wear to my baby shower (7 months pregnant currently) so I sized up to a medium....\" Read more \"I did end up returning this, but it is super cute . I bought it for a wedding and it just wasn't appropriate for that. But it is a super cute dress....\" Read more 347 customers mention \"Fit\" 290 positive 57 negative Customers like how the dress fits, with one mentioning it is longer in the back. \"This is not just comfy, but fits perfectly ! The length is great. I am 5’10, and it hits at all the right places. Fits just like in the stock photos....\" Read more \" Fits great . It’s flattering and comfortable. Totally adorable with a denim jacket & sneakers or sandals and a shawl. XL fit perfectly.\" Read more \" Fit perfectly , fabric is lightweight and I will be washing on gentle cycle and hanging to dry. This was another great purchase for my cruise.\" Read more \"Wasn’t sure about the fabric but ended up to be great quality and perfect fit . I bought 3 dresse for family beach photos snd this one was my favorite!\" Read more 242 customers mention \"Quality\" 188 positive 54 negative Customers praise the dress's construction, describing it as beautiful and well-made, with one customer specifically noting the quality of the ties. \"Wasn’t sure about the fabric but ended up to be great quality and perfect fit. I bought 3 dresse for family beach photos snd this one was my favorite!\" Read more \" Love this dress . It's very flattering. Can't wait to wear it . Im 5'11 and a double d fits perfectly its comfortabe soft....\" Read more \"...It was perfect for the occasion! Lightweight but good quality and very nice details!! Fit was as expected and was forgiving, hiding any tummy issues....\" Read more \"...When received, dress was not as nice looking. Cheaply made . Picture of a beautiful dress was deceiving. Bought 2 different sizes to be safe....\" Read more 155 customers mention \"Comfort\" 144 positive 11 negative Customers find the dress comfortable, particularly on hot days, and appreciate that it's not itchy or scratchy. \"...about their clothes lately, but this one is nice material, comfortable , and super flattering. I get so many compliments on it. Just get it already! ;)\" Read more \"I really liked this dress. It is very comfortable and flowy, but I didn't realize that it was see through at the bottom below the knee which is fine....\" Read more \"This is not just comfy , but fits perfectly! The length is great. I am 5’10, and it hits at all the right places. Fits just like in the stock photos....\" Read more \"Quality was pretty good. Color perfect super comfortable floaty value exceptionable did not need any slips and honestly, you do not need a bra with...\" Read more 121 customers mention \"Flattering\" 98 positive 23 negative Customers find the dress flattering, particularly noting how it accentuates curves and works well for various body types, with one customer mentioning it effectively hides tummy issues. \"...and coverage to wear without a bra, yet still felt secure and flattering . The fit was true to size, accentuating my curves without being too tight....\" Read more \"The fit and size of this is amazing. Very flattering and comfortable. For size reference I am a hourglass shape Size 14. 5’6 180ish....\" Read more \"...clothes lately, but this one is nice material, comfortable, and super flattering . I get so many compliments on it. Just get it already! ;)\" Read more \" So flattering ! I got a ton of compliments on it! The only alteration I made was cutting off the pompoms :) Other than those, love it!!\" Read more 85 customers mention \"Dress quality\" 84 positive 1 negative Customers love this dress for summer occasions, particularly noting it works well for beach weddings and outdoor events. One customer mentions it was perfect for their beach engagement photoshoot. \"The perfect summer dress , it is flowy and fresh, you can dress it up or down with accessories, it is comfortable and flattering, I absolutely loved...\" Read more \"...Size is very close to accurate. Worth the buy and a great summer dress . Would love if they had more variety of colors.\" Read more \"...Flattering and great for summer \" Read more \"...They are very thin. Very appropriate for a 2nd marriage. Casual , would be great for a beach wedding....\" Read more 99 customers mention \"Size\" 65 positive 34 negative Customers have mixed opinions about the dress's size, with some finding it true to size while others report it runs too small, particularly noting that the straps are tiny and the dress is shorter than advertised measurements. \"Probably one of the best Amazon purchases I’ve made in clothing. True to size , looks exactly like picture and is extremely feminine, dress flows...\" Read more \" Not true to size ....\" Read more \"...Wore it to my bridal shower. Runs true to size . Didn’t need a bra with it, I’m a D36, just a few cup inserts worked.\" Read more \"... Sizing is true to size .\" Read more 93 customers mention \"Fabric quality\" 52 positive 41 negative Customers have mixed opinions about the fabric of the dress, with some praising its great quality while others find it feels like a cheap T-shirt and is delicate. \"Love this dress, great fit, very flattering, it flows great, great material , very light and flattering in the bust.\" Read more \"...it get snagged really easy on everything even shoes and the fabric is really cheap is definitely not worth the money l bought it for my daughter...\" Read more \"...It is a little transparent so I would advise shape wear. The fabric is nice and the value can’t be beat. The dress is very comfortable without a bra....\" Read more \"It doesn't state anywhere in the description that the lining is 100% polyester ...this has the most contact with your body.\" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Beautiful dress",
        "body": "Fit well. Hubby loved it. I’m apple shaped and carry most of my weight in my midsection and this was flattering. Shows off arms, legs, cleavage. Kinda flowy in belly area so very forgiving. Sorry I didn’t get a full length photo, I did feel beautiful on our date though. Definitely worth trying! Read more",
        "author": "Katherine McKeithen",
        "rating": 5.0,
        "date": "December 6, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61EpMn+joKL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Summer Perfection in a Dress!",
        "body": "I fell in love with this CUPSHE maxi the moment I slipped it on! The lightweight fabric is ideal for hot summer days and breezy nights—it feels like wearing a cloud. I chose the white version, and it’s absolutely stunning. I’m planning to wear it to a BBQ and Bands & Brews, styled with brown low sandals, a white and brown Coach purse, and gold earrings for a casual yet polished look. The fit is spot-on! I always wear a medium, and this dress hugged just right—especially flattering for my 34DD bust. The adjustable spaghetti straps and flowy silhouette make it both comfortable and flattering. I’m already eyeing another color because one just isn’t enough! If you’re looking for a breezy, boho-inspired summer dress that’s effortlessly chic, this one’s a winner. Read more",
        "author": "PinkShoes1116",
        "rating": 5.0,
        "date": "July 16, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Cute Comfy Dress, Quality Ok",
        "body": "The media could not be loaded. The dress actually fits pretty well and it’s pretty cute. The length is nowhere near what the photos suggest and is below the knee to maybe mid calf at most. I would have liked it to be longer as advertised but it’s still cute and fits well. The quality isn’t horrible but it definitely could be better with that price. I freshened it up in the dryer for a few minutes to get the wrinkles out and the little fluffy balls on the strings fell right off. It honestly looks better without them, as they look like cheap cat toys. Read more",
        "author": "Adie whitlow",
        "rating": 4.0,
        "date": "October 7, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71I8ldnSLaL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Very happy hot mess mama about to become a Mrs.!",
        "body": "I love this dress. It is simple, yet elegant with all of the lace. I feel like it flows gracefully. I like how it is shorter in front with a slip and longer in back. Somehow that makes my 49 year old self feel somewhat sexy, while being classy at the same time. The best part is that it really hides my larger sized midsection. I am 5'5 and 277lbs, and my usual fit is 22/24 (2x or 3x for the ultimate comfort. I like a lot of breathing room). The recommended size was 2x, and it fits true to size for me. I have had sensory issues with my back since my spinal surgery, and it is hard to find something that does not make me want to crawl of my skin. This to me is comfortable. It was worth the money I paid, however, it does seem quite delicate, so it is important to be mindful when putting it on and taking it off. ** It did come with pom poms in the front attached to the tassels. I cut them off and made it more my style. I also used a cover up because the dress is strappy and I have flabby arms. Lastly, the dress lining is thin, so light colored panties may be the best option. I am using this dress for a simple wedding ceremony and really pleased with my choice. Read more",
        "author": "hotmessmama",
        "rating": 5.0,
        "date": "May 27, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71b+E+rnj7L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Wash and wear easy for summer traveling",
        "body": "Love this dress!! Good for warm weather. The Lacey feel is beautifully soft and washes well. I hang dry and looks amazing! Got compliments from friends and strangers so I recommend it is much a flattering fit. Read more",
        "author": "Christine Wachter",
        "rating": 5.0,
        "date": "October 12, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Coachella Summer Dress Vibe",
        "body": "Looked as described. Fit well. I was disappointed that the little pom poms fell off in the dryer on the first wash. Cute look with cowboy boots as well. Read more",
        "author": "Elizabeth Doerrfeld",
        "rating": 3.0,
        "date": "July 19, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars HIGHLY RECOMMEND! I love this dress so much",
        "body": "I purchased the CUPSHE Women's Sleeveless Summer Dress for our Key West trip, and it was a total hit! The flowy, lightweight fabric kept me cool and comfortable in the humid Florida heat, and the vibrant design screamed tropical chic. As someone with a 34DDD bust, I was thrilled that the dress provided enough support and coverage to wear without a bra, yet still felt secure and flattering. The fit was true to size, accentuating my curves without being too tight. It was perfect for casual beach strolls and dinners out. Easy to pack, wrinkle-resistant, and super versatile—this dress is a summer must-have! Highly recommend! Read more",
        "author": "Renee",
        "rating": 5.0,
        "date": "July 29, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Not best quality, skirt liner is shorter in person.",
        "body": "5'6 130lbs. I bought this in a S and a M and honestly could wear either. The S, the skirt liner looked a lot shorter and the chest area was fine, more snug than the M. In the photos, it looks like the skirt goes to the top of the knee. That model must be short. Look at some of the lower photos and you'll see the skirt is more like 2/3 of the way down the thigh. For a long dress, this liner is pretty short. My husband said he didn't like the dress on me in S but did in M, so M stayed. I echo other reviews, the lace below the bra line does not go all the way around and there is a bit of odd lace on the back of the dress that sticks out on both sides. This is just poor sewing or design. Also, the quality is not amazing for a $50 dress. It honestly doesn't merit that price for this quality. But the dress is lightweight and flowy and does look nice on. Read more",
        "author": "Flyer",
        "rating": 4.0,
        "date": "November 1, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Maxi Sleeveless is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.",
  "about_this_item": "Womens Maxi Dress Maxi Sleeveless is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.",
  "long_description": "Womens Maxi Dress Maxi Sleeveless is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Wine, Brown, Blue, Olive Green, Black, Dark Green, Mint Green, Pink, White, Beige, Yellow, Royal Blue, Rust Red, B-orange. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Maxi Sleeveless is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Wine, Brown, Blue, Olive Green, Black, Dark Green, Mint Green, Pink, White, Beige, Yellow, Royal Blue, Rust Red, B-orange. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "a2596067-1ff7-41d3-804c-32ec28345af8",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a2596067-1ff7-41d3-804c-32ec28345af8/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a2596067-1ff7-41d3-804c-32ec28345af8/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/82c43e56-058b-4c06-b43b-c9d03525c489.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "51e4faef-fcfb-4c87-ac88-566ab656c2ee",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/51e4faef-fcfb-4c87-ac88-566ab656c2ee/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/51e4faef-fcfb-4c87-ac88-566ab656c2ee/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/82c43e56-058b-4c06-b43b-c9d03525c489.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "72d84b9b-aab7-471a-b80f-53a5e60128ea",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/72d84b9b-aab7-471a-b80f-53a5e60128ea/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/72d84b9b-aab7-471a-b80f-53a5e60128ea/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/82c43e56-058b-4c06-b43b-c9d03525c489.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "8a661188-8f2c-45a4-828f-659821be8bf2",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8a661188-8f2c-45a4-828f-659821be8bf2/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8a661188-8f2c-45a4-828f-659821be8bf2/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/82c43e56-058b-4c06-b43b-c9d03525c489.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "bb2645c2-cf9b-464c-835a-6487422c59d5",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bb2645c2-cf9b-464c-835a-6487422c59d5/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bb2645c2-cf9b-464c-835a-6487422c59d5/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/82c43e56-058b-4c06-b43b-c9d03525c489.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "0a684051-fd35-48b1-bcd9-521de5dc2593",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0a684051-fd35-48b1-bcd9-521de5dc2593/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0a684051-fd35-48b1-bcd9-521de5dc2593/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/82c43e56-058b-4c06-b43b-c9d03525c489.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "8e7243e1-d263-498a-9491-10f9ec5563c3",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8e7243e1-d263-498a-9491-10f9ec5563c3/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8e7243e1-d263-498a-9491-10f9ec5563c3/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/82c43e56-058b-4c06-b43b-c9d03525c489.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "61e76f6e-95cf-4440-aec0-bae43673b223",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/61e76f6e-95cf-4440-aec0-bae43673b223/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/61e76f6e-95cf-4440-aec0-bae43673b223/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/82c43e56-058b-4c06-b43b-c9d03525c489.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "d0d6a0ed-99f5-4313-936d-33e50ef2066c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d0d6a0ed-99f5-4313-936d-33e50ef2066c/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d0d6a0ed-99f5-4313-936d-33e50ef2066c/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/82c43e56-058b-4c06-b43b-c9d03525c489.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "e81c8c3f-9442-4cb3-a8aa-45d38a1699ae",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e81c8c3f-9442-4cb3-a8aa-45d38a1699ae/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e81c8c3f-9442-4cb3-a8aa-45d38a1699ae/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/82c43e56-058b-4c06-b43b-c9d03525c489.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "ad937670-6df9-4d8c-9465-5cd4304c686c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ad937670-6df9-4d8c-9465-5cd4304c686c/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ad937670-6df9-4d8c-9465-5cd4304c686c/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/82c43e56-058b-4c06-b43b-c9d03525c489.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "ce05d4cb-dd1b-47f7-b987-83d482c19fe7",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ce05d4cb-dd1b-47f7-b987-83d482c19fe7/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ce05d4cb-dd1b-47f7-b987-83d482c19fe7/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/82c43e56-058b-4c06-b43b-c9d03525c489.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Wine": "https://m.media-amazon.com/images/I/41oaaUjyhtL._AC_SR38,50_.jpg",
    "Brown": "https://m.media-amazon.com/images/I/412JRmKl0wL._AC_SR38,50_.jpg",
    "Blue": "https://m.media-amazon.com/images/I/41Kh8Z4tmtL._AC_SR38,50_.jpg",
    "Olive Green": "https://m.media-amazon.com/images/I/412dlH5Jh8L._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/41Ja-zqBHrL._AC_SR38,50_.jpg",
    "Dark Green": "https://m.media-amazon.com/images/I/41d8vUwwCLL._AC_SR38,50_.jpg",
    "Mint Green": "https://m.media-amazon.com/images/I/41Tm580yXdL._AC_SR38,50_.jpg",
    "Pink": "https://m.media-amazon.com/images/I/41Jgl+U7iFL._AC_SR38,50_.jpg",
    "White": "https://m.media-amazon.com/images/I/415p1v0v0OL._AC_SR38,50_.jpg",
    "Beige": "https://m.media-amazon.com/images/I/41HzIy1JSNL._AC_SR38,50_.jpg",
    "Yellow": "https://m.media-amazon.com/images/I/41Iv2gkxcYL._AC_SR38,50_.jpg",
    "Royal Blue": "https://m.media-amazon.com/images/I/41hwRzjIE9L._AC_SR38,50_.jpg",
    "Rust Red": "https://m.media-amazon.com/images/I/41l6j-q3X2L._AC_SR38,50_.jpg",
    "B-orange": "https://m.media-amazon.com/images/I/418kkuR1e3L._AC_SR38,50_.jpg",
    "Green": "https://m.media-amazon.com/images/I/41IT1P4FR5L._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Wine": "71L+G3YNB8L",
    "Brown": "71rBsDB0t8L",
    "Blue": "618TXP7WEqL",
    "Olive Green": "71QnZY-uHSL",
    "Black": "61uLkHY-GCL",
    "Dark Green": "61L+itUc6ML",
    "Mint Green": "71X0QGbSVCL",
    "Pink": "61wYmSwkVyL",
    "White": "61C7-A2R4HL",
    "Beige": "71wKqp1xg+L",
    "Yellow": "61Ay9o7HGvL",
    "Royal Blue": "61khpQ6CPuL",
    "Rust Red": "71PtLp5d-RL",
    "B-orange": "71lAaf6j36L",
    "Green": "61eduCWiGML"
  },
  "color_images": {
    "Wine": [
      "https://m.media-amazon.com/images/I/71L+G3YNB8L._SL1500_.jpg"
    ],
    "Brown": [
      "https://m.media-amazon.com/images/I/71rBsDB0t8L._SL1500_.jpg"
    ],
    "Blue": [
      "https://m.media-amazon.com/images/I/618TXP7WEqL._SL1500_.jpg"
    ],
    "Olive Green": [
      "https://m.media-amazon.com/images/I/71QnZY-uHSL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/61uLkHY-GCL._SL1500_.jpg"
    ],
    "Dark Green": [
      "https://m.media-amazon.com/images/I/61L+itUc6ML._SL1500_.jpg"
    ],
    "Mint Green": [
      "https://m.media-amazon.com/images/I/71X0QGbSVCL._SL1500_.jpg"
    ],
    "Pink": [
      "https://m.media-amazon.com/images/I/61wYmSwkVyL._SL1500_.jpg"
    ],
    "White": [
      "https://m.media-amazon.com/images/I/61C7-A2R4HL._SL1500_.jpg"
    ],
    "Beige": [
      "https://m.media-amazon.com/images/I/71wKqp1xg+L._SL1500_.jpg"
    ],
    "Yellow": [
      "https://m.media-amazon.com/images/I/61Ay9o7HGvL._SL1500_.jpg"
    ],
    "Royal Blue": [
      "https://m.media-amazon.com/images/I/61khpQ6CPuL._SL1500_.jpg"
    ],
    "Rust Red": [
      "https://m.media-amazon.com/images/I/71PtLp5d-RL._SL1500_.jpg"
    ],
    "B-orange": [
      "https://m.media-amazon.com/images/I/71lAaf6j36L._SL1500_.jpg"
    ],
    "Green": [
      "https://m.media-amazon.com/images/I/61eduCWiGML._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 47.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61WNtzQlpvL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-maxi-formal-long-sleeve",
      "title": "Womens Maxi Dress Bodycon Maxi Formal Long Sleeve",
      "price": 29.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61mnhC3OzLL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-sleeveless-ruched-bodycon-cocktail",
      "title": "Womens Dress Sleeveless Ruched Bodycon Cocktail",
      "price": 48.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Work",
      "images": [
        "https://m.media-amazon.com/images/I/61pGnWrgkyL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening",
      "title": "Womens Maxi Dress Formal Evening",
      "price": 64.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/516ScMrYzlL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 45.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51g3DTDsW9L._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-formal-v-neck",
      "title": "Womens Maxi Dress Formal V Neck",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51cMfA7Z9XL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 43.69,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61-pFN+nfgL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-cocktail-evening-off-shoulder",
      "title": "Womens Maxi Dress Formal Cocktail Evening Off Shoulder",
      "price": 40.84,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61gKUfw8aaL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-ruched",
      "title": "Womens Maxi Dress Long Sleeve Ruched",
      "price": 38.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61wx6wsmeQL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/81YEThkfM3L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail-v-neck",
      "title": "Womens Dress Cocktail V Neck",
      "price": 42.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/81Ct0tUZJRL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-formal-one-shoulder",
      "title": "Womens Maxi Dress Evening Formal One Shoulder",
      "price": 69.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/619Po5TvLvL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-formal-short-sleeve-mermaid-evening",
      "title": "Womens Dress Formal Short Sleeve Mermaid Evening",
      "price": 104.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71M8KcrOhyL._SL1500_.jpg"
      ]
    }
  ]
}