{
  "id": "womens-maxi-dress-cocktail-v-neck-long-sleeve",
  "handle": "womens-maxi-dress-cocktail-v-neck-long-sleeve",
  "sku": "JC1676",
  "asin": "B0B38WFHLD",
  "title": "Womens Maxi Dress Cocktail V Neck Long Sleeve",
  "title_original": "IN'VOLAND Plus Size Womens Glitter Dress V Neck Long Sleeve Ruffle Hem Swing Club Cocktail Party Dresses",
  "brand": "Visit the IN'VOLAND Store",
  "price": 45.99,
  "social_proof": {
    "bought_past_month": 143,
    "text": "143+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/81Ao8ojwo0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81d5tzV+jWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91J5bxzkRVL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81cVhMn9EaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81u+tIPvgqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91KWLLTIsfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/A1Y-xfMi1EL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81fe191GDLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81399wIuz+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81YYfJtMP1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81TnBNr6xGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81ukRvadybL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81QO-bLCCiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/815PjwSfORL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81980dUJ7mL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/8112nY10TWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/812bVC-g9lL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81igY5REA6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81ZkU2GVUcL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/81Ao8ojwo0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81d5tzV+jWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91J5bxzkRVL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81cVhMn9EaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81u+tIPvgqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91KWLLTIsfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/A1Y-xfMi1EL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81fe191GDLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81399wIuz+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81YYfJtMP1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81TnBNr6xGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81ukRvadybL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81QO-bLCCiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/815PjwSfORL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81980dUJ7mL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/8112nY10TWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/812bVC-g9lL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81igY5REA6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81ZkU2GVUcL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Package Dimensions ‏": "‎ 13.39 x 11.02 x 1.18 inches; 11.29 ounces",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ January 20, 2024",
    "ASIN ‏": "‎ B0BNMDMNDW",
    "Best Sellers Rank": "#39,221 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #385 in Women's Cocktail Dresses",
    "Customer Reviews": "4.2 4.2 out of 5 stars (1,162)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Brown",
      "Brown2",
      "Hot Pink",
      "Black",
      "Blue2",
      "Navy Blue",
      "Orange",
      "Dark Green",
      "Red",
      "Wine Red",
      "Khaki",
      "Pink",
      "Purple"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.2,
    "count": 1162,
    "customers_say": "Customers find the dress comfortable, not itchy, and true to size, with one noting it leaves room to move. The dress is flattering on the body, particularly for plus-size figures, and one customer mentions it creates the illusion of a waistline. They appreciate its appearance, with one noting it appears more expensive than it is, and its sparkle that's not overly shimmering. The material thickness receives mixed feedback, with several customers finding it too thin. Select to learn more Fit Appearance Comfort Quality Flattering Sparkle Size Material thickness 140 customers mention \"Fit\" 111 positive 29 negative Customers are satisfied with how the dress fits, noting its appropriate length, and one customer mentions it leaves room to move. \"The dress was perfect! Perfect fit ! Perfect color! Perfect material! I got so many compliments! Will be buying another color…\" Read more \"Nice dress for the price. Was a great fit and very flattering on. The material did not bother me. The Fit was true to size.\" Read more \"Fits well, ordered a size up just in case and it fit perfectly . It’s a little sheer but I usually wear stuff under dresses anyway so it was fine....\" Read more \"I really like this dress only downfall it is really short \" Read more 128 customers mention \"Appearance\" 123 positive 5 negative Customers find the dress super pretty and sexy, with one customer noting it appears more expensive than it is. \"...I wore the red to hoco and it was comfortable and cute ! Definitely recommend! I would make sure to size up tho....\" Read more \"...The fit was perfect and she was beautiful . Dress was well made. Plus size dresses are hard to find where we are (small rural town).\" Read more \"Love this beautiful dress . I looked good going to homecoming\" Read more \" Super cute , better than pix. Fit true to size. Flowey, soft , very feminine looking. I’m considering buying in another color\" Read more 71 customers mention \"Comfort\" 62 positive 9 negative Customers find the dress comfortable, noting it's not scratchy and doesn't cause itching. \"The dress is beautiful and good for formal events. It's stretchy and comfortable . A bit short, i wore shorts under, also snags easily ....\" Read more \"Good fit. Very comfortable . Fabric nice and silver threading didn't disappoint. The length was ideal for my legs and thighs....\" Read more \"Nice plus size dress. It's so comfy feels like pj's. I nice wide belt really upped the glamour. Would by again.\" Read more \"...I'm 5ft 3 260 lbs and 24 plus fits perfectly. super comfy but looks dressy. great for a night out on the town.\" Read more 61 customers mention \"Quality\" 55 positive 6 negative Customers find the dress to be of good quality, with several mentioning their daughters loved it. \" Great dress ! Had a strange smell, but it faded after washing....\" Read more \" Nice dress . Shorter than I thought it would be. A little itchy but I still love it.\" Read more \" Love the dress but be warned if you have sensitive skin you will feel itchy also the green is not the same as pictured but still beautiful.\" Read more \"I immediately loved this dress. Nice material, good quality . I ordered a size18, which was too big. So ultimately returning....\" Read more 41 customers mention \"Flattering\" 38 positive 3 negative Customers find the dress flattering, particularly on plus size figures, with one customer noting it creates the illusion of a waistline and another mentioning it hides the tummy well. \"...It is very flattering and covers up areas that she would normally feel uncomfortable about others seeing. I can't wait until she wears this out again.\" Read more \"Very cute and flattering . Shows just enough cleavage for sass and not too short. The material is good don't wrinkle very easily.\" Read more \"...Quality is pretty good and it is super flattering .\" Read more \"... VERY flattering cut . I am 5’4” 197lbs and I bought XXL. And, IT HAD POCKETS!\" Read more 34 customers mention \"Sparkle\" 27 positive 7 negative Customers appreciate the dress's sparkle, with several noting it has the right amount of shimmer, and one mentioning its slight sheen to the material. \"Love love love this dress! It’s sparkly and flattering!\" Read more \"Loved the dress! It has the right amount of sparkle !...\" Read more \"First, the dress is very pretty. It is shimmery and washes well....\" Read more \"...Material is cheap. Not sequin it’s just glittery . Definitely NOT worth the price!!!\" Read more 30 customers mention \"Size\" 22 positive 8 negative Customers are satisfied with the dress's sizing, finding it true to size and suitable for plus-size women. \"The dress is nice, true to size . However, it was delivered late and couldn’t use it for the event I bought it for.\" Read more \"This dress comes in a very soft fabric. The dress runs true to size and is a great deal for the price....\" Read more \"The dress runs large . I ordered size 20, it’s too big. The top is very loose, I have a big bust size D and it didn’t fill the top. Material is cheap....\" Read more \" Nice plus size dress . It's so comfy feels like pj's. I nice wide belt really upped the glamour. Would by again.\" Read more 36 customers mention \"Material thickness\" 7 positive 29 negative Customers find the dress material too thin. \"...I loved the look of the dress, the fabric feels super cheap as well as thin . You could see my underwear garments through the dress....\" Read more \"Very short on my 5'9\" frame. Also very thin and cheap material. I returned. Could be cute for the right person, but not for me.\" Read more \"...Fit was good and super comfortable. Fabric is a little thin but not see through....\" Read more \"This dress actually looks cute on but it’s very thin material . You can see undergarments right through it....\" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Gorgeous, Comfortable & Sparkly — I Loved It So Much This Is My Third Color!",
        "body": "This dress is such a winner! I have it in three colors now because the fit and style are just that good. The cut is super flattering and the fabric has plenty of stretch, so it’s very comfortable to wear all day. It also has this gorgeous shiny, sparkly finish that makes it perfect for fall events, holidays, or even a casual night out. One of my favorite features is the little snap at the chest, you can keep it closed for extra coverage or leave it open depending on the look you want. Such a thoughtful detail! The only thing to note is that it does need to be steamed when it first arrives, but once you do that, it looks beautiful and flowy. Overall, I absolutely love this dress and keep reaching for it. Comfortable, cute, and just the right amount of sparkle! Read more",
        "author": "The Curvy Darlin",
        "rating": 5.0,
        "date": "December 1, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/719dkmWXw1L._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71jBSnn3y6L._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71FwgQUF+4L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars True to size",
        "body": "Fits fantastic. Nice material, needs a bit of ironing, but overall it looks great. Ordered a size 14 plus, im 5'7, 240lbs with a pear body shape. Read more",
        "author": "Kindle Customer",
        "rating": 5.0,
        "date": "November 30, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/51p4BtIFMwL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/51zvbQ-B6OL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars FANTASTIC Purchase!",
        "body": "All I can say is BUY THE DRESS! I have used it for a vintage themed party, a Christmas party and now I will be wearing it to a work anniversary party for my husband. The material is very soft and THICK. It has a slight sheen to the material making it appear much more expensive and slightly upping the dressy quality. VERY flattering cut. I am 5’4” 197lbs and I bought XXL. And, IT HAD POCKETS! Read more",
        "author": "TxTravelgirl",
        "rating": 5.0,
        "date": "September 22, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/410PzxzxH2L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "4.0 out of 5 stars Good dress for the price!",
        "body": "I ordered this dress last minute for a Halloween costume after another dress disappointed me. I LOVED it! I got so many compliments on this dress. The sizing was accurate and fit me perfectly. The cut out in the front was very appealing, if you know what I mean. The coloring was accurate. The sparkle is not as intense as the picture but is still lovely and a nice touch of femininity. The flow is perfect compared to the fitted top and creates a good contrast. I thought it was very flattering on my body type as a plus sized woman. My only complaint would be that the material was rather itchy and not of a perfect quality. It was worth it for how sparkly it was though. I got used to it after wearing it for a bit and did not mind because I liked the dress so much. It did come wrinkled but it seems tricky to avoid that. I can see myself re-wearing this for events in the future. 100% worth the price. Read more",
        "author": "Julia",
        "rating": 4.0,
        "date": "November 4, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars The dress has some stretch and fit perfectly",
        "body": "The dress fit me perfectly, I bought this dress for my husband's work Christmas party. I received alot of compliments, but the dress felt good and was very comfortable, I would like to buy the red one as well. Read more",
        "author": "Barnes",
        "rating": 5.0,
        "date": "December 6, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "1.0 out of 5 stars Purchase with caution.",
        "body": "Honestly, it was completely see through. I needed it for a wedding I was attending, and I could not wear it due to it being see through and definitely not flattering at all. The picture on the screen was very different from the dress, that I received. Read more",
        "author": "Vicki Felps",
        "rating": 1.0,
        "date": "December 1, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Not as fancy as it looks",
        "body": "Pretty dress. Fits like I expected. It's thinner than expected but still nice. Only issue is it does not look quite like the pictures. It's not as fancy. I bought it for a Gala and it's more like a regular date night dress. Will be returning. Read more",
        "author": "E",
        "rating": 3.0,
        "date": "October 26, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71iLmp-Tu7L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars I LOVED IT",
        "body": "I wore this to girls only party made me feel so sexy!!! I still have the pics I took saved in my phone and good quality that I can still wear today!! Read more",
        "author": "Ayana Anderson",
        "rating": 5.0,
        "date": "December 8, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Cocktail V Neck Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.",
  "about_this_item": "Womens Maxi Dress Cocktail V Neck Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.",
  "long_description": "Womens Maxi Dress Cocktail V Neck Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Brown, Brown2, Hot Pink, Black, Blue2, Navy Blue, Orange, Dark Green, Red, Wine Red, Khaki, Pink, Purple. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Cocktail V Neck Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Brown, Brown2, Hot Pink, Black, Blue2, Navy Blue, Orange, Dark Green, Red, Wine Red, Khaki, Pink, Purple. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "ece23665-9e97-4f9c-b41d-97c247613332",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ece23665-9e97-4f9c-b41d-97c247613332/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ece23665-9e97-4f9c-b41d-97c247613332/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/d0f9074b-208b-430c-91ba-a4c4d576c898.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "9b10acf8-3f5b-4aaf-8fee-d81bd07cdd89",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9b10acf8-3f5b-4aaf-8fee-d81bd07cdd89/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9b10acf8-3f5b-4aaf-8fee-d81bd07cdd89/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/d0f9074b-208b-430c-91ba-a4c4d576c898.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "2cfb3c4e-5802-4142-9ce8-27a05551073e",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2cfb3c4e-5802-4142-9ce8-27a05551073e/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2cfb3c4e-5802-4142-9ce8-27a05551073e/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/d0f9074b-208b-430c-91ba-a4c4d576c898.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "fbc32005-f407-4385-bd14-74c90bee5afb",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/fbc32005-f407-4385-bd14-74c90bee5afb/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/fbc32005-f407-4385-bd14-74c90bee5afb/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/d0f9074b-208b-430c-91ba-a4c4d576c898.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "f285e7e1-6f5b-4d72-8080-0ff784dfedcb",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f285e7e1-6f5b-4d72-8080-0ff784dfedcb/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f285e7e1-6f5b-4d72-8080-0ff784dfedcb/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/d0f9074b-208b-430c-91ba-a4c4d576c898.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "f1bf61e1-d675-4da7-b956-d8a0b0808a2c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f1bf61e1-d675-4da7-b956-d8a0b0808a2c/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f1bf61e1-d675-4da7-b956-d8a0b0808a2c/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/d0f9074b-208b-430c-91ba-a4c4d576c898.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "3d32cc21-aba2-4f52-b632-aa50233bb2c5",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3d32cc21-aba2-4f52-b632-aa50233bb2c5/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3d32cc21-aba2-4f52-b632-aa50233bb2c5/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/d0f9074b-208b-430c-91ba-a4c4d576c898.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "e3dd37cb-8fa0-477b-8dd4-4adaffb3189b",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e3dd37cb-8fa0-477b-8dd4-4adaffb3189b/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e3dd37cb-8fa0-477b-8dd4-4adaffb3189b/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/d0f9074b-208b-430c-91ba-a4c4d576c898.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "874cfbb4-7e0a-4248-bc05-ecc4b91cc35b",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/874cfbb4-7e0a-4248-bc05-ecc4b91cc35b/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/874cfbb4-7e0a-4248-bc05-ecc4b91cc35b/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/d0f9074b-208b-430c-91ba-a4c4d576c898.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "c4689e84-428d-4a55-a59c-bf9518090ab8",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c4689e84-428d-4a55-a59c-bf9518090ab8/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c4689e84-428d-4a55-a59c-bf9518090ab8/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/d0f9074b-208b-430c-91ba-a4c4d576c898.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "5c3017be-0cb0-4ece-9e7e-4fa8b65cfad9",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5c3017be-0cb0-4ece-9e7e-4fa8b65cfad9/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5c3017be-0cb0-4ece-9e7e-4fa8b65cfad9/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/d0f9074b-208b-430c-91ba-a4c4d576c898.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "7c2893ea-384b-48ca-9899-22157a7bb496",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7c2893ea-384b-48ca-9899-22157a7bb496/videopreview.jobtemplate.mp4.342X192P_20HZ_350KBPS_VER_1_0.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7c2893ea-384b-48ca-9899-22157a7bb496/videopreview.jobtemplate.mp4.342X192P_20HZ_350KBPS_VER_1_0.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/d0f9074b-208b-430c-91ba-a4c4d576c898.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Brown": "https://m.media-amazon.com/images/I/41VICfeuH0L._AC_SR38,50_.jpg",
    "Brown2": "https://m.media-amazon.com/images/I/51qGoIzjw8L._AC_SR38,50_.jpg",
    "Hot Pink": "https://m.media-amazon.com/images/I/41uAWBvj-+L._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/41wwwYj-CBL._AC_SR38,50_.jpg",
    "Blue2": "https://m.media-amazon.com/images/I/51rBED0Y5pL._AC_SR38,50_.jpg",
    "Navy Blue": "https://m.media-amazon.com/images/I/41yjcQ-wVOL._AC_SR38,50_.jpg",
    "Orange": "https://m.media-amazon.com/images/I/51Za+mpY7BL._AC_SR38,50_.jpg",
    "Dark Green": "https://m.media-amazon.com/images/I/41Ed6XJ31OL._AC_SR38,50_.jpg",
    "Red": "https://m.media-amazon.com/images/I/41eIXQf-4UL._AC_SR38,50_.jpg",
    "Wine Red": "https://m.media-amazon.com/images/I/41lrKjWE8nL._AC_SR38,50_.jpg",
    "Khaki": "https://m.media-amazon.com/images/I/51spUV+jrQL._AC_SR38,50_.jpg",
    "Pink": "https://m.media-amazon.com/images/I/5167yL5f-QL._AC_SR38,50_.jpg",
    "Purple": "https://m.media-amazon.com/images/I/4151sbEP1QL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Brown": "81fe191GDLL",
    "Brown2": "81399wIuz+L",
    "Hot Pink": "81YYfJtMP1L",
    "Black": "81Ao8ojwo0L",
    "Blue2": "81TnBNr6xGL",
    "Navy Blue": "81ukRvadybL",
    "Orange": "81QO-bLCCiL",
    "Dark Green": "815PjwSfORL",
    "Red": "81980dUJ7mL",
    "Wine Red": "8112nY10TWL",
    "Khaki": "812bVC-g9lL",
    "Pink": "81igY5REA6L",
    "Purple": "81ZkU2GVUcL"
  },
  "color_images": {
    "Brown": [
      "https://m.media-amazon.com/images/I/81fe191GDLL._SL1500_.jpg"
    ],
    "Brown2": [
      "https://m.media-amazon.com/images/I/81399wIuz+L._SL1500_.jpg"
    ],
    "Hot Pink": [
      "https://m.media-amazon.com/images/I/81YYfJtMP1L._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/81Ao8ojwo0L._SL1500_.jpg"
    ],
    "Blue2": [
      "https://m.media-amazon.com/images/I/81TnBNr6xGL._SL1500_.jpg"
    ],
    "Navy Blue": [
      "https://m.media-amazon.com/images/I/81ukRvadybL._SL1500_.jpg"
    ],
    "Orange": [
      "https://m.media-amazon.com/images/I/81QO-bLCCiL._SL1500_.jpg"
    ],
    "Dark Green": [
      "https://m.media-amazon.com/images/I/815PjwSfORL._SL1500_.jpg"
    ],
    "Red": [
      "https://m.media-amazon.com/images/I/81980dUJ7mL._SL1500_.jpg"
    ],
    "Wine Red": [
      "https://m.media-amazon.com/images/I/8112nY10TWL._SL1500_.jpg"
    ],
    "Khaki": [
      "https://m.media-amazon.com/images/I/812bVC-g9lL._SL1500_.jpg"
    ],
    "Pink": [
      "https://m.media-amazon.com/images/I/81igY5REA6L._SL1500_.jpg"
    ],
    "Purple": [
      "https://m.media-amazon.com/images/I/81ZkU2GVUcL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-v-neck-long-sleeve",
      "title": "Womens Maxi Dress V Neck Long Sleeve",
      "price": 36.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61ZwfFeDCIL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-formal-long-sleeve-v-neck",
      "title": "Womens Maxi Dress Maxi Formal Long Sleeve V Neck",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61NwQA9VLPL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-off-shoulder",
      "title": "Womens Maxi Dress Off Shoulder",
      "price": 159.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/71gSdMwmvyL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-sleeveless-short-sleeve",
      "title": "Womens Dress Sleeveless Short Sleeve",
      "price": 38.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71AiLmsrdfL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-v-neck",
      "title": "Womens Maxi Dress Maxi V Neck",
      "price": 51.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71peZX2kilL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-long-sleeve-bodycon",
      "title": "Womens Maxi Dress Long Sleeve Bodycon",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51IlfOb2WTL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi",
      "title": "Womens Maxi Dress Maxi",
      "price": 37.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/81cD936J5PL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening",
      "title": "Womens Maxi Dress Evening",
      "price": 70.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51eDqK+4J0L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-formal",
      "title": "Womens Dress Formal",
      "price": 94.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51PI6vrc2zL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-long-sleeve-v-neck-ruched",
      "title": "Womens Maxi Dress Formal Long Sleeve V Neck Ruched",
      "price": 74.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61+3M8LB72L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-bodycon-maxi",
      "title": "Womens Maxi Dress Cocktail Bodycon Maxi",
      "price": 32.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61tpO1rTF2L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-formal-evening",
      "title": "Womens Dress Formal Evening",
      "price": 85.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51DBpbbgqCL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-maxi-long-sleeve-ruched",
      "title": "Womens Maxi Dress Evening Maxi Long Sleeve Ruched",
      "price": 159.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/81zIL8HcHxL._SL1500_.jpg"
      ]
    }
  ]
}