{
  "id": "womens-maxi-dress-v-neck-long-sleeve",
  "handle": "womens-maxi-dress-v-neck-long-sleeve",
  "sku": "JC1675",
  "asin": "B0B8HHWF36",
  "title": "Womens Maxi Dress V Neck Long Sleeve",
  "title_original": "Imily Bela Womens Fall Long Sleeve Tunic Dress Casual V Neck Loose Ruffle Tiered Dress",
  "brand": "Visit the Imily Bela Store",
  "price": 42.99,
  "social_proof": {
    "bought_past_month": 1711,
    "text": "1711+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/61ESKKVXeyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51idsT6nEML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51Kc+znHt2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/814tUhiM+nL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71JEbS+jZgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61C6kTSkCoL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61IjCdJF+nL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61-Xe59wHIL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61LkNdlqcgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61xh6Xu1-nL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/617uYfF3U-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Es9mvGwJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61GQmFG1YmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Of0r4bTZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/6151ekA1oOL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/6170uGQt0HL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61XVwI2+udL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61yXSJx7XeL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71TMPYw46dL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71LefkAbVaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61fuB4DVCnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/610p4BpDIAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71mmNV3B2RL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/61ESKKVXeyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51idsT6nEML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51Kc+znHt2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/814tUhiM+nL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71JEbS+jZgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61C6kTSkCoL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61IjCdJF+nL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61-Xe59wHIL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61LkNdlqcgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61xh6Xu1-nL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/617uYfF3U-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Es9mvGwJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61GQmFG1YmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Of0r4bTZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/6151ekA1oOL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/6170uGQt0HL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61XVwI2+udL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61yXSJx7XeL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71TMPYw46dL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71LefkAbVaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61fuB4DVCnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/610p4BpDIAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71mmNV3B2RL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ June 2, 2022",
    "ASIN ‏": "‎ B0B319CS8X",
    "Best Sellers Rank": "#13,945 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #92 in Women's Casual Dresses",
    "Customer Reviews": "4.1 4.1 out of 5 stars (767)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "A-light Blue",
      "A-yellow",
      "Z2-green",
      "A-black",
      "A-light Green",
      "A-burgundy",
      "A-navy Blue",
      "Z2-black",
      "A-beige",
      "Z2-sky Blue",
      "A-rose Red",
      "S-coffee",
      "A-coffee",
      "A-orange",
      "Z2-white&blue",
      "Z2-pink",
      "A-blackish Green",
      "A-pink",
      "Z2-dark Blue",
      "Z2-navy"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.1,
    "count": 767,
    "customers_say": "Customers find the dress chic and well-made, with a comfortable fit that's particularly suitable for short people. They appreciate its length, with one noting it sits at an ideal location, and like its color variety, with three options available. The fabric quality receives mixed feedback - while some love the material, others describe it as cheap. The sizing is also mixed, with some finding it true to size while others say it runs large. Generated from the text of customer reviews Select to learn more Cute (105) Quality (85) Fit (83) Color variety (40) Comfort (34) Length (32) Size (65) Fabric quality (55) 105 customers mention cute, 100 positive, 5 negative 105 customers mention \"Cute\" 100 positive 5 negative Customers find the dress super chic, with one mentioning it's very nice to wear to work, and another noting it doesn't make them feel frumpy. \" This dress is cute and comfortable! The material is soft and pretty. The shape is cute and flattering. It also comes in lots of colors.... \" Read more \" Beautiful dress . Fits like a dream. I’m 5’4, 155 got a size M. Very nice material, a bit sheer, but perfect for all seasons. \" Read more \" This dress is super cute in the photo however, it’s miss leading. Instead of being stylish and flattering, it is frumpy and oddly shaped. \" Read more \" Cute dress , as pictured. The lighter weight fabric with long sleeves is perfect for FL winter and pockets are great.... \" Read more 85 customers mention quality, 76 positive, 9 negative 85 customers mention \"Quality\" 76 positive 9 negative Customers find the dress to be well-made and fantastic, with one customer specifically noting its boutique quality with pockets. \" ...Won’t lie. Disappointed because it is a great dress and great quality. Just wish it was more swingy and empire waisted. :... \" Read more \" Great quality . Arrived quickly. Can be dressed up or down. \" Read more \" Love this dress . \" Read more \" ...Fabric is light, rich color, and overall good quality . The dress has a fitted look across the shoulders. I received a lot of compliments wearing it. \" Read more 83 customers mention fit, 68 positive, 15 negative 83 customers mention \"Fit\" 68 positive 15 negative Customers like how the dress fits, particularly noting that it accommodates short people well, and one customer mentions it hits right above the knees. \" A perfect fit . I think I've purchased this dress in several colors. I can't get enough of it. And I get compliments every time I wear it.... \" Read more \" Wore this to a sorority meeting. I loved the quality, the fit , and how comfortable it was. I received multiple compliments. \" Read more \" Absolutely love this dress. Fits great and very flattering. Light weight and comfortable \" Read more \" The fabric was thicker and softer than I expected. The fit was great and I actually liked the look of the dress on more than I thought I would. \" Read more 40 customers mention color variety, 39 positive, 1 negative 40 customers mention \"Color variety\" 39 positive 1 negative Customers love the colors of the dress, with some mentioning it comes in three different shades. \" ...Lightweight fabric, true to size, beautiful color . I plan to buy another one in a fall color! \" Read more \" Love the color and it fits great plus the material feels wonderful. \" Read more \" Fabulous dress fit downsized 1 & great color \" Read more \" The color of this dress is beautiful but its poorly made. The bottom seam of my dress was folded over in several places and couldn't be ironed flat.... \" Read more 34 customers mention comfort, 34 positive, 0 negative 34 customers mention \"Comfort\" 34 positive 0 negative Customers find the dress comfortable. \" This dress is so comfortable and flattering. Bought this for a wedding and it was perfect. Really love the material. Lightweight and flowy.... \" Read more \" ...It’s so comfortable . The length is perfect!!! The material is good quality. Looks like I spent more than I did. I love it!! \" Read more \" Very comfortable Like the length Hit right above the knee and looked great with knee high boots Not see through... \" Read more \" A very comfortable dress \" Read more 32 customers mention length, 24 positive, 8 negative 32 customers mention \"Length\" 24 positive 8 negative Customers like the dress's length, with one mentioning it sits at an ideal location and another noting it's perfect for a short girl. \" Cute dress, as pictured. The lighter weight fabric with long sleeves is perfect for FL winter and pockets are great.... \" Read more \" Beautiful design, easy care, fits perfectly all over and great length . Can wear with knee boots, booties, heels, sandals. Anything!... \" Read more \" ...those who prefer an oversized fit, but for petite frames, it’s just too long and shapeless. \" Read more \" I’m 5’9” & this dress fits beautifully, it’s a nice length , not too short. Flows nicely & has pockets!! Very versatile. \" Read more 65 customers mention size, 27 positive, 38 negative 65 customers mention \"Size\" 27 positive 38 negative Customers have mixed opinions about the dress's sizing, with some finding it true to size while others report it runs large and is too loose. \" Very pretty and well made but runs large . Had to return and could not reorder since small was the smallest size offered. \" Read more \" Adorable dress. Super comfy, true to size and gorgeous rich color. Best feature, pockets!!!! I got a ton of compliments. It washes beautifully. \" Read more \" Love the dress but you might want to size down because it runs a little large . Had to return my large for a medium. \" Read more \" Gorgeous and flattering. Fits true to size . I’m wearing an XL. \" Read more 55 customers mention fabric quality, 35 positive, 20 negative 55 customers mention \"Fabric quality\" 35 positive 20 negative Customers have mixed opinions about the fabric of the dress, with some loving it and finding it wonderful, while others describe it as cheap and note that it has no give. \" I love everything about the dress!! Nice fabric , well made!... \" Read more \" The material is sheer and very static clingy. The dress is not lined. Also the sizing is weird.... \" Read more \" This dress is so cute. Very nice material and looks great with a wide belt. I got many compliments on it. Highly recommend this dress \" Read more \" Great material . Perfect length; sits at the knee - I'm 5'7\" so often dresses are too short, for my liking. Good heavy material; feels luxurious. \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars So comfortable and stylist -buying more colors",
        "body": "Just tried it on for an engagement party tomorrow. Measured and ordered accordingly and the dress fits perfect. The burgundy color is so rich. Love the flow of the dress and style. The sleeves are stylish too. Ordered a black one too. After seeing how nice the fabric is and the style, I am going to order the coffee to go with brown boots. The burgundy will be worn with black boots. Super pleased with this purchase. 63 years old, 5’4, 185 lbs, wear L and XL normally, size 16. I ordered XL for this. It has pockets too! Read more",
        "author": "Terry King",
        "rating": 5.0,
        "date": "October 18, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars A 1",
        "body": "I love this dress, perfect quality, length and fit. The pockets are a bonus. The dress has a decent stretch to it and it does not wrinkle which makes it perfect for travel. There are great colors to choose from as well. I give this a 10. Read more",
        "author": "jill stabeno",
        "rating": 5.0,
        "date": "December 18, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Fall dress",
        "body": "Super cute, comfortable and fits great Read more",
        "author": "wegd",
        "rating": 4.0,
        "date": "December 15, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Perfect for any event.",
        "body": "Wore this to a sorority meeting. I loved the quality, the fit, and how comfortable it was. I received multiple compliments. Read more",
        "author": "DEE",
        "rating": 5.0,
        "date": "December 13, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "1.0 out of 5 stars Extremely oversized.. retuned",
        "body": "Extremely oversized so if that’s the style you want it’s for you. The material is not cotton so it’s much lighter better for a warm fall day then if it were actually chilly out. I loved the idea and pockets but it was a giant balloon on me. I wanted it loose but not a size or 2 too big. Sadly returned! Read more",
        "author": "Life things",
        "rating": 1.0,
        "date": "December 7, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Pretty",
        "body": "Very pretty and well made but runs large. Had to return and could not reorder since small was the smallest size offered. Read more",
        "author": "Shannon",
        "rating": 3.0,
        "date": "November 15, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Lovely!",
        "body": "Lovely!!!!! I’m bigger in the middle and it is hard finding a flattering dress. This one is great. Material is thick and flowing. The detail on the sleeves is very nice. Just need a good steamer to get the wrinkles out. I added some gold jewelry and heels and it looked great for church. The hot pink color is very rich. True to size. I got a size medium. I am 5’ 4” and 160 lbs and it is above my knee and plenty of room in the mid section. Read more",
        "author": "Ginger Hubbard",
        "rating": 5.0,
        "date": "October 27, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/81NZzRCmYLL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Great quality",
        "body": "This dress is so cute. Very nice material and looks great with a wide belt. I got many compliments on it. Highly recommend this dress Read more",
        "author": "Jax",
        "rating": 5.0,
        "date": "November 7, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress V Neck Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.",
  "about_this_item": "Womens Maxi Dress V Neck Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.",
  "long_description": "Womens Maxi Dress V Neck Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: A-light Blue, A-yellow, Z2-green, A-black, A-light Green, A-burgundy, A-navy Blue, Z2-black, A-beige, Z2-sky Blue, A-rose Red, S-coffee, A-coffee, A-orange. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress V Neck Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: A-light Blue, A-yellow, Z2-green, A-black, A-light Green, A-burgundy, A-navy Blue, Z2-black, A-beige, Z2-sky Blue, A-rose Red, S-coffee, A-coffee, A-orange. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "acaa2196-b7b7-44b7-9846-834249d95c46",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/acaa2196-b7b7-44b7-9846-834249d95c46/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/acaa2196-b7b7-44b7-9846-834249d95c46/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "4d7d6d09-2c8b-4694-ba57-95e3d97ec630",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4d7d6d09-2c8b-4694-ba57-95e3d97ec630/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4d7d6d09-2c8b-4694-ba57-95e3d97ec630/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "2d8caa11-5b30-4344-9428-5b57102a4a20",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2d8caa11-5b30-4344-9428-5b57102a4a20/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2d8caa11-5b30-4344-9428-5b57102a4a20/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "25922226-a7e0-4663-a271-adfe3acd5ee5",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/25922226-a7e0-4663-a271-adfe3acd5ee5/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/25922226-a7e0-4663-a271-adfe3acd5ee5/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "709a0a03-96bc-497c-84d0-d43a6c21e0fc",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/709a0a03-96bc-497c-84d0-d43a6c21e0fc/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/709a0a03-96bc-497c-84d0-d43a6c21e0fc/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "be1384ac-1a67-4954-87c9-509fba0c4cef",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/be1384ac-1a67-4954-87c9-509fba0c4cef/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/be1384ac-1a67-4954-87c9-509fba0c4cef/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "4d3c8031-56bc-4213-bf51-cb28d897dafe",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4d3c8031-56bc-4213-bf51-cb28d897dafe/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4d3c8031-56bc-4213-bf51-cb28d897dafe/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "c88f610b-9ef2-4c59-95e2-478c289ccd09",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c88f610b-9ef2-4c59-95e2-478c289ccd09/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c88f610b-9ef2-4c59-95e2-478c289ccd09/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "2da22481-7953-46e8-9295-37caf56b1db6",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2da22481-7953-46e8-9295-37caf56b1db6/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2da22481-7953-46e8-9295-37caf56b1db6/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "b4b4d493-9c0a-467f-8e8d-101861c59ce1",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b4b4d493-9c0a-467f-8e8d-101861c59ce1/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b4b4d493-9c0a-467f-8e8d-101861c59ce1/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "9913d8af-8514-4edb-9cc3-0766e5905a44",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9913d8af-8514-4edb-9cc3-0766e5905a44/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9913d8af-8514-4edb-9cc3-0766e5905a44/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "c13e7024-e861-4958-a2b9-81857898ee72",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c13e7024-e861-4958-a2b9-81857898ee72/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c13e7024-e861-4958-a2b9-81857898ee72/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "A-light Blue": "https://m.media-amazon.com/images/I/31GEsIRbbtL._AC_SR38,50_.jpg",
    "A-yellow": "https://m.media-amazon.com/images/I/31YgbhNPRzL._AC_SR38,50_.jpg",
    "Z2-green": "https://m.media-amazon.com/images/I/41G22rlZ6vL._AC_SR38,50_.jpg",
    "A-black": "https://m.media-amazon.com/images/I/316ZtWMb0SL._AC_SR38,50_.jpg",
    "A-light Green": "https://m.media-amazon.com/images/I/31GRn3pcIuL._AC_SR38,50_.jpg",
    "A-burgundy": "https://m.media-amazon.com/images/I/31BMwkgI5+L._AC_SR38,50_.jpg",
    "A-navy Blue": "https://m.media-amazon.com/images/I/31mUCE6z5jL._AC_SR38,50_.jpg",
    "Z2-black": "https://m.media-amazon.com/images/I/41lWbI4HyqL._AC_SR38,50_.jpg",
    "A-beige": "https://m.media-amazon.com/images/I/31b7kUgIfUL._AC_SR38,50_.jpg",
    "Z2-sky Blue": "https://m.media-amazon.com/images/I/41HMpDfB3oL._AC_SR38,50_.jpg",
    "A-rose Red": "https://m.media-amazon.com/images/I/316oB9aiTVL._AC_SR38,50_.jpg",
    "S-coffee": "https://m.media-amazon.com/images/I/319GrzkXtsL._AC_SR38,50_.jpg",
    "A-coffee": "https://m.media-amazon.com/images/I/319GrzkXtsL._AC_SR38,50_.jpg",
    "A-orange": "https://m.media-amazon.com/images/I/31nrn76I6yL._AC_SR38,50_.jpg",
    "Z2-white&blue": "https://m.media-amazon.com/images/I/41yjeAU9lQL._AC_SR38,50_.jpg",
    "Z2-pink": "https://m.media-amazon.com/images/I/41dy+rJH3ML._AC_SR38,50_.jpg",
    "A-blackish Green": "https://m.media-amazon.com/images/I/31VUbS0zgIL._AC_SR38,50_.jpg",
    "A-pink": "https://m.media-amazon.com/images/I/31IcX4fx4PL._AC_SR38,50_.jpg",
    "Z2-dark Blue": "https://m.media-amazon.com/images/I/41rRcnGP0gL._AC_SR38,50_.jpg",
    "Z2-navy": "https://m.media-amazon.com/images/I/51-h6N9T5xL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "A-light Blue": "61C6kTSkCoL",
    "A-yellow": "61IjCdJF+nL",
    "Z2-green": "61-Xe59wHIL",
    "A-black": "61LkNdlqcgL",
    "A-light Green": "61xh6Xu1-nL",
    "A-burgundy": "617uYfF3U-L",
    "A-navy Blue": "61Es9mvGwJL",
    "Z2-black": "61GQmFG1YmL",
    "A-beige": "61Of0r4bTZL",
    "Z2-sky Blue": "6151ekA1oOL",
    "A-rose Red": "6170uGQt0HL",
    "S-coffee": "61XVwI2+udL",
    "A-coffee": "61XVwI2+udL",
    "A-orange": "61yXSJx7XeL",
    "Z2-white&blue": "71TMPYw46dL",
    "Z2-pink": "71LefkAbVaL",
    "A-blackish Green": "61ESKKVXeyL",
    "A-pink": "61fuB4DVCnL",
    "Z2-dark Blue": "610p4BpDIAL",
    "Z2-navy": "71mmNV3B2RL"
  },
  "color_images": {
    "A-light Blue": [
      "https://m.media-amazon.com/images/I/61C6kTSkCoL._SL1500_.jpg"
    ],
    "A-yellow": [
      "https://m.media-amazon.com/images/I/61IjCdJF+nL._SL1500_.jpg"
    ],
    "Z2-green": [
      "https://m.media-amazon.com/images/I/61-Xe59wHIL._SL1500_.jpg"
    ],
    "A-black": [
      "https://m.media-amazon.com/images/I/61LkNdlqcgL._SL1500_.jpg"
    ],
    "A-light Green": [
      "https://m.media-amazon.com/images/I/61xh6Xu1-nL._SL1500_.jpg"
    ],
    "A-burgundy": [
      "https://m.media-amazon.com/images/I/617uYfF3U-L._SL1500_.jpg"
    ],
    "A-navy Blue": [
      "https://m.media-amazon.com/images/I/61Es9mvGwJL._SL1500_.jpg"
    ],
    "Z2-black": [
      "https://m.media-amazon.com/images/I/61GQmFG1YmL._SL1500_.jpg"
    ],
    "A-beige": [
      "https://m.media-amazon.com/images/I/61Of0r4bTZL._SL1500_.jpg"
    ],
    "Z2-sky Blue": [
      "https://m.media-amazon.com/images/I/6151ekA1oOL._SL1500_.jpg"
    ],
    "A-rose Red": [
      "https://m.media-amazon.com/images/I/6170uGQt0HL._SL1500_.jpg"
    ],
    "S-coffee": [
      "https://m.media-amazon.com/images/I/61XVwI2+udL._SL1500_.jpg"
    ],
    "A-coffee": [
      "https://m.media-amazon.com/images/I/61XVwI2+udL._SL1500_.jpg"
    ],
    "A-orange": [
      "https://m.media-amazon.com/images/I/61yXSJx7XeL._SL1500_.jpg"
    ],
    "Z2-white&blue": [
      "https://m.media-amazon.com/images/I/71TMPYw46dL._SL1500_.jpg"
    ],
    "Z2-pink": [
      "https://m.media-amazon.com/images/I/71LefkAbVaL._SL1500_.jpg"
    ],
    "A-blackish Green": [
      "https://m.media-amazon.com/images/I/61ESKKVXeyL._SL1500_.jpg"
    ],
    "A-pink": [
      "https://m.media-amazon.com/images/I/61fuB4DVCnL._SL1500_.jpg"
    ],
    "Z2-dark Blue": [
      "https://m.media-amazon.com/images/I/610p4BpDIAL._SL1500_.jpg"
    ],
    "Z2-navy": [
      "https://m.media-amazon.com/images/I/71mmNV3B2RL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress-v-neck-sleeveless",
      "title": "Womens Dress V Neck Sleeveless",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/81T7G18uRnL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-boat-neck-sleeveless",
      "title": "Womens Dress Boat Neck Sleeveless",
      "price": 19.79,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/518oJldZIfL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-formal",
      "title": "Womens Dress Formal",
      "price": 69.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51vneqmjy1L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-bodycon-sleeveless",
      "title": "Womens Dress Bodycon Sleeveless",
      "price": 40.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61nnB4TWroL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 324.43,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/41gTuGV5SBL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-formal-evening",
      "title": "Womens Maxi Dress Formal Evening",
      "price": 94.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61fzKHOQJGL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-ruched-v-neck-cocktail-maxi-formal",
      "title": "Womens Maxi Dress Ruched V Neck Cocktail Maxi Formal",
      "price": 129.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71i8AuwBqUL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-off-shoulder-maxi",
      "title": "Womens Maxi Dress Bodycon Off Shoulder Maxi",
      "price": 36.89,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61DDKd5ehZL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-v-neck-bodycon",
      "title": "Womens Maxi Dress Long Sleeve V Neck Bodycon",
      "price": 47.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61QbwpUJEwL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 76.9,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Wedding Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/514+blcsiGL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening",
      "title": "Womens Maxi Dress Formal Evening",
      "price": 77.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61Hj4-S+4eL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-cocktail-ruched",
      "title": "Womens Maxi Dress Bodycon Cocktail Ruched",
      "price": 37.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/91HL3aBO+gL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-v-neck-cocktail-evening-long-sleeve",
      "title": "Womens Maxi Dress V Neck Cocktail Evening Long Sleeve",
      "price": 64.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/71jdGTmoWkL._SL1500_.jpg"
      ]
    }
  ]
}