{
  "id": "womens-maxi-dress-long-sleeve",
  "handle": "womens-maxi-dress-long-sleeve",
  "sku": "JC1566",
  "asin": "B0BD2J1Y62",
  "title": "Womens Maxi Dress Long Sleeve",
  "title_original": "GORGLITTER Women's Button Up Long Sleeve Mini T Shirt Dress Lapel Collar Pleated Flared Short Dresses",
  "brand": "Visit the GORGLITTER Store",
  "price": 43.99,
  "social_proof": {
    "bought_past_month": 50,
    "text": "50+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/611H2dG3jvL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ZDKsOssQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/6181vRm3pIL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71AqkbVBWDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81lZVxPjoaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61eS5FYVNQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61EDBN9KOGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/613q6Z+ZlfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61hwTuXg1QL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71dgpbum9QL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61mCNnxZgGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/619pbkHIBxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Zjwy5B9BL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61PYh76aFOL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71PG5VLHA5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ZgoDEv-RL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Rz+gfeqfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Ghqdal5pL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61q6wYznHOL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/716JLgopviL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/611H2dG3jvL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ZDKsOssQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/6181vRm3pIL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71AqkbVBWDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81lZVxPjoaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61eS5FYVNQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61EDBN9KOGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/613q6Z+ZlfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61hwTuXg1QL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71dgpbum9QL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61mCNnxZgGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/619pbkHIBxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Zjwy5B9BL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61PYh76aFOL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71PG5VLHA5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ZgoDEv-RL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Rz+gfeqfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Ghqdal5pL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61q6wYznHOL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/716JLgopviL._SL1500_.jpg"
  ],
  "aplus_images": [
    "https://m.media-amazon.com/images/I/4132vFciwSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31G3kKGVKQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41JoL7uLN8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41DVAJ6eWnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41yhC77gJ7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41gL91jitLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31Dp%2BVuL4JL._SL1500_.jpg"
  ],
  "description_images": [
    "https://m.media-amazon.com/images/I/4132vFciwSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31G3kKGVKQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41JoL7uLN8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41DVAJ6eWnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41yhC77gJ7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41gL91jitLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31Dp%2BVuL4JL._SL1500_.jpg"
  ],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ September 4, 2022",
    "Manufacturer ‏": "‎ Shein",
    "ASIN ‏": "‎ B0BD161V8S",
    "Best Sellers Rank": "#115,407 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #1,294 in Women's Casual Dresses",
    "Customer Reviews": "4.0 4.0 out of 5 stars (132)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "White",
      "Solid White",
      "Black",
      "Solid Black"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.0,
    "count": 132,
    "customers_say": "Customers find the dress feminine without being fussy and good for casual wear, with true-to-size measurements. However, the fit receives mixed feedback, with some finding it great while others say it's too short. Moreover, the material quality is mixed, with some praising it while others find it feels cheap, and several customers note it's too see-through. Generated from the text of customer reviews Select to learn more Style (19) Size (6) Casual wear (3) Fit (20) Material quality (13) Quality (9) See through (8) 19 customers mention style, 18 positive, 1 negative 19 customers mention \"Style\" 18 positive 1 negative Customers find the dress cute and feminine without being fussy, with one customer noting it looks polished. \" Super cute and classy. I got a large. I'm 4'11. 163 pounds. I washed it and hung it up. Every thing is still in tact \" Read more \" ...Still cute , but for the price and quality ill just buy a long t-shirt button down and put a belt at the waist for the hourglass illusion. \" Read more \" ...Look: This dress is simply adorable and subtly sexy.... \" Read more \" Classy and versatile... \" Read more 6 customers mention size, 5 positive, 1 negative 6 customers mention \"Size\" 5 positive 1 negative Customers find the dress runs true to size, with one mentioning that the sleeves run large. \" Very cute, true to size , looks good under corset \" Read more \" ...Fit & Sizing (I’m 125 lbs, 34D): The fit is very on point—flattering, tailored-looking, and feminine.... \" Read more \" ...The size was perfect and the material of the dress was a very nice quality. I received quite a few compliments.... \" Read more \" Sleeves run large ... \" Read more 3 customers mention casual wear, 3 positive, 0 negative 3 customers mention \"Casual wear\" 3 positive 0 negative Customers find the dress suitable for casual wear, with one mentioning it can transition from work to dinner out. \" Super cute but super short! Material it’s ok Good for casual wear \" Read more \" ...pairs with any length skirt, jeans, or other pants, and can go from work to dinner out without missing a beat. Great find! \" Read more \" This dress can be worn as a casual wear or Dinner wear. Very Nice \" Read more 20 customers mention fit, 13 positive, 7 negative 20 customers mention \"Fit\" 13 positive 7 negative Customers have mixed opinions about the dress's fit, with some finding it great while others say it's too short. \" Perfect fit great material love this dress. \" Read more \" Too short for 5’ 8 \" Read more \" Very see through, cheap material. Fit was flattering but would get a darker color in this not white. \" Read more \" ...The Medium fit me perfectly . \" Read more 13 customers mention material quality, 9 positive, 4 negative 13 customers mention \"Material quality\" 9 positive 4 negative Customers have mixed opinions about the dress's material quality, with some finding it great while others say it feels cheap. \" ...Feel: The fabric is soft , lightweight, and comfortable even without stretch.... \" Read more \" Material was great true to size color was correct and the fabric was perfect it was worth the value \" Read more \" The material feels very cheap , I returned it! \" Read more \" The material isn’t bad , but for almost $50, I’d want better quality. Sizing is off, so it’s not as cinched in.... \" Read more 9 customers mention quality, 6 positive, 3 negative 9 customers mention \"Quality\" 6 positive 3 negative Customers have mixed opinions about the dress's quality. \" Great dress ! The material does wrinkle easily, but it was still flattering and comfortable. I am 5’6 and around 140lbs.... \" Read more \" Quality not good \" Read more \" It’s well made and not see through. \" Read more \" It’s a great length and quality is fine but the sleeves are really baggy. Ended up returning \" Read more 8 customers mention see through, 2 positive, 6 negative 8 customers mention \"See through\" 2 positive 6 negative Customers report that the dress is too see-through. \" I’m 5’9” too short for me. And too see through . \" Read more \" Loved this dress ! I usually wear a large and it fit perfect ! It is see through but with the proper undergarments it’s perfect !... \" Read more \" ...the material is exactly what I was looking for; lightweight but not see through . It feels very \"linen\". Going to order more colors!... \" Read more \" Very see through , cheap material. Fit was flattering but would get a darker color in this not white. \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Adorable + Sexy + Versatile — The Little White Dress I Didn’t Know I Needed",
        "body": "This GORGLITTER button-up mini dress is such a vibe. It hits that perfect balance of classy-meets-sexy, and the versatility is next-level. You can style this so many ways that it basically pays for itself. Fit & Sizing (I’m 125 lbs, 34D): The fit is very on point—flattering, tailored-looking, and feminine. Just note: I’m a 34D and it almost creates a button gap across the bust. Not enough to return it, but enough that you might want to wear a seamless bra or a little fashion tape if you’re fuller-chested. If you're between sizes or bustier, you may want to size up. Feel: The fabric is soft, lightweight, and comfortable even without stretch. It has that flowy, flared movement that looks polished but still easy to wear. Look: This dress is simply adorable and subtly sexy. The button-up detail lets you create the vibe—fully buttoned for daytime or work, and unbuttoned a little for a night-out look. The lapel collar + pleats make it look more structured and expensive. How I’m Styling It: Daytime: blazer + tights + boots Work: belted with an overcoat Night out: unbuttoned with high-heeled sandals or knee-high boots Casual: denim jacket + sneakers Versatility: Perfect for everything—work, holidays, dates, shopping days, brunch, or a night out. It’s one of those “simple but powerful” pieces that transforms depending on how you style it. If you want a dress that can go from polished to sexy with one outfit change, this is it. Read more",
        "author": "Stephanie Ann",
        "rating": 5.0,
        "date": "November 27, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Classy and comfy",
        "body": "Great dress! The material does wrinkle easily, but it was still flattering and comfortable. I am 5’6 and around 140lbs. I got a small and I still had plenty of breathing room. Paired it with the corset belt and I think it was the exact mix of classy and comfy I aim for. Read more",
        "author": "Sarah",
        "rating": 5.0,
        "date": "November 18, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/719+g-nTZaL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "4.0 out of 5 stars Fits great and is super cute.",
        "body": "I listened to Amazon's size suggestion and got the small. I'm normally a size medium or even a large. For reference, I am 5'2\" and 145 lbs. This fit absolutely incredible and looks REALLY cute on. I'm a bit conflicted because it's not really see through but because it's white, it does show just a bit of the undergarments but I'm going to try to see if I can find some that are a little less showing and try to make it work because this REALLY is an adorable and well fitting little dress. Read more",
        "author": "julie rubin",
        "rating": 4.0,
        "date": "June 11, 2024",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Not see through!",
        "body": "It’s well made and not see through. Read more",
        "author": "charlene m",
        "rating": 5.0,
        "date": "December 11, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/81YqU7c2cML._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "1.0 out of 5 stars Too short",
        "body": "Too short for 5’8 Read more",
        "author": "BodiesByMonika",
        "rating": 1.0,
        "date": "April 30, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "2.0 out of 5 stars Very short and very polyester.",
        "body": "I got it for a costume and it'll be fine for that but if you want to wear it as a dress, it's SHORT. If you size up, the sleeves are going to be very long. The material is pretty much glorified plastic. Read more",
        "author": "Laura Z.",
        "rating": 2.0,
        "date": "September 4, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Cute but too big",
        "body": "The material isn’t bad, but for almost $50, I’d want better quality. Sizing is off, so it’s not as cinched in. While the style itself is made to cinch in, unless you are already like that the effect will just not look great. Sizing is big, so I would order a smaller size than what they recommend. Still cute, but for the price and quality ill just buy a long t-shirt button down and put a belt at the waist for the hourglass illusion. Read more",
        "author": "Each Day is a Gift",
        "rating": 3.0,
        "date": "March 2, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Such a cute classic piece for a time capsule wardrobe",
        "body": "So so pretty much prettier in real life than I even imagined I do usually wear a medium and I accidentally bought a small and I’m so glad I did because it fits like a glove. It’s beautiful. Read more",
        "author": "Evelyn Lorae",
        "rating": 5.0,
        "date": "September 25, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.",
  "about_this_item": "Womens Maxi Dress Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.",
  "long_description": "Womens Maxi Dress Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: White, Solid White, Black, Solid Black. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/4132vFciwSL._SL1500_.jpg",
      "alt": "Womens Maxi Dress Long Sleeve details image 1"
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/31G3kKGVKQL._SL1500_.jpg",
      "alt": "Womens Maxi Dress Long Sleeve details image 2"
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/41JoL7uLN8L._SL1500_.jpg",
      "alt": "Womens Maxi Dress Long Sleeve details image 3"
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/41DVAJ6eWnL._SL1500_.jpg",
      "alt": "Womens Maxi Dress Long Sleeve details image 4"
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: White, Solid White, Black, Solid Black. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/41yhC77gJ7L._SL1500_.jpg",
      "alt": "Womens Maxi Dress Long Sleeve details image 5"
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "5c4aeee5-4e33-4a69-8789-33a57ba328a1",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5c4aeee5-4e33-4a69-8789-33a57ba328a1/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5c4aeee5-4e33-4a69-8789-33a57ba328a1/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/fac1067d-28fc-4bb6-8479-05988cc36918.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "3dbd3a47-cafe-4071-93fa-34057a7345c0",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3dbd3a47-cafe-4071-93fa-34057a7345c0/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3dbd3a47-cafe-4071-93fa-34057a7345c0/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/fac1067d-28fc-4bb6-8479-05988cc36918.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "White": "https://m.media-amazon.com/images/I/31Rms1divHL._AC_SR38,50_.jpg",
    "Solid White": "https://m.media-amazon.com/images/I/31Acu0UVlIL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/41gZ2j1qvKL._AC_SR38,50_.jpg",
    "Solid Black": "https://m.media-amazon.com/images/I/31An-UkbQyL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "White": "611H2dG3jvL",
    "Solid White": "61eS5FYVNQL",
    "Black": "61mCNnxZgGL",
    "Solid Black": "61ZgoDEv-RL"
  },
  "color_images": {
    "White": [
      "https://m.media-amazon.com/images/I/611H2dG3jvL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61ZDKsOssQL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/6181vRm3pIL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71AqkbVBWDL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81lZVxPjoaL._SL1500_.jpg"
    ],
    "Solid White": [
      "https://m.media-amazon.com/images/I/61eS5FYVNQL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61EDBN9KOGL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/613q6Z+ZlfL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61hwTuXg1QL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71dgpbum9QL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/61mCNnxZgGL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/619pbkHIBxL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61Zjwy5B9BL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61PYh76aFOL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71PG5VLHA5L._SL1500_.jpg"
    ],
    "Solid Black": [
      "https://m.media-amazon.com/images/I/61ZgoDEv-RL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61Rz+gfeqfL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61Ghqdal5pL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61q6wYznHOL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/716JLgopviL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress-cocktail-bodycon",
      "title": "Womens Dress Cocktail Bodycon",
      "price": 47.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61NfEwzl3xL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-one-shoulder-maxi-formal",
      "title": "Womens Maxi Dress Evening One Shoulder Maxi Formal",
      "price": 69.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/5150AIQL4eL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail",
      "title": "Womens Dress Cocktail",
      "price": 103.54,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61JApwce25L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-formal-bodycon-evening-sleeveless",
      "title": "Womens Maxi Dress Maxi Formal Bodycon Evening Sleeveless",
      "price": 61.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61s8qg6u1VL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 158.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71PmRANW40L._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress-bodycon-split-ruched-off-shoulder",
      "title": "Womens Dress Bodycon Split Ruched Off Shoulder",
      "price": 38.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/41JjYcPgcpL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 95.61,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Work",
      "images": [
        "https://m.media-amazon.com/images/I/71hVgSIB1jL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 138.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51PZNrlyY9L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-split-evening-formal",
      "title": "Womens Maxi Dress Split Evening Formal",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51BZ1BqPx8L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 65.97,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/81wr8PDg55L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-v-neck",
      "title": "Womens Dress V Neck",
      "price": 82.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/710bSTpZ9hL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 278.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/91YXeyW506L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening-long-sleeve",
      "title": "Womens Maxi Dress Formal Evening Long Sleeve",
      "price": 87.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61nnk+flvaL._SL1500_.jpg"
      ]
    }
  ]
}