{
  "id": "womens-maxi-dress-long-sleeve-bodycon-v-neck",
  "handle": "womens-maxi-dress-long-sleeve-bodycon-v-neck",
  "sku": "JC1183",
  "asin": "B0BGRKWTFY",
  "title": "Womens Maxi Dress Long Sleeve Bodycon V Neck",
  "title_original": "Blooming Jelly Womens Long Sleeve Sweater Dress Sexy V Neck Bodycon Mini Fall Dresses Trendy Ribbed Ladies Winter Sweater",
  "brand": "Visit the Blooming Jelly Store",
  "price": 43.99,
  "social_proof": {
    "bought_past_month": 656,
    "text": "656+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/81-RE7-1kNL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81DumWEu6-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91DI-K9IfYL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81kDH7xLlNL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81IcH8eCtAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81N8j7EIMBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81hnDYgKEyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81rP5OlD6sL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81xWu6vnAmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81yHdh6vXFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81U7UbjiXiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81Nj0SR+YyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81mz-FyNWiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81WP+cNvsfL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/81-RE7-1kNL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81DumWEu6-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91DI-K9IfYL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81kDH7xLlNL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81IcH8eCtAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81N8j7EIMBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81hnDYgKEyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81rP5OlD6sL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81xWu6vnAmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81yHdh6vXFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81U7UbjiXiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81Nj0SR+YyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81mz-FyNWiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81WP+cNvsfL._SL1500_.jpg"
  ],
  "aplus_images": [
    "https://m.media-amazon.com/images/I/41gCNczLVPL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41udRSOpF0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41TTyxt%2BNjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41SfTY-GSsL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41HXy7-ke8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41tFJQGVG8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31On-njBekL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31Qv2B-8HoL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41YVzRQ3T3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51e2rCs7zEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/410deUplORL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/418ezXp5jJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51LjxxywUKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41z%2B6vlf4dL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51N-75HKTdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/413EZVUy5%2BL._SL1500_.jpg"
  ],
  "description_images": [
    "https://m.media-amazon.com/images/I/41gCNczLVPL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41udRSOpF0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41TTyxt%2BNjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41SfTY-GSsL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41HXy7-ke8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41tFJQGVG8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31On-njBekL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31Qv2B-8HoL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41YVzRQ3T3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51e2rCs7zEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/410deUplORL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/418ezXp5jJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51LjxxywUKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41z%2B6vlf4dL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51N-75HKTdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/413EZVUy5%2BL._SL1500_.jpg"
  ],
  "bullets": [],
  "specs": {
    "Item Weight ‏": "‎ 13.4 ounces",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ July 5, 2022",
    "ASIN ‏": "‎ B0B5TRQZVT",
    "Best Sellers Rank": "#33,513 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #290 in Women's Casual Dresses",
    "Customer Reviews": "4.3 4.3 out of 5 stars (808)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Brown",
      "White",
      "Deep Blue",
      "Burgundy",
      "Apricot",
      "Army Green",
      "Hot Pink",
      "Black",
      "Grey"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.3,
    "count": 808,
    "customers_say": "Customers find the dress comfortable, well-made, and cute, particularly noting it's perfect for fall wear with boots. The dress is flattering, hugging curves in all the right places, and customers appreciate its stretchiness, with one mentioning it's not too tight and clingy. The color receives positive feedback, though opinions about sizing are mixed, with some finding it true to size while others say it's too small. Generated from the text of customer reviews Select to learn more Fit (98) Style (72) Comfort (38) Quality (38) Flattering (33) Stretchiness (29) Color (15) Size (15) 98 customers mention fit, 76 positive, 22 negative 98 customers mention \"Fit\" 76 positive 22 negative Customers are satisfied with how the dress fits, particularly noting its perfect length and how it hugs their curves, with one customer mentioning it hits below the mid-thigh. \" ...This dress fits so nice. I ordered my normal size L and it fits great . It gives nice shape but also has a lot of stretch without being too fitted.... \" Read more \" I don’t wear many dresses but I took a shot on this one! It was a great fit and good quality! \" Read more \" I love how comfortable this dress is, it fits perfectly . I always order a size XL. It hugs my body and it's beautiful. \" Read more \" Ordered XL - my size - should have fit. Way too small . Stretched yes but not cute. Too small for an XL \" Read more 72 customers mention style, 69 positive, 3 negative 72 customers mention \"Style\" 69 positive 3 negative Customers find the dress cute, particularly as a fall outfit to wear with boots, with one customer specifically appreciating its fitted look. \" This is cute , but I returned it because it’s closer to knee length instead of short. \" Read more \" ...Even though it’s sweater like material - it’s not too hot. Very cute and FTTS! 5’4” 128lbs small fits perfect! \" Read more \" Super cute ! Not too thin of material. Very form fitting and flattering. I am 5‘7“ 145 pounds. Seems to be well made. I where at once so far. \" Read more \" Fits like a glove !! Very flattering and sexy , yet very classy .. purchased in black as well ! \" Read more 38 customers mention comfort, 36 positive, 2 negative 38 customers mention \"Comfort\" 36 positive 2 negative Customers find the dress comfortable. \" ...Very stretchy and comfortable ! I got the XL, wasn’t totally sure how it would fit but to me it’s like a glove! To reference I’m 5’3 and about 235lbs \" Read more \" This dress is super cute and comfy . I love the buttons at the front of the dress. You can definitely dress it up or down.... \" Read more \" ...helps smooth out imperfections, and feels nice on the skin, also very comfortable , doesn't tend to bind, twist or crawl against other fabrics like... \" Read more \" It’s super comfy no warm at all but I would’ve got one size down if you want a tighter fit \" Read more 38 customers mention quality, 33 positive, 5 negative 38 customers mention \"Quality\" 33 positive 5 negative Customers find the dress well-made and perfect for its purpose. \" Love this dress . True size. Love the way it fits. Hubby couldn’t keep his hands off \" Read more \" Dress is very comfy and not too short. Good quality , stretchy fabric. Top button can easily be undone with no awkward flaps or anything.... \" Read more \" Great dress , comfortable fabric and good amount of stretch. Very flattering on and true to size. \" Read more \" Nice dress , but it didn’t fit very well on me so I had to return other than that everything’s nice \" Read more 33 customers mention flattering, 29 positive, 4 negative 33 customers mention \"Flattering\" 29 positive 4 negative Customers find the dress flattering, saying it shows off beautiful curves and hugs them in all the right places. \" Fits like a glove !! Very flattering and sexy , yet very classy .. purchased in black as well ! \" Read more \" A really cute casual dress that's breathable and flattering . The ribbed design makes it more appealing to hide any little flaws on curvy shapes.... \" Read more \" The fit is nice. Dress is flattering . Warm without being too thick. I returned this though.... \" Read more \" Very flattering dress ! I am very curvy with an hourglass shape and this looks really good on me.... \" Read more 29 customers mention stretchiness, 27 positive, 2 negative 29 customers mention \"Stretchiness\" 27 positive 2 negative Customers like the dress's stretchiness, with one mentioning it provides enough flexibility to pull it up. \" ...I am 5’5 138 lbs got a medium and it fit well, very stretchy . Fall to mid thigh almost like a mini skirt so if you don’t like that size up \" Read more \" I loved the dress hugged me in all the right places , it’s stretchy . I got a small I’m usually a medium. I’m 5’7 at 155 lbs .... \" Read more \" It has stretch but I’d recommend sizing up!! \" Read more \" I’m 5,2”, 115 pounds and the medium fits perfectly! The material is stretchy and soft on my sensitive skin.... \" Read more 15 customers mention color, 12 positive, 3 negative 15 customers mention \"Color\" 12 positive 3 negative Customers love the color of the dress. \" Lovely sexy dress, beautiful color , fit great, stretchy, so you have room to move and very comfortable too \" Read more \" ...The green color is so pretty . Will be purchasing more colors! \" Read more \" Color was perfect and the fit was great! \" Read more \" ...I needed a white dress and this one is not white . \" Read more 15 customers mention size, 6 positive, 9 negative 15 customers mention \"Size\" 6 positive 9 negative Customers have mixed opinions about the dress's sizing, with some finding it true to size while others say it runs small. \" Too small ... \" Read more \" ...Very flattering and classy. True to size . I’m 55, 140 pounds, 34B, generally wear a size 2, I got a small and it’s perfect \" Read more \" Good quality. Runs a little small but overall very cute \" Read more \" Love this dress. True size . Love the way it fits. Hubby couldn’t keep his hands off \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Comfortable, Flattering & Perfect for Mom-Life Moments",
        "body": "The media could not be loaded. I wore this sweater dress to a Thanksgiving party, and it was honestly the perfect mix of cute and comfortable. The fabric is soft, stretchy, and lightweight, but still warm enough for fall and winter. It felt great on my skin and didn’t make me overheat while moving around, talking, or chasing kids. One thing I really appreciated is the v-cut neckline. It looks stylish without being too low, and the buttons are decorative, so there’s no awkward gapping. I’m currently breastfeeding, and this dress made it surprisingly easy to go from having fun to feeding my baby without feeling uncomfortable or messing up the whole outfit. The mini length is flattering without being too short, and the fit hugs your shape in a really nice, smooth way. I paired it with boots and felt completely put together. The ribbed knit gives it that extra bit of texture that makes it look more expensive than it is. What I love most is how versatile it is. I wore it as a dress for the party, but you can also pull it up and wear it with jeans as a long sweater — perfect for days when you want a cozy but stylish look without trying too hard. Overall, it’s a great staple for fall and winter. Comfortable, flattering, mom-friendly, and easy to care for. I’m definitely keeping this one in rotation. Read more",
        "author": "B.Nicole",
        "rating": 5.0,
        "date": "December 11, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Perfect outfit for fall",
        "body": "I’m pregnant and wanted something that would still make me feel cute and confident. This set is exactly that. It fits perfectly, feels soft, and it’s very flattering even with the bump. It’s great for fall and looks super cute with little boots. I felt so pretty and stylish wearing it, definitely one of my favorite outfits this season. Read more",
        "author": "Angie Maimone",
        "rating": 5.0,
        "date": "October 29, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/618Ug3hMqmL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "4.0 out of 5 stars Super cute sweater dress",
        "body": "I'm 5'1 and I weigh 138. I ordered both a small and a medium. The medium was loose and had a lot of extra fabric. The small was also a little loose but much more form fitting. Since I'm so short it did go all the way down to right above my knee, so I kept pulling it up for a more sexy look. Great dress if you have a mom pouch. Overall I enjoyed wearing this and it was super comfy. Photographed is the size small. Read more",
        "author": "Customer",
        "rating": 4.0,
        "date": "February 5, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/51r9tWH2RgL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Order your normal size",
        "body": "Great dress! This dress fits so nice. I ordered my normal size L and it fits great. It gives nice shape but also has a lot of stretch without being too fitted. Length is not too short and the material is a little on the thin side but that works for me. The green color is so pretty. Will be purchasing more colors! Read more",
        "author": "Jennifer Y.",
        "rating": 5.0,
        "date": "October 21, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61sNeqhMQ9L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Great dress!",
        "body": "Sexy!! I get a lot of compliments!! I'm 5'2 123 lbs..medium fits perfect! Read more",
        "author": "Gary L. Gilbert",
        "rating": 5.0,
        "date": "December 4, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars White is See through",
        "body": "The white one is so see through. I was hoping for the price it would be thicker material. It’s very cute but have to get a different color. Read more",
        "author": "Brookessi",
        "rating": 3.0,
        "date": "December 1, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61Bo8xfKy9L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Short and curvy",
        "body": "Super cute on 5'3 190lbs no stretch fyi great length live the nexk line thick material its a cute dress for sure Read more",
        "author": "Creepywillow",
        "rating": 5.0,
        "date": "November 30, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Just get it",
        "body": "Loveee this dress! Wanted a cute fall type of dress to wear with boots. Very stretchy and comfortable! I got the XL, wasn’t totally sure how it would fit but to me it’s like a glove! To reference I’m 5’3 and about 235lbs Read more",
        "author": "Lindsey",
        "rating": 5.0,
        "date": "November 28, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61FfOdHb7gL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/51GdxHgN-kL._SY88._SL1500_.jpg"
        ]
      }
    ]
  },
  "short_description": "Womens Maxi Dress Long Sleeve Bodycon V Neck is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.",
  "about_this_item": "Womens Maxi Dress Long Sleeve Bodycon V Neck is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.",
  "long_description": "Womens Maxi Dress Long Sleeve Bodycon V Neck is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Brown, White, Deep Blue, Burgundy, Apricot, Army Green, Hot Pink, Black, Grey. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Long Sleeve Bodycon V Neck is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/41gCNczLVPL._SL1500_.jpg",
      "alt": "Womens Maxi Dress Long Sleeve Bodycon V Neck details image 1"
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/41udRSOpF0L._SL1500_.jpg",
      "alt": "Womens Maxi Dress Long Sleeve Bodycon V Neck details image 2"
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/41TTyxt%2BNjL._SL1500_.jpg",
      "alt": "Womens Maxi Dress Long Sleeve Bodycon V Neck details image 3"
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/41SfTY-GSsL._SL1500_.jpg",
      "alt": "Womens Maxi Dress Long Sleeve Bodycon V Neck details image 4"
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Brown, White, Deep Blue, Burgundy, Apricot, Army Green, Hot Pink, Black, Grey. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/41HXy7-ke8L._SL1500_.jpg",
      "alt": "Womens Maxi Dress Long Sleeve Bodycon V Neck details image 5"
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "9575e212-d4e4-4289-a3a5-7c79ff4220c5",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9575e212-d4e4-4289-a3a5-7c79ff4220c5/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9575e212-d4e4-4289-a3a5-7c79ff4220c5/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/195ac649-05ac-46a3-ba50-0205b5e765b3.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "02808cf7-2c33-43a7-a1a7-8e1fa8343914",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/02808cf7-2c33-43a7-a1a7-8e1fa8343914/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/02808cf7-2c33-43a7-a1a7-8e1fa8343914/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/195ac649-05ac-46a3-ba50-0205b5e765b3.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "88251066-1600-4494-be30-cb1b5b234a0d",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/88251066-1600-4494-be30-cb1b5b234a0d/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/88251066-1600-4494-be30-cb1b5b234a0d/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/195ac649-05ac-46a3-ba50-0205b5e765b3.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "c5004e2c-3d8f-4b96-9964-bb56c4f98160",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c5004e2c-3d8f-4b96-9964-bb56c4f98160/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c5004e2c-3d8f-4b96-9964-bb56c4f98160/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/195ac649-05ac-46a3-ba50-0205b5e765b3.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "b638e822-f3f9-422c-961d-5b24895c3875",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b638e822-f3f9-422c-961d-5b24895c3875/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b638e822-f3f9-422c-961d-5b24895c3875/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/195ac649-05ac-46a3-ba50-0205b5e765b3.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "2bd0ade0-dea3-4c47-a76f-92ee1022ff21",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2bd0ade0-dea3-4c47-a76f-92ee1022ff21/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2bd0ade0-dea3-4c47-a76f-92ee1022ff21/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/195ac649-05ac-46a3-ba50-0205b5e765b3.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "fac11073-67d5-4319-9dd3-71c05f789a81",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/fac11073-67d5-4319-9dd3-71c05f789a81/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/fac11073-67d5-4319-9dd3-71c05f789a81/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/195ac649-05ac-46a3-ba50-0205b5e765b3.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "1fdf7ba5-efc6-4ebb-a1b1-8844da07522d",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1fdf7ba5-efc6-4ebb-a1b1-8844da07522d/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1fdf7ba5-efc6-4ebb-a1b1-8844da07522d/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/195ac649-05ac-46a3-ba50-0205b5e765b3.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "b991b96a-bcac-4564-8548-3d673fc503d9",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b991b96a-bcac-4564-8548-3d673fc503d9/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b991b96a-bcac-4564-8548-3d673fc503d9/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/195ac649-05ac-46a3-ba50-0205b5e765b3.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "7c3e6b30-0754-4016-a7d0-83a4b1481eb3",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7c3e6b30-0754-4016-a7d0-83a4b1481eb3/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7c3e6b30-0754-4016-a7d0-83a4b1481eb3/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/195ac649-05ac-46a3-ba50-0205b5e765b3.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "6d789124-d5df-4c62-9c56-715ccd0bdf0f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6d789124-d5df-4c62-9c56-715ccd0bdf0f/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6d789124-d5df-4c62-9c56-715ccd0bdf0f/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/195ac649-05ac-46a3-ba50-0205b5e765b3.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "4bd0b8cf-45ad-4fb4-9921-d81d9bc7432c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4bd0b8cf-45ad-4fb4-9921-d81d9bc7432c/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4bd0b8cf-45ad-4fb4-9921-d81d9bc7432c/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/195ac649-05ac-46a3-ba50-0205b5e765b3.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Brown": "https://m.media-amazon.com/images/I/41LwwP9qP0L._AC_SR38,50_.jpg",
    "White": "https://m.media-amazon.com/images/I/41P6gC0lS-L._AC_SR38,50_.jpg",
    "Deep Blue": "https://m.media-amazon.com/images/I/41iaRARokjL._AC_SR38,50_.jpg",
    "Burgundy": "https://m.media-amazon.com/images/I/41D8Jl+krRL._AC_SR38,50_.jpg",
    "Apricot": "https://m.media-amazon.com/images/I/41RFJOpn7AL._AC_SR38,50_.jpg",
    "Army Green": "https://m.media-amazon.com/images/I/41zyig3fTtL._AC_SR38,50_.jpg",
    "Hot Pink": "https://m.media-amazon.com/images/I/41PLKYg2w5L._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/41gCNczLVPL._AC_SR38,50_.jpg",
    "Grey": "https://m.media-amazon.com/images/I/41HnHdUQomL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Brown": "81hnDYgKEyL",
    "White": "81rP5OlD6sL",
    "Deep Blue": "81xWu6vnAmL",
    "Burgundy": "81-RE7-1kNL",
    "Apricot": "81yHdh6vXFL",
    "Army Green": "81U7UbjiXiL",
    "Hot Pink": "81Nj0SR+YyL",
    "Black": "81mz-FyNWiL",
    "Grey": "81WP+cNvsfL"
  },
  "color_images": {
    "Brown": [
      "https://m.media-amazon.com/images/I/81hnDYgKEyL._SL1500_.jpg"
    ],
    "White": [
      "https://m.media-amazon.com/images/I/81rP5OlD6sL._SL1500_.jpg"
    ],
    "Deep Blue": [
      "https://m.media-amazon.com/images/I/81xWu6vnAmL._SL1500_.jpg"
    ],
    "Burgundy": [
      "https://m.media-amazon.com/images/I/81-RE7-1kNL._SL1500_.jpg"
    ],
    "Apricot": [
      "https://m.media-amazon.com/images/I/81yHdh6vXFL._SL1500_.jpg"
    ],
    "Army Green": [
      "https://m.media-amazon.com/images/I/81U7UbjiXiL._SL1500_.jpg"
    ],
    "Hot Pink": [
      "https://m.media-amazon.com/images/I/81Nj0SR+YyL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/81mz-FyNWiL._SL1500_.jpg"
    ],
    "Grey": [
      "https://m.media-amazon.com/images/I/81WP+cNvsfL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-long-sleeve-bodycon",
      "title": "Womens Maxi Dress Long Sleeve Bodycon",
      "price": 58.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61Rb6+eoO7L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-v-neck",
      "title": "Womens Maxi Dress Long Sleeve V Neck",
      "price": 19.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71SbIMg7hCL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-one-shoulder-long-sleeve-cocktail",
      "title": "Womens Maxi Dress One Shoulder Long Sleeve Cocktail",
      "price": 47.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71BWG+YCo6L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-maxi-bodycon-long-sleeve-formal-ruched",
      "title": "Womens Maxi Dress Cocktail Maxi Bodycon Long Sleeve Formal Ruched",
      "price": 64.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51rp1FtyHmL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-sleeveless-cocktail",
      "title": "Womens Dress Sleeveless Cocktail",
      "price": 27.19,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/713CbSuzGgL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 19.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/81tjLlUnGTL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 18.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71e0f6DNBbL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 119.93,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Work",
      "images": [
        "https://m.media-amazon.com/images/I/81xacGTyEtL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi",
      "title": "Womens Maxi Dress Maxi",
      "price": 8.76,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71St-N3EkkL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-sleeveless-ruched-bodycon",
      "title": "Womens Dress Sleeveless Ruched Bodycon",
      "price": 34.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71KyKsxryEL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 54.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71IVlRrmVDL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 45.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/712FTzeTFLL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-bodycon-v-neck-ruched-cocktail-sleeveless",
      "title": "Womens Dress Bodycon V Neck Ruched Cocktail Sleeveless",
      "price": 43.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61l8XIhTUvL._SL1500_.jpg"
      ]
    }
  ]
}