{
  "id": "womens-maxi-dress-long-sleeve-bodycon-maxi",
  "handle": "womens-maxi-dress-long-sleeve-bodycon-maxi",
  "sku": "JC2357",
  "asin": "B0BJJP8Y7L",
  "title": "Womens Maxi Dress Long Sleeve Bodycon Maxi",
  "title_original": "PUMIEY Women's Square Neck Long Sleeve Maxi Dress Ribbed Bodycon Dresses for Women Soft Lounge Dress",
  "brand": "Visit the PUMIEY Store",
  "price": 28.49,
  "social_proof": {
    "bought_past_month": 401,
    "text": "401+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/51eR-f9GklL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61AjjrSrf-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61yaBgmz5iL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Twl9EKMwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71FCOpz9S3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61-FxeZAqkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51iP-VNBqkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51H1lTQzV0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51SWhuUXZ-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51JTkd0lS3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61vnFvWHrsL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51ztDkBGvuL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/514Jiw7knNL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/51eR-f9GklL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61AjjrSrf-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61yaBgmz5iL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Twl9EKMwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71FCOpz9S3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61-FxeZAqkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51iP-VNBqkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51H1lTQzV0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51SWhuUXZ-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51JTkd0lS3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61vnFvWHrsL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51ztDkBGvuL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/514Jiw7knNL._SL1500_.jpg"
  ],
  "aplus_images": [
    "https://m.media-amazon.com/images/I/31EW1G17rNL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31vDEfp6mkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31lHtlDgEgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31e6%2BKCO8cL._SL1500_.jpg"
  ],
  "description_images": [
    "https://m.media-amazon.com/images/I/31EW1G17rNL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31vDEfp6mkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31lHtlDgEgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31e6%2BKCO8cL._SL1500_.jpg"
  ],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ October 18, 2022",
    "Manufacturer ‏": "‎ PUMIEY",
    "ASIN ‏": "‎ B0BJK535NB",
    "Best Sellers Rank": "#10,542 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #128 in Women's Dresses",
    "Customer Reviews": "4.5 4.5 out of 5 stars (2,799)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Tango",
      "Aegean",
      "Hazelnut",
      "Periwinkle",
      "Jet Black",
      "Caramel",
      "Stone",
      "Bubblegum",
      "Olive-khaki"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.5,
    "count": 2799,
    "customers_say": "Customers find the dress comfortable, well-made, and appreciate its stretchy, soft cotton material that accommodates growth. The dress receives positive feedback for its flattering design, particularly its square neck that suits all body types, and its versatility in creating different looks. The length receives mixed reviews - while some find it perfect, others mention sizing issues. Regarding sheerness, while the black version isn't see-through, customers note that the pink version is more transparent. Generated from the text of customer reviews Select to learn more Fit (285) Looks (202) Comfort (194) Quality (190) Stretchy fabric (148) Flattering (133) Length (132) Sheerness (116) 285 customers mention fit, 243 positive, 42 negative 285 customers mention \"Fit\" 243 positive 42 negative Customers like how the dress fits, with one mentioning it reaches just above the ankles. \" ...Fits true to size. The material is so soft and buttery. Fits like a glove and shows all the right places. Can’t wait to order more in every color! \" Read more \" Fits perfectly … the only reason I give it a 4/5 is because it’s a bit see through if you shine a light through it which is rare that ever happens in... \" Read more \" Fits great I actually have a dress from the Kardashians label and compare the two and they are exactly the same exact same fabric exact same... \" Read more \" ...It’s form fitting yet breathable and stretches to comfort. Wearing it definitely brought out a whole ass woman I hadn’t met before lol BUY IT! \" Read more 202 customers mention looks, 196 positive, 6 negative 202 customers mention \"Looks\" 196 positive 6 negative Customers find the dress chic and sexy, noting it doesn't look or feel cheap. One customer mentions it creates an hourglass silhouette, while another describes it as giving Barbie vibes. \" ...I wanted something comfy & cute which this was exactly that. Very versatile you could dress it up or down. I can’t wait to purchase another color. \" Read more \" Beautiful dress . However, upon opening it I was hit with the worst chemical/mustard smell. Its literally so pungent. Not worth it based on that. \" Read more \" Super cute and stretches good, normally am a size L and this was true to size. Im ~170 and 5’5” 36 D and it was a good length and fit at a size L \" Read more \" ...It’s very stretchy and comfortable. I just can’t express how beautiful and simple this dress is. Material is great and thick. Length was perfect \" Read more 194 customers mention comfort, 191 positive, 3 negative 194 customers mention \"Comfort\" 191 positive 3 negative Customers find the dress comfortable, describing it as a cute maxi dress and cozy. \" The dress fits well and it’s comfortable if not slightly tight in the arms but that’s just my arms and that can move freely so that’s not a problem.... \" Read more \" ...I’d say you can definitely size down from your regular size. It’s comfy ! I don’t think it’s anything extremely special but it’s a nice comfy dress. \" Read more \" ...it is very comfortable and lightweight! my only complaint although, is that it came dirty, straight out of the package i was met with a white stain \" Read more \" I wore this for a Maleficent costume, and it was so comfortable and flattering. No see through, and I was able to play a few games of darts in it. \" Read more 190 customers mention quality, 176 positive, 14 negative 190 customers mention \"Quality\" 176 positive 14 negative Customers find the dress to be well-made and better than expected. \" ...The light brown and pink are quite see through but they are such great quality and so comfortable so if you don’t mind a little see through I would... \" Read more \" it looks like the photo. it fits well and it’s comfortable and good quality . it’s very snug on the body and nice weight of fabric. \" Read more \" The perfect skims dupe to wear around the house. I feel sexy and comfortable everytime I wear it. I’m ordering more colors !... \" Read more \" This is a great dress ! Easy to wear, stretchy and looks flattering on all body types. The dress I purchased was a small in the color Hazelnut.... \" Read more 148 customers mention stretchy fabric, 140 positive, 8 negative 148 customers mention \"Stretchy fabric\" 140 positive 8 negative Customers appreciate the dress's stretchy fabric, which provides room for growth and is made of soft cotton, with one customer noting its ribbed texture. \" Stretchy , comfortable, got the brown and it’s perfect, material is very nice, not to thick but also not too thin, fits perfectly for reference I am... \" Read more \" ...It's very stretchy (you can probably size down one if you like a tighter fit). Absolutely love. I ordered this dress in about 4-5 different colors. \" Read more \" ... Super stretchy so I’ll be able to wear after the baby too!! I wanted it a little shorter so I hemmed it 2in (I’m 5’4”), but it was still perfect.... \" Read more \" ...Strong, stretchy material that doesn’t feel cheap and it contours the body in the most flattering way (granted you wear the right undergarments) I’m... \" Read more 133 customers mention flattering, 125 positive, 8 negative 133 customers mention \"Flattering\" 125 positive 8 negative Customers find the dress flattering, noting that it shapes the body nicely and accentuates curves in all the right places, with a square neck that works well for all body types. \" ...But the rib material is forgiving and flattering . It is quite long, almost touching the ground on me (I'm 5'3\") but with heels on it's a fine height.... \" Read more \" This dress is SO flattering . I’m 9 months pregnant and I’m sure this would have been a perfect fit before baby and I do plan to wear it after! \" Read more \" Little sheer but very flattering ! Did not realize it was ribbed, but that’s my fault. Wish it squeezed you in a bit more but it is very stretchy \" Read more \" ...Perfect date night dress. If you are pale get this icey blue, its super flattering . \" Read more 132 customers mention length, 92 positive, 40 negative 132 customers mention \"Length\" 92 positive 40 negative Customers have mixed opinions about the dress's length, with some finding it perfect and great for taller women, while others report it being too long and too big. \" I’m so happy I ordered this dress. So soft. Thick material. True to size . I’ll be ordering more. \" Read more \" Perfect length , contours and hugs your body. Color is rich. Great quality and definitely worth buying. Don’t think twice ladies, get it! \" Read more \" For the price, it is def a skims dupe. But I found it to be too long (arms and length) and pretty see through. Not sure I would recommend. \" Read more \" ...The length was perfect and it has a lot of give to it. I was worried about the sizing and all, but it’s pretty true to size, with a little room too.... \" Read more 116 customers mention sheerness, 62 positive, 54 negative 116 customers mention \"Sheerness\" 62 positive 54 negative Customers have mixed opinions about the dress's sheerness, with some finding the black version opaque while others note it is see-through, particularly in the pink version. \" ...Xs was perfect and is stretchy, and light. It’s super comfortable. Not see through . You can actually wear the back towards the from for open back.... \" Read more \" ...The only thing iffy about it is that it's a little see through BUT you get whar you pay for so overall it's awesome Quality for its price!... \" Read more \" fit was amazing! not see through at all . texture was super soft and stretchy, yet flattering. it was the perfect length.... \" Read more \" This dress is definitely not worth that much money . It’s very see through you can literally see my bra through the dress and my shape wear I don’t... \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Incredible purchase! Worth every penny and then some!",
        "body": "I LOVE this dress! I am sooo happy with this purchase! I ordered the periwinkle color for my baby shower and it is the perfect lavender shade, just as I’d hoped for! The fit is perfect, I ordered my normal size small and the stretchy material fit my bump nicely and I will be able to wear again after baby arrives! It is an incredibly flattering dress and I didn’t find it see through as much as the other reviews noted either. I am 5’1” and around 130lbs. The length is perfect for me as well! I tried it on both front ways and backwards due to reading the reviews about bra straps showing. It looks beautiful worn either way but I am opting to wear it front ways, I don’t see the same issue with straps as some other women have but I also am not large chested. The material is buttery and soft and perfect for long day of wear and wanting to be comfortable while pregnant. Definitely worth every penny! Will be ordering more colors!! Read more",
        "author": "Tyler",
        "rating": 5.0,
        "date": "November 11, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Buy it",
        "body": "Noiceee. It’s comfortable and form fitting but you don’t feel any uncomfortable seams anywhere. You can easily dress this up or down, it really just compliments your body. Tons of color choices. VERY THIN, wear the most invisible undies you can. I feel like it’s worth the money (i paid $25). Size down cus this thing can seriously stretch. Read more",
        "author": "David",
        "rating": 5.0,
        "date": "December 1, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71D1YCwXmFL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Comfortable, warm, and cute!",
        "body": "I loved this dress, but PLEASE READ MY DISCLAIMER BELOW! I wore it for my birthday brunch this past year and loved how it fit. The length is great for taller girlies, and the color is pretty true to the picture. It's lightweight and not see through at all. An IMPORTANT word of caution: I wore no bra with this. It was the middle of winter so I bit the bullet, but this dress looks AWFUL with sticky boobs -- the fabric is a little too thin to hide them. Because of the square neckline it was also impossible for me to wear a wired bra. YMMV with a strapless bra. It worked fine for me because I have a smaller chest size, but please be warned if you aren't comfortable going braless or have a bigger bust size! Read more",
        "author": "Yolanda Simpson",
        "rating": 5.0,
        "date": "April 2, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71IPT+4QyoL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/712FoqEpINL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "4.0 out of 5 stars Comfy and fits well but a bit see-through",
        "body": "I have this dress in blue and pink but the pink seems slightly more see-through. If you have a bit of a tummy like me then this dress will accentuate that and lines from shape wear will show through so keep this in mind. With that being said this is an ideal dress for pregnancy since it’s soft, comfortable and the quality is lovely. Since it is quite thin I find it to be breathable. I’m 5 ft 3 and the length goes all the way to my ankles. I like these dresses a lot just wish they were a bit less see-through. Read more",
        "author": "Customer",
        "rating": 4.0,
        "date": "February 5, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Amazing fit! Beautiful dress!",
        "body": "I love this dress! The material is stretchy and the fit is amazing! It's warm too! In other reviews I saw that ppl had a problem with it being see through....the one I received is not see through. I got the black one but will be buying more different colors. Read more",
        "author": "Brooke Fuller",
        "rating": 5.0,
        "date": "November 2, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars true to size, good quality",
        "body": "i’m 5’5 and 145lbs ordered a medium and it fit great and went to my ankles, good quality love this dress! Read more",
        "author": "Courtney Campbell",
        "rating": 5.0,
        "date": "December 4, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Bump friendly!",
        "body": "Used for maternity pics at 9 months pregnant. No need to size up. Looked great. Read more",
        "author": "Ariana",
        "rating": 5.0,
        "date": "December 22, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61uVg2V8hrL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "3.0 out of 5 stars Nice fit but a couple things I’d change",
        "body": "I recently purchased this long black dress, and overall, I’m pretty happy with it. The material is soft, comfortable, and has a nice flow to it, which I really like. The fit is also great – it hugs my body in all the right places, and the dress feels flattering. I love how it fits me up top and through the waist, making it easy to wear for various occasions. However, there are a couple of things I wish were different. First, the length is a bit longer than I expected. I would have preferred it to be slightly shorter or more fitted on the legs for a more streamlined look. I feel like it could benefit from a tighter fit around the legs to give it more shape. Secondly, the neckline doesn't stay in place as well as I hoped. It tends to shift a bit, which can be a little annoying. It would be nice if the neckline stayed more secure, especially if you're wearing the dress for an event or for longer periods. Overall, it’s a lovely dress, and I’m still happy with my purchase. It’s comfortable, stylish, and the material is great – just a few minor adjustments would make it even better. Read more",
        "author": "I’ve held off writing this review so I could really test it out and see how it works. I bought this to use for my son due to his dry scalp! He had an allergic reaction to the original shampoo our pediatrician prescribed, so she recommended this Mustela brand to me. We’ve been using it for about 3 months now and are loving it! It has helped with our toddlers dry scalp & has little to no scaly dry flakes anymore. Definitely recommend to the moms!",
        "rating": 3.0,
        "date": "December 23, 2024",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61CdwdsRCoL._SY88._SL1500_.jpg"
        ]
      }
    ]
  },
  "short_description": "Womens Maxi Dress Long Sleeve Bodycon Maxi is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.",
  "about_this_item": "Womens Maxi Dress Long Sleeve Bodycon Maxi is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.",
  "long_description": "Womens Maxi Dress Long Sleeve Bodycon Maxi is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Tango, Aegean, Hazelnut, Periwinkle, Jet Black, Caramel, Stone, Bubblegum, Olive-khaki. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Long Sleeve Bodycon Maxi is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/31EW1G17rNL._SL1500_.jpg",
      "alt": "Womens Maxi Dress Long Sleeve Bodycon Maxi details image 1"
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/31vDEfp6mkL._SL1500_.jpg",
      "alt": "Womens Maxi Dress Long Sleeve Bodycon Maxi details image 2"
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/31lHtlDgEgL._SL1500_.jpg",
      "alt": "Womens Maxi Dress Long Sleeve Bodycon Maxi details image 3"
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/31e6%2BKCO8cL._SL1500_.jpg",
      "alt": "Womens Maxi Dress Long Sleeve Bodycon Maxi details image 4"
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Tango, Aegean, Hazelnut, Periwinkle, Jet Black, Caramel, Stone, Bubblegum, Olive-khaki. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "5474f77f-293f-47a6-be69-3299b12db498",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5474f77f-293f-47a6-be69-3299b12db498/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5474f77f-293f-47a6-be69-3299b12db498/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/48a5c487-f45b-4362-8970-b85e5f752e45.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "9d1e19f1-d37b-4512-9b63-d607564eef4f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9d1e19f1-d37b-4512-9b63-d607564eef4f/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9d1e19f1-d37b-4512-9b63-d607564eef4f/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/48a5c487-f45b-4362-8970-b85e5f752e45.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "bab80a29-b87b-4569-8b72-2ece51cb4644",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bab80a29-b87b-4569-8b72-2ece51cb4644/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bab80a29-b87b-4569-8b72-2ece51cb4644/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/48a5c487-f45b-4362-8970-b85e5f752e45.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "27c5be0b-512d-4567-83c8-4a7dd67cfffa",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/27c5be0b-512d-4567-83c8-4a7dd67cfffa/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/27c5be0b-512d-4567-83c8-4a7dd67cfffa/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/48a5c487-f45b-4362-8970-b85e5f752e45.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "f3b2b360-0619-4fb5-b918-9bff57f4f3ab",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f3b2b360-0619-4fb5-b918-9bff57f4f3ab/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f3b2b360-0619-4fb5-b918-9bff57f4f3ab/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/48a5c487-f45b-4362-8970-b85e5f752e45.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "b92f387e-3fb9-4a8e-8f5a-1e50bece98fd",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b92f387e-3fb9-4a8e-8f5a-1e50bece98fd/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b92f387e-3fb9-4a8e-8f5a-1e50bece98fd/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/48a5c487-f45b-4362-8970-b85e5f752e45.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "7e24c150-f3c9-419d-bba0-944757faa2d2",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7e24c150-f3c9-419d-bba0-944757faa2d2/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7e24c150-f3c9-419d-bba0-944757faa2d2/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/48a5c487-f45b-4362-8970-b85e5f752e45.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "7683042f-0f22-4bc7-88dd-a64e4e315e35",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7683042f-0f22-4bc7-88dd-a64e4e315e35/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7683042f-0f22-4bc7-88dd-a64e4e315e35/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/48a5c487-f45b-4362-8970-b85e5f752e45.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "a0ad4e7b-1e63-4a42-bb2f-bc474d350acc",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a0ad4e7b-1e63-4a42-bb2f-bc474d350acc/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a0ad4e7b-1e63-4a42-bb2f-bc474d350acc/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/48a5c487-f45b-4362-8970-b85e5f752e45.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "d80dff03-9b90-44a8-a23d-bbfd7f215a5c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d80dff03-9b90-44a8-a23d-bbfd7f215a5c/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d80dff03-9b90-44a8-a23d-bbfd7f215a5c/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/48a5c487-f45b-4362-8970-b85e5f752e45.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "051bb454-90eb-42b1-b417-d4063a12514f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/051bb454-90eb-42b1-b417-d4063a12514f/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/051bb454-90eb-42b1-b417-d4063a12514f/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/48a5c487-f45b-4362-8970-b85e5f752e45.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "e993c1cf-0817-44d7-9ede-f4d765311cbf",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e993c1cf-0817-44d7-9ede-f4d765311cbf/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e993c1cf-0817-44d7-9ede-f4d765311cbf/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/48a5c487-f45b-4362-8970-b85e5f752e45.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Tango": "https://m.media-amazon.com/images/I/31cQm2i0u6L._AC_SR38,50_.jpg",
    "Aegean": "https://m.media-amazon.com/images/I/31EW1G17rNL._AC_SR38,50_.jpg",
    "Hazelnut": "https://m.media-amazon.com/images/I/31OaGTjD4OL._AC_SR38,50_.jpg",
    "Periwinkle": "https://m.media-amazon.com/images/I/21KeeHelKcL._AC_SR38,50_.jpg",
    "Jet Black": "https://m.media-amazon.com/images/I/31-P8+PZ5aL._AC_SR38,50_.jpg",
    "Caramel": "https://m.media-amazon.com/images/I/31R52CIHVwL._AC_SR38,50_.jpg",
    "Stone": "https://m.media-amazon.com/images/I/31WV8Znaw-L._AC_SR38,50_.jpg",
    "Bubblegum": "https://m.media-amazon.com/images/I/31kSrYUxAOL._AC_SR38,50_.jpg",
    "Olive-khaki": "https://m.media-amazon.com/images/I/219rtO8dIcL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Tango": "61-FxeZAqkL",
    "Aegean": "51iP-VNBqkL",
    "Hazelnut": "51H1lTQzV0L",
    "Periwinkle": "51SWhuUXZ-L",
    "Jet Black": "51eR-f9GklL",
    "Caramel": "51JTkd0lS3L",
    "Stone": "61vnFvWHrsL",
    "Bubblegum": "51ztDkBGvuL",
    "Olive-khaki": "514Jiw7knNL"
  },
  "color_images": {
    "Tango": [
      "https://m.media-amazon.com/images/I/61-FxeZAqkL._SL1500_.jpg"
    ],
    "Aegean": [
      "https://m.media-amazon.com/images/I/51iP-VNBqkL._SL1500_.jpg"
    ],
    "Hazelnut": [
      "https://m.media-amazon.com/images/I/51H1lTQzV0L._SL1500_.jpg"
    ],
    "Periwinkle": [
      "https://m.media-amazon.com/images/I/51SWhuUXZ-L._SL1500_.jpg"
    ],
    "Jet Black": [
      "https://m.media-amazon.com/images/I/51eR-f9GklL._SL1500_.jpg"
    ],
    "Caramel": [
      "https://m.media-amazon.com/images/I/51JTkd0lS3L._SL1500_.jpg"
    ],
    "Stone": [
      "https://m.media-amazon.com/images/I/61vnFvWHrsL._SL1500_.jpg"
    ],
    "Bubblegum": [
      "https://m.media-amazon.com/images/I/51ztDkBGvuL._SL1500_.jpg"
    ],
    "Olive-khaki": [
      "https://m.media-amazon.com/images/I/514Jiw7knNL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-evening-formal-bodycon-cocktail",
      "title": "Womens Maxi Dress Evening Formal Bodycon Cocktail",
      "price": 82.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/91+aHmfKmZL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening-v-neck-cocktail",
      "title": "Womens Maxi Dress Formal Evening V Neck Cocktail",
      "price": 65.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/517P57g6cDL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-ruched-formal",
      "title": "Womens Maxi Dress Ruched Formal",
      "price": 76.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Wedding Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/515mOYptbuL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening",
      "title": "Womens Maxi Dress Formal Evening",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/81QZOqZkMLL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 54.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71IVlRrmVDL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress-cocktail-formal-evening",
      "title": "Womens Dress Cocktail Formal Evening",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/71-YlJD0XgL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-v-neck-maxi",
      "title": "Womens Maxi Dress V Neck Maxi",
      "price": 48.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71b-lFZMlqL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-long-sleeve-v-neck-ruched",
      "title": "Womens Maxi Dress Bodycon Long Sleeve V Neck Ruched",
      "price": 33.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61kF-K8khYL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-v-neck-ruched-bodycon",
      "title": "Womens Maxi Dress Long Sleeve V Neck Ruched Bodycon",
      "price": 33.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Work",
      "images": [
        "https://m.media-amazon.com/images/I/61ZKdkKctnL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail",
      "title": "Womens Dress Cocktail",
      "price": 25.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61mWgZVvTbL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-long-sleeve",
      "title": "Womens Maxi Dress Bodycon Long Sleeve",
      "price": 39.97,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71iEhrta8dL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail-sleeveless",
      "title": "Womens Dress Cocktail Sleeveless",
      "price": 55.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61GAi4F7LzS._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-v-neck-formal-long-sleeve",
      "title": "Womens Maxi Dress Bodycon V Neck Formal Long Sleeve",
      "price": 74.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51DTjtOSU7L._SL1500_.jpg"
      ]
    }
  ]
}