{
  "id": "womens-maxi-dress-long-sleeve-off-shoulder",
  "handle": "womens-maxi-dress-long-sleeve-off-shoulder",
  "sku": "JC2668",
  "asin": "B0BKZB223L",
  "title": "Womens Maxi Dress Long Sleeve Off Shoulder",
  "title_original": "Sweater Dresses for Women Casual Sexy Off Shoulder Long Sleeve Knit Pullover Winter Pullover Dress",
  "brand": "Visit the sexycherry Store",
  "price": 43.99,
  "social_proof": {
    "bought_past_month": 128,
    "text": "128+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/71ACMs+kctL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/711ixuCEdfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71zznIoVXyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61hWJTDbdeL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91COPpuxOsL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ArBSu0KkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71gqos17gjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81XuU4xLKLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51qG8pq-xaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71DfagNZcZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81KHuTOJTUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71RTW3iX0gL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Ig8HlS6ML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81Q5xzwdBKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71twQpIzktL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71oLvRo5CaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81hy1kDte7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71NoleD+R8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61VJeDrISjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71JGPXfjeeL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61-DZJRxALL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/816VOtuUAzL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61UIhOQ2ghL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71hIhjMS40L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61GOcqOAK7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81FCl81mtIL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71D6mpFOjAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71fW987AckL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/71ACMs+kctL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/711ixuCEdfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71zznIoVXyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61hWJTDbdeL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91COPpuxOsL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ArBSu0KkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71gqos17gjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81XuU4xLKLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51qG8pq-xaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71DfagNZcZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81KHuTOJTUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71RTW3iX0gL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Ig8HlS6ML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81Q5xzwdBKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71twQpIzktL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71oLvRo5CaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81hy1kDte7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71NoleD+R8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61VJeDrISjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71JGPXfjeeL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61-DZJRxALL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/816VOtuUAzL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61UIhOQ2ghL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71hIhjMS40L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61GOcqOAK7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81FCl81mtIL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71D6mpFOjAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71fW987AckL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Package Dimensions ‏": "‎ 5.91 x 3.94 x 0.39 inches; 3.53 ounces",
    "Item model number ‏": "‎ SMR8724",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ September 29, 2017",
    "Manufacturer ‏": "‎ sexycherry",
    "ASIN ‏": "‎ B0D637QTQK",
    "Best Sellers Rank": "#20,426 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #333 in Women's Dresses",
    "Customer Reviews": "4.2 4.2 out of 5 stars (956)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Lantern Sleeves/Black",
      "Light Brown",
      "Sweater Dress/Dark Green",
      "Knit/Pink",
      "Lantern Sleeves/Burgundy",
      "Sweater Dress/Black",
      "Dark Grey",
      "Army Green",
      "Knit/Dark Red",
      "Solid/Black",
      "Navy Blue",
      "Coffee Brown",
      "Christmas Black",
      "Knit/Black",
      "Red",
      "White",
      "Dark Black",
      "Purple",
      "Solid/Green",
      "Christmas Red",
      "Christmas Green"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.2,
    "count": 956,
    "customers_say": "Customers find the sweater dress comfortable and appreciate its nice fit, color, and quality. The material is thick and well-made, with one customer noting it's perfect for being casually sexy. The sizing receives mixed feedback - while some find it true to size, others mention the sleeves are too long. Customers disagree on how flattering it is, with some finding it flattering on their curves while others say it's not flattering at all. Generated from the text of customer reviews Select to learn more Fit (59) Color (54) Quality (35) Comfort (24) Material thickness (17) Material quality (16) Size (45) Flattering (18) 59 customers mention fit, 44 positive, 15 negative 59 customers mention \"Fit\" 44 positive 15 negative Customers like how the dress fits, noting that it conforms nicely to their curves. \" Love Everything about this dress. Perfect fit … Definitely will be buying buying in other colors \" Read more \" Love the fit and uniqueness. Received so many compliments when I wore it. \" Read more \" ...Arms were extremely long like a foot past my hand and the dress went past my knees . Hard pass.... \" Read more \" ...were a little too wide & big for my liking, but otherwise the dress fit perfectly .... \" Read more 54 customers mention color, 52 positive, 2 negative 54 customers mention \"Color\" 52 positive 2 negative Customers love the color of the dress, finding it very pretty and perfect for being casually sexy. \" After figuring out to wear with leggings and boots and such it was cute . I made it work \" Read more \" I absolutely LOVE this dress!! ❤️ Great quality. It’s sexy and very flattering. True to size. I plan on purchasing it in black as well. \" Read more \" Cute dress with a nice fit. It was little short. Overall cute dress. \" Read more \" Thinner than expected but I'm happy with the dress very sexy love the length reached my ankles \" Read more 35 customers mention quality, 32 positive, 3 negative 35 customers mention \"Quality\" 32 positive 3 negative Customers find the sweater dress to be of great quality, with one customer noting it fits true to size. \" ...The sleeve length is well past my wrist. Overall, a great dress and the ties on the sides of the sleeves add interest. \" Read more \" ...'m going to have someone take it in a bit but other than that it's a nice dress . \" Read more \" I absolutely LOVE this dress!! ❤️ Great quality . It’s sexy and very flattering. True to size. I plan on purchasing it in black as well. \" Read more \" Loved this dress and got so many compliments. \" Read more 24 customers mention comfort, 22 positive, 2 negative 24 customers mention \"Comfort\" 22 positive 2 negative Customers find the dress comfortable. \" Comfortable & flattering! Hugs I got so many compliments on this dress \" Read more \" Love it. Very comfy just rides up throughout the day so I had to keep pulling it down.... \" Read more \" This sexy sweater dress is very comfortable and will definitely turn heads! Very nice material. Great quality and design. \" Read more \" ...It's longer in the back which was perfect for the boots I wore. It's comfy and warm not too heavy. I recommend. \" Read more 17 customers mention material thickness, 12 positive, 5 negative 17 customers mention \"Material thickness\" 12 positive 5 negative Customers like the material thickness of the dress. \" The material is good and thick BUT this dress runs really big. I got a small and it was really loose. \" Read more \" ...Is super comfy is not see through, keeps you warm as is material is thick and the color is a little more darker then the picture and is not to short. \" Read more \" Thinner than expected but I'm happy with the dress very sexy love the length reached my ankles \" Read more \" Flattering dress on your curves, soft, stretchable, not too thick , great quality for the value of your money. It's soft against your skin.... \" Read more 16 customers mention material quality, 13 positive, 3 negative 16 customers mention \"Material quality\" 13 positive 3 negative Customers like the material of the dress. \" Love the material , love the weight of dress. The burgundy is perfect color. Forms beautifully. All around this dress is perfect. \" Read more \" Fits true to size. Very nice material and fit. \" Read more \" ...Side note though, I love the dress. Great material not cheap looking at all.... \" Read more \" It looked amazing on my fiancee and the fabric was of good quality ! \" Read more 45 customers mention size, 20 positive, 25 negative 45 customers mention \"Size\" 20 positive 25 negative Customers have mixed opinions about the dress size, with some finding it true to size and appreciating its perfect length, while others note that the sleeves are too long and the overall fit is big for their liking. \" Runs large but us very very nice! Thick so winter wear only \" Read more \" ...The navy won only because I love the color more. Both fit similar.. true to size . I usually wear large/xl due to being top heavy. \" Read more \" ...I'm so sad, it's an amazing dress. I wish it came in XS. Very large , especially for a product from Asia, which usually run very small.... \" Read more \" This dress fit PERFECTLY! Definitely size down , I’m normally a Large/XL due to my large breast, but after reading the comments about the sizes I... \" Read more 18 customers mention flattering, 12 positive, 6 negative 18 customers mention \"Flattering\" 12 positive 6 negative Customers have mixed opinions about how flattering the dress is, with some finding it flattering on curves while others disagree. \" I absolutely LOVE this dress!! ❤️ Great quality. It’s sexy and very flattering . True to size. I plan on purchasing it in black as well. \" Read more \" Material stretches quick & not flattering at all ...the only nice part are the sleeves & the laces on them...disappointing...not recommended... \" Read more \" Comfortable & flattering ! Hugs I got so many compliments on this dress \" Read more \" Very flatering ! Buy it! \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Loved this dress!",
        "body": "Really liked this piece. It was comfortable, thick, and sexy. I have an athletic body type, so I appreciate something that has some room in the shoulders. It wasn't form fitting (which I prefer), but it was still structured enough to give you a nice silhouette. The shade of purple was perhaps a teeny bit darker, but pretty close to the photo. Overall I am happy with my purchase. Read more",
        "author": "Candace",
        "rating": 5.0,
        "date": "September 14, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61Og-AVH+dL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars My husband said it look very seductive",
        "body": "Fits way better than i thought it would. It make my butt look big and I don't even have any butt lol Read more",
        "author": "Tam",
        "rating": 5.0,
        "date": "September 13, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Cute dress",
        "body": "Size up on this dress because it does fit a bit snug. This is a cute casual outfit. I have worn in the fall and the winter and it was warm! Read more",
        "author": "HaulsByHaley",
        "rating": 4.0,
        "date": "December 16, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61Z1KsnctoL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars PERFECT!!!",
        "body": "This dress fit PERFECTLY! Definitely size down, I’m normally a Large/XL due to my large breast, but after reading the comments about the sizes I purchased a medium and it was just right! When I first tired it on it was a bit itchy, but a few days later when I wore it, it was fine. I’m going to order more in different colors Read more",
        "author": "Bobbie",
        "rating": 5.0,
        "date": "March 3, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/6162srrK4NL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars TRUE TO SIZE AND PERFECT FOR CHUNCK!!",
        "body": "This dress is simply beautiful! Really boosts my confidence! It’s nice and warm due to the thickness, a little short but overall nice! So no bending over if you drop anything. Very comfortable though! Worth the money for sure! Read more",
        "author": "Kylie Q.",
        "rating": 5.0,
        "date": "December 19, 2024",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/6105QYpNIDL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/61k60zVDduL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "1.0 out of 5 stars I didn’t like it",
        "body": "I didn’t like the material and doesn’t have shape Read more",
        "author": "Paola Basto",
        "rating": 1.0,
        "date": "December 22, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars HUGE and too long!",
        "body": "The sizes are crazy! I’m usually a large being 5’3 160lbs and saw the reviews to size down so I ordered a medium and it was still VERY large! The sleeves were too long and could have covered my hands easily, and the dress itself could have been 5 inches shorter than where it was. It might not look it on the picture but this dress was wayyyy to long in the back and almost covered the top of my boots. It would have been more flattering if it was a little shorter but maybe it’s not for the short girlies. The color of the dress was spot on from the photos and I liked that about it. The material was a little itchy but with a sweater dress it’s to be expected. It seemed very warm for the duration I had it on and was a little heavy which could have pulled the material down longer. I would have also needed shapewear as it did not work with my curves so I ended up returning it but it was a good try. I would not get it even if it I got the smallest size, the sizing just seems way too unpredictable. Read more",
        "author": "H&D",
        "rating": 3.0,
        "date": "October 12, 2024",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71p5fjWSRIL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Amazing",
        "body": "Good quality Read more",
        "author": "jessenia cabrera",
        "rating": 5.0,
        "date": "December 15, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Long Sleeve Off Shoulder is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.",
  "about_this_item": "Womens Maxi Dress Long Sleeve Off Shoulder is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.",
  "long_description": "Womens Maxi Dress Long Sleeve Off Shoulder is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Lantern Sleeves/Black, Light Brown, Sweater Dress/Dark Green, Knit/Pink, Lantern Sleeves/Burgundy, Sweater Dress/Black, Dark Grey, Army Green, Knit/Dark Red, Solid/Black, Navy Blue, Coffee Brown, Christmas Black, Knit/Black. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Long Sleeve Off Shoulder is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Lantern Sleeves/Black, Light Brown, Sweater Dress/Dark Green, Knit/Pink, Lantern Sleeves/Burgundy, Sweater Dress/Black, Dark Grey, Army Green, Knit/Dark Red, Solid/Black, Navy Blue, Coffee Brown, Christmas Black, Knit/Black. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "9dd34388-c9ad-4998-8695-63511836244a",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9dd34388-c9ad-4998-8695-63511836244a/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9dd34388-c9ad-4998-8695-63511836244a/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "98e6a3ac-4835-47f4-817a-18217569ceb0",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/98e6a3ac-4835-47f4-817a-18217569ceb0/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/98e6a3ac-4835-47f4-817a-18217569ceb0/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Lantern Sleeves/Black": "https://m.media-amazon.com/images/I/311tVsVqXjL._AC_SR38,50_.jpg",
    "Light Brown": "https://m.media-amazon.com/images/I/51gfDrZ2qAL._AC_SR38,50_.jpg",
    "Sweater Dress/Dark Green": "https://m.media-amazon.com/images/I/41I-r2uE4PL._AC_SR38,50_.jpg",
    "Knit/Pink": "https://m.media-amazon.com/images/I/411RFI3MrZL._AC_SR38,50_.jpg",
    "Lantern Sleeves/Burgundy": "https://m.media-amazon.com/images/I/31NSsbWA7yL._AC_SR38,50_.jpg",
    "Sweater Dress/Black": "https://m.media-amazon.com/images/I/41qC8gHRHmL._AC_SR38,50_.jpg",
    "Dark Grey": "https://m.media-amazon.com/images/I/414+MLXnzLL._AC_SR38,50_.jpg",
    "Army Green": "https://m.media-amazon.com/images/I/41t8rjoLPML._AC_SR38,50_.jpg",
    "Knit/Dark Red": "https://m.media-amazon.com/images/I/41lfuQ594BL._AC_SR38,50_.jpg",
    "Solid/Black": "https://m.media-amazon.com/images/I/51wlPw4Jv0L._AC_SR38,50_.jpg",
    "Navy Blue": "https://m.media-amazon.com/images/I/418eQw4xBrL._AC_SR38,50_.jpg",
    "Coffee Brown": "https://m.media-amazon.com/images/I/41M6bwUOVcL._AC_SR38,50_.jpg",
    "Christmas Black": "https://m.media-amazon.com/images/I/41wr8fqwmFL._AC_SR38,50_.jpg",
    "Knit/Black": "https://m.media-amazon.com/images/I/4193lG701NL._AC_SR38,50_.jpg",
    "Red": "https://m.media-amazon.com/images/I/41BGqR4AiOL._AC_SR38,50_.jpg",
    "White": "https://m.media-amazon.com/images/I/41p-sTLLCDL._AC_SR38,50_.jpg",
    "Dark Black": "https://m.media-amazon.com/images/I/41dXStTaS6L._AC_SR38,50_.jpg",
    "Purple": "https://m.media-amazon.com/images/I/41-K9NiVBeL._AC_SR38,50_.jpg",
    "Solid/Green": "https://m.media-amazon.com/images/I/51TGGfm2YTL._AC_SR38,50_.jpg",
    "Christmas Red": "https://m.media-amazon.com/images/I/419abN9VOtL._AC_SR38,50_.jpg",
    "Christmas Green": "https://m.media-amazon.com/images/I/41K4qNBNs0L._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Lantern Sleeves/Black": "51qG8pq-xaL",
    "Light Brown": "71DfagNZcZL",
    "Sweater Dress/Dark Green": "81KHuTOJTUL",
    "Knit/Pink": "71RTW3iX0gL",
    "Lantern Sleeves/Burgundy": "61Ig8HlS6ML",
    "Sweater Dress/Black": "81Q5xzwdBKL",
    "Dark Grey": "71twQpIzktL",
    "Army Green": "71oLvRo5CaL",
    "Knit/Dark Red": "71ACMs+kctL",
    "Solid/Black": "81hy1kDte7L",
    "Navy Blue": "71NoleD+R8L",
    "Coffee Brown": "61VJeDrISjL",
    "Christmas Black": "71JGPXfjeeL",
    "Knit/Black": "61-DZJRxALL",
    "Red": "816VOtuUAzL",
    "White": "61UIhOQ2ghL",
    "Dark Black": "71hIhjMS40L",
    "Purple": "61GOcqOAK7L",
    "Solid/Green": "81FCl81mtIL",
    "Christmas Red": "71D6mpFOjAL",
    "Christmas Green": "71fW987AckL"
  },
  "color_images": {
    "Lantern Sleeves/Black": [
      "https://m.media-amazon.com/images/I/51qG8pq-xaL._SL1500_.jpg"
    ],
    "Light Brown": [
      "https://m.media-amazon.com/images/I/71DfagNZcZL._SL1500_.jpg"
    ],
    "Sweater Dress/Dark Green": [
      "https://m.media-amazon.com/images/I/81KHuTOJTUL._SL1500_.jpg"
    ],
    "Knit/Pink": [
      "https://m.media-amazon.com/images/I/71RTW3iX0gL._SL1500_.jpg"
    ],
    "Lantern Sleeves/Burgundy": [
      "https://m.media-amazon.com/images/I/61Ig8HlS6ML._SL1500_.jpg"
    ],
    "Sweater Dress/Black": [
      "https://m.media-amazon.com/images/I/81Q5xzwdBKL._SL1500_.jpg"
    ],
    "Dark Grey": [
      "https://m.media-amazon.com/images/I/71twQpIzktL._SL1500_.jpg"
    ],
    "Army Green": [
      "https://m.media-amazon.com/images/I/71oLvRo5CaL._SL1500_.jpg"
    ],
    "Knit/Dark Red": [
      "https://m.media-amazon.com/images/I/71ACMs+kctL._SL1500_.jpg"
    ],
    "Solid/Black": [
      "https://m.media-amazon.com/images/I/81hy1kDte7L._SL1500_.jpg"
    ],
    "Navy Blue": [
      "https://m.media-amazon.com/images/I/71NoleD+R8L._SL1500_.jpg"
    ],
    "Coffee Brown": [
      "https://m.media-amazon.com/images/I/61VJeDrISjL._SL1500_.jpg"
    ],
    "Christmas Black": [
      "https://m.media-amazon.com/images/I/71JGPXfjeeL._SL1500_.jpg"
    ],
    "Knit/Black": [
      "https://m.media-amazon.com/images/I/61-DZJRxALL._SL1500_.jpg"
    ],
    "Red": [
      "https://m.media-amazon.com/images/I/816VOtuUAzL._SL1500_.jpg"
    ],
    "White": [
      "https://m.media-amazon.com/images/I/61UIhOQ2ghL._SL1500_.jpg"
    ],
    "Dark Black": [
      "https://m.media-amazon.com/images/I/71hIhjMS40L._SL1500_.jpg"
    ],
    "Purple": [
      "https://m.media-amazon.com/images/I/61GOcqOAK7L._SL1500_.jpg"
    ],
    "Solid/Green": [
      "https://m.media-amazon.com/images/I/81FCl81mtIL._SL1500_.jpg"
    ],
    "Christmas Red": [
      "https://m.media-amazon.com/images/I/71D6mpFOjAL._SL1500_.jpg"
    ],
    "Christmas Green": [
      "https://m.media-amazon.com/images/I/71fW987AckL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 89.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51NuUv+OXgL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 545.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61ZukB9C16L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 175.42,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/81pwjJgvUtL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-off-shoulder",
      "title": "Womens Maxi Dress Off Shoulder",
      "price": 103.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51ipqmzN4IL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-long-sleeve-ruched",
      "title": "Womens Maxi Dress Bodycon Long Sleeve Ruched",
      "price": 40.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51Ya-KxobWL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-long-sleeve-v-neck",
      "title": "Womens Maxi Dress Long Sleeve V Neck",
      "price": 28.78,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61Snqr58PqL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 83.16,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61myt1FB2YL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-off-shoulder-bodycon-long-sleeve-maxi",
      "title": "Womens Maxi Dress Off Shoulder Bodycon Long Sleeve Maxi",
      "price": 53.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/611pJhxTuIL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-long-sleeve",
      "title": "Womens Maxi Dress Bodycon Long Sleeve",
      "price": 36.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71ykLRhk+6L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-sleeveless-cocktail",
      "title": "Womens Dress Sleeveless Cocktail",
      "price": 38.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51zplUMtETL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-ruched-maxi-bodycon-cocktail",
      "title": "Womens Maxi Dress Long Sleeve Ruched Maxi Bodycon Cocktail",
      "price": 58.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61BOHuOzjjL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi",
      "title": "Womens Maxi Dress Maxi",
      "price": 31.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61pjj-1NYOL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi",
      "title": "Womens Maxi Dress Maxi",
      "price": 19.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71QZPXa-3TL._SL1500_.jpg"
      ]
    }
  ]
}