{
  "id": "womens-maxi-dress-v-neck-long-sleeve-maxi-bodycon-cocktail-ruched",
  "handle": "womens-maxi-dress-v-neck-long-sleeve-maxi-bodycon-cocktail-ruched",
  "sku": "JC1379",
  "asin": "B0BK8RV72F",
  "title": "Womens Maxi Dress V Neck Long Sleeve Maxi Bodycon Cocktail Ruched",
  "title_original": "CYiNu Women's V Neck Wrap Velvet Long Sleeve Elegant Bodycon Ruched Cocktail Party Maxi Dress",
  "brand": "Visit the CYiNu Store",
  "price": 60.99,
  "social_proof": {
    "bought_past_month": 1653,
    "text": "1653+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/61lNqpOFyqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/712O40u3L3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/7166ux2aGZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/718asAfB9EL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71q1F-khDFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61L-FR1GWxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61bZfcNYwzL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61lieZcjH0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61YSenVpAJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61EmacMCE2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61H7i-U923L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61IvD8J3TUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/612K3QjA14L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61szcHxvJQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61m85j2B9sL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/61lNqpOFyqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/712O40u3L3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/7166ux2aGZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/718asAfB9EL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71q1F-khDFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61L-FR1GWxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61bZfcNYwzL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61lieZcjH0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61YSenVpAJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61EmacMCE2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61H7i-U923L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61IvD8J3TUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/612K3QjA14L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61szcHxvJQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61m85j2B9sL._SL1500_.jpg"
  ],
  "aplus_images": [
    "https://m.media-amazon.com/images/I/31UL7xeBUAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31MCdqIwQTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/319SBFdz%2BlL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31fPf76FJJL._SL1500_.jpg"
  ],
  "description_images": [
    "https://m.media-amazon.com/images/I/31UL7xeBUAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31MCdqIwQTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/319SBFdz%2BlL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31fPf76FJJL._SL1500_.jpg"
  ],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ October 24, 2022",
    "ASIN ‏": "‎ B0BK8RW9NP",
    "Best Sellers Rank": "#9,168 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #100 in Women's Dresses",
    "Customer Reviews": "4.1 4.1 out of 5 stars (472)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Brown",
      "Dark Army Green",
      "Wine Red",
      "Pink",
      "Blue",
      "Purple",
      "Peacock Blue",
      "Royal Blue",
      "Mauve",
      "Black",
      "Green"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.1,
    "count": 472,
    "customers_say": "Customers find the dress fits well and accentuates curves, with soft, beautiful velvet material that hugs the waistline. They describe it as super flattering, comfortable, and gorgeous, with one customer noting it looks more expensive than its price. The color receives positive feedback, though opinions about the cut are mixed, with several customers noting the front slit is lower than expected. Generated from the text of customer reviews Select to learn more Fit (97) Style (84) Material quality (55) Flattering (54) Quality (53) Comfort (48) Color (31) Cut (22) 97 customers mention fit, 80 positive, 17 negative 97 customers mention \"Fit\" 80 positive 17 negative Customers like how the dress fits, describing it as sexy and form-fitting, with one customer noting it hits at the mid-calf. \" ...Love the ruched front! I am 5'1\", 120 lbs., 36 D, Sz M perfect fit . Sexy and Classy all in one! Very, comfortable and easy to move in. \" Read more \" Fits great and is so pretty! It’s really wrinkly from being shrink wrapped, but it should be good to go after I wash and dry it.... \" Read more \" ...I ordered a size small in blue and it fits like a glove ! I was concerned about the length because the cut on the bottom would be challenging to hem.... \" Read more \" ...This dress came just in time. Looked so small in the bag but fit like a glove . I did buy it with an type of Spanx undergarment.... \" Read more 84 customers mention style, 75 positive, 9 negative 84 customers mention \"Style\" 75 positive 9 negative Customers find the dress gorgeous, with one mentioning it looks more expensive than its price and another noting it pairs well with strappy heels. \" Bought this dress for a winter wedding and it was beautiful . I received so many compliments. I ordered a XL with the hopes it wouldn’t be too tight.... \" Read more \" Beautiful dress . Fits like a glove. I receive many compliments when I wear it. Fabric is soft and no itchiness at all. \" Read more \" ...Love the ruched front! I am 5'1\", 120 lbs., 36 D, Sz M perfect fit. Sexy and Classy all in one! Very, comfortable and easy to move in. \" Read more \" Classy , great material,feel and look. \" Read more 55 customers mention material quality, 40 positive, 15 negative 55 customers mention \"Material quality\" 40 positive 15 negative Customers appreciate the material of the dress, describing it as beautiful velvet with a luxurious feel and soft texture, with one customer noting how it hugs the waist line. \" Love! I got this for a wedding. It's soft and has good stretch while keeping it's form. It's very comfortable and I received many compliments.... \" Read more \" ...Fits like a glove. I receive many compliments when I wear it. Fabric is soft and no itchiness at all. \" Read more \" Poor material . Too itchy \" Read more \" Bought this dress for my sister's wedding, fabric is great , kept me warm for the cool day on her wedding. The cut seam looked lovely.... \" Read more 54 customers mention flattering, 52 positive, 2 negative 54 customers mention \"Flattering\" 52 positive 2 negative Customers find the dress flattering, particularly noting how it accentuates and hugs curves in all the right places. \" This dress was comfortable and flattering , but arrived wrinkly. The material was not too thin and had good weight to it.... \" Read more \" ...This dress is very flattering . It hugged all the right areas. Had it dry cleaned to knock out some wrinkles and it kept its shape; no issues. \" Read more \" ...5’2, but it actually worked perfectly on the longer end and hugged all the right places . I received so many compliments! Super flattering fit! \" Read more \" ...by how perfect this dress fits- its comfortable, stretchy, hugs all the right places , the top isn’t excessively low/open cut the way it is on some... \" Read more 53 customers mention quality, 46 positive, 7 negative 53 customers mention \"Quality\" 46 positive 7 negative Customers find the dress to be of nice quality and perfect for their needs. \" Great dress . The fit, look, and style looks great! The material is on ruff thicker side. Thec dress has stretch to it . \" Read more \" ...Like I spent at least 300.00 on the dress. Only I didn't. Great quality , beautiful cut. Flattering where it needs to go. Hides many sins.... \" Read more \" This is a nice dress . I’m 220lb bought XL. Fit all the curves great \" Read more \" ...I will be returning it due to that reason . This dress is well made and beautiful however in my opinion, It does run smaller.... \" Read more 48 customers mention comfort, 47 positive, 1 negative 48 customers mention \"Comfort\" 47 positive 1 negative Customers find the dress comfortable, with one mentioning that the ruching is forgiving and another noting there is no itchiness at all. \" I was very pleasantly surprised by how perfect this dress fits- its comfortable , stretchy, hugs all the right places, the top isn’t excessively low/... \" Read more \" ...It was so comfortable and very, very elegant! I am so glad that I was able to trust the reviews enough in order to place my order for this dress!... \" Read more \" Holiday cocktail party?- this is your dress! Sexy, yet comfy and warm for winter! \" Read more \" Great dress true to size very comfortable received lots of compliments, price was on point, loved the velvet fabric without being too hot \" Read more 31 customers mention color, 27 positive, 4 negative 31 customers mention \"Color\" 27 positive 4 negative Customers like the dress's color. \" Beautiful color , but the sleeves were just too loose. I’m 5 foot 3 1/2 inches and approximately 120 pounds.... \" Read more \" This dress fit like a glove. The color is beautiful and the fabric is great. I'm 5'3\", 160lbs and got a M which fit perfectly. \" Read more \" Gorgeous color and cut. Thin material, but cut makes up for that. Size chart is off, they are much bigger \" Read more \" ...First time buying a velvet dress, so comfortable and the color was so pretty . Fit is true to size . Usually a 14 and the Xl fit nicely. \" Read more 22 customers mention cut, 11 positive, 11 negative 22 customers mention \"Cut\" 11 positive 11 negative Customers have mixed opinions about the dress's cut, with some appreciating the high slit and tasteful neckline, while others find it a little lower than desired. \" ... Love the neckline . The ruching is perfect. I ordered the Medium and it fits like a glove. Material is firm but stretchy and compliments the body.... \" Read more \" ...I would say it’s a great cocktail party dress. The slit is high , so if you are planning on wearing shoe wear keep that in mind.... \" Read more \" ...Honestly it’s not a bad quality dress, not see through , not too thick or thin, held my larger chest in place, and a beautiful shade of green… it... \" Read more \" ...Just be careful when sitting as the slit is pretty high . \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Stunning!",
        "body": "LOVE this dress. It is comfortable and flattering. I have received so many compliments when wearing it. The material has a bit of stretch, so it still fits nicely as my weight has fluctuated. The material is opaque and nicely heavy, but I do not overheat in it. Read more",
        "author": "Customer",
        "rating": 5.0,
        "date": "December 19, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Comfy and so pretty!",
        "body": "It’s not quite as green as it appears in the photo but I still really loved it! It’s more of a brownish green but it can look slightly different in different lighting. I wore this to a cold winter wedding and I definitely appreciated finding a dress with long sleeves! The slight ripples of the fabric on the front make it really flattering! The fabric, color, and the gathering of the fabric made my post holiday belly seem slimmer which I appreciated! I had this packed tightly in a carry on bag and it had very limited wrinkles when I unpacked it which then shook out immediately. Flattering cut and length! Cute with strappy heals as well as tights and dressy boots! If you want a fitted, flattering, earth toned dress, this is perfect! Read more",
        "author": "Emma",
        "rating": 5.0,
        "date": "January 11, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Great Dress",
        "body": "Great dress. The fit, look, and style looks great! The material is on ruff thicker side. Thec dress has stretch to it . Read more",
        "author": "lissette",
        "rating": 5.0,
        "date": "December 12, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Cute and Flattering",
        "body": "Super cute, comfy, and made with good material. I’m 5’3” and 148 lbs and got a size small — it fit like a glove and even hid my stomach area while hugging all the right places. The only downside is that when I sat down, the slit went up pretty high, and I had to keep pulling it closed. Read more",
        "author": "Ya Ya",
        "rating": 4.0,
        "date": "November 12, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "1.0 out of 5 stars Poor Quality and Fit",
        "body": "This dress is absolutely not worth the price. Fabric is thin and looks cheap. I ordered my normal size and the fit was off...skin tight in the hips and thighs and weirdly big on top. The v neck is very wide and just doesn't sit right. Unfortunately, the dress was returned. Read more",
        "author": "cghudson",
        "rating": 1.0,
        "date": "December 4, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Gorgeous dress! Hand steam - worth it",
        "body": "This dress fits great and looks fantastic! It’s comfortable and has a little stretch. I went with amazon’s suggested size for my profile. Fits perfectly. Great for cold weather. Came vacuum packed, so very wrinkled. Hand steaming worked great. (Ice cubes in the dryer did not work) Read more",
        "author": "Cac",
        "rating": 5.0,
        "date": "December 6, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Is cute",
        "body": "The dress is nice, although the fit is a bit off and it had a bad smell. The quality is not bad, but it has a little stretch. The fabric is soft and has a moderate thickness. Read more",
        "author": "COLETTE ROGERS-WHYTE",
        "rating": 3.0,
        "date": "November 6, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Fits great",
        "body": "Slinky fit. Sexy. True to size. Emerald green.lovely xmas dress. Read more",
        "author": "Mel",
        "rating": 5.0,
        "date": "December 15, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress V Neck Long Sleeve Maxi Bodycon Cocktail Ruched is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.",
  "about_this_item": "Womens Maxi Dress V Neck Long Sleeve Maxi Bodycon Cocktail Ruched is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.",
  "long_description": "Womens Maxi Dress V Neck Long Sleeve Maxi Bodycon Cocktail Ruched is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Brown, Dark Army Green, Wine Red, Pink, Blue, Purple, Peacock Blue, Royal Blue, Mauve, Black, Green. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress V Neck Long Sleeve Maxi Bodycon Cocktail Ruched is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/31UL7xeBUAL._SL1500_.jpg",
      "alt": "Womens Maxi Dress V Neck Long Sleeve Maxi Bodycon Cocktail Ruched details image 1"
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/31MCdqIwQTL._SL1500_.jpg",
      "alt": "Womens Maxi Dress V Neck Long Sleeve Maxi Bodycon Cocktail Ruched details image 2"
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/319SBFdz%2BlL._SL1500_.jpg",
      "alt": "Womens Maxi Dress V Neck Long Sleeve Maxi Bodycon Cocktail Ruched details image 3"
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/31fPf76FJJL._SL1500_.jpg",
      "alt": "Womens Maxi Dress V Neck Long Sleeve Maxi Bodycon Cocktail Ruched details image 4"
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Brown, Dark Army Green, Wine Red, Pink, Blue, Purple, Peacock Blue, Royal Blue, Mauve, Black, Green. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "01f520f3-0eb1-40a1-9891-48665660de26",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/01f520f3-0eb1-40a1-9891-48665660de26/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/01f520f3-0eb1-40a1-9891-48665660de26/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/48a5c487-f45b-4362-8970-b85e5f752e45.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "540fccc4-39f7-4196-98da-e783dd795ca6",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/540fccc4-39f7-4196-98da-e783dd795ca6/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/540fccc4-39f7-4196-98da-e783dd795ca6/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/48a5c487-f45b-4362-8970-b85e5f752e45.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "feb8d4d6-5a62-4046-aa7e-1868460d403e",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/feb8d4d6-5a62-4046-aa7e-1868460d403e/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/feb8d4d6-5a62-4046-aa7e-1868460d403e/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/48a5c487-f45b-4362-8970-b85e5f752e45.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "f5f477b5-590b-4b59-8134-5c397a7cc512",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f5f477b5-590b-4b59-8134-5c397a7cc512/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f5f477b5-590b-4b59-8134-5c397a7cc512/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/48a5c487-f45b-4362-8970-b85e5f752e45.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "3687b372-3f7d-4ca4-9972-41c70296c00c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3687b372-3f7d-4ca4-9972-41c70296c00c/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3687b372-3f7d-4ca4-9972-41c70296c00c/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/48a5c487-f45b-4362-8970-b85e5f752e45.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "517c256d-3f88-4d12-9ca4-ed7fb00057e3",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/517c256d-3f88-4d12-9ca4-ed7fb00057e3/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/517c256d-3f88-4d12-9ca4-ed7fb00057e3/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/48a5c487-f45b-4362-8970-b85e5f752e45.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "e8d2fe6a-498c-4e8d-bf7d-a656ad73b299",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e8d2fe6a-498c-4e8d-bf7d-a656ad73b299/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e8d2fe6a-498c-4e8d-bf7d-a656ad73b299/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/48a5c487-f45b-4362-8970-b85e5f752e45.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "6ed94dcb-163a-4fa9-a2a5-09eb3a4c3b90",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6ed94dcb-163a-4fa9-a2a5-09eb3a4c3b90/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6ed94dcb-163a-4fa9-a2a5-09eb3a4c3b90/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/48a5c487-f45b-4362-8970-b85e5f752e45.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "f995926b-f98e-403d-b89e-3162c89507c9",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f995926b-f98e-403d-b89e-3162c89507c9/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f995926b-f98e-403d-b89e-3162c89507c9/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/48a5c487-f45b-4362-8970-b85e5f752e45.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "e283756c-08d9-4cc7-81e0-8635bf09c50d",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e283756c-08d9-4cc7-81e0-8635bf09c50d/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e283756c-08d9-4cc7-81e0-8635bf09c50d/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/48a5c487-f45b-4362-8970-b85e5f752e45.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Brown": "https://m.media-amazon.com/images/I/31fPf76FJJL._AC_SR38,50_.jpg",
    "Dark Army Green": "https://m.media-amazon.com/images/I/31xKnjt7dGL._AC_SR38,50_.jpg",
    "Wine Red": "https://m.media-amazon.com/images/I/31UL7xeBUAL._AC_SR38,50_.jpg",
    "Pink": "https://m.media-amazon.com/images/I/31qs+ekFNnL._AC_SR38,50_.jpg",
    "Blue": "https://m.media-amazon.com/images/I/31hp3ZzMsaL._AC_SR38,50_.jpg",
    "Purple": "https://m.media-amazon.com/images/I/319Lap643ML._AC_SR38,50_.jpg",
    "Peacock Blue": "https://m.media-amazon.com/images/I/31RCd8+QivL._AC_SR38,50_.jpg",
    "Royal Blue": "https://m.media-amazon.com/images/I/31hucPktdnL._AC_SR38,50_.jpg",
    "Mauve": "https://m.media-amazon.com/images/I/310QT4kEZ8L._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/319SBFdz+lL._AC_SR38,50_.jpg",
    "Green": "https://m.media-amazon.com/images/I/31MCdqIwQTL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Brown": "61L-FR1GWxL",
    "Dark Army Green": "61bZfcNYwzL",
    "Wine Red": "61lieZcjH0L",
    "Pink": "61YSenVpAJL",
    "Blue": "61EmacMCE2L",
    "Purple": "61H7i-U923L",
    "Peacock Blue": "61IvD8J3TUL",
    "Royal Blue": "612K3QjA14L",
    "Mauve": "61szcHxvJQL",
    "Black": "61lNqpOFyqL",
    "Green": "61m85j2B9sL"
  },
  "color_images": {
    "Brown": [
      "https://m.media-amazon.com/images/I/61L-FR1GWxL._SL1500_.jpg"
    ],
    "Dark Army Green": [
      "https://m.media-amazon.com/images/I/61bZfcNYwzL._SL1500_.jpg"
    ],
    "Wine Red": [
      "https://m.media-amazon.com/images/I/61lieZcjH0L._SL1500_.jpg"
    ],
    "Pink": [
      "https://m.media-amazon.com/images/I/61YSenVpAJL._SL1500_.jpg"
    ],
    "Blue": [
      "https://m.media-amazon.com/images/I/61EmacMCE2L._SL1500_.jpg"
    ],
    "Purple": [
      "https://m.media-amazon.com/images/I/61H7i-U923L._SL1500_.jpg"
    ],
    "Peacock Blue": [
      "https://m.media-amazon.com/images/I/61IvD8J3TUL._SL1500_.jpg"
    ],
    "Royal Blue": [
      "https://m.media-amazon.com/images/I/612K3QjA14L._SL1500_.jpg"
    ],
    "Mauve": [
      "https://m.media-amazon.com/images/I/61szcHxvJQL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/61lNqpOFyqL._SL1500_.jpg"
    ],
    "Green": [
      "https://m.media-amazon.com/images/I/61m85j2B9sL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-sleeveless-maxi",
      "title": "Womens Maxi Dress Sleeveless Maxi",
      "price": 48.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71qwUjryGiL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-ruched-long-sleeve-bodycon",
      "title": "Womens Maxi Dress Ruched Long Sleeve Bodycon",
      "price": 31.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51zwWMjriiL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-bodycon-ruched-sleeveless-cocktail",
      "title": "Womens Dress Bodycon Ruched Sleeveless Cocktail",
      "price": 30.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61agJqjEn4L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-long-sleeve",
      "title": "Womens Maxi Dress Bodycon Long Sleeve",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71eDrn5syuL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-boat-neck-ruched-bodycon",
      "title": "Womens Maxi Dress Long Sleeve Boat Neck Ruched Bodycon",
      "price": 37.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61bFy4NJTbL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-evening-short-sleeve",
      "title": "Womens Maxi Dress Evening Short Sleeve",
      "price": 65.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61LNlQEZAzL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-cocktail-bodycon-one-shoulder-sleeveless",
      "title": "Womens Maxi Dress Maxi Cocktail Bodycon One Shoulder Sleeveless",
      "price": 45.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/61cj7Y09JcL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-maxi",
      "title": "Womens Maxi Dress Long Sleeve Maxi",
      "price": 54.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71KQMgGHykL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-off-shoulder",
      "title": "Womens Maxi Dress Off Shoulder",
      "price": 165.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Wedding Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/61i1OBlANrL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-sleeveless-maxi",
      "title": "Womens Maxi Dress Sleeveless Maxi",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51JKH0nQu5L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-short-sleeve-v-neck-cocktail",
      "title": "Womens Maxi Dress Maxi Short Sleeve V Neck Cocktail",
      "price": 62.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61DbY3AkAIL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/51lIams4plL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-off-shoulder-bodycon-long-sleeve-maxi",
      "title": "Womens Maxi Dress Off Shoulder Bodycon Long Sleeve Maxi",
      "price": 53.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/611pJhxTuIL._SL1500_.jpg"
      ]
    }
  ]
}