{
  "id": "womens-maxi-dress-long-sleeve",
  "handle": "womens-maxi-dress-long-sleeve",
  "sku": "JC1716",
  "asin": "B0BLVRV2JL",
  "title": "Womens Maxi Dress Long Sleeve",
  "title_original": "KIRUNDO Long Sleeve Baby Doll Dresses Women 2025 Casual Fall Winter Ruffle Mock Neck Tiered Mini Flowy Swing Shift Dress",
  "brand": "Visit the KIRUNDO Store",
  "price": 39.99,
  "social_proof": {
    "bought_past_month": 293,
    "text": "293+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/71fftOJjItL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71TG7j6uAxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71yGcxRKMAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71NUNWZNGeL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71MqCoDfuAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71CnsnHH5qL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71k8XxHE2rL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71WCaX7BPCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81+uN8ztgjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81GyNzLf4QL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71FfJk4jJQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/7128289UCoL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71IB725c-PL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/713oPK1kBTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/717itY4-NHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81kt+PKX-tL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71wSfGMIyHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71-7MjYODeL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ulyJ8rjeL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/71fftOJjItL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71TG7j6uAxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71yGcxRKMAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71NUNWZNGeL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71MqCoDfuAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71CnsnHH5qL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71k8XxHE2rL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71WCaX7BPCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81+uN8ztgjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81GyNzLf4QL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71FfJk4jJQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/7128289UCoL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71IB725c-PL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/713oPK1kBTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/717itY4-NHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81kt+PKX-tL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71wSfGMIyHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71-7MjYODeL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ulyJ8rjeL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ December 11, 2022",
    "ASIN ‏": "‎ B0BLVQLG3P",
    "Best Sellers Rank": "#21,382 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #163 in Women's Casual Dresses",
    "Customer Reviews": "4.1 4.1 out of 5 stars (1,129)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Blue",
      "Apricot",
      "Light Green",
      "Black",
      "Brunt Orange",
      "Light Blue",
      "Rose Red",
      "Lake Blue",
      "Navy",
      "Wine Red",
      "Pink",
      "White",
      "Purple",
      "Green"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.1,
    "count": 1129,
    "customers_say": "Customers find the dress cute and flattering, particularly noting it works well for all body types and is perfect for fall weddings. The dress receives positive feedback for its fit, being longer than knee length, and its quality, with one customer mentioning it's loose enough to wear a warm undershirt underneath. They appreciate its comfort, color, and versatility for various occasions, while opinions about sizing are mixed, with some finding it true to size while others say it's a bit big. Generated from the text of customer reviews Select to learn more Appearance (112) Fit (85) Quality (52) Color (40) Comfort (36) Dress style (36) Flattering (29) Size (32) 112 customers mention appearance, 103 positive, 9 negative 112 customers mention \"Appearance\" 103 positive 9 negative Customers find the dress visually appealing, describing it as cute and nice, with one customer noting it looks fine even in dim lights, while another mentions it makes them feel like royalty. \" ...this dress to my graduation and received so many compliments about how cute it is. I have it in my cart already in another color. Loved this so much! \" Read more \" Beautiful dress that is comfortable too. The sizing is very flexible and could work well with lots of different body types.... \" Read more \" This is such a cute dress . It is flowy and the color is great. I got so many compliments on it when I wore it to the office.... \" Read more \" Super cute , great fit. Just came with a TON of wrinkles so if you order, plan to steam it before you wear it. \" Read more 85 customers mention fit, 64 positive, 21 negative 85 customers mention \"Fit\" 64 positive 21 negative Customers are satisfied with how the dress fits, noting it's not too short for their age and is longer than knee length, with one customer mentioning it's loose enough to wear a warm undershirt underneath. \" Wore this dress for a Halloween wedding and was the perfect fit ! So many compliments! Definitely will purchase in another color. True to size! \" Read more \" Great dress, I’m 5’8 150lbs bought a medium, fit wonderfully. Great length , not see through, nice material.... \" Read more \" This sweet little dress is perfect Great fit , true to size. Very cute and comfy and it is lined so no see through.... \" Read more \" ...The Burt orange is perfect. I ordered a small and it’s still very long . I’m sure if you have longer torso it would be great. \" Read more 52 customers mention quality, 48 positive, 4 negative 52 customers mention \"Quality\" 48 positive 4 negative Customers have mixed opinions about the dress's quality, with some finding it beautifully made and great, while others describe it as cheap. \" ... Great quality , color. Love the tie neck detail in the back. Easy fall staple that can be dressed up or down. \" Read more \" This is a great dress ! Casual or dressy. I ordered a Large. Perfect fit. I am 5’5” and it came sligtly below my knee.... \" Read more \" Nice dress ... \" Read more \" Love this dress ! Wore it for two concerts today! Fits nice. A bit big. As suggested may wont to try one size down.... \" Read more 40 customers mention color, 34 positive, 6 negative 40 customers mention \"Color\" 34 positive 6 negative Customers like the dress's color, with one mentioning it works well as a simple black dress for funerals. \" Beautiful color . The Burt orange is perfect. I ordered a small and it’s still very long. I’m sure if you have longer torso it would be great. \" Read more \" ...true to size....beautiful fabric.....glam chic looking.... love the color \" Read more \" The dress arrived quickly, the color is beautiful , and the fabric feels light. But I had the impression that someone had already worn it before.... \" Read more \" ...I did not like how my chest looked even bigger but loved the color . It’s soft and little flow to it. Just not on me as much as I thought.... \" Read more 36 customers mention comfort, 36 positive, 0 negative 36 customers mention \"Comfort\" 36 positive 0 negative Customers find the dress comfortable, with one mentioning it's not itchy and another noting they feel at ease all night. \" ...Has no pockets, it's comfortable and has a functional and cute tie in the back, which made it easy for me to get around my chest and tie in the back... \" Read more \" Wore this to a wedding. Very comfortable and was flattering. If I had more time I would have sized up.... \" Read more \" ...It’s comfy and flowy. I love the bow on the back. Fit perfectly. It’s TTS. All the seams are good. Nothing loose or uneven. Very well made!... \" Read more \" Love how it fits!!! So comfortable ! \" Read more 36 customers mention dress style, 36 positive, 0 negative 36 customers mention \"Dress style\" 36 positive 0 negative Customers love the dress's versatility, finding it perfect for fall weddings and formal wear, with one customer noting it can be dressed up for various occasions. \" ...The cut and make is beautiful. It’s so versatile You can pair it with tennis shoes or sandals and it will look fantastic! \" Read more \" ...It's a perfect fall dress ! \" Read more \" ...Love the tie neck detail in the back. Easy fall staple that can be dressed up or down . \" Read more \" This dress is perfect for all occasions ! It can be dressed up or down. It is flowy and hits perfectly in all the right places. \" Read more 29 customers mention flattering, 26 positive, 3 negative 29 customers mention \"Flattering\" 26 positive 3 negative Customers find the dress flattering, particularly noting that it works well for all body types, with one customer mentioning it hits perfectly in all the right places. \" I love this dress! Very comfy, beautiful, and flattering . I like it so much that I just purchased another one in a different color. Highly recommend. \" Read more \" ...The sleeves are a belled at the wrist and sheer. The dress is very flattering and feminine. I will definitely be ordering additional colors. \" Read more \" This dress was super flattering and comfortable. As a curvy person with broad shoulders, dresses are sometimes difficult.... \" Read more \" ...is beautiful, not see through, more fitted around the bust, and extremely flattering . Can’t wait to wear out. \" Read more 32 customers mention size, 17 positive, 15 negative 32 customers mention \"Size\" 17 positive 15 negative Customers have mixed opinions about the dress's fit, with some finding it true to size while others say it runs a bit big. \" ...Picture is not accurate to show how dress actually fits. True to size . Although if someone is large on top it would be a squeeze.... \" Read more \" Runs large and brighter red than it looks in the picture. Cute dress but the fabric feels cheap. \" Read more \" Very pretty, and the sizing is as expected , except in the chest--too large for me, and didn't look right.... \" Read more \" This dress runs very large . It's heavy, and not nearly as \"flowy\" as it appears in the photo.... \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Great dress",
        "body": "Beautiful dress!! Fit true to size! Lightweight dress that is great for summer or early fall! Read more",
        "author": "Holli",
        "rating": 5.0,
        "date": "December 7, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Love!",
        "body": "There is a lot of mixed reviews on this dress, I’m glad I took the chance and purchased the black. It fit perfectly and looked nice/elegant, one of my favs. I got medium- 5’8 and it hit right above the knee. Read more",
        "author": "SG",
        "rating": 5.0,
        "date": "December 22, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Flowy and Elegant",
        "body": "This dress is absolutely stunning! The quality is excellent—well-made with a true-to-size fit. The fabric flows beautifully, creating a graceful silhouette, and it’s not see-through, adding to its sophistication. The bow at the back, tied at the nape of the neck, elevates the design perfectly. Incredibly comfortable to wear, it was the perfect choice for an all-black-themed wedding. I received countless compliments and felt both stylish and at ease all night. Highly recommend! Reference: 160 lbs | 5’1” | 36DD Read more",
        "author": "AriVel429",
        "rating": 4.0,
        "date": "March 23, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/81WmNLH2k7L._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71cJ0XMgtkL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Love the color!",
        "body": "This is such a cute dress. It is flowy and the color is great. I got so many compliments on it when I wore it to the office. It is a nice quality material and is not itchy. Its not too short. It has a nice layer underneath which makes it not see through which is great. This is a dress that I would consider buying again in another color. Read more",
        "author": "Heidi Smith",
        "rating": 5.0,
        "date": "June 1, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Disappointed with the neckline",
        "body": "The dress arrived quickly, the color is beautiful, and the fabric feels light. But I had the impression that someone had already worn it before. The neckline doesn’t look neat and doesn’t match the photos — it makes the overall appearance less attractive. Otherwise, it fits okay, but I expected better quality. Read more",
        "author": "Binoculars",
        "rating": 3.0,
        "date": "August 30, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "1.0 out of 5 stars Oh no.",
        "body": "IFFF you’re going for Laura Ingles/ little house on the prairie type vibes, you’ve definitely come to the right place. I ordered the green dress and the light blue one is the one I got. I didn’t even care enough to complain after I tried it on. The color suddenly became the least of my worries. Super cute in photos and reviews, but don’t fall for it. You’ll literally look like life before WiFi. 10/10 do not recommend. Read more",
        "author": "Ashley M",
        "rating": 1.0,
        "date": "October 4, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Great dress for holiday and more formal wear!",
        "body": "Love this dress! Wore it for two concerts today! Fits nice. A bit big. As suggested may wont to try one size down. Love it though and works with my figure. Was comfortable for singing and standing. Thank you! Read more",
        "author": "suzie",
        "rating": 5.0,
        "date": "December 15, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Good for dressy or casual",
        "body": "This one has been in my cart for a bit, but she went on sale for Black Friday so I snatched her up quick! It’s comfy and flowy. I love the bow on the back. Fit perfectly. It’s TTS. All the seams are good. Nothing loose or uneven. Very well made! Good price with BF sale. Very happy I finally pulled the trigger. Noticed while uploading that pics aren’t the best. I will add more when I wear it. Read more",
        "author": "KCP",
        "rating": 5.0,
        "date": "November 22, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71QSC6P7lDL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/61YOuFWUV1L._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/716fZkvFKAL._SY88._SL1500_.jpg"
        ]
      }
    ]
  },
  "short_description": "Womens Maxi Dress Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.",
  "about_this_item": "Womens Maxi Dress Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.",
  "long_description": "Womens Maxi Dress Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Blue, Apricot, Light Green, Black, Brunt Orange, Light Blue, Rose Red, Lake Blue, Navy, Wine Red, Pink, White, Purple, Green. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Blue, Apricot, Light Green, Black, Brunt Orange, Light Blue, Rose Red, Lake Blue, Navy, Wine Red, Pink, White, Purple, Green. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "7f3c07e6-9453-4e97-a53b-a8cf2f5247c0",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7f3c07e6-9453-4e97-a53b-a8cf2f5247c0/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7f3c07e6-9453-4e97-a53b-a8cf2f5247c0/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/cadf0b48-60a8-4d84-beef-cccbe069ab86.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "8e1b1466-314b-45d3-b3ed-9b4b18201f9f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8e1b1466-314b-45d3-b3ed-9b4b18201f9f/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8e1b1466-314b-45d3-b3ed-9b4b18201f9f/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/cadf0b48-60a8-4d84-beef-cccbe069ab86.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "46359963-3ff1-4694-aea4-109ecd1255ec",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/46359963-3ff1-4694-aea4-109ecd1255ec/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/46359963-3ff1-4694-aea4-109ecd1255ec/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/cadf0b48-60a8-4d84-beef-cccbe069ab86.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "ce0e0b44-c477-4a30-8218-f3b49b01e8e6",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ce0e0b44-c477-4a30-8218-f3b49b01e8e6/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ce0e0b44-c477-4a30-8218-f3b49b01e8e6/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/cadf0b48-60a8-4d84-beef-cccbe069ab86.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "ecf39bc1-ee1e-4ec1-aadb-dd88e6006329",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ecf39bc1-ee1e-4ec1-aadb-dd88e6006329/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ecf39bc1-ee1e-4ec1-aadb-dd88e6006329/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/cadf0b48-60a8-4d84-beef-cccbe069ab86.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "0f5d252c-332d-44ec-9157-c4b1b432b75a",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0f5d252c-332d-44ec-9157-c4b1b432b75a/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0f5d252c-332d-44ec-9157-c4b1b432b75a/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/cadf0b48-60a8-4d84-beef-cccbe069ab86.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "0a8277bc-e295-44d3-a4e1-e971c38af6fe",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0a8277bc-e295-44d3-a4e1-e971c38af6fe/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0a8277bc-e295-44d3-a4e1-e971c38af6fe/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/cadf0b48-60a8-4d84-beef-cccbe069ab86.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "d66e2d47-731a-40e8-894e-0c7d34562103",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d66e2d47-731a-40e8-894e-0c7d34562103/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d66e2d47-731a-40e8-894e-0c7d34562103/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/cadf0b48-60a8-4d84-beef-cccbe069ab86.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "30d94a8d-59b3-40fa-ab8b-abbccee9739f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/30d94a8d-59b3-40fa-ab8b-abbccee9739f/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/30d94a8d-59b3-40fa-ab8b-abbccee9739f/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/cadf0b48-60a8-4d84-beef-cccbe069ab86.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "12561402-c95c-4dd5-8d2c-660f38b3fb42",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/12561402-c95c-4dd5-8d2c-660f38b3fb42/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/12561402-c95c-4dd5-8d2c-660f38b3fb42/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/cadf0b48-60a8-4d84-beef-cccbe069ab86.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "5b6996b0-1abf-4802-bf94-9f8644c2f7a5",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5b6996b0-1abf-4802-bf94-9f8644c2f7a5/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5b6996b0-1abf-4802-bf94-9f8644c2f7a5/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/cadf0b48-60a8-4d84-beef-cccbe069ab86.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "f9d058a4-fe9e-4a8e-9a4c-d7add4f3a237",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f9d058a4-fe9e-4a8e-9a4c-d7add4f3a237/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f9d058a4-fe9e-4a8e-9a4c-d7add4f3a237/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/cadf0b48-60a8-4d84-beef-cccbe069ab86.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Blue": "https://m.media-amazon.com/images/I/41YuTDFCaGL._AC_SR38,50_.jpg",
    "Apricot": "https://m.media-amazon.com/images/I/41xkvprR1mL._AC_SR38,50_.jpg",
    "Light Green": "https://m.media-amazon.com/images/I/414sUkUX8xL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/41Zw7VYFzbL._AC_SR38,50_.jpg",
    "Brunt Orange": "https://m.media-amazon.com/images/I/41aRHK6JelL._AC_SR38,50_.jpg",
    "Light Blue": "https://m.media-amazon.com/images/I/41XPu+vzVXL._AC_SR38,50_.jpg",
    "Rose Red": "https://m.media-amazon.com/images/I/41mVIWe-MjL._AC_SR38,50_.jpg",
    "Lake Blue": "https://m.media-amazon.com/images/I/41rjk9O2PsL._AC_SR38,50_.jpg",
    "Navy": "https://m.media-amazon.com/images/I/412yCLjaX0L._AC_SR38,50_.jpg",
    "Wine Red": "https://m.media-amazon.com/images/I/41CjuYXjaJL._AC_SR38,50_.jpg",
    "Pink": "https://m.media-amazon.com/images/I/414hd09m-gL._AC_SR38,50_.jpg",
    "White": "https://m.media-amazon.com/images/I/41RS9D3u-8L._AC_SR38,50_.jpg",
    "Purple": "https://m.media-amazon.com/images/I/41q5uecaV6L._AC_SR38,50_.jpg",
    "Green": "https://m.media-amazon.com/images/I/41Ou+agFSJL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Blue": "71k8XxHE2rL",
    "Apricot": "71WCaX7BPCL",
    "Light Green": "81+uN8ztgjL",
    "Black": "71fftOJjItL",
    "Brunt Orange": "81GyNzLf4QL",
    "Light Blue": "71FfJk4jJQL",
    "Rose Red": "7128289UCoL",
    "Lake Blue": "71IB725c-PL",
    "Navy": "713oPK1kBTL",
    "Wine Red": "717itY4-NHL",
    "Pink": "81kt+PKX-tL",
    "White": "71wSfGMIyHL",
    "Purple": "71-7MjYODeL",
    "Green": "71ulyJ8rjeL"
  },
  "color_images": {
    "Blue": [
      "https://m.media-amazon.com/images/I/71k8XxHE2rL._SL1500_.jpg"
    ],
    "Apricot": [
      "https://m.media-amazon.com/images/I/71WCaX7BPCL._SL1500_.jpg"
    ],
    "Light Green": [
      "https://m.media-amazon.com/images/I/81+uN8ztgjL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/71fftOJjItL._SL1500_.jpg"
    ],
    "Brunt Orange": [
      "https://m.media-amazon.com/images/I/81GyNzLf4QL._SL1500_.jpg"
    ],
    "Light Blue": [
      "https://m.media-amazon.com/images/I/71FfJk4jJQL._SL1500_.jpg"
    ],
    "Rose Red": [
      "https://m.media-amazon.com/images/I/7128289UCoL._SL1500_.jpg"
    ],
    "Lake Blue": [
      "https://m.media-amazon.com/images/I/71IB725c-PL._SL1500_.jpg"
    ],
    "Navy": [
      "https://m.media-amazon.com/images/I/713oPK1kBTL._SL1500_.jpg"
    ],
    "Wine Red": [
      "https://m.media-amazon.com/images/I/717itY4-NHL._SL1500_.jpg"
    ],
    "Pink": [
      "https://m.media-amazon.com/images/I/81kt+PKX-tL._SL1500_.jpg"
    ],
    "White": [
      "https://m.media-amazon.com/images/I/71wSfGMIyHL._SL1500_.jpg"
    ],
    "Purple": [
      "https://m.media-amazon.com/images/I/71-7MjYODeL._SL1500_.jpg"
    ],
    "Green": [
      "https://m.media-amazon.com/images/I/71ulyJ8rjeL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress-cocktail-bodycon",
      "title": "Womens Dress Cocktail Bodycon",
      "price": 47.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61NfEwzl3xL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-one-shoulder-maxi-formal",
      "title": "Womens Maxi Dress Evening One Shoulder Maxi Formal",
      "price": 69.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/5150AIQL4eL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail",
      "title": "Womens Dress Cocktail",
      "price": 103.54,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61JApwce25L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-formal-bodycon-evening-sleeveless",
      "title": "Womens Maxi Dress Maxi Formal Bodycon Evening Sleeveless",
      "price": 61.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61s8qg6u1VL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 158.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71PmRANW40L._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress-bodycon-split-ruched-off-shoulder",
      "title": "Womens Dress Bodycon Split Ruched Off Shoulder",
      "price": 38.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/41JjYcPgcpL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 95.61,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Work",
      "images": [
        "https://m.media-amazon.com/images/I/71hVgSIB1jL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 138.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51PZNrlyY9L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-split-evening-formal",
      "title": "Womens Maxi Dress Split Evening Formal",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51BZ1BqPx8L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 65.97,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/81wr8PDg55L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-v-neck",
      "title": "Womens Dress V Neck",
      "price": 82.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/710bSTpZ9hL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 278.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/91YXeyW506L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening-long-sleeve",
      "title": "Womens Maxi Dress Formal Evening Long Sleeve",
      "price": 87.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61nnk+flvaL._SL1500_.jpg"
      ]
    }
  ]
}