{
  "id": "womens-dress-cocktail",
  "handle": "womens-dress-cocktail",
  "sku": "JC2968",
  "asin": "B0BPM6H547",
  "title": "Womens Dress Cocktail",
  "title_original": "Women's Sequin Cocktail Dresses 1920s Flapper Dress Gatsby Fringe Mini Dresses Feather Prom Party Dress",
  "brand": "Visit the meilun Store",
  "price": 80.49,
  "social_proof": {
    "bought_past_month": 83,
    "text": "83+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/71eKfuRshVL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71QLxtUp88L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71fCqYYl6UL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/713btYEY+3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/7156tPkZbDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71KOZiK0TTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71dgZibWrWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61hx4Ya57fL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71XgBF-jyaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71cPXFxd6uL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61LhmQ1UIUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71XhDaBnFZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/615ULi+H-0L._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/71eKfuRshVL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71QLxtUp88L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71fCqYYl6UL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/713btYEY+3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/7156tPkZbDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71KOZiK0TTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71dgZibWrWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61hx4Ya57fL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71XgBF-jyaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71cPXFxd6uL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61LhmQ1UIUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71XhDaBnFZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/615ULi+H-0L._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ November 14, 2023",
    "ASIN ‏": "‎ B0CN9CVFSZ",
    "Best Sellers Rank": "#32,431 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #66 in Women's Cocktail Dresses",
    "Customer Reviews": "3.8 3.8 out of 5 stars (178)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "A-white",
      "A-black",
      "A-green",
      "A-navy",
      "A-beige",
      "A-pink",
      "A-red"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 3.8,
    "count": 178,
    "customers_say": "Customers find the dress beautiful and worth the money, particularly appreciating it for Gatsby parties. The fit and quality receive mixed feedback - while some say it's true to size and well-made, others find it a bit big and note quality issues. Moreover, the feathers fall off, and customers have mixed opinions about how flattering the dress is. Additionally, some customers report fabric irritation, with one mentioning it caused a rash. Generated from the text of customer reviews Select to learn more Look (35) Fun (7) Value for money (5) Fit (24) Quality (19) Flattering (6) Feathers (7) Fabric irritation (5) 35 customers mention look, 32 positive, 3 negative 35 customers mention \"Look\" 32 positive 3 negative Customers find the dress beautiful and amazing, with one noting it looks better in person than in pictures. \" ...It's such a nice dress , but a sheath dress can be hard to get the best size in when you have hips and curves. \" Read more \" Pretty dress . Ordered a couple colors to choose from in case colors weren’t the same in person.... \" Read more \" It’s a Beautiful dress . It’s a little heavy and not what I really wanted. Maybe good for a rolling 20’s or even new years. \" Read more \" this dress is absolutely beautiful ! I have order several items from this seller and I haven't been disappointed yet.... \" Read more 7 customers mention fun, 7 positive, 0 negative 7 customers mention \"Fun\" 7 positive 0 negative Customers find the dress perfect for fun occasions, with one mentioning it's ideal for a Gatsby party. \" ...Fab and fun dress . Straps adjust. \" Read more \" The dress fit well. Was the perfect dress for my occasion . Under the arms were a little scratchy after some time wearing and dancing in it.... \" Read more \" The dress is perfect. Good quality. For well . Lightweight. Highly recommend \" Read more \" ...This soft creamy pink color cocktail dress is sexy, fun and flirty, comfortable and perfect.... \" Read more 5 customers mention value for money, 4 positive, 1 negative 5 customers mention \"Value for money\" 4 positive 1 negative Customers find the dress worth the money. \" ...The fit is true to size. A little stretch goes a long way. Great value ! \" Read more \" Love this set. Can't wait to wear it. Worth the money . \" Read more \" LOVE. Looks even better on than in the pic. And fantastic price is icing on the cake \" Read more \" ...I can’t even return it now because it’s damaged. Total waste of money . \" Read more 24 customers mention fit, 15 positive, 9 negative 24 customers mention \"Fit\" 15 positive 9 negative Customers have mixed opinions about the dress's fit, with some finding it true to size while others say it runs a bit big. \" This dress was adorable. We ordered a size too big. It runs true to size (i.e. a small would be a US size 4/6) \" Read more \" ...It was little big on me , per usual..it's hard to find anything that fits without alterations when you're 5 feet tall & weigh 93 pounds.... \" Read more \" ...Originally ordered Med, but sent it back for a small and fit perfectly . I am 5'5 120#.... \" Read more \" The dress fits perfect , very nice material. One thing is that the buttom rhiestones are too high .... \" Read more 19 customers mention quality, 13 positive, 6 negative 19 customers mention \"Quality\" 13 positive 6 negative Customers have mixed opinions about the dress's quality, with some finding it well-made and loving it, while others describe it as awful. \" GREAT DRESS . High quality and super lovely. That said, your underarms will be stinging for days after all the rubbing.... \" Read more \" Absolutely love the dress ! I got the medium. However the boobage part of the dress was big for me by a half cup size.... \" Read more \" There are multiple tears in this dress. It’s not a cheap dress either. Now I do not have a dress for my event this weekend. I’m very upset \" Read more \" Absolutely stunning thank you. Well made love the bead work! Would definitely recommend this dress if you are looking for something authentic \" Read more 6 customers mention flattering, 4 positive, 2 negative 6 customers mention \"Flattering\" 4 positive 2 negative Customers have mixed opinions about how flattering the dress is. \" ...This dress hugged all the right places and you don't need a bra! I am so happy with this dress!!!! I weight 130lbs. 32DDD, waist 26, Hip 37 \" Read more \" The dress itself was great! I only rated it a 3/5 because the seems under the arms flip and the dress ended up irritating under my arms.... \" Read more \" ...The material feels like a high quality product this flattering piece looks like a million $$ on my mom of five body. The fit is true to size.... \" Read more \" Cute, comfy, flirty, and flattering ... \" Read more 7 customers mention feathers, 0 positive, 7 negative 7 customers mention \"Feathers\" 0 positive 7 negative Customers report issues with the feathers falling off the dress. \" As soon as I pulled this dress up half of the feathers fell off . I can’t even return it now because it’s damaged. Total waste of money. \" Read more \" ...I ordered a 2nd dress; it also came used and feather falling off dress . I'm assuming this dress gets return a lot. Returning and not ordering again. \" Read more \" The bottom was covered with feathers which wasn't my concern. When I put the dress all feathers start falling on the floor.it was horrible.... \" Read more \" ...for my birthday when I just put on me fits nice but all the feathers goes down I just use it for the first time… \" Read more 5 customers mention fabric irritation, 0 positive, 5 negative 5 customers mention \"Fabric irritation\" 0 positive 5 negative Customers report issues with the dress fabric, including itchy feathers, scratchy arms, and discomfort under the armpits. \" ...Was the perfect dress for my occasion. Under the arms were a little scratchy after some time wearing and dancing in it.... \" Read more \" Cute dress, the feathers were itchy , recommend shorts or spanks under it \" Read more \" ...5’1”, 115 lb fit the SM well. Be aware the sequins rub on arm a little if worn HOURS- a little red, tender, not awful. Fab and fun dress.... \" Read more \" ...a 3/5 because the seems under the arms flip and the dress ended up irritating under my arms . Outside of that, it was great! \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Darling little cocktail dress.",
        "body": "Who says a girl’s little dress must be black? This soft creamy pink color cocktail dress is sexy, fun and flirty, comfortable and perfect. The material feels like a high quality product this flattering piece looks like a million $$ on my mom of five body. The fit is true to size. A little stretch goes a long way. Great value! Read more",
        "author": "Rachel E Stewart",
        "rating": 5.0,
        "date": "November 25, 2024",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Shiny and beautiful dress.",
        "body": "It’s a Beautiful dress . It’s a little heavy and not what I really wanted. Maybe good for a rolling 20’s or even new years. Read more",
        "author": "Susan Perez",
        "rating": 5.0,
        "date": "December 1, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "2.0 out of 5 stars Received worn dress 2 times",
        "body": "This dress is really cute, but it does run small. I am only giving 2 stars as the dress that I received arrived already used and reeked of someone's perfume and arrived with no tags. Returning and ordering a NEW dress. I ordered a 2nd dress; it also came used and feather falling off dress. I'm assuming this dress gets return a lot. Returning and not ordering again. Read more",
        "author": "Brittney McKenzie",
        "rating": 2.0,
        "date": "October 6, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "1.0 out of 5 stars DO NOT BUY!!!!",
        "body": "The feathers are too tight on the hips. I returned this dress and it has been 3 months and I am still waiting for my refund of closer to $100. At this point I don't think I will ever get it. DO NOT buy this dress unless you are positive that you will love it because you won't receive your refund. Read more",
        "author": "Customer",
        "rating": 1.0,
        "date": "June 14, 2024",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Super cute and perfect for my event.",
        "body": "The dress fit well. Was the perfect dress for my occasion. Under the arms were a little scratchy after some time wearing and dancing in it. I wore a long sleeve cover and it solved that issue. Read more",
        "author": "Misti Baldo",
        "rating": 5.0,
        "date": "September 14, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/815BBRBR3eL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "3.0 out of 5 stars Great dress, but needs help under the arms!",
        "body": "The dress itself was great! I only rated it a 3/5 because the seems under the arms flip and the dress ended up irritating under my arms. Outside of that, it was great! Read more",
        "author": "DS",
        "rating": 3.0,
        "date": "November 18, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/81FxRZb5R+L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "4.0 out of 5 stars Great dress!",
        "body": "GREAT DRESS. High quality and super lovely. That said, your underarms will be stinging for days after all the rubbing. I am a small and I bought a small and it fit perfectly so it runs true to size. Read more",
        "author": "jjessjjones",
        "rating": 4.0,
        "date": "October 29, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars I LOVE this dress!",
        "body": "One of my favorite dresses. I bought for NYE. Yes, it sheds feathers, but not a significant amount. You'll still have a full dress by the end of the night lol. As for the fit, I'm curvy on the bottom and slim up top, so the dress fit my hips but was kind of large for my bust size and shoulders. I had to make the straps about as tight as possible, but it still looked big up top and didn't make my boobs look all that great. I have muscular shoulders so looking like I have no boobs didn't help with the overall aesthetic. So, I used boob tape to give me more of a bust; I still wore a strapless bra, but I put the tape underneath going left to right, to push my boobs inward. So for the curvier gals, I'd highly recommend that you go with the size that works best for your hips and butt, and just make the top work. It's such a nice dress, but a sheath dress can be hard to get the best size in when you have hips and curves. Read more",
        "author": "Amanie M.",
        "rating": 5.0,
        "date": "February 5, 2024",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71SjGoav+wL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/713RzA4zhIL._SY88._SL1500_.jpg"
        ]
      }
    ]
  },
  "short_description": "Womens Dress Cocktail is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.",
  "about_this_item": "Womens Dress Cocktail is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.",
  "long_description": "Womens Dress Cocktail is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: A-white, A-black, A-green, A-navy, A-beige, A-pink, A-red. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Dress Cocktail is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: A-white, A-black, A-green, A-navy, A-beige, A-pink, A-red. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "dab039d3-c908-4d1f-a406-f6748f57f967",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/dab039d3-c908-4d1f-a406-f6748f57f967/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/dab039d3-c908-4d1f-a406-f6748f57f967/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "3509e2b0-a01e-4470-a696-e915814ea3d1",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3509e2b0-a01e-4470-a696-e915814ea3d1/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3509e2b0-a01e-4470-a696-e915814ea3d1/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "0e5ac2f4-afbe-427c-a2fb-3e091954440b",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0e5ac2f4-afbe-427c-a2fb-3e091954440b/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0e5ac2f4-afbe-427c-a2fb-3e091954440b/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "86301f6a-568d-4ab9-ba71-ce1a4e94559d",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/86301f6a-568d-4ab9-ba71-ce1a4e94559d/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/86301f6a-568d-4ab9-ba71-ce1a4e94559d/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "a4b898bc-6ad6-42f2-b736-da049d354b33",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a4b898bc-6ad6-42f2-b736-da049d354b33/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a4b898bc-6ad6-42f2-b736-da049d354b33/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "8a1e1395-0c54-4a04-8586-ab098db9c1a2",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8a1e1395-0c54-4a04-8586-ab098db9c1a2/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8a1e1395-0c54-4a04-8586-ab098db9c1a2/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "a0a0b2dd-71c4-46ae-b3a7-3bedde6c7d1c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a0a0b2dd-71c4-46ae-b3a7-3bedde6c7d1c/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a0a0b2dd-71c4-46ae-b3a7-3bedde6c7d1c/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "49630570-ac7e-45d5-ae5a-48386bf1d277",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/49630570-ac7e-45d5-ae5a-48386bf1d277/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/49630570-ac7e-45d5-ae5a-48386bf1d277/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "A-white": "https://m.media-amazon.com/images/I/41QSUyzvMWL._AC_US40_.jpg",
    "A-black": "https://m.media-amazon.com/images/I/41vtfHdOOqL._AC_SR38,50_.jpg",
    "A-green": "https://m.media-amazon.com/images/I/41qZ3UEuRmL._AC_SR38,50_.jpg",
    "A-navy": "https://m.media-amazon.com/images/I/41r5o9hgWDL._AC_SR38,50_.jpg",
    "A-beige": "https://m.media-amazon.com/images/I/419QlnrqyKL._AC_SR38,50_.jpg",
    "A-pink": "https://m.media-amazon.com/images/I/41zMIFqdNaL._AC_SR38,50_.jpg",
    "A-red": "https://m.media-amazon.com/images/I/41fvpBIQKFL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "A-white": "61hx4Ya57fL",
    "A-black": "71XgBF-jyaL",
    "A-green": "71cPXFxd6uL",
    "A-navy": "61LhmQ1UIUL",
    "A-beige": "71eKfuRshVL",
    "A-pink": "71XhDaBnFZL",
    "A-red": "615ULi+H-0L"
  },
  "color_images": {
    "A-white": [
      "https://m.media-amazon.com/images/I/61hx4Ya57fL._SL1500_.jpg"
    ],
    "A-black": [
      "https://m.media-amazon.com/images/I/71XgBF-jyaL._SL1500_.jpg"
    ],
    "A-green": [
      "https://m.media-amazon.com/images/I/71cPXFxd6uL._SL1500_.jpg"
    ],
    "A-navy": [
      "https://m.media-amazon.com/images/I/61LhmQ1UIUL._SL1500_.jpg"
    ],
    "A-beige": [
      "https://m.media-amazon.com/images/I/71eKfuRshVL._SL1500_.jpg"
    ],
    "A-pink": [
      "https://m.media-amazon.com/images/I/71XhDaBnFZL._SL1500_.jpg"
    ],
    "A-red": [
      "https://m.media-amazon.com/images/I/615ULi+H-0L._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-ruched-long-sleeve-off-shoulder",
      "title": "Womens Maxi Dress Ruched Long Sleeve Off Shoulder",
      "price": 65.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/610S-XUGzwL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-sleeveless-v-neck-cocktail-maxi-bodycon",
      "title": "Womens Maxi Dress Sleeveless V Neck Cocktail Maxi Bodycon",
      "price": 44.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51eoMzKwaqL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-formal-cocktail",
      "title": "Womens Maxi Dress Long Sleeve Formal Cocktail",
      "price": 45.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/610egGe2LwL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-v-neck-ruched",
      "title": "Womens Maxi Dress Long Sleeve V Neck Ruched",
      "price": 41.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/41nKZb3yrHL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 33.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61W5l+uioHL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-evening",
      "title": "Womens Maxi Dress Evening",
      "price": 72.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61ifQNM1WAL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening",
      "title": "Womens Maxi Dress Evening",
      "price": 66.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61jhboT-KdL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-bodycon-ruched-off-shoulder",
      "title": "Womens Maxi Dress Cocktail Bodycon Ruched Off Shoulder",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/51pNtXYlEDL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 70.57,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/512WgWMyYLL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-one-shoulder-formal-mermaid",
      "title": "Womens Maxi Dress Evening One Shoulder Formal Mermaid",
      "price": 69.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/613xHpbpN5L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-off-shoulder",
      "title": "Womens Dress Off Shoulder",
      "price": 93.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71+G9PIEq1L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-short-sleeve",
      "title": "Womens Dress Short Sleeve",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61Gm5oBtjDL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-bodycon-cocktail",
      "title": "Womens Dress Bodycon Cocktail",
      "price": 55.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61k-qoz2M6L._SL1500_.jpg"
      ]
    }
  ]
}