{
  "id": "womens-dress-cocktail",
  "handle": "womens-dress-cocktail",
  "sku": "JC2498",
  "asin": "B0BQ6XMD1V",
  "title": "Womens Dress Cocktail",
  "title_original": "Sequin Cocktail Dresses Flapper Dresses 1920s Gatsby with All-Over Fringe Mini Dresses Prom Party Dress",
  "brand": "Visit the meilun Store",
  "price": 72.49,
  "social_proof": {
    "bought_past_month": 1079,
    "text": "1079+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/81b1YwMqNbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/A1om+ZzeNfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/814Elb8yfdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/717dEnXCurL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/811awsXXQgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71U+7f4eMQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81S7eHKXnBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71y0r3mlTaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/811hiYKHXwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81YjlaJHqFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/8164vVnZMwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/715VU1r234L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81FvNE-DwNL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81FRh4Kff8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/816120Ks5aL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81B21m9kfDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81Nh+oprwRL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81WyZypcBRL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/717LVdqj+LL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81RlST1swUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81CjJA-vO-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81uDLu8yzrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71sTjOhJsfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81NQQ9QAU-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/910-LCW8d3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/8168S+-ljhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81uXehpbiZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71pP61A74ML._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/81b1YwMqNbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/A1om+ZzeNfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/814Elb8yfdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/717dEnXCurL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/811awsXXQgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71U+7f4eMQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81S7eHKXnBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71y0r3mlTaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/811hiYKHXwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81YjlaJHqFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/8164vVnZMwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/715VU1r234L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81FvNE-DwNL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81FRh4Kff8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/816120Ks5aL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81B21m9kfDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81Nh+oprwRL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81WyZypcBRL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/717LVdqj+LL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81RlST1swUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81CjJA-vO-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81uDLu8yzrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71sTjOhJsfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81NQQ9QAU-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/910-LCW8d3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/8168S+-ljhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81uXehpbiZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71pP61A74ML._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ May 23, 2024",
    "ASIN ‏": "‎ B0D4Z45RDK",
    "Best Sellers Rank": "#74,362 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #2,108 in Women's Dresses",
    "Customer Reviews": "3.6 3.6 out of 5 stars (199)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "B-gold",
      "B-white2",
      "B-black",
      "B-silvergrey",
      "B-purple",
      "B-green",
      "B-pink"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 3.6,
    "count": 199,
    "customers_say": "Customers find the dress sparkles as they walk and appreciate its well-made construction with nice sequin work. They describe it as super fun to wear, though the fit receives mixed feedback - while some say it fits great, others note it runs like an XXL. The dress is uncomfortable on the skin and runs large in the breast area, with customers reporting their arms get scratched up during wear. While some find it worth the money, others feel it's too cheap for its price point. Generated from the text of customer reviews Select to learn more Sparkle (30) Quality (27) Fun to wear (8) Fit (27) Value for money (6) Comfort (18) Size (17) Scratch resistance (9) 30 customers mention sparkle, 26 positive, 4 negative 30 customers mention \"Sparkle\" 26 positive 4 negative Customers appreciate the dress's sparkle, noting that it looks very pretty and glitters as they move. \" Beautiful and fun to wear. The bust is very lose fitting so consider sizing down.... \" Read more \" It would have been a beautiful dress if it weren’t see through. It was also a bit shorter than I would have liked. I ended up returning the dress.... \" Read more \" Fits true to size, definitely a darker color than I thought but cute . I feel like I got what I paid for. \" Read more \" ...I don't think a different size would've remedied this problem. It was super cute and worth it for once a year usage. \" Read more 27 customers mention quality, 22 positive, 5 negative 27 customers mention \"Quality\" 22 positive 5 negative Customers praise the dress's construction and sequin work, describing it as beautiful and well-made. \" This is a great dress . Nice quality in the sequin work, lining was smooth and comfortable and it fit great.... \" Read more \" Loved the dress ! Wore it for Taylor swift and it was perfect. I ordered a small (5’4, 125) and had to keep pulling up the top.... \" Read more \" ...It’s well made and didn’t feel like a costume . An Absolute keeper... \" Read more \" Love this dress ! Bought it for a concert and it did not disappoint. Fit exactly as expected. Little stretch so it’s super comfortable.... \" Read more 8 customers mention fun to wear, 8 positive, 0 negative 8 customers mention \"Fun to wear\" 8 positive 0 negative Customers find the dress super fun to wear, with one mentioning that the little tassels make it enjoyable to spin in. \" ...Super flattering, fun dress . Generous in size. \" Read more \" Beautiful and fun to wear . The bust is very lose fitting so consider sizing down.... \" Read more \" ...It left scratch marks under my armpits. It was fun to spin in . \" Read more \" ...Overall it was a fun dress to wear for the night . \" Read more 27 customers mention fit, 16 positive, 11 negative 27 customers mention \"Fit\" 16 positive 11 negative Customers have mixed experiences with how the dress fits, with some saying it's great while others report it runs like an XXL and the top is too big. \" Love the color and the sparkle! I’m 5’9” and 167lbs, the large fit perfectly . A bit short, but not a problem for me.... \" Read more \" I'm 5'10 and 200lbs - This dress didn't even cover my butt ! It fit snugly up top, baggy in the middle and super tight at the bottom.... \" Read more \" Fits true to size , definitely a darker color than I thought but cute. I feel like I got what I paid for. \" Read more \" I wanted to love this dress so badly but it just fit horribly .... \" Read more 6 customers mention value for money, 3 positive, 3 negative 6 customers mention \"Value for money\" 3 positive 3 negative Customers have mixed opinions about the dress's value for money, with some finding it worth the price while others note it's super cheap for $70. \" ... Great value ! Highly recommend! \" Read more \" This was a cute dress, but definitely overpriced for the quality .... \" Read more \" ...I think it’s definitely worth the money because it is made so well and the sequins don’t fall off and there is no residue anywhere.... \" Read more \" ...It seems like it was cheaply made, and not worth $80 . \" Read more 18 customers mention comfort, 4 positive, 14 negative 18 customers mention \"Comfort\" 4 positive 14 negative Customers find the dress uncomfortable, describing it as itchy and scratchy. \" ...Iy was itchy and very uncomfortable. It left scratch marks under my armpits. It was fun to spin in. \" Read more \" Super cute but uncomfortable ... \" Read more \" ... Very itchy and kinda distracting. \" Read more \" ...Nice quality in the sequin work, lining was smooth and comfortable and it fit great.... \" Read more 17 customers mention size, 1 positive, 16 negative 17 customers mention \"Size\" 1 positive 16 negative Customers report that the dress runs large, particularly in the breast area and with weird proportions. \" Really pretty dress and nicely made but the sizing is way off . Ordered an L and it fits like an XXL. I would order at least one size down; maybe two \" Read more \" ...fringe are super cute, but it's just a poorly made dress with weird proportions . For reference, I'm 5'2\" 125lbs and ordered the XS.... \" Read more \" Even though the midsection fit perfectly, the bust was very large and the straps slide down.... \" Read more \" Looked horrendous in person We HAD to return Runs big too \" Read more 9 customers mention scratch resistance, 1 positive, 8 negative 9 customers mention \"Scratch resistance\" 1 positive 8 negative Customers report issues with the dress's sequins digging into their skin, particularly around the arms. \" ...My only issue is the sequins scratched the inside of my arm on one side and it was very annoying. Maybe my dress was a one off.... \" Read more \" ...I’m only giving it three stars because of how much the sequins scratch my arms when I wear it. Very itchy and kinda distracting. \" Read more \" ...reason I’m not giving it a full 5 stars is because of the sequins around the arms area , they had them pointed up and was stabbing it into my armpits... \" Read more \" ...It was also very uncomfortable under the arms as the sequins tend to dig into your skin . It seems like it was cheaply made, and not worth $80. \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars BEAUTIFUL, Comfortable, Flattering",
        "body": "I wore this to the Taylor Swift Eras tour and got SO many compliments! It was a last minute purchase that exceeded all expectations in quality, comfort, beauty and it was super flattering! I wore it with a nude colored bra, but if you want to wear a bra I'd suggest one with clear straps. I got away with it using my hair to cover it, and it really didn't show much anyways but the straps are thin (like a thicker version os a spaghetti strap). So just a suggestion. The little tassels on the dress are so much fun when you walk or dance. I felt like a flapper from the 20s. Taylor Swift's version is really close to this one, so it was perfect, but I'd wear it even for a different type of party or event. Great value! Highly recommend! Read more",
        "author": "Melanie",
        "rating": 5.0,
        "date": "December 17, 2023",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71ghFIp3RCL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71CfPLFCgLL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "1.0 out of 5 stars Abrasive; it looks better on a hanger",
        "body": "It was uncomfortable to wear because of the abrasive material. Read more",
        "author": "miso soup",
        "rating": 1.0,
        "date": "January 18, 2024",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars The life of the party",
        "body": "This was an excellent dress.It moves well and fits well and everyone loved it Read more",
        "author": "Tenesia",
        "rating": 5.0,
        "date": "September 16, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars BEAUTIFUL DRESS",
        "body": "I ordered this dress for a party & was very excited to try it on once I received it so quickly. The quality is nice but the sizing is off. I ordered the recommended size (L), but it was quite big. I think a M or maybe even a S would fit. I'm returning & the only reason I'm not exchanging it is because of the fringe in the shoulder area. It's a bit itchy & uncomfortable on the skin. Read more",
        "author": "Customer",
        "rating": 4.0,
        "date": "August 25, 2024",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Not a nadine merabi dupe, picture looks waaaaay fuller than in person; color beautiful.",
        "body": "So I have been stalking the Nadine Merabi beaded fringe dresses and thought I found a Dupe! THe style is comparable but the fringe is a thin strand of sequins and lays thin and flat when its not moving. the picture looks great for motion but it looks cheap when you are standing still because its not full. Straps were a little wide/ top was a bit big and fell off shoulders, rest of fit was perfect. Color gorgeous. IF I needed a one time costume on the fly that was inexpensive this would do it. But I wanted a cocktail dress for date night- this didn't fit that. And ok dress dress but not for what I was wanting or the way the picture portrays it. Shoulda known when it's a picture from an in motion shot! Read more",
        "author": "redsmith",
        "rating": 3.0,
        "date": "December 7, 2023",
        "verified": false,
        "images": []
      },
      {
        "title": "2.0 out of 5 stars Beautiful dress, but it's poorly made and has weird proportions!",
        "body": "I wanted to love this dress so badly but it just fit horribly. I got it to wear to a concert and knew I'd be miserable the whole time because the straps were too long and the chest area was too big. The lining is not attached to the outer fringe sheath and the weight of the fringe pulled on the neckline, causing the liner to stick out. I tried pinning the straps to see if it helped, but I still had to adjust the neckline everytime I moved. The color of the dress (purple), sparkles, and fringe are super cute, but it's just a poorly made dress with weird proportions. For reference, I'm 5'2\" 125lbs and ordered the XS. If you're a petite person with a large chest, this would be perfect for you! Read more",
        "author": "Elizabeth Espinosa",
        "rating": 2.0,
        "date": "March 2, 2024",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Sizing is way off",
        "body": "Really pretty dress and nicely made but the sizing is way off. Ordered an L and it fits like an XXL. I would order at least one size down; maybe two Read more",
        "author": "Kimmieflies",
        "rating": 5.0,
        "date": "August 14, 2024",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars size down",
        "body": "Bought this for Halloween, tried it on and absolutely loved it! Size down with this product if you are 5'2\" and weight 120lbs. It is not as grey as the picture suggests, more silver than anything. Read more",
        "author": "Haley",
        "rating": 5.0,
        "date": "October 12, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Dress Cocktail is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.",
  "about_this_item": "Womens Dress Cocktail is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.",
  "long_description": "Womens Dress Cocktail is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: B-gold, B-white2, B-black, B-silvergrey, B-purple, B-green, B-pink. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Dress Cocktail is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: B-gold, B-white2, B-black, B-silvergrey, B-purple, B-green, B-pink. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "8494737e-e1fc-4e04-ba2f-7e67c18be018",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8494737e-e1fc-4e04-ba2f-7e67c18be018/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8494737e-e1fc-4e04-ba2f-7e67c18be018/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "1adc7cc1-584d-4647-99f7-8c8faa75b835",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1adc7cc1-584d-4647-99f7-8c8faa75b835/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1adc7cc1-584d-4647-99f7-8c8faa75b835/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "B-gold": "https://m.media-amazon.com/images/I/515ajc-AvXL._AC_SR38,50_.jpg",
    "B-white2": "https://m.media-amazon.com/images/I/41xKix4P8BL._AC_SR38,50_.jpg",
    "B-black": "https://m.media-amazon.com/images/I/51lRAxYKqSL._AC_SR38,50_.jpg",
    "B-silvergrey": "https://m.media-amazon.com/images/I/51lUhhqhJXL._AC_SR38,50_.jpg",
    "B-purple": "https://m.media-amazon.com/images/I/51Z+F+xYk6L._AC_SR38,50_.jpg",
    "B-green": "https://m.media-amazon.com/images/I/51htq6n4qiL._AC_SR38,50_.jpg",
    "B-pink": "https://m.media-amazon.com/images/I/51UQZsw15vL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "B-gold": "81b1YwMqNbL",
    "B-white2": "71y0r3mlTaL",
    "B-black": "81YjlaJHqFL",
    "B-silvergrey": "81FRh4Kff8L",
    "B-purple": "81B21m9kfDL",
    "B-green": "81RlST1swUL",
    "B-pink": "81NQQ9QAU-L"
  },
  "color_images": {
    "B-gold": [
      "https://m.media-amazon.com/images/I/81b1YwMqNbL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/A1om+ZzeNfL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/814Elb8yfdL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/717dEnXCurL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/811awsXXQgL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71U+7f4eMQL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81S7eHKXnBL._SL1500_.jpg"
    ],
    "B-white2": [
      "https://m.media-amazon.com/images/I/71y0r3mlTaL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/811hiYKHXwL._SL1500_.jpg"
    ],
    "B-black": [
      "https://m.media-amazon.com/images/I/81YjlaJHqFL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/8164vVnZMwL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/715VU1r234L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81FvNE-DwNL._SL1500_.jpg"
    ],
    "B-silvergrey": [
      "https://m.media-amazon.com/images/I/81FRh4Kff8L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/816120Ks5aL._SL1500_.jpg"
    ],
    "B-purple": [
      "https://m.media-amazon.com/images/I/81B21m9kfDL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81Nh+oprwRL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81WyZypcBRL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/717LVdqj+LL._SL1500_.jpg"
    ],
    "B-green": [
      "https://m.media-amazon.com/images/I/81RlST1swUL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81CjJA-vO-L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81uDLu8yzrL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71sTjOhJsfL._SL1500_.jpg"
    ],
    "B-pink": [
      "https://m.media-amazon.com/images/I/81NQQ9QAU-L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/910-LCW8d3L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/8168S+-ljhL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81uXehpbiZL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71pP61A74ML._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-ruched-long-sleeve-off-shoulder",
      "title": "Womens Maxi Dress Ruched Long Sleeve Off Shoulder",
      "price": 65.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/610S-XUGzwL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-sleeveless-v-neck-cocktail-maxi-bodycon",
      "title": "Womens Maxi Dress Sleeveless V Neck Cocktail Maxi Bodycon",
      "price": 44.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51eoMzKwaqL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-formal-cocktail",
      "title": "Womens Maxi Dress Long Sleeve Formal Cocktail",
      "price": 45.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/610egGe2LwL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-v-neck-ruched",
      "title": "Womens Maxi Dress Long Sleeve V Neck Ruched",
      "price": 41.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/41nKZb3yrHL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 33.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61W5l+uioHL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-evening",
      "title": "Womens Maxi Dress Evening",
      "price": 72.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61ifQNM1WAL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening",
      "title": "Womens Maxi Dress Evening",
      "price": 66.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61jhboT-KdL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-bodycon-ruched-off-shoulder",
      "title": "Womens Maxi Dress Cocktail Bodycon Ruched Off Shoulder",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/51pNtXYlEDL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 70.57,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/512WgWMyYLL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-one-shoulder-formal-mermaid",
      "title": "Womens Maxi Dress Evening One Shoulder Formal Mermaid",
      "price": 69.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/613xHpbpN5L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-off-shoulder",
      "title": "Womens Dress Off Shoulder",
      "price": 93.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71+G9PIEq1L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-short-sleeve",
      "title": "Womens Dress Short Sleeve",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61Gm5oBtjDL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-bodycon-cocktail",
      "title": "Womens Dress Bodycon Cocktail",
      "price": 55.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61k-qoz2M6L._SL1500_.jpg"
      ]
    }
  ]
}