{
  "id": "womens-maxi-dress-long-sleeve",
  "handle": "womens-maxi-dress-long-sleeve",
  "sku": "JC1930",
  "asin": "B0BRSCPX9X",
  "title": "Womens Maxi Dress Long Sleeve",
  "title_original": "meilun Deep V Dress with Drawstring Long Sleeve Sequin Dress for Women Long Gown",
  "brand": "Visit the meilun Store",
  "price": 88.49,
  "social_proof": {
    "bought_past_month": 109,
    "text": "109+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/61imYyqh0TL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71SmQafsLhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81Vx6K5hCdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/714hetNnAPL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71RhpdHwCwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/8149gUEVt8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61jXeJZTzUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51Z142Ds6-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51laYHVO0nL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61C6HMtbMZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/515fpPvB8EL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/612hDHDj3nL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/61imYyqh0TL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71SmQafsLhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81Vx6K5hCdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/714hetNnAPL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71RhpdHwCwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/8149gUEVt8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61jXeJZTzUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51Z142Ds6-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51laYHVO0nL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61C6HMtbMZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/515fpPvB8EL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/612hDHDj3nL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ January 6, 2023",
    "ASIN ‏": "‎ B0BRSD9VNF",
    "Best Sellers Rank": "#64,842 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #222 in Women's Formal Dresses",
    "Customer Reviews": "4.0 4.0 out of 5 stars (123)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Red",
      "Brown",
      "As Shown",
      "Purple",
      "Black",
      "Green",
      "Flugreen"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.0,
    "count": 123,
    "customers_say": "Customers find the dress beautiful and well-made, with soft lining and comfortable wear. The fit receives mixed feedback, with several customers noting it's too tight on the shoulders and arms. Moreover, the sequins fall off and the ties are poorly made. The sizing is also mixed, with some finding it true to size while others disagree. Generated from the text of customer reviews Select to learn more Beauty (38) Quality (24) Comfort (8) Fit (18) Size (7) Lining (6) Tie quality (10) Sequin quality (9) 38 customers mention beauty, 30 positive, 8 negative 38 customers mention \"Beauty\" 30 positive 8 negative Customers find the dress beautiful, describing it as a statement piece with a lovely color, and one customer mentions it sparkles. \" ...PROS: It's so beautiful and made me want to immediately go out dancing - Your butt will look like a disco ball, win... \" Read more \" This dress is gorgeous ! It’s heavier than expected because of the sequins, but it’s comfortable. The lining is very soft. True to size.... \" Read more \" True to size and very sexy . \" Read more \" ...Fits in all the right places! The string on the dress is kind of cheap looking tbh. Like other reviewers have stated.... \" Read more 24 customers mention quality, 19 positive, 5 negative 24 customers mention \"Quality\" 19 positive 5 negative Customers find the dress well-made and of good quality, with one customer describing it as feeling luxurious. \" Great quality no sequin shed however black string can pop - the back one did not the front- I’d advise reinforcing black strings with some thread... \" Read more \" ...All though the dress is good quality I did not like how the nude undergarment was showing. It looked very cheap and not luxurious.... \" Read more \" Amazing dress ! Highly recommend. Got so many compliments!!! \" Read more \" Straps make the dress look costume like and cheap .Also very annoying to tie. \" Read more 8 customers mention comfort, 7 positive, 1 negative 8 customers mention \"Comfort\" 7 positive 1 negative Customers find the dress comfortable. \" ...It’s heavier than expected because of the sequins, but it’s comfortable . The lining is very soft. True to size.... \" Read more \" Super cute bought it for my baby shower it was very comfortable some of the sequins did fall off so that’s why 4 stars however if sparkle is your... \" Read more \" ...The inner lining was also fairly soft and comfortable against the skin , and there wasn’t anywhere that I noticed the sequins rubbing, which is great... \" Read more \" ...Got compliments all night. The sequence aren't itchy , there's a lining underneath. For reference I'm 5'1, 146lbs and 36DDD.... \" Read more 18 customers mention fit, 12 positive, 6 negative 18 customers mention \"Fit\" 12 positive 6 negative Customers have mixed experiences with the dress's fit, with some finding it perfect while others report it being too tight on the shoulders and arms and too small. \" This dress was surprisingly lovely! Great fit , looked amazing, and the sleeves are so cute. Got tons of compliments. Would recommend! \" Read more \" ...The sequins fall off, the arms are a bit tight and the cording is cheap.... \" Read more \" ...I was very impressed with the quality of the dress and the fit ! They sequins laid nice and it felt much more expensive than it was.... \" Read more \" This dress fit so well . Wore it for my birthday. Went to see a broadway play and then out to dinner. Got compliments all night.... \" Read more 7 customers mention size, 4 positive, 3 negative 7 customers mention \"Size\" 4 positive 3 negative Customers have mixed experiences with the dress's sizing, with some finding it true to size while others report it runs large. \" This dress is SO flattering, true to size , and looks exactly like the original dress. I was so pleasantly surprised with it.... \" Read more \" ...Black looks really cheap. Runs pretty large , ordered medium in both and could have definitely done a small. The ties are the worst part.... \" Read more \" Quality of fabric is really nice. Size is accurate \" Read more \" Very cute—bought for a 70s party. The size was good in places , and I had to get it altered, but very cute.... \" Read more 6 customers mention lining, 3 positive, 3 negative 6 customers mention \"Lining\" 3 positive 3 negative Customers have mixed opinions about the dress's lining, with some finding it smooth and buttery, while others describe it as tacky. \" ...The lining is very soft . True to size. It’s beautiful and I can’t wait to wear it! \" Read more \" ...It looked very cheap and not luxurious . It also was too small on me so the fit wasn’t the best. \" Read more \" ...I'm 5'4\" 200 lbs, 40DD. The lining is nice and smooth , I don't feel the sequins at all on my skin.... \" Read more \" ...you’d find at Home Depot with cinches on the end to make it tighter, tacky and cheap. \" Read more 10 customers mention tie quality, 0 positive, 10 negative 10 customers mention \"Tie quality\" 0 positive 10 negative Customers have mixed experiences with the dress's ties, with some finding them difficult to tie and poorly made, while others report no issues. \" It came broken . The ties are not sewn on just glued at the inseams but since my bag was lost and I wouldn’t be able to return it by the date , I’m... \" Read more \" ...The ties are the worst part . They look like chord you’d find at Home Depot with cinches on the end to make it tighter, tacky and cheap. \" Read more \" ...Like some other reviews mention, the ties do look like tent cording as well as the silver spring cord locks that don't work one bit.... \" Read more \" The dress itself is quality and the color is amazing but the tangled strings wasn’t great . Returned item for a different one \" Read more 9 customers mention sequin quality, 2 positive, 7 negative 9 customers mention \"Sequin quality\" 2 positive 7 negative Customers report issues with the sequins falling off the dress. \" ...The sequins fall off , the arms are a bit tight and the cording is cheap.... \" Read more \" ...it for my baby shower it was very comfortable some of the sequins did fall off so that’s why 4 stars however if sparkle is your thang go for it it... \" Read more \" ...CONS: The sequins fall off easily , but there's plenty on there so I didn't notice them missing on the dress, I only saw them all over my floor... \" Read more \" Great quality no sequin shed however black string can pop - the back one did not the front- I’d advise reinforcing black strings with some thread... \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Say yes to the dress!",
        "body": "Sexiest I’ve ever felt in a dress! Fits in all the right places! The string on the dress is kind of cheap looking tbh. Like other reviewers have stated. I didn’t have any problems with it…but, I wish they’d upgrade it! Want it in other colors. Read more",
        "author": "Chad Pope",
        "rating": 5.0,
        "date": "December 9, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/7171hW7hBGL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Loved!!!",
        "body": "I loved everything about this dress! The fit was exactly how it was sized and i loved the color. Read more",
        "author": "Tayana R.",
        "rating": 5.0,
        "date": "November 13, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71LA6m7lefL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "4.0 out of 5 stars Almost amazing",
        "body": "When I first opened the dress out of the package, I was a little bit let down because the sequins are clear and it sort of loses the rich chocolate brown color. They probably look just fine on the lighter colors like the purple in the blue. The other disappointing thing I noticed right away, was the cords. A few other reviewers also mentioned they looked cheap and I agree. Almost like something you’d find on camping equipment lol. The last negative impression was left when I looked at the ground and noticed tons of fibers I think? Assuming they came from the lining material or the cords, I included a picture. Any area that I was adjusting the dress or standing for a few minutes in my apartment I noticed these would collect underneath me. Now for the positives! I was very impressed by the overall fit of the dress as well as the material. You can tell from some of my close-up photos that it does a great job, hiding, lumps, and bumps. I hate when you can tell where someone’s belly button or their underwear lines is, it looks trashy, and this was great at hiding anything. The inner lining was also fairly soft and comfortable against the skin, and there wasn’t anywhere that I noticed the sequins rubbing, which is great, because I have wore dresses and tops in the past that left my arms raw by the end of the night. Unfortunately for me this was just too tight on the shoulders and arms and I don’t have the biggest arms but I do work out, so maybe others wouldn’t have this issue? Ultimately, this was the reason I didn’t keep the dress because I felt like I couldn’t move comfortably. The hips and waist fit like an absolute dream though! For the right person, this dress is the perfect designer dupe for less! For reference, I’m wearing the size medium. I am 5‘10“ tall, 165lbs, 34C bra and I’m not wearing anything in the photo, 29” waist, 40” hips, and my biceps are about 13” circumference. Read more",
        "author": "Kristen Brown",
        "rating": 4.0,
        "date": "September 18, 2024",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/614VerDt+aL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/61T1p+PTyYL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/6155EK4+3sL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71PF6DuQhNL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71vJrQ2KatL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Very sexy",
        "body": "True to size and very sexy. Read more",
        "author": "NORMA S.",
        "rating": 5.0,
        "date": "November 19, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "1.0 out of 5 stars So cheaply made",
        "body": "Do not buy this CHEAP dress!!!! Sure it’s cute, and I was very happy, until I put it on. This dress is ridiculously expensive for the quality. As soon as I put it on, the floor was covered in sequins. Looked like at least half of them fell off. Then I tried to tighten the draw string, the thing snaps right off… I barely put any pressure on it. The dress is beautiful for sure but please don’t waste THIS MUCH money on this cheaply made piece of crap. Read more",
        "author": "KHillis",
        "rating": 1.0,
        "date": "November 2, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Tangled strings",
        "body": "The dress itself is quality and the color is amazing but the tangled strings wasn’t great. Returned item for a different one Read more",
        "author": "LSB",
        "rating": 3.0,
        "date": "April 13, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "2.0 out of 5 stars Ok dress, poor quality control",
        "body": "The dress is pretty and could be of better quality with better workmanship. The sequins fall off, the arms are a bit tight and the cording is cheap. I had to return mine because the front cord arrived detached and the right arm near the wrist area was cut irregularly. I couldn't get my arm through it, or even a broomstick for that matter. I'm 6', 28 waist and 163 pounds. Size medium fit. Read more",
        "author": "Topazamazon",
        "rating": 2.0,
        "date": "December 16, 2024",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/81RGLTK+UcL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71jtv6l-rgL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Beautiful sequin dress",
        "body": "This dress is gorgeous! It’s heavier than expected because of the sequins, but it’s comfortable. The lining is very soft. True to size. It’s beautiful and I can’t wait to wear it! Read more",
        "author": "Sam P",
        "rating": 5.0,
        "date": "September 6, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.",
  "about_this_item": "Womens Maxi Dress Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.",
  "long_description": "Womens Maxi Dress Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Red, Brown, As Shown, Purple, Black, Green, Flugreen. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Red, Brown, As Shown, Purple, Black, Green, Flugreen. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "bf28d0b4-fd72-4422-bca9-369ed73875a7",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bf28d0b4-fd72-4422-bca9-369ed73875a7/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bf28d0b4-fd72-4422-bca9-369ed73875a7/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "7225a806-bbac-4299-9d75-20cf25547d14",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7225a806-bbac-4299-9d75-20cf25547d14/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7225a806-bbac-4299-9d75-20cf25547d14/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "44fa480e-b427-490e-8a9b-04423e29ec19",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/44fa480e-b427-490e-8a9b-04423e29ec19/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/44fa480e-b427-490e-8a9b-04423e29ec19/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "778d33e5-0ccf-4dc3-9695-7a5b14468f28",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/778d33e5-0ccf-4dc3-9695-7a5b14468f28/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/778d33e5-0ccf-4dc3-9695-7a5b14468f28/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "df204c1f-1646-4c30-8099-917286b602e9",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/df204c1f-1646-4c30-8099-917286b602e9/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/df204c1f-1646-4c30-8099-917286b602e9/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "84fbe0bf-cedb-4104-be23-5a2fabd7a4a8",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/84fbe0bf-cedb-4104-be23-5a2fabd7a4a8/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/84fbe0bf-cedb-4104-be23-5a2fabd7a4a8/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "71bfebd2-772a-46ae-8d54-f54ce991ff0a",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/71bfebd2-772a-46ae-8d54-f54ce991ff0a/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/71bfebd2-772a-46ae-8d54-f54ce991ff0a/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "af270565-531f-433d-bc8a-c0794bfd7560",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/af270565-531f-433d-bc8a-c0794bfd7560/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/af270565-531f-433d-bc8a-c0794bfd7560/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Red": "https://m.media-amazon.com/images/I/411j3DHDmIL._AC_SR38,50_.jpg",
    "Brown": "https://m.media-amazon.com/images/I/31KJ3lzZ5JL._AC_SR38,50_.jpg",
    "As Shown": "https://m.media-amazon.com/images/I/31LcfVaEOiL._AC_SR38,50_.jpg",
    "Purple": "https://m.media-amazon.com/images/I/315PZbSGHxL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31x0nrYINNL._AC_SR38,50_.jpg",
    "Green": "https://m.media-amazon.com/images/I/31bXfeH1ryL._AC_SR38,50_.jpg",
    "Flugreen": "https://m.media-amazon.com/images/I/31LIiTs9vgL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Red": "61jXeJZTzUL",
    "Brown": "51Z142Ds6-L",
    "As Shown": "61imYyqh0TL",
    "Purple": "51laYHVO0nL",
    "Black": "61C6HMtbMZL",
    "Green": "515fpPvB8EL",
    "Flugreen": "612hDHDj3nL"
  },
  "color_images": {
    "Red": [
      "https://m.media-amazon.com/images/I/61jXeJZTzUL._SL1500_.jpg"
    ],
    "Brown": [
      "https://m.media-amazon.com/images/I/51Z142Ds6-L._SL1500_.jpg"
    ],
    "As Shown": [
      "https://m.media-amazon.com/images/I/61imYyqh0TL._SL1500_.jpg"
    ],
    "Purple": [
      "https://m.media-amazon.com/images/I/51laYHVO0nL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/61C6HMtbMZL._SL1500_.jpg"
    ],
    "Green": [
      "https://m.media-amazon.com/images/I/515fpPvB8EL._SL1500_.jpg"
    ],
    "Flugreen": [
      "https://m.media-amazon.com/images/I/612hDHDj3nL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress-cocktail-bodycon",
      "title": "Womens Dress Cocktail Bodycon",
      "price": 47.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61NfEwzl3xL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-one-shoulder-maxi-formal",
      "title": "Womens Maxi Dress Evening One Shoulder Maxi Formal",
      "price": 69.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/5150AIQL4eL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail",
      "title": "Womens Dress Cocktail",
      "price": 103.54,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61JApwce25L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-formal-bodycon-evening-sleeveless",
      "title": "Womens Maxi Dress Maxi Formal Bodycon Evening Sleeveless",
      "price": 61.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61s8qg6u1VL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 158.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71PmRANW40L._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress-bodycon-split-ruched-off-shoulder",
      "title": "Womens Dress Bodycon Split Ruched Off Shoulder",
      "price": 38.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/41JjYcPgcpL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 95.61,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Work",
      "images": [
        "https://m.media-amazon.com/images/I/71hVgSIB1jL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 138.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51PZNrlyY9L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-split-evening-formal",
      "title": "Womens Maxi Dress Split Evening Formal",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51BZ1BqPx8L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 65.97,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/81wr8PDg55L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-v-neck",
      "title": "Womens Dress V Neck",
      "price": 82.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/710bSTpZ9hL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 278.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/91YXeyW506L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening-long-sleeve",
      "title": "Womens Maxi Dress Formal Evening Long Sleeve",
      "price": 87.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61nnk+flvaL._SL1500_.jpg"
      ]
    }
  ]
}