{
  "id": "womens-maxi-dress-long-sleeve-mermaid",
  "handle": "womens-maxi-dress-long-sleeve-mermaid",
  "sku": "JC1973",
  "asin": "B0BSCWGBGT",
  "title": "Womens Maxi Dress Long Sleeve Mermaid",
  "title_original": "Mermaid Wedding Dresses for Bride Classy lace Boho Long Sleeve Open Back Bohemian Wedding Gowns",
  "brand": "Sorayan",
  "price": 178.99,
  "social_proof": {
    "bought_past_month": 84,
    "text": "84+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/61rBTtxm4NL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/616JKHGSkaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61xJPN6rzdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51uB2AZTHGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61RfkSoWIIL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61eYUiKl29L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61m-R08QKkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51Z7bUVo5RL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41anVjJ5hmL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/61rBTtxm4NL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/616JKHGSkaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61xJPN6rzdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51uB2AZTHGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61RfkSoWIIL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61eYUiKl29L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61m-R08QKkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51Z7bUVo5RL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41anVjJ5hmL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ January 15, 2023",
    "ASIN ‏": "‎ B0BSCWFFSL",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#399,322 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #2,536 in Women's Formal Dresses",
    "Customer Reviews": "4.2 4.2 out of 5 stars (72)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "White"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.2,
    "count": 72,
    "customers_say": "Customers find the wedding dress to be well-made, comfortable, and flattering, with one mentioning it accommodates a size G bust. The dress features soft fabric, and one customer notes it looks brand new. They appreciate its value for money and consider it a great choice. Generated from the text of customer reviews Select to learn more Style (22) Fit (21) Quality (17) Comfort (8) Fabric softness (6) Flattering (5) Value for money (5) Material quality (4) 22 customers mention style, 19 positive, 3 negative 22 customers mention \"Style\" 19 positive 3 negative Customers find the dress gorgeous, with one mentioning it looks brand new. \" ...It is beautiful and yellowish pads can be changed for white. I will use with a backless shapewear with padding and will remove bra pads all together. \" Read more \" Beautiful dress but ultimately I decided on a different one. But this one looks more expensive in real life . \" Read more \" It is gorgeous ! A little bit more see through than I expected on the chest part. But is super comfortable and fits well.... \" Read more \" Gorgeous dress !... \" Read more 21 customers mention fit, 15 positive, 6 negative 21 customers mention \"Fit\" 15 positive 6 negative Customers like how the dress fits, with one mentioning it accommodates a size G bust. \" ...I received so many compliments from this dress. It fit perfectly and was comfortable to wear!... \" Read more \" Dress fit perfectly ! WOW the price, the way it felt, what a steal!!! \" Read more \" ...Also the sleeves are a little tight , so if you have larger arms be mindful about that other than that the dress is really cute and doesn’t feel... \" Read more \" Love this dress! The fit was perfect & it was comfortable and classy. \" Read more 17 customers mention quality, 17 positive, 0 negative 17 customers mention \"Quality\" 17 positive 0 negative Customers find the dress to be of great quality. \" ...Used shapewear shorts. Made my figure look great. GREAT Quality . No smell on arrival. Very comfortable to sit down in. \" Read more \" Loved this dress !! Ordered the size that matched my measurements (small). Received within days of ordering. Great price for the quality.... \" Read more \" Did fit perfectly. Loved the dress \" Read more \" Sleeves were extremely tight. The rest of the dress was nice . There is no smell and it seemed soft and comfortable.... \" Read more 8 customers mention comfort, 7 positive, 1 negative 8 customers mention \"Comfort\" 7 positive 1 negative Customers find the dress comfortable. \" ...There is no smell and it seemed soft and comfortable . But I don’t have particularly large arms and I could not get my arms in. \" Read more \" ...But is super comfortable and fits well. I sized up to have more flexibility \" Read more \" ...It fit perfectly and was comfortable to wear !... \" Read more \" ...GREAT Quality. No smell on arrival. Very comfortable to sit down in . \" Read more 6 customers mention fabric softness, 6 positive, 0 negative 6 customers mention \"Fabric softness\" 6 positive 0 negative Customers like the fabric of the dress, describing it as soft. \" ...The fabric is soft and stretchy, providing a comfortable fit while still flattering my growing bump.... \" Read more \" Dress fit perfectly! WOW the price, the way it felt , what a steal!!! \" Read more \" ...The rest of the dress was nice. There is no smell and it seemed soft and comfortable.... \" Read more \" Nice dress not cheap feeling just not what I was wanting for my wedding day 5’3 156 36DD I ordered a large \" Read more 5 customers mention flattering, 5 positive, 0 negative 5 customers mention \"Flattering\" 5 positive 0 negative Customers find the dress flattering, with one mentioning it accommodates a growing bump well and requires no alterations. \" ...Tried many on and this is the one! Flowy, sexy in an elegant way and flattering .... \" Read more \" ...The lace pattern is beautiful. Sleeves were perfect and dress accentuates your curves .... \" Read more \" ...Would highly recommend. No altering was needed . Size up. \" Read more \" ...I taped my girls up no bra. Used shapewear shorts. Made my figure look great . GREAT Quality. No smell on arrival. Very comfortable to sit down in. \" Read more 5 customers mention value for money, 5 positive, 0 negative 5 customers mention \"Value for money\" 5 positive 0 negative Customers find the dress to be a great value. \" ... Great value and beautiful material — this dress I will was ALOT for the Florida heat I definitely was drenched in sweat after only being in it for 2-... \" Read more \" ...Received within days of ordering. Great price for the quality . Very happy bride! \" Read more \" This is too good to have that price . I bought this a the last moment due to complications… It fit soo good on her! I’m happy I trust this dress.... \" Read more \" Dress fit perfectly! WOW the price , the way it felt, what a steal!!! \" Read more 4 customers mention material quality, 4 positive, 0 negative 4 customers mention \"Material quality\" 4 positive 0 negative Customers like the material of the dress, with one mentioning its modern fabric. \" ...beautiful it fit good, the fabric is modern, clean, resistant, good material , this is easily a $1000 wedding dress if you find it in a luxury store. \" Read more \" ...Great value and beautiful material — this dress I will was ALOT for the Florida heat I definitely was drenched in sweat after only being in it for 2-... \" Read more \" I do like this dress. It’s beautiful, the material seems nice and well made, love the sleeves….... \" Read more \" Good material . And everything.... \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Wedding dress finds!",
        "body": "I was skeptical about ordering this dress, but it’s really cute. The lace doesn’t feel cheap and the back is really nice. The only thing is the bra portion is see through but once you put it on, it blends in. Also the sleeves are a little tight, so if you have larger arms be mindful about that other than that the dress is really cute and doesn’t feel cheap at all!!! 5/5 Read more",
        "author": "Veronica Herrera",
        "rating": 5.0,
        "date": "October 20, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars GET THE DRESS!!",
        "body": "BEAUTIFUL. Weird that it has tan padding in a lace top and you can see them thru it but it blended well in my pictures. I loved this. It fit perfect. Zipper on the back. Im 5’5 & 165lbs and it fit me perfect. Sleeves were the perfect length. Bust fit great. I taped my girls up no bra. Used shapewear shorts. Made my figure look great. GREAT Quality. No smell on arrival. Very comfortable to sit down in. Read more",
        "author": "Emily",
        "rating": 5.0,
        "date": "July 13, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/617cACdGsOL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/61ezN6d6sJL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "4.0 out of 5 stars Can’t believe the quality!",
        "body": "I bought SEVERAL dresses and tried on all price ranges and landed with this. I have no regrets. I had the cups replaced with white ones. I actually washed the dress after in the washing machine and hung to dry and it still looks brand new. Don’t hesitate to buy! ♥️ Read more",
        "author": "Vanessa_Mae",
        "rating": 4.0,
        "date": "May 15, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/51Ux-HTUB3L._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/51pxv4-qg6L._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/41TFHoTT+rL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/615PYvdDJGL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/51UBOwGihsL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Fantastic Choice",
        "body": "I got this for a low-key wedding last-minute after a custom ordered gown from Amazon was executed well but didn’t feel right for my bust. This came within a day and was so surprised. It holds up my size G bust, doesn’t show any belly issues, and has a very beautiful back. I did choose to not have it be overly fitting with an xxl, helping me accommodate my chest while not being form fitting on my stomach or hips. The only potential con is the little cups do have a neutral look through a pretty sheer top. I’m okay with that and also considering seeing if I can get a seamstress to switch out the cups for a bigger size. If I had to go with it as is today, I’d be really content. Read more",
        "author": "Hibiscus",
        "rating": 5.0,
        "date": "October 20, 2024",
        "verified": false,
        "images": []
      },
      {
        "title": "1.0 out of 5 stars No me gustó",
        "body": "La parte de los senos es muy amarillo y el vestido es blanco deberían solucionarlo Read more",
        "author": "Altagracia n.",
        "rating": 1.0,
        "date": "January 30, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71m+y1vOZGL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Well worth it!",
        "body": "Dress fit perfectly! WOW the price, the way it felt, what a steal!!! Read more",
        "author": "Jessica Rae",
        "rating": 5.0,
        "date": "October 6, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71EVwan6XoL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/61vOn+HyQHL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "3.0 out of 5 stars Tight sleeves.",
        "body": "Sleeves were extremely tight. The rest of the dress was nice. There is no smell and it seemed soft and comfortable. But I don’t have particularly large arms and I could not get my arms in. Read more",
        "author": "Meg P.",
        "rating": 3.0,
        "date": "July 16, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Gorgeous dress",
        "body": "Beautiful dress, I wore this on my elopement and everyone thought it was a really expensive dress. I did have it altered and replaced the yellow cups with some nude looking ones my seamstress had, it made an entire difference. I would recommend getting it altered to you. Great quality. Read more",
        "author": "Michelle",
        "rating": 5.0,
        "date": "October 21, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Long Sleeve Mermaid is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.",
  "about_this_item": "Womens Maxi Dress Long Sleeve Mermaid is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.",
  "long_description": "Womens Maxi Dress Long Sleeve Mermaid is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: White. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Long Sleeve Mermaid is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: White. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "2c2e5db0-d70a-4ddd-b6c0-e199000dafcd",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2c2e5db0-d70a-4ddd-b6c0-e199000dafcd/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2c2e5db0-d70a-4ddd-b6c0-e199000dafcd/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "3f7fca5b-b383-4e94-9dcc-f4d90ae51e41",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3f7fca5b-b383-4e94-9dcc-f4d90ae51e41/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3f7fca5b-b383-4e94-9dcc-f4d90ae51e41/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "White": "https://m.media-amazon.com/images/I/3177aue1n1L._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "White": "61rBTtxm4NL"
  },
  "color_images": {
    "White": [
      "https://m.media-amazon.com/images/I/61rBTtxm4NL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/616JKHGSkaL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61xJPN6rzdL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/51uB2AZTHGL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61RfkSoWIIL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61eYUiKl29L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61m-R08QKkL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/51Z7bUVo5RL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/41anVjJ5hmL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-bodycon-formal-split-cocktail-maxi",
      "title": "Womens Maxi Dress Bodycon Formal Split Cocktail Maxi",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61Hw+j3QQiL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-evening-formal-v-neck",
      "title": "Womens Dress Evening Formal V Neck",
      "price": 70.89,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/41u6H0EcRlL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-v-neck-long-sleeve",
      "title": "Womens Maxi Dress V Neck Long Sleeve",
      "price": 34.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61xWCXeA-SL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 19.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71c3AS8CsmL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 320.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/81CXQt0W+wL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 129.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/81xqcRe24OL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 300.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61iarf4BQ5L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening-v-neck-long-sleeve",
      "title": "Womens Maxi Dress Formal Evening V Neck Long Sleeve",
      "price": 89.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/51Ri6WY-AIL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-short-sleeve-evening",
      "title": "Womens Dress Short Sleeve Evening",
      "price": 53.75,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61rthYhN-yL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-mermaid-long-sleeve",
      "title": "Womens Maxi Dress Evening Mermaid Long Sleeve",
      "price": 99.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/6145FIB9XIL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail-v-neck-sleeveless",
      "title": "Womens Dress Cocktail V Neck Sleeveless",
      "price": 34.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/81h5FzkfOvL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi",
      "title": "Womens Maxi Dress Maxi",
      "price": 23.74,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/71E9Jden+6L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-sleeveless-cocktail",
      "title": "Womens Dress Sleeveless Cocktail",
      "price": 27.19,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/713CbSuzGgL._SL1500_.jpg"
      ]
    }
  ]
}