{
  "id": "womens-dress-cocktail-formal",
  "handle": "womens-dress-cocktail-formal",
  "sku": "JC1927",
  "asin": "B0BX9M19DZ",
  "title": "Womens Dress Cocktail Formal",
  "title_original": "Meetjen Womens Sparkly Homecoming Dresses for Teens Short Sequin High Low Formal Prom Dress Cocktail Party Wedding Guest",
  "brand": "Visit the Meetjen Store",
  "price": 62.99,
  "social_proof": {
    "bought_past_month": 50,
    "text": "50+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/71+Un5trSBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71fqV8jt3sL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71MijZGJw4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71xfKj8SnNL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61f1hJYlSIL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/711BFJYnaOL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Ld7bxJXNL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71wChveyYcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51VSaIRn1YL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/713CEhMUd8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/514n5EQlh6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Vb7u0ZSSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71J1VF5qjRL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/71+Un5trSBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71fqV8jt3sL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71MijZGJw4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71xfKj8SnNL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61f1hJYlSIL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/711BFJYnaOL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Ld7bxJXNL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71wChveyYcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51VSaIRn1YL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/713CEhMUd8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/514n5EQlh6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Vb7u0ZSSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71J1VF5qjRL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ January 30, 2024",
    "ASIN ‏": "‎ B0CTKD34D7",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#52,832 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #99 in Women's Cocktail Dresses",
    "Customer Reviews": "4.4 4.4 out of 5 stars (404)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Darkgreen",
      "Red",
      "Navy",
      "Pink",
      "White",
      "Blue",
      "Burgundy",
      "Black"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.4,
    "count": 404,
    "customers_say": "Customers find the dress beautiful and trendy, with one noting it feels and looks expensive. Moreover, the dress is well-made, true to size, and perfect for homecoming events. Additionally, they appreciate its length, with the back being longer than the front, and the material being nice and thick. Customers also find it comfortable. Generated from the text of customer reviews Select to learn more Beauty (70) Quality (45) Fit (42) Size (17) Dress size (16) Length (14) Material quality (14) Comfort (11) 70 customers mention beauty, 67 positive, 3 negative 70 customers mention \"Beauty\" 67 positive 3 negative Customers find the dress beautiful, describing it as stunning and age-appropriate, with one customer noting its good color quality and another mentioning it looks very expensive. \" Beautiful dress had to do a last minute order because the other dress different style & company didn't fit my daughter.... \" Read more \" ...However, it is beautiful . I will say this the only other issue with the dress is the zipper. I had to pay extra to replace the zipper.... \" Read more \" This dress is gorgeous ! We loved it but unfortunately, it was way too short in the front for my daughter to wear to her school Valentine's Day dance.... \" Read more \" Super cute and pretty!! Very comfortable! I’m actually wearing it for my wedding dress!... \" Read more 45 customers mention quality, 42 positive, 3 negative 45 customers mention \"Quality\" 42 positive 3 negative Customers find the dress to be nicely made and of great quality. \" We were so pleasantly surprised by this dress. It's great quality , modest but still cute and flirty.... \" Read more \" ...The dress was beautiful and well made , but we had to return it because it was too short in the front. \" Read more \" Great dresses, bought 2, navy & burgundy good quality , just as described, bought for daughters HOCO dance.... \" Read more \" Great dress , comfortable and size was accurate \" Read more 42 customers mention fit, 32 positive, 10 negative 42 customers mention \"Fit\" 32 positive 10 negative Customers are satisfied with how the dress fits. \" Beautiful dress, nice weight and flow to it. It was the perfect fit for my 13 year old daughter but unfortunately there was a 2-3 inch tear/... \" Read more \" ...There is no stretch to the fabric, but it fits true to size . Would definitely buy this dress again! \" Read more \" ...My usual dress size is 12 and my bust is between B/C cup. This dress fit perfectly . \" Read more \" I wear a 2x. The dress fit tight but it is gorgeous \" Read more 17 customers mention size, 14 positive, 3 negative 17 customers mention \"Size\" 14 positive 3 negative Customers find the dress runs true to size. \" I bought this dress for my birthday, it’s came on time. True to size . Material is soft and well trimmed. No heavy nor light .... \" Read more \" ...So many compliments. Age-appropriate and classy style. Size chart was accurate . Lots of sparkle and shine. Well made and not see through. \" Read more \" Great dress, comfortable and size was accurate \" Read more \" This dress was stunning and very well made. Good quality and the sizing is perfect . I purchased an XL.... \" Read more 16 customers mention dress size, 16 positive, 0 negative 16 customers mention \"Dress size\" 16 positive 0 negative Customers find this dress perfect for homecoming events, with one mentioning it's suitable for formal occasions like weddings and dances. \" ...It’s an informal, small wedding and it will be a pretty, fun dress ! I’m short, so the length was perfect for me, not too short!... \" Read more \" This dress is adorable! Perfect for my bachelorette party . I'm 220 lb and 5ft 4in and a xxl fit just right. \" Read more \" ...This is a great dress for a formal or even a homecoming. \" Read more \" ...The fit is true to size and flattering, making it perfect for parties , special events, or nights out.... \" Read more 14 customers mention length, 10 positive, 4 negative 14 customers mention \"Length\" 10 positive 4 negative Customers like the dress's length, particularly noting that it is longer in the back. \" ...She got so many compliments! We loved the way it was longer in the back . It was very flattering. The material was thicker and not cheap feeling.... \" Read more \" ...The length was great , the material flawless and even though we paid a little extra for shipping it actually got here a week before the dance. \" Read more \" ...We loved it but unfortunately, it was way too short in the front for my daughter to wear to her school Valentine's Day dance. We had to return it. \" Read more \" ...I’m short, so the length was perfect for me, not too short ! Can’t wait to wear it for my special day! \" Read more 14 customers mention material quality, 10 positive, 4 negative 14 customers mention \"Material quality\" 10 positive 4 negative Customers appreciate the dress's material, noting that it is nice and thick and of good quality. \" This dress is gorgeous! Fits well, nice material . I’d say it’s true to size. Would definitely buy again \" Read more \" ...The fabric was nice . \" Read more \" ...The zipper gets stuck at the upper waist line because of the double material . A stronger zipper needed to be replaced.... \" Read more \" ...The fabric is good quality --durable, thick and looked to be more expensive than the price.... \" Read more 11 customers mention comfort, 11 positive, 0 negative 11 customers mention \"Comfort\" 11 positive 0 negative Customers find the dress comfortable. \" ...This dress checked all the boxes. Comfortable and also I felt like it has a classic shape. It was not too low cut and I could wear a regular bra.... \" Read more \" ...It was a comfortable dress for her to wear to a school dance. \" Read more \" ...It's a great \"eatin' dress\" as we say here in the South. Super comfortable , you can wear a regular bra with it, and the price honestly isn't that... \" Read more \" Super cute and pretty!! Very comfortable ! I’m actually wearing it for my wedding dress!... \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Feels and looks expensive",
        "body": "Absolutely gorgeous dress! Feels and looks expensive. Very nice quality. Note: Amazon told me my recommended size was L but the size guide put me more as an M. So I ordered two dresses; one in each size. The M fit perfectly. The L was just a little bit too large in the chest/shoulder area. The top half of this dress (the part with the sequins) is STRETCHY. For reference, I’m 5’7” and 140 lbs. The navy color is beautiful, but the green color (the one I’m returning) is also stunning. Read more",
        "author": "Biker Chick",
        "rating": 5.0,
        "date": "December 15, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Buy it!!",
        "body": "Was for my daughters 8th grade graduation she loved it. It was beautiful. Very good quality, true to size. I bought it a little bigger so she could ware it more. She's in 10th grade now and its still super comfortable for her!! Read more",
        "author": "Samantha Hernandez",
        "rating": 5.0,
        "date": "December 9, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Perfect for homecoming!!",
        "body": "We're really impressed with the quality of this dress!! Our daughter is 135 lbs, 5' 7 and wearing a size small, and it fit like a glove!! The green is absolutely beautiful! There is no stretch to the fabric, but it fits true to size. Would definitely buy this dress again! Read more",
        "author": "AlaskaMama",
        "rating": 5.0,
        "date": "October 7, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/81RIGNnh-HL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71LzyYJPwjL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Classy, dazzling, well made dress for homecoming or special occasion.",
        "body": "A gorgeous, sparkling and classy, age-appropriate homecoming dress. After much searching at area stores, we were getting disappointed with the super skimpy low-cut corset top styles. We were pleasantly surprised to find this dress on Amazon and it is beautiful. So many compliments. Age-appropriate and classy style. Size chart was accurate. Lots of sparkle and shine. Well made and not see through. Read more",
        "author": "Jennifer",
        "rating": 5.0,
        "date": "October 24, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71kJBoggjAL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "4.0 out of 5 stars Beautiful Dress!",
        "body": "This dress is very pretty. It fit my daughter pretty well (size 14). The overall quality was pretty good except the zipper was a bit on the cheap side. But for a one night wear, it was perfect. I loved the varying length of the dress how it is flared and longer in the back. Read more",
        "author": "TechGirl",
        "rating": 4.0,
        "date": "May 6, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Beautiful, versatile dress",
        "body": "Wow. This dress absolutely killed it. I bought it to wear to my birthday dinner on a cruise by a Michelin star rated chef, and it did not disappoint! It's a great \"eatin' dress\" as we say here in the South. Super comfortable, you can wear a regular bra with it, and the price honestly isn't that bad considering the quality. I'll definitely wear it for other occasions! Also, pro tip. Steam the bottom layers of the dress before wearing. It takes a while, but looks so much better. The material is nice and thick. Read more",
        "author": "C. M.",
        "rating": 5.0,
        "date": "October 2, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61fpGr+FDrL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/61y3LKIxCxL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "3.0 out of 5 stars Dress to small, bought 1 size bigger then chart shows, still to small. Daughter cried.",
        "body": "The dress is gorgeous and the cor is amazing. The size was not what I expected. I read the reviews and even bought 1 size bigger for my daughter so she can wear more then 1 time. Got the dress, it is to small and short in the front. She is so upset that the size did not fit. Read more",
        "author": "betty",
        "rating": 3.0,
        "date": "December 7, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Great Dress",
        "body": "Super cute!! True to size. Read more",
        "author": "Kindle Customer",
        "rating": 5.0,
        "date": "December 18, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Dress Cocktail Formal is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.",
  "about_this_item": "Womens Dress Cocktail Formal is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.",
  "long_description": "Womens Dress Cocktail Formal is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Darkgreen, Red, Navy, Pink, White, Blue, Burgundy, Black. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Dress Cocktail Formal is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Darkgreen, Red, Navy, Pink, White, Blue, Burgundy, Black. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "d045e2a5-566f-4b62-a743-b39d784f4e8d",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d045e2a5-566f-4b62-a743-b39d784f4e8d/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d045e2a5-566f-4b62-a743-b39d784f4e8d/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "643f49b8-ef07-439a-82c7-3b4192281f0d",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/643f49b8-ef07-439a-82c7-3b4192281f0d/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/643f49b8-ef07-439a-82c7-3b4192281f0d/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "d1cab175-8c07-4306-970d-bcc0bbabb5f9",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d1cab175-8c07-4306-970d-bcc0bbabb5f9/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d1cab175-8c07-4306-970d-bcc0bbabb5f9/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "7b5b4639-a39f-43e8-9973-c4d1d5e94741",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7b5b4639-a39f-43e8-9973-c4d1d5e94741/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7b5b4639-a39f-43e8-9973-c4d1d5e94741/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "551967b7-47d2-49e0-a6a7-9dc26a51b34c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/551967b7-47d2-49e0-a6a7-9dc26a51b34c/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/551967b7-47d2-49e0-a6a7-9dc26a51b34c/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "f2eb8de7-80d3-456a-a13b-dffdb7154220",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f2eb8de7-80d3-456a-a13b-dffdb7154220/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f2eb8de7-80d3-456a-a13b-dffdb7154220/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "847994f6-267d-441b-99ef-84ab0b061044",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/847994f6-267d-441b-99ef-84ab0b061044/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/847994f6-267d-441b-99ef-84ab0b061044/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "6f4fd1c9-d9df-433d-8b32-144ae27893c8",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6f4fd1c9-d9df-433d-8b32-144ae27893c8/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6f4fd1c9-d9df-433d-8b32-144ae27893c8/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "0a16101e-d840-48c7-a99a-aed6ae495d37",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0a16101e-d840-48c7-a99a-aed6ae495d37/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0a16101e-d840-48c7-a99a-aed6ae495d37/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Darkgreen": "https://m.media-amazon.com/images/I/4114-blQg5L._AC_SR38,50_.jpg",
    "Red": "https://m.media-amazon.com/images/I/41Rb7RTWiuL._AC_SR38,50_.jpg",
    "Navy": "https://m.media-amazon.com/images/I/41ggCRcva3L._AC_SR38,50_.jpg",
    "Pink": "https://m.media-amazon.com/images/I/31JZ80op5bL._AC_SR38,50_.jpg",
    "White": "https://m.media-amazon.com/images/I/41lkBPWOVjL._AC_SR38,50_.jpg",
    "Blue": "https://m.media-amazon.com/images/I/31xOthoHdvL._AC_SR38,50_.jpg",
    "Burgundy": "https://m.media-amazon.com/images/I/41tbVoqbv6L._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/416ewLcUU7L._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Darkgreen": "71Ld7bxJXNL",
    "Red": "71wChveyYcL",
    "Navy": "71+Un5trSBL",
    "Pink": "51VSaIRn1YL",
    "White": "713CEhMUd8L",
    "Blue": "514n5EQlh6L",
    "Burgundy": "71Vb7u0ZSSL",
    "Black": "71J1VF5qjRL"
  },
  "color_images": {
    "Darkgreen": [
      "https://m.media-amazon.com/images/I/71Ld7bxJXNL._SL1500_.jpg"
    ],
    "Red": [
      "https://m.media-amazon.com/images/I/71wChveyYcL._SL1500_.jpg"
    ],
    "Navy": [
      "https://m.media-amazon.com/images/I/71+Un5trSBL._SL1500_.jpg"
    ],
    "Pink": [
      "https://m.media-amazon.com/images/I/51VSaIRn1YL._SL1500_.jpg"
    ],
    "White": [
      "https://m.media-amazon.com/images/I/713CEhMUd8L._SL1500_.jpg"
    ],
    "Blue": [
      "https://m.media-amazon.com/images/I/514n5EQlh6L._SL1500_.jpg"
    ],
    "Burgundy": [
      "https://m.media-amazon.com/images/I/71Vb7u0ZSSL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/71J1VF5qjRL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/81yYY12S3jL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-cocktail-long-sleeve-bodycon-maxi",
      "title": "Womens Maxi Dress Formal Cocktail Long Sleeve Bodycon Maxi",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51ZsyXOTWzL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-sleeveless",
      "title": "Womens Dress Sleeveless",
      "price": 37.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51UJzutsULL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-v-neck",
      "title": "Womens Dress V Neck",
      "price": 48.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61qpJfEpIXL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-formal-maxi-long-sleeve",
      "title": "Womens Maxi Dress Cocktail Formal Maxi Long Sleeve",
      "price": 45.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61NXa9j1ztL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-long-sleeve-maxi-bodycon",
      "title": "Womens Maxi Dress Long Sleeve Maxi Bodycon",
      "price": 39.97,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51KrRZOevJL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-bodycon",
      "title": "Womens Maxi Dress Long Sleeve Bodycon",
      "price": 47.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/41fPmqn+ZhL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 48.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61jqQrB7P-L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-long-sleeve",
      "title": "Womens Maxi Dress Maxi Long Sleeve",
      "price": 53.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71AjOz9v3wL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 32.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61PAMnsaq3L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-formal-long-sleeve-maxi",
      "title": "Womens Maxi Dress Evening Formal Long Sleeve Maxi",
      "price": 94.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51Nq5R1Ds-L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-sleeveless-formal",
      "title": "Womens Maxi Dress Sleeveless Formal",
      "price": 56.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/610l4zBj+0L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 52.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/617Wv-9nImL._SL1500_.jpg"
      ]
    }
  ]
}