{
  "id": "womens-dress",
  "handle": "womens-dress",
  "sku": "JC2125",
  "asin": "B0C4T3ZTMV",
  "title": "Womens Dress",
  "title_original": "OFEEFAN Women Puff Sleeve Square Neck Tie in Back Dresses with Zipper",
  "brand": "Visit the OFEEFAN Store",
  "price": 34.99,
  "social_proof": {
    "bought_past_month": 730,
    "text": "730+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/71veOWdQxmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91NEVVMxd+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71acuP0OY2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71VV7Mxb8SL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71XO0+jIyPL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71d6WT9SnML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71AXJ7tDqxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/715LI-uynRL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71uJBKPIB+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71j8svAoYGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71fCppe705L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71WHYM8M5BL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71-E562qivL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71cL4Nfxh8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71VCGBSwAcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71OcktQMgfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71NF9GHLa4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/7187e4ve46L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/715NkNVpo2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Ewo0FDTuL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/71veOWdQxmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91NEVVMxd+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71acuP0OY2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71VV7Mxb8SL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71XO0+jIyPL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71d6WT9SnML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71AXJ7tDqxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/715LI-uynRL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71uJBKPIB+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71j8svAoYGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71fCppe705L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71WHYM8M5BL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71-E562qivL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71cL4Nfxh8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71VCGBSwAcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71OcktQMgfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71NF9GHLa4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/7187e4ve46L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/715NkNVpo2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Ewo0FDTuL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Item model number ‏": "‎ d05c8d76-6f61-46e4-bebe-e4a4e415ac08",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ October 1, 2024",
    "ASIN ‏": "‎ B0BTLYDH13",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#38,581 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #399 in Women's Casual Dresses",
    "Customer Reviews": "4.2 4.2 out of 5 stars (777)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "A White",
      "Maroon",
      "Steel Blue",
      "A Black",
      "Burgundy",
      "Olive Green",
      "Sage Green",
      "Dusty Blue",
      "Navy Blue",
      "Red",
      "Baby Blue",
      "Yellow",
      "Light Cyan",
      "Royal Blue",
      "Light Pink",
      "Grey"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.2,
    "count": 777,
    "customers_say": "Customers find the dress cute with a bow detail in the back, and appreciate its perfect fit that lands above the knees. The material and fabric receive positive feedback, with one customer noting it feels like cotton/linen, and they find it comfortable and flattering. While some it's true to size, others report sizing issues, particularly with the arms being too small. Customers disagree on whether the dress is see-through. Generated from the text of customer reviews Select to learn more Style (89) Fit (78) Quality (51) Material quality (49) Comfort (32) Flattering (23) Sizing (29) See through (21) 89 customers mention style, 84 positive, 5 negative 89 customers mention \"Style\" 84 positive 5 negative Customers find the dress very cute, noting that it doesn't look cheap at all and features a bow in the back that adds a nice detail. \" ...The quality is fantastic, and it’s super trendy, flirty, and cute —perfect for a night out or a fun day event.... \" Read more \" This dress is super cute on my daughter. The fit is true to size. Material is nice. She really likes it! \" Read more \" It's a cute dress but it was too big/baggy in waist and shoulder area was very wide. I had to return it. I ordered medium as suggested by Amazon.... \" Read more \" This dress is very cute , comfortable, stylish and flattering. I bought it for an all white party but didn’t need it after all.... \" Read more 78 customers mention fit, 61 positive, 17 negative 78 customers mention \"Fit\" 61 positive 17 negative Customers are satisfied with how the dress fits, noting that it lands right above the knee, and one customer mentions it pairs well with both heels and flats. \" ...The fabric is so soft, it fits great and does not look cheap at all. The color (I got the blue one) is so pretty and vibrant.... \" Read more \" ...Exchanged for a smaller size and fit well ! Comfortable and a great length for me (I’m 5’11” and it’s tough finding dresses that aren’t too short). \" Read more \" This looked so cute on my daughter for graduation. Good fit and quality. She loved it and we got many compliments. \" Read more \" It's a cute dress but it was too big /baggy in waist and shoulder area was very wide. I had to return it. I ordered medium as suggested by Amazon.... \" Read more 51 customers mention quality, 42 positive, 9 negative 51 customers mention \"Quality\" 42 positive 9 negative Customers find the dress to be of great quality and perfect for graduation occasions, with one customer mentioning it works well for weddings. \" Great dress ! Good fit but the top/chest part is a little see through. I bought this in white. \" Read more \" i’m in love! good quality , not see through, and perfect for graduation. the waist doesn’t have any elastic or ties so I would size down.... \" Read more \" ...For the price I think it’s a great quality ! I got compliments on it all night! \" Read more \" Nice dress \" Read more 49 customers mention material quality, 36 positive, 13 negative 49 customers mention \"Material quality\" 36 positive 13 negative Customers like the dress's material, describing it as nice and flowy, with one customer noting it feels like leggings. \" ...She is 12 and I purchased the medium. Its a nice material ...not see through (although she did wear some biker shorts underneath).... \" Read more \" Adorable. Nice fabric . Fits perfectly with adjustable tie in back. Planning to use for graduation. Daughter is 5’6, 130 lbs, and we ordered a small. \" Read more \" Cheap material and poorly made \" Read more \" We liked it. Fabric is nice and dress runs true to size \" Read more 32 customers mention comfort, 28 positive, 4 negative 32 customers mention \"Comfort\" 28 positive 4 negative Customers find the dress comfortable, with one mentioning it is very forgiving. \" ...Exchanged for a smaller size and fit well! Comfortable and a great length for me (I’m 5’11” and it’s tough finding dresses that aren’t too short). \" Read more \" ...Great for weddings, funerals, Sunday church, and events! Very comfortable and lots of flowiness to feel good in! I absolutely love this dress!! \" Read more \" Comfy , runs a little small, perfect for any occasion, and good length \" Read more \" Very flattering and comfortable dress . It doesn’t have much stretch to it but I would say it’s very true to size.... \" Read more 23 customers mention flattering, 21 positive, 2 negative 23 customers mention \"Flattering\" 21 positive 2 negative Customers find the dress flattering. \" This is just the cutest dress I've seen in a long time!! It is very flattering . I am going to wear it to work in my formal dress store with leggings.... \" Read more \" Breezy and flattering , but I wish it came with a belt/sash to tie, or had some ruching at the waist because it really needs something to break up... \" Read more \" ...The cut and shape of the dress is surprisingly super flattering and feminine, and I loved it.... \" Read more \" This dress is so flattering . Flowy, fits nice and the fabric is good quality. \" Read more 29 customers mention sizing, 19 positive, 10 negative 29 customers mention \"Sizing\" 19 positive 10 negative Customers have mixed experiences with the sizing of the dress, with some finding it true to size while others report that the arms are too small. \" Get so many compliments on this dress every time I wear it! True to size and fabric is soft. It does wrinkle and had to be ironed after washing.... \" Read more \" Arms too small and dress fabric flimsy \" Read more \" We liked it. Fabric is nice and dress runs true to size \" Read more \" ...I get compliments on it a lot. Runs true to size . The sleeves are elastic and not too tight on my arms, which I do struggle with in most dresses.... \" Read more 21 customers mention see through, 14 positive, 7 negative 21 customers mention \"See through\" 14 positive 7 negative Customers have mixed opinions about the dress's transparency, with some finding it opaque while others note it is slightly see-through. \" My daughter loves it. Its a very pretty dress. Is not see through . It did come in a vacuum sealed bag and very wrinkled, but should steam out easily.... \" Read more \" A little see through . It definitely needed to be steamed, but it wasn’t the most flattering look on me so I returned. \" Read more \" ...She was very comfortable and the dress is not see through . \" Read more \" Love this dress. It wasn’t see through and I wore it all night at Megan Moroney. It’s thick and very wearable. I also appreciate the length and fit. \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars So pretty!",
        "body": "Buy this dress if you want compliments! True to size and great quality fabric! I wore this with some cute pattern heels. It is very comfortable and fits a pair of biker shorts under it very easily. Not too short! Read more",
        "author": "Aaron burch",
        "rating": 5.0,
        "date": "November 19, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Cute Dress",
        "body": "Get so many compliments on this dress every time I wear it! True to size and fabric is soft. It does wrinkle and had to be ironed after washing. The back cinches your waist nicely lol. I am 5'4 and the length hit just above the knees. I got the green for September into fall and will be purchasing the black because it is a classic dress. Read more",
        "author": "Erin McManus",
        "rating": 5.0,
        "date": "November 1, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Sized down, cute, great value",
        "body": "Needed a black, knee-length dress for my daughter’s choir concert. I sized down for her. She’s 140 lbs and 5’6, normally wears a small top. I went with the XS. Fits perfect! Read more",
        "author": "MSully",
        "rating": 5.0,
        "date": "December 15, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Very cute!",
        "body": "Super cute and it’s a good length! The material is good not super soft but still comfortable! Read more",
        "author": "Adyson walls",
        "rating": 4.0,
        "date": "June 5, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Good product",
        "body": "Pretty color, looks much better in the picture. I bought it for a wedding and it is just VERY plain. Fit was True to Size. Color was exactly as pictured. Material good. The ONLY downfall was how plain it is. Read more",
        "author": "Cara",
        "rating": 3.0,
        "date": "November 27, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Super Flattering Dress",
        "body": "I am 5’7” and 135 lbs, I ordered a size medium in black. I got this dress for a rehearsal dinner as a guest, and it ended up being perfect! It’s the perfect length, and lands right above the knee, so no worrying about it riding up when sitting or moving around. The back of the dress isn’t really revealing or low cut, and the little tie bow adds an extra touch! The cut and shape of the dress is surprisingly super flattering and feminine, and I loved it. The only note I have is the waist was a little loose for a medium, and I could’ve sized down, but I still think it looks flattering, and would especially be okay if you had a bigger bust. The zipper is on the side which I love because it is hidden. I ordered the dress in black, and it was not see through in my opinion. The fabric felt like cotton/linen and was comfortable, lightweight, flowy, but still held its shape. For the price I think it’s a great quality! I got compliments on it all night! Read more",
        "author": "Ava",
        "rating": 5.0,
        "date": "July 11, 2024",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Great dress!",
        "body": "Beautiful dress and good quality as well. My daughter is taller, and this dress has a nice length to it as well. It is simple enough to wear casually or be dressed up for a more formal event like church or a funeral. Read more",
        "author": "Jabrummett",
        "rating": 5.0,
        "date": "November 10, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Perfect size",
        "body": "Love this dress. It wasn’t see through and I wore it all night at Megan Moroney. It’s thick and very wearable. I also appreciate the length and fit. Read more",
        "author": "Lila bennett",
        "rating": 5.0,
        "date": "December 14, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Dress is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.",
  "about_this_item": "Womens Dress is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.",
  "long_description": "Womens Dress is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: A White, Maroon, Steel Blue, A Black, Burgundy, Olive Green, Sage Green, Dusty Blue, Navy Blue, Red, Baby Blue, Yellow, Light Cyan, Royal Blue. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Dress is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: A White, Maroon, Steel Blue, A Black, Burgundy, Olive Green, Sage Green, Dusty Blue, Navy Blue, Red, Baby Blue, Yellow, Light Cyan, Royal Blue. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "b3aaa44f-b6f4-475e-bc19-d9c82584ccfc",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b3aaa44f-b6f4-475e-bc19-d9c82584ccfc/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b3aaa44f-b6f4-475e-bc19-d9c82584ccfc/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/bfdf6284-aa37-4f48-954b-701ad54b2c37.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "4413362f-32a4-47e9-b665-260a00ff99e6",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4413362f-32a4-47e9-b665-260a00ff99e6/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4413362f-32a4-47e9-b665-260a00ff99e6/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/bfdf6284-aa37-4f48-954b-701ad54b2c37.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "98b58ff9-35a2-4799-a672-175f6c5ede8d",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/98b58ff9-35a2-4799-a672-175f6c5ede8d/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/98b58ff9-35a2-4799-a672-175f6c5ede8d/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/bfdf6284-aa37-4f48-954b-701ad54b2c37.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "e45c8f83-9f03-42a4-93de-e44b544dba07",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e45c8f83-9f03-42a4-93de-e44b544dba07/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e45c8f83-9f03-42a4-93de-e44b544dba07/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/bfdf6284-aa37-4f48-954b-701ad54b2c37.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "a706633e-5c6c-4d24-b785-974ce8141423",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a706633e-5c6c-4d24-b785-974ce8141423/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a706633e-5c6c-4d24-b785-974ce8141423/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/bfdf6284-aa37-4f48-954b-701ad54b2c37.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "e8e3a2ba-40bb-4fb5-952e-c3cf01b2c5e5",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e8e3a2ba-40bb-4fb5-952e-c3cf01b2c5e5/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e8e3a2ba-40bb-4fb5-952e-c3cf01b2c5e5/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/bfdf6284-aa37-4f48-954b-701ad54b2c37.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "f75c239d-ce6a-4e7e-9545-097e9c9f8bf2",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f75c239d-ce6a-4e7e-9545-097e9c9f8bf2/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f75c239d-ce6a-4e7e-9545-097e9c9f8bf2/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/bfdf6284-aa37-4f48-954b-701ad54b2c37.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "4af5b36d-4bb0-4f2f-8815-a5a2b05231bb",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4af5b36d-4bb0-4f2f-8815-a5a2b05231bb/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4af5b36d-4bb0-4f2f-8815-a5a2b05231bb/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/bfdf6284-aa37-4f48-954b-701ad54b2c37.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "08a7f43f-4b11-4193-90a1-5cd1112f3d43",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/08a7f43f-4b11-4193-90a1-5cd1112f3d43/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/08a7f43f-4b11-4193-90a1-5cd1112f3d43/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/bfdf6284-aa37-4f48-954b-701ad54b2c37.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "38ce3344-b261-4d24-85eb-25ee6114942b",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/38ce3344-b261-4d24-85eb-25ee6114942b/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/38ce3344-b261-4d24-85eb-25ee6114942b/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/bfdf6284-aa37-4f48-954b-701ad54b2c37.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "35ec4431-5aba-4c78-810f-6b6390b34821",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/35ec4431-5aba-4c78-810f-6b6390b34821/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/35ec4431-5aba-4c78-810f-6b6390b34821/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/bfdf6284-aa37-4f48-954b-701ad54b2c37.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "2ada6c73-8250-4b63-a1ee-e7951cbe076e",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2ada6c73-8250-4b63-a1ee-e7951cbe076e/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2ada6c73-8250-4b63-a1ee-e7951cbe076e/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/bfdf6284-aa37-4f48-954b-701ad54b2c37.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "A White": "https://m.media-amazon.com/images/I/41fJZSxj41L._AC_SR38,50_.jpg",
    "Maroon": "https://m.media-amazon.com/images/I/41DWKG672mL._AC_SR38,50_.jpg",
    "Steel Blue": "https://m.media-amazon.com/images/I/41oq4xRHlIL._AC_SR38,50_.jpg",
    "A Black": "https://m.media-amazon.com/images/I/41a9GObNalL._AC_SR38,50_.jpg",
    "Burgundy": "https://m.media-amazon.com/images/I/41FnePrL2aL._AC_SR38,50_.jpg",
    "Olive Green": "https://m.media-amazon.com/images/I/41adRkxPJdL._AC_SR38,50_.jpg",
    "Sage Green": "https://m.media-amazon.com/images/I/41cB9rLx9KL._AC_SR38,50_.jpg",
    "Dusty Blue": "https://m.media-amazon.com/images/I/41nid37qvaL._AC_SR38,50_.jpg",
    "Navy Blue": "https://m.media-amazon.com/images/I/41c5miQSlmL._AC_SR38,50_.jpg",
    "Red": "https://m.media-amazon.com/images/I/41r53kjj4QL._AC_SR38,50_.jpg",
    "Baby Blue": "https://m.media-amazon.com/images/I/410QxojpDFL._AC_SR38,50_.jpg",
    "Yellow": "https://m.media-amazon.com/images/I/41Ddm7whN0L._AC_SR38,50_.jpg",
    "Light Cyan": "https://m.media-amazon.com/images/I/41v3ZlOEgrL._AC_SR38,50_.jpg",
    "Royal Blue": "https://m.media-amazon.com/images/I/41Y4xHnXCPL._AC_SR38,50_.jpg",
    "Light Pink": "https://m.media-amazon.com/images/I/41LRXdYJzwL._AC_SR38,50_.jpg",
    "Grey": "https://m.media-amazon.com/images/I/41EWebSLnEL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "A White": "71d6WT9SnML",
    "Maroon": "71AXJ7tDqxL",
    "Steel Blue": "715LI-uynRL",
    "A Black": "71veOWdQxmL",
    "Burgundy": "71uJBKPIB+L",
    "Olive Green": "71j8svAoYGL",
    "Sage Green": "71fCppe705L",
    "Dusty Blue": "71WHYM8M5BL",
    "Navy Blue": "71-E562qivL",
    "Red": "71cL4Nfxh8L",
    "Baby Blue": "71VCGBSwAcL",
    "Yellow": "71OcktQMgfL",
    "Light Cyan": "71NF9GHLa4L",
    "Royal Blue": "7187e4ve46L",
    "Light Pink": "715NkNVpo2L",
    "Grey": "71Ewo0FDTuL"
  },
  "color_images": {
    "A White": [
      "https://m.media-amazon.com/images/I/71d6WT9SnML._SL1500_.jpg"
    ],
    "Maroon": [
      "https://m.media-amazon.com/images/I/71AXJ7tDqxL._SL1500_.jpg"
    ],
    "Steel Blue": [
      "https://m.media-amazon.com/images/I/715LI-uynRL._SL1500_.jpg"
    ],
    "A Black": [
      "https://m.media-amazon.com/images/I/71veOWdQxmL._SL1500_.jpg"
    ],
    "Burgundy": [
      "https://m.media-amazon.com/images/I/71uJBKPIB+L._SL1500_.jpg"
    ],
    "Olive Green": [
      "https://m.media-amazon.com/images/I/71j8svAoYGL._SL1500_.jpg"
    ],
    "Sage Green": [
      "https://m.media-amazon.com/images/I/71fCppe705L._SL1500_.jpg"
    ],
    "Dusty Blue": [
      "https://m.media-amazon.com/images/I/71WHYM8M5BL._SL1500_.jpg"
    ],
    "Navy Blue": [
      "https://m.media-amazon.com/images/I/71-E562qivL._SL1500_.jpg"
    ],
    "Red": [
      "https://m.media-amazon.com/images/I/71cL4Nfxh8L._SL1500_.jpg"
    ],
    "Baby Blue": [
      "https://m.media-amazon.com/images/I/71VCGBSwAcL._SL1500_.jpg"
    ],
    "Yellow": [
      "https://m.media-amazon.com/images/I/71OcktQMgfL._SL1500_.jpg"
    ],
    "Light Cyan": [
      "https://m.media-amazon.com/images/I/71NF9GHLa4L._SL1500_.jpg"
    ],
    "Royal Blue": [
      "https://m.media-amazon.com/images/I/7187e4ve46L._SL1500_.jpg"
    ],
    "Light Pink": [
      "https://m.media-amazon.com/images/I/715NkNVpo2L._SL1500_.jpg"
    ],
    "Grey": [
      "https://m.media-amazon.com/images/I/71Ewo0FDTuL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-sleeveless-maxi",
      "title": "Womens Maxi Dress Sleeveless Maxi",
      "price": 48.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71qwUjryGiL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 43.69,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61-pFN+nfgL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-bodycon",
      "title": "Womens Maxi Dress Maxi Bodycon",
      "price": 36.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61o6MKJoZLL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-one-shoulder-formal-mermaid-bodycon-evening-maxi",
      "title": "Womens Maxi Dress One Shoulder Formal Mermaid Bodycon Evening Maxi",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71mgUBuGwhL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-v-neck-short-sleeve",
      "title": "Womens Dress V Neck Short Sleeve",
      "price": 34.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71T+iJeFITL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress-cocktail-ruched-evening-split",
      "title": "Womens Dress Cocktail Ruched Evening Split",
      "price": 29.69,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/61003bnFhAS._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-maxi",
      "title": "Womens Maxi Dress Formal Maxi",
      "price": 64.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/61RWPo72AmL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-mermaid-one-shoulder",
      "title": "Womens Maxi Dress Mermaid One Shoulder",
      "price": 238.74,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51lR3NNtXCL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-maxi-formal-long-sleeve-v-neck",
      "title": "Womens Maxi Dress Cocktail Maxi Formal Long Sleeve V Neck",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61cfJoIR5bL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-bodycon-ruched",
      "title": "Womens Maxi Dress Cocktail Bodycon Ruched",
      "price": 49.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51+rVhgLHSL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-formal",
      "title": "Womens Dress Formal",
      "price": 75.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51TVxkZ3J2L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening",
      "title": "Womens Maxi Dress Formal Evening",
      "price": 64.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/516ScMrYzlL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-ruched-bodycon-v-neck",
      "title": "Womens Maxi Dress Long Sleeve Ruched Bodycon V Neck",
      "price": 33.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51AvldIvTmL._SL1500_.jpg"
      ]
    }
  ]
}