{
  "id": "womens-dress-bodycon-ruched",
  "handle": "womens-dress-bodycon-ruched",
  "sku": "JC1444",
  "asin": "B0C4KLY1KB",
  "title": "Womens Dress Bodycon Ruched",
  "title_original": "Ekaliy Women's Sexy Off The Shoulder Midi Dress Ruched Bodycon Dresses",
  "brand": "Visit the Ekaliy Store",
  "price": 38.99,
  "social_proof": {
    "bought_past_month": 50,
    "text": "50+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/51xtUJukFCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61YdT-4YhYL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71H38+eJodL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71U6TJl6aAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/719k22G41vL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51IYY99glyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31GYi8UOGTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/519o6tj0EdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/310vreSTNqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51yMWeUo+sL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31b2bC9pC-L._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/51xtUJukFCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61YdT-4YhYL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71H38+eJodL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71U6TJl6aAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/719k22G41vL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51IYY99glyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31GYi8UOGTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/519o6tj0EdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/310vreSTNqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51yMWeUo+sL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31b2bC9pC-L._SL1500_.jpg"
  ],
  "aplus_images": [
    "https://m.media-amazon.com/images/I/315ob3BSfLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31KLhFD6N9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31tTg6EcR8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31DyoVCIuuL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31RENkipTzL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31ckNEAul6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31cxmF-eD3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31NpwipvOTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41aDUpbxB4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31Bf-NlZtrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31kgmuhDbgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31qof6Vlj4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41D6JVWEIwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41T5kPC4x5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/416QBCDsGqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41HQZB6fY2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41TTp6CibpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41iOxvx3K3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41YnGHELf7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41j0pQ6orBL._SL1500_.jpg"
  ],
  "description_images": [
    "https://m.media-amazon.com/images/I/315ob3BSfLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31KLhFD6N9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31tTg6EcR8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31DyoVCIuuL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31RENkipTzL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31ckNEAul6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31cxmF-eD3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31NpwipvOTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41aDUpbxB4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31Bf-NlZtrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31kgmuhDbgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31qof6Vlj4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41D6JVWEIwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41T5kPC4x5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/416QBCDsGqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41HQZB6fY2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41TTp6CibpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41iOxvx3K3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41YnGHELf7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41j0pQ6orBL._SL1500_.jpg"
  ],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ October 23, 2023",
    "ASIN ‏": "‎ B0CLL15TQ8",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#61,387 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #323 in Women's Club & Night Out Dresses",
    "Customer Reviews": "4.2 4.2 out of 5 stars (314)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Red",
      "Rose Red",
      "Wine",
      "Brown",
      "Royal Blue",
      "Black",
      "Green"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.2,
    "count": 314,
    "customers_say": "Customers find the dress gorgeous and flattering, with one noting it hugs curves in all the right places. The dress fits well, is stretchy, and customers like its color. However, the material quality receives mixed feedback - while some say it's perfect, others find it very cheap. Additionally, several customers mention the material is very see-through. Generated from the text of customer reviews Select to learn more Looks (25) Fit (21) Flattering (12) Stretchiness (11) Color (10) Quality (20) Material quality (12) Material viscosity (8) 25 customers mention looks, 23 positive, 2 negative 25 customers mention \"Looks\" 23 positive 2 negative Customers find the dress gorgeous. \" Beautiful dress . Very stretchy. I was afraid my mommy belly would be too exposed but the ruffles in the front do a good job at hiding it.... \" Read more \" Beautiful and comfortable \" Read more \" Very cute dress , but the shoulder part was a little too loose. \" Read more \" This dress is stunning love the way it goes off the shoulders. The color was perfect and just like in the picture.... \" Read more 21 customers mention fit, 18 positive, 3 negative 21 customers mention \"Fit\" 18 positive 3 negative Customers like how the dress fits, with one mentioning it's comfortable and another noting it's perfect for their body. \" Perfect fit !! Loved it \" Read more \" The dress fit perfectly !!! \" Read more \" ...It feels a little cheap. The fit is super flattering though so I think it was worth it!... \" Read more \" Nice dress fits perfectly \" Read more 12 customers mention flattering, 11 positive, 1 negative 12 customers mention \"Flattering\" 11 positive 1 negative Customers find the dress flattering, with one mentioning it camouflages tummy issues and another noting it hides belly pouches. \" If you’re looking at this dress - BUY IT! It is so flattering especially if you’re curvy!... \" Read more \" This dress is beautiful!! Love that it’s ruched and hides my belly . The back looks even more beautiful. \" Read more \" I wore this to a wedding and was not disappointed. It hugs your curves in all the right places . I suggest shape wear for sure!... \" Read more \" Oh My goodnesss this dress was soooo flattering I received so many compliments. People thought I was apart of the wedding party.... \" Read more 11 customers mention stretchiness, 11 positive, 0 negative 11 customers mention \"Stretchiness\" 11 positive 0 negative Customers like the dress's stretchiness. \" ...I got a medium even though I normally wear a large in dresses. It’s stretchy ! It feels comfortable:) I’d buy it again in another color! \" Read more \" Very stretchy , great material, very soft and the color was beautiful blue. The length was great, it was very functional and the right thickness.... \" Read more \" ...I ordered XL, I am 5'3\", 180lbs. The dress is stretchy and very comfortable. I probably could have gotten a L and it would have been fine.... \" Read more \" The length is great and material is stretchy but it is very thin. Anything worn underneath will show or be outlined. \" Read more 10 customers mention color, 7 positive, 3 negative 10 customers mention \"Color\" 7 positive 3 negative Customers like the dress's color. \" ...For the melanated girlies, the color was everything . This was a great Amazon buy! \" Read more \" ...The color was perfect and just like in the picture. The quality of the dress was good and it stretches I could’ve sized down one.... \" Read more \" The color is to bright is like a red not burgundy has described \" Read more \" Soft , stretchy material a beautiful pink color . Great dress to hide tummy issues. True to size I ordered size large.... \" Read more 20 customers mention quality, 11 positive, 9 negative 20 customers mention \"Quality\" 11 positive 9 negative Customers have mixed opinions about the dress's quality, with some finding it amazing while others describe it as very low quality and cheap. \" Dress was perfect . I am a plus size woman and it fits very comfortable thick and for the amount I paid it was worth it. \" Read more \" It was supposed to be for a wedding. Hell no !! It’s horrible quality I could not show up in such a thing.... \" Read more \" Great quality dress . Material was perfect. No see through lining. Just the right amount of stretch. Fit was great.... \" Read more \" Not like the photo. Do not waste your money. The material is tacky and cheap .... \" Read more 12 customers mention material quality, 7 positive, 5 negative 12 customers mention \"Material quality\" 7 positive 5 negative Customers have mixed opinions about the dress's material quality, with some finding it good while others describe it as very cheap. \" Great quality dress. Material was perfect . No see through lining. Just the right amount of stretch. Fit was great.... \" Read more \" The material is very thin, almost like a spandex material , I was expecting a thicker material. \" Read more \" Love the material of this dress fast delivery! Great fit, has good stretch very versatile dress and the straps stay off the should as advertised!... \" Read more \" Horrible fabric bad quality not as advertised \" Read more 8 customers mention material viscosity, 2 positive, 6 negative 8 customers mention \"Material viscosity\" 2 positive 6 negative Customers report that the dress is very see-through, with one mentioning that anything worn underneath will show or be outlined. \" Dress was very cheap ugly looking. The material is see through and cheap. Do not waste your money \" Read more \" ...I had to return it because it was see-through . It only had one layer and I needed to hide my gf corset.... \" Read more \" ...super soft and very good quality, the size is accurate and it's not see-through . 10/10 \" Read more \" It’s extremely sheer and cheap looking. I won’t be buying more or recommending. \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Good dress",
        "body": "This dress is stunning love the way it goes off the shoulders. The color was perfect and just like in the picture. The quality of the dress was good and it stretches I could’ve sized down one. The length of the dress was also perfect. Read more",
        "author": "monica",
        "rating": 5.0,
        "date": "December 19, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars You will be a glamorous goddess in this dress",
        "body": "I wore this to a wedding and was not disappointed. It hugs your curves in all the right places. I suggest shape wear for sure! It's a comfy, glamorous dress. It has a lot of give and is stretchy. True to size Read more",
        "author": "Paula I Lobato",
        "rating": 5.0,
        "date": "November 18, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61-ndobZv9L._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71li-QBV5YL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Excellent dress",
        "body": "Very good dress, the size is perfect, it fits me very well Read more",
        "author": "Cristian Roman",
        "rating": 5.0,
        "date": "November 26, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "1.0 out of 5 stars Runs big",
        "body": "The media could not be loaded. Not too thrilled about the material. Felt cheap. Runs bigger. I got an XL because I'm 186lbs. It was huge on the stomach area. The neckline/shoulders looked nice however. Read more",
        "author": "Customer",
        "rating": 1.0,
        "date": "May 6, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Has potential for the right body type",
        "body": "Very cute dress, but the shoulder part was a little too loose. Read more",
        "author": "Customer",
        "rating": 4.0,
        "date": "July 29, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Great buy!",
        "body": "Beautiful dress. Very stretchy. I was afraid my mommy belly would be too exposed but the ruffles in the front do a good job at hiding it. The color was supposed to be more brown but it looked good on me and still managed to match the color scheme I was looking for. Read more",
        "author": "Dominique Williams",
        "rating": 5.0,
        "date": "September 20, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71dkV3m59AL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "3.0 out of 5 stars Not for bodies with a pouch belly",
        "body": "Beautiful dress. The color is more red than wine. The back of the dress is perfect. However, the front does not have enough ruching to hide a larger belly. Read more",
        "author": "Carl Tomlin",
        "rating": 3.0,
        "date": "October 28, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Elegant",
        "body": "I loved everything about this dress. It accentuated all of my curves and more. For the melanated girlies, the color was everything. This was a great Amazon buy! Read more",
        "author": "Misses",
        "rating": 5.0,
        "date": "November 29, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61LV82pz4kL._SY88._SL1500_.jpg"
        ]
      }
    ]
  },
  "short_description": "Womens Dress Bodycon Ruched is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.",
  "about_this_item": "Womens Dress Bodycon Ruched is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.",
  "long_description": "Womens Dress Bodycon Ruched is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Red, Rose Red, Wine, Brown, Royal Blue, Black, Green. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Dress Bodycon Ruched is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/315ob3BSfLL._SL1500_.jpg",
      "alt": "Womens Dress Bodycon Ruched details image 1"
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/31KLhFD6N9L._SL1500_.jpg",
      "alt": "Womens Dress Bodycon Ruched details image 2"
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/31tTg6EcR8L._SL1500_.jpg",
      "alt": "Womens Dress Bodycon Ruched details image 3"
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/31DyoVCIuuL._SL1500_.jpg",
      "alt": "Womens Dress Bodycon Ruched details image 4"
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Red, Rose Red, Wine, Brown, Royal Blue, Black, Green. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/31RENkipTzL._SL1500_.jpg",
      "alt": "Womens Dress Bodycon Ruched details image 5"
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "009f11ba-0e96-4bf2-bdbe-a2eb4dcd275d",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/009f11ba-0e96-4bf2-bdbe-a2eb4dcd275d/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/009f11ba-0e96-4bf2-bdbe-a2eb4dcd275d/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/ac0cb415-2962-488c-84a5-014808b7d683.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "2004dc47-a1ad-48f5-b598-a9ed76ef8638",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2004dc47-a1ad-48f5-b598-a9ed76ef8638/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2004dc47-a1ad-48f5-b598-a9ed76ef8638/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/ac0cb415-2962-488c-84a5-014808b7d683.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Red": "https://m.media-amazon.com/images/I/31g9PRQmQiL._AC_SR38,50_.jpg",
    "Rose Red": "https://m.media-amazon.com/images/I/31GYi8UOGTL._AC_SR38,50_.jpg",
    "Wine": "https://m.media-amazon.com/images/I/31mnGTchEyL._AC_SR38,50_.jpg",
    "Brown": "https://m.media-amazon.com/images/I/31+Ep1DaZYL._AC_SR38,50_.jpg",
    "Royal Blue": "https://m.media-amazon.com/images/I/310vreSTNqL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31nkUjlPKEL._AC_SR38,50_.jpg",
    "Green": "https://m.media-amazon.com/images/I/31b2bC9pC-L._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Red": "51IYY99glyL",
    "Rose Red": "31GYi8UOGTL",
    "Wine": "51xtUJukFCL",
    "Brown": "519o6tj0EdL",
    "Royal Blue": "310vreSTNqL",
    "Black": "51yMWeUo+sL",
    "Green": "31b2bC9pC-L"
  },
  "color_images": {
    "Red": [
      "https://m.media-amazon.com/images/I/51IYY99glyL._SL1500_.jpg"
    ],
    "Rose Red": [
      "https://m.media-amazon.com/images/I/31GYi8UOGTL._SL1500_.jpg"
    ],
    "Wine": [
      "https://m.media-amazon.com/images/I/51xtUJukFCL._SL1500_.jpg"
    ],
    "Brown": [
      "https://m.media-amazon.com/images/I/519o6tj0EdL._SL1500_.jpg"
    ],
    "Royal Blue": [
      "https://m.media-amazon.com/images/I/310vreSTNqL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/51yMWeUo+sL._SL1500_.jpg"
    ],
    "Green": [
      "https://m.media-amazon.com/images/I/31b2bC9pC-L._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-long-sleeve-mermaid-formal",
      "title": "Womens Maxi Dress Long Sleeve Mermaid Formal",
      "price": 80.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/4144TFf2-NL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-ruched-long-sleeve-bodycon-cocktail-off-shoulder-maxi",
      "title": "Womens Maxi Dress Ruched Long Sleeve Bodycon Cocktail Off Shoulder Maxi",
      "price": 52.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61Idn8rOrRL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-formal-evening",
      "title": "Womens Dress Formal Evening",
      "price": 79.95,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/615Qr4YN+tL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 61.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51VEsza1YAL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-formal-ruched",
      "title": "Womens Maxi Dress Evening Formal Ruched",
      "price": 67.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61XytRDkNbL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-maxi-long-sleeve-bodycon",
      "title": "Womens Maxi Dress Maxi Long Sleeve Bodycon",
      "price": 51.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/616jndkUHIL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-v-neck-formal-long-sleeve",
      "title": "Womens Maxi Dress Bodycon V Neck Formal Long Sleeve",
      "price": 74.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51DTjtOSU7L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-formal-evening",
      "title": "Womens Dress Formal Evening",
      "price": 74.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61Er9CvHl3L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-off-shoulder",
      "title": "Womens Maxi Dress Off Shoulder",
      "price": 145.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61vEt64A2DL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-ruched-bodycon-long-sleeve-cocktail-v-neck",
      "title": "Womens Maxi Dress Ruched Bodycon Long Sleeve Cocktail V Neck",
      "price": 48.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/51tgZkqvl9L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-evening-formal-v-neck",
      "title": "Womens Dress Evening Formal V Neck",
      "price": 70.89,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/41u6H0EcRlL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-jumpsuit-v-neck",
      "title": "Womens Jumpsuit V Neck",
      "price": 80.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/31udZ16+E8L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-maxi-bodycon",
      "title": "Womens Maxi Dress Long Sleeve Maxi Bodycon",
      "price": 41.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51u-03U0ZHL._SL1500_.jpg"
      ]
    }
  ]
}