{
  "id": "womens-maxi-dress-long-sleeve-v-neck-bodycon",
  "handle": "womens-maxi-dress-long-sleeve-v-neck-bodycon",
  "sku": "JC3219",
  "asin": "B0C49NGMSD",
  "title": "Womens Maxi Dress Long Sleeve V Neck Bodycon",
  "title_original": "ZESICA Women's 2026 Fall Sweater Dress V Neck Long Sleeve Ribbed Knit Tie Waist Bodycon Slim Fit Midi Dresses",
  "brand": "Visit the ZESICA Store",
  "price": 47.99,
  "social_proof": {
    "bought_past_month": 1321,
    "text": "1321+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/61QbwpUJEwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61CnKIFwrwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61k+gymdvVL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71kVYAiG-oL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91uMQx7qnOL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71fF+fwJlvL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61AQjgHpT1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Tsh8-ovyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61kXjkw6NkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Zq8g-redL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61VhYxdT2yL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61kElvFd3zL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/619+pSeBMJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/612fpmtKHhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/610a8gGvJML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ghGrkeZmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61M27yaAQaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61zKUXpamEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61NNEyqAKhL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/61QbwpUJEwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61CnKIFwrwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61k+gymdvVL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71kVYAiG-oL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91uMQx7qnOL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71fF+fwJlvL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61AQjgHpT1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Tsh8-ovyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61kXjkw6NkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Zq8g-redL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61VhYxdT2yL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61kElvFd3zL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/619+pSeBMJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/612fpmtKHhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/610a8gGvJML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ghGrkeZmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61M27yaAQaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61zKUXpamEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61NNEyqAKhL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Product Dimensions ‏": "‎ 1.97 x 0.79 x 0.39 inches; 3.53 ounces",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ May 4, 2023",
    "Manufacturer ‏": "‎ ZESICA",
    "ASIN ‏": "‎ B0D49X69PL",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#22,037 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #170 in Women's Casual Dresses #340 in Women's Pullover Sweaters",
    "Customer Reviews": "4.5 4.5 out of 5 stars (637)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Darkgreen",
      "Red",
      "Redbrown",
      "Navy",
      "Khaki",
      "Pink",
      "White",
      "Apricot",
      "Black",
      "Dustyblue",
      "Darkviolet",
      "Armygreen"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.5,
    "count": 637,
    "customers_say": "Customers find the dress fits well, with one noting it accommodates various body types, and appreciate its beautiful construction and expensive appearance. The dress is comfortable, with one customer describing it as \"epitome of cozy chic,\" and features a thick, stretchy material that's perfect for fall and winter wear. They love the color options and find it flattering, with one mentioning how it accentuates the waist. Select to learn more Fit Quality Beauty Flattering Comfort Color Material thickness Fabric quality 86 customers mention \"Fit\" 79 positive 7 negative Customers like how the dress fits, particularly noting its perfect length, and one customer mentions it accommodates various body types. \"Very stylish sweater dress. Great fit , can't see thru the color. Nice & thick. Great price & value!! Love it!! The belt is a great touch!\" Read more \"...hard time wearing belted dresses due to my chest size, but this was a nice fit and the belt was still at my waist....\" Read more \"I actually have this dress in 2 colors. It fits great and is very comfortable.\" Read more \"I wanted to love this dress so much it fits perfectly however it made me look 20 pounds larger than I am unfortunately I had already worn it so it’s...\" Read more 71 customers mention \"Quality\" 70 positive 1 negative Customers appreciate the dress's quality, describing it as beautiful and well-made, with one customer noting its perfect fit. \"This was a great dress , so comfortable, material is thick would buy again in more colors\" Read more \"I love this dress! Good quality and is beautiful.\" Read more \" Nice dress , fits well…figure flattering\" Read more \" Love this dress !!...\" Read more 67 customers mention \"Beauty\" 63 positive 4 negative Customers find the dress beautiful, describing it as feminine and expensive-looking. \" Beautiful dress , great for the holidays\" Read more \"...I purchased a dusty blue, and it is beautiful and subtle....\" Read more \" Beautiful sweater dress . The fabric is thick feels nice and high quality. Definitely not see through....\" Read more \"...It doesn’t show too much cleavage but still sexy . Yes, you can wear it to church or work. It’s beautiful with enough stretch!\" Read more 48 customers mention \"Flattering\" 44 positive 4 negative Customers find the dress flattering, with individual reviews noting how it accentuates the waist and hugs curves in the right places. \"This dress is so simple but so cute! Very comfy and flattering . I will likely hang to dry so it doesn’t shrink at all. It fits perfect right now!\" Read more \"This dress was very cute, fit well and was very flattering . It appeared well made, but was way too long - hit lower calf on me....\" Read more \" So flattering and very good for the office. Fits very nicely and is the perfect length\" Read more \"...And it us perfect, super flattering , the tie belt is everything.\" Read more 39 customers mention \"Comfort\" 39 positive 0 negative Customers find the dress comfortable and cozy. \"...One of the best things about this dress is how comfortable it is. The knit material feels soft against the skin, making it ideal for all-day wear....\" Read more \"... Very comfortable and very flattering to my body shape. I'm going to get it in more colors. Can't wait to wear this when it gets a little cooler.\" Read more \"Very stretchy and comfy and quality was great! 100% buying this brand again....\" Read more \"Make sure one size down! It’s super comfortable and color looks so pretty! It doesn’t see through! It’s so stretchiness ❤️\" Read more 37 customers mention \"Color\" 33 positive 4 negative Customers love the color of the dress, describing it as very pretty, with one customer mentioning they buy all the colors available. \"This dress is a beautiful color and the fit was perfect. I received so many compliments on my dress....\" Read more \" Love the color and goes well with my curves\" Read more \"Beauty sweater dress. Love. Love, loved this dress. Prefect size and color \" Read more \"...The material thickness was good and the red color was vibrant \" Read more 26 customers mention \"Material thickness\" 22 positive 4 negative Customers like the dress's material thickness, finding it neither too thick nor too thin. \"Very stylish sweater dress. Great fit, can't see thru the color. Nice & thick . Great price & value!! Love it!! The belt is a great touch!\" Read more \"This dress is very flattering. The material is thick . I love the length and that it is lightly snug at the bottom....\" Read more \"...The fabric is thick and stretchy and not super cheap....\" Read more \"Material is good for fall even winter. Thick sweater material . Stretch fit, and flattering. I work this for a gender reveal it turned out cute\" Read more 25 customers mention \"Fabric quality\" 23 positive 2 negative Customers love the fabric of the dress, describing it as nice and amazing, with one customer noting it's suitable for fall and even winter wear. \"I got so many compliments on the color, style and material ...I keep telling people that I bought it through this company on Amazon and they said...\" Read more \"This dress is quality material and design. I got this for my baby shower and its so flattering....\" Read more \"Great dress bought it in 4 colors , beautifully made , great material … loved the dress\" Read more \"I absolutely love it! The fit is awesome! The fabric is amazing !! Highly recommend!\" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars ZESICA does it again!",
        "body": "First of all let me say that I love the ZESICA brand of dresses. The quality is great! This dress is so shape complimenting. It's curve hugging, but not to tight. The weight of the fabric is perfect. The attacked belt can accentuate and camouflage the waist. It is a very soft shape of pink. Would look good on just about every skin tone. I purchased it in the pink first. I am not a true pink girl, but I am sold on this shade of pink. I received a lot of compliments when I wore the dress. I purchased it in the peacock as well, and received even more compliments. I love this dress. ZESICA does it again! Read more",
        "author": "Kim Rone",
        "rating": 5.0,
        "date": "October 17, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Wonderful dress! Size M",
        "body": "The media could not be loaded. This dress is the epitome of cozy chic! The ribbed knit gives it a subtle texture that elevates it from basic to stylish, and the cream color is versatile enough to pair with just about anything. The long sleeves make it perfect for cooler weather, and the matching fabric belt cinches at the waist for a flattering silhouette. One of the best things about this dress is how comfortable it is. The knit material feels soft against the skin, making it ideal for all-day wear. Whether you're running errands or meeting friends for brunch, you'll feel both comfortable and put-together. Overall, this dress is a great addition to any wardrobe, offering both style and comfort in one versatile piece. Read more",
        "author": "Maryia Cuzimencov",
        "rating": 5.0,
        "date": "October 28, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/816Yk9YFNYL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/81Ss0t0q94L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Very flattering and comfortable",
        "body": "Overall great fit. Loved the material/stretchiness of this dress. Length was perfect and v-neck not too low. I'm approx 115lbs. Size 34a bust, 5'5\" height in a size small. Read more",
        "author": "Dallas Peyton",
        "rating": 5.0,
        "date": "December 6, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/81ek43DHjYL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "4.0 out of 5 stars Hourglass figures-amazing!",
        "body": "This is a beautiful fall dress! Fits exactly as shown. Color is exactly as shown, the dusty blue is very flattering and lovely. It does hug the body but not tight. I bought the xl knowing the large would be snug. I love it. Sleeves are very long is my only complaint. Read more",
        "author": "BP Mcpherson",
        "rating": 4.0,
        "date": "October 2, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Stretchy, curvy and comfy",
        "body": "Love, love, love! This dress feels so soft and comfortable. I am 5’5” and 148 lbs for reference. I bought a medium. The fabric is lightweight and not see-through. The length is perfect, right under the knees. It is very stretchy, so if you want to size down, I say go ahead. I could have sized down to a small, but I don’t like it when dresses feel tight on my arms. You can wear it for the office or for a date night. I think it would look god with some nice heels, but if you’re a flats kind of gal, I think it would look good too. Read more",
        "author": "Robely Cespedes",
        "rating": 5.0,
        "date": "September 28, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71z2kibq7rL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars J. Brown",
        "body": "The dress was of good quality and a perfect fit. Read more",
        "author": "Barbara Milton",
        "rating": 5.0,
        "date": "December 3, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Absolutely perfect sweater dress - lovely quality",
        "body": "I am so happy with this dress! Have lost a lot of weight this year and have dreamt of being in a sweater dress again for the holidays. I was a little nervous ordering this but it looks amazing on my new body. I chose the Navy in an XL. I wear a 16 now and am still losing weight so it'll be fine even when I'm a 14 or 12. I am about 5' 9\" and the length is great. I'll add that the quality is much better than expected. Read more",
        "author": "Stella",
        "rating": 5.0,
        "date": "December 17, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Just Not Proportioned!",
        "body": "Unfortunately, this dress was immediately returned. I wear a size 14 so I purchased a large. Even if I had purchased an extra-large, I doubt if this dress would be a good fit. My measurements are 40 - 33- 43. I am five feet eight inches tall. I weigh 180 pounds. The dress was too tight on my slender arms. The dress looked awkward because the tie is about four inches above my natural waistline. The material thickness was good and the red color was vibrant Read more",
        "author": "Shvonne",
        "rating": 3.0,
        "date": "September 11, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Long Sleeve V Neck Bodycon is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.",
  "about_this_item": "Womens Maxi Dress Long Sleeve V Neck Bodycon is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.",
  "long_description": "Womens Maxi Dress Long Sleeve V Neck Bodycon is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Darkgreen, Red, Redbrown, Navy, Khaki, Pink, White, Apricot, Black, Dustyblue, Darkviolet, Armygreen. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Long Sleeve V Neck Bodycon is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Darkgreen, Red, Redbrown, Navy, Khaki, Pink, White, Apricot, Black, Dustyblue, Darkviolet, Armygreen. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "6936770c-a988-4dce-a448-425ac8d96010",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6936770c-a988-4dce-a448-425ac8d96010/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6936770c-a988-4dce-a448-425ac8d96010/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "27302030-3f49-4d73-9a7d-0f903ab10891",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/27302030-3f49-4d73-9a7d-0f903ab10891/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/27302030-3f49-4d73-9a7d-0f903ab10891/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "e70bdd2d-aabb-4c4d-afe7-bfe0d33edbd4",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e70bdd2d-aabb-4c4d-afe7-bfe0d33edbd4/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e70bdd2d-aabb-4c4d-afe7-bfe0d33edbd4/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "332085ca-ba36-4b8f-a881-1721d34bf995",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/332085ca-ba36-4b8f-a881-1721d34bf995/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/332085ca-ba36-4b8f-a881-1721d34bf995/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "b98d6c4f-c8b6-4273-b9a9-e8a553999178",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b98d6c4f-c8b6-4273-b9a9-e8a553999178/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b98d6c4f-c8b6-4273-b9a9-e8a553999178/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "d2230968-8251-498f-902a-0837bdab04cc",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d2230968-8251-498f-902a-0837bdab04cc/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d2230968-8251-498f-902a-0837bdab04cc/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "e96342b3-6bc1-4c02-8aba-fa62f64fd53d",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e96342b3-6bc1-4c02-8aba-fa62f64fd53d/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e96342b3-6bc1-4c02-8aba-fa62f64fd53d/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "f45204f4-c6d0-4eb2-a5e5-da048dc25b2d",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f45204f4-c6d0-4eb2-a5e5-da048dc25b2d/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f45204f4-c6d0-4eb2-a5e5-da048dc25b2d/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "db638238-60b6-47d2-8c73-9c832e6cb21f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/db638238-60b6-47d2-8c73-9c832e6cb21f/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/db638238-60b6-47d2-8c73-9c832e6cb21f/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "0f528d61-bdea-4667-bed3-c221b0f49b20",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0f528d61-bdea-4667-bed3-c221b0f49b20/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0f528d61-bdea-4667-bed3-c221b0f49b20/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "f11b8cbb-b8ad-4c62-8bd0-f65d9e9464d8",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f11b8cbb-b8ad-4c62-8bd0-f65d9e9464d8/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f11b8cbb-b8ad-4c62-8bd0-f65d9e9464d8/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "7b226ba2-bb1f-445d-bba1-d65da8da3841",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7b226ba2-bb1f-445d-bba1-d65da8da3841/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7b226ba2-bb1f-445d-bba1-d65da8da3841/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Darkgreen": "https://m.media-amazon.com/images/I/318k1q25kIL._AC_SR38,50_.jpg",
    "Red": "https://m.media-amazon.com/images/I/31QGBd-90+L._AC_SR38,50_.jpg",
    "Redbrown": "https://m.media-amazon.com/images/I/31FVTzUsYIL._AC_SR38,50_.jpg",
    "Navy": "https://m.media-amazon.com/images/I/31GGGZ2peSL._AC_SR38,50_.jpg",
    "Khaki": "https://m.media-amazon.com/images/I/31BLVQOyoJL._AC_SR38,50_.jpg",
    "Pink": "https://m.media-amazon.com/images/I/314p6CzVwhL._AC_SR38,50_.jpg",
    "White": "https://m.media-amazon.com/images/I/31W67h1ZW2L._AC_SR38,50_.jpg",
    "Apricot": "https://m.media-amazon.com/images/I/31pyN2arsKL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31O+LnBT6FL._AC_SR38,50_.jpg",
    "Dustyblue": "https://m.media-amazon.com/images/I/31P+LFjXiKL._AC_SR38,50_.jpg",
    "Darkviolet": "https://m.media-amazon.com/images/I/31ctFcKmTDL._AC_SR38,50_.jpg",
    "Armygreen": "https://m.media-amazon.com/images/I/31c9uIwlV3L._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Darkgreen": "61kXjkw6NkL",
    "Red": "61Zq8g-redL",
    "Redbrown": "61VhYxdT2yL",
    "Navy": "61kElvFd3zL",
    "Khaki": "619+pSeBMJL",
    "Pink": "612fpmtKHhL",
    "White": "610a8gGvJML",
    "Apricot": "61QbwpUJEwL",
    "Black": "61ghGrkeZmL",
    "Dustyblue": "61M27yaAQaL",
    "Darkviolet": "61zKUXpamEL",
    "Armygreen": "61NNEyqAKhL"
  },
  "color_images": {
    "Darkgreen": [
      "https://m.media-amazon.com/images/I/61kXjkw6NkL._SL1500_.jpg"
    ],
    "Red": [
      "https://m.media-amazon.com/images/I/61Zq8g-redL._SL1500_.jpg"
    ],
    "Redbrown": [
      "https://m.media-amazon.com/images/I/61VhYxdT2yL._SL1500_.jpg"
    ],
    "Navy": [
      "https://m.media-amazon.com/images/I/61kElvFd3zL._SL1500_.jpg"
    ],
    "Khaki": [
      "https://m.media-amazon.com/images/I/619+pSeBMJL._SL1500_.jpg"
    ],
    "Pink": [
      "https://m.media-amazon.com/images/I/612fpmtKHhL._SL1500_.jpg"
    ],
    "White": [
      "https://m.media-amazon.com/images/I/610a8gGvJML._SL1500_.jpg"
    ],
    "Apricot": [
      "https://m.media-amazon.com/images/I/61QbwpUJEwL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/61ghGrkeZmL._SL1500_.jpg"
    ],
    "Dustyblue": [
      "https://m.media-amazon.com/images/I/61M27yaAQaL._SL1500_.jpg"
    ],
    "Darkviolet": [
      "https://m.media-amazon.com/images/I/61zKUXpamEL._SL1500_.jpg"
    ],
    "Armygreen": [
      "https://m.media-amazon.com/images/I/61NNEyqAKhL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-long-sleeve-formal-cocktail",
      "title": "Womens Maxi Dress Long Sleeve Formal Cocktail",
      "price": 48.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61W9LD7yFrL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-ruched-mermaid-one-shoulder-formal",
      "title": "Womens Maxi Dress Maxi Ruched Mermaid One Shoulder Formal",
      "price": 84.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51dhGTr8JuL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-sleeveless-bodycon-cocktail",
      "title": "Womens Dress Sleeveless Bodycon Cocktail",
      "price": 56.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61YgtRC0RkL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-bodycon-long-sleeve",
      "title": "Womens Maxi Dress Cocktail Bodycon Long Sleeve",
      "price": 36.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51d0VG13YRL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi",
      "title": "Womens Maxi Dress Maxi",
      "price": 14.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/916xbNjj9rL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress-mermaid-evening-one-shoulder",
      "title": "Womens Dress Mermaid Evening One Shoulder",
      "price": 79.97,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/51Zg57lcGTL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-ruched-bodycon-cocktail",
      "title": "Womens Maxi Dress Long Sleeve Ruched Bodycon Cocktail",
      "price": 29.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61a1SNbl57L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 159.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/81dEbovGxbL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-v-neck-evening",
      "title": "Womens Maxi Dress Long Sleeve V Neck Evening",
      "price": 69.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61Vbv66FjRL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-one-shoulder",
      "title": "Womens Maxi Dress Long Sleeve One Shoulder",
      "price": 36.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/61ZXvYFT8KL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi",
      "title": "Womens Maxi Dress Maxi",
      "price": 31.49,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61M8EyTsFFL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-maxi-cocktail-mermaid-evening",
      "title": "Womens Maxi Dress Formal Maxi Cocktail Mermaid Evening",
      "price": 55.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51xwRNp-naL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-long-sleeve",
      "title": "Womens Maxi Dress Bodycon Long Sleeve",
      "price": 11.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71M2aqj8NxL._SL1500_.jpg"
      ]
    }
  ]
}