{
  "id": "womens-maxi-dress-short-sleeve-maxi",
  "handle": "womens-maxi-dress-short-sleeve-maxi",
  "sku": "JC2180",
  "asin": "B0C4Y2789L",
  "title": "Womens Maxi Dress Short Sleeve Maxi",
  "title_original": "OUGES Women's Long/Short Sleeve V-Neck Wrap Waist Maxi Dress",
  "brand": "Visit the OUGES Store",
  "price": 63.99,
  "social_proof": {
    "bought_past_month": 494,
    "text": "494+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/51pU-JcR5ML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81VIEZmmzAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81WV-JE59qL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61eSo-5CR4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61aFermJDfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71VY1lXhvOL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71tRJA8b7LL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/512-fi5h2JL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/515qaV-OMuL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/6188CUGeRIL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51OuhJE49ML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61HAgYM1tDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61HvpF8S-FL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61HbejB3p5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51fg7rRoBzL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51xiUZ2d2HL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/51pU-JcR5ML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81VIEZmmzAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81WV-JE59qL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61eSo-5CR4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61aFermJDfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71VY1lXhvOL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71tRJA8b7LL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/512-fi5h2JL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/515qaV-OMuL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/6188CUGeRIL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51OuhJE49ML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61HAgYM1tDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61HvpF8S-FL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61HbejB3p5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51fg7rRoBzL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51xiUZ2d2HL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Is Discontinued By Manufacturer ‏": "‎ No",
    "Product Dimensions ‏": "‎ 5 x 5 x 0.7 inches; 9.17 ounces",
    "Item model number ‏": "‎ OUGES OE309",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ June 1, 2018",
    "Manufacturer ‏": "‎ OUGES",
    "ASIN ‏": "‎ B07DGQ3JT5",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#33,464 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #77 in Women's Formal Dresses",
    "Customer Reviews": "4.3 4.3 out of 5 stars (9,927)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "G-velvet Green",
      "A-dark Rose",
      "A-black",
      "G-velvet Navy",
      "A-green",
      "A-wine",
      "G-velvet Wine Red",
      "A-navy",
      "G-velvet Black",
      "G-velvet Haze Blue"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.3,
    "count": 9927,
    "customers_say": "Customers find the dress comfortable, with one noting it hits the top of their feet, and appreciate its style and quality, particularly as a maternity dress. The fabric receives mixed feedback - while some find it soft and agreeable on the skin, others say it's very thin. The length is also mixed, with some finding it just right while others say it's too long. Customers like the dress's pockets. Select to learn more Fit Comfort Style Quality Soft fabric Pockets Length Fabric thickness 576 customers mention \"Fit\" 445 positive 131 negative Customers are satisfied with how the dress fits, noting that it accommodates their curves perfectly, with one customer mentioning it hits at the top of their feet. \"...Finally! Same great fit and comfort. It is warm and snuggly enough to use as a house dress yet presentable in public. It has pockets!...\" Read more \" Perfect fit (and I’m 5’1 So I have a hard time finding dresses that aren’t too long) I’m buying it in multiple colors now that I’ve worn it...\" Read more \"...You definitely get what you pay for, but it fits well and looks nice. I’m 5’6” and it hits me just at my ankles length wise. No complaints\" Read more \"...5’7” 138 lbs 34DD. The medium was huge. Very comfy but too large . I’m ordering another in a smaller size.\" Read more 393 customers mention \"Comfort\" 393 positive 0 negative Customers find the dress comfortable and cozy. \"Easy to put on and comfortable . Bonus that there are pockets. Flows nicely and has held up for two winter weddings and one other event. Washed easily.\" Read more \"I love this dress so much that I bought it in two colors! It's very comfortable and flattering in all the right places. The pockets are deep, too!\" Read more \"...I got a large, it was a little big in the shoulders and waist but comfy . I loved having pockets and worked well with carrying a 2 year old around....\" Read more \"...I ordered a medium. I got so many compliments and it was so comfortable !! I am buying another one in January for my baby shower! Can’t wait!...\" Read more 368 customers mention \"Style\" 347 positive 21 negative Customers like the style of the dress, finding it nice and feeling beautiful in it, with one customer noting it looks expensive. \"I got so many compliments on it! Its beautiful and comfortable I could totally wear it lounging around the house or dress it up to wear to a wedding!\" Read more \"Such a beautiful dress ! The color is rich, it’s comfortable, AND IT HAS POCKETS! I’m 5’8 and wore it when I was 25 weeks pregnant. Fit perfectly!\" Read more \"So, this is cute , but the material is incredibly thin. It is more like a nightgown thickness, and i would not wear it outside of the house....\" Read more \"...Nice velvet fabric. Worked beautifully as a maternity dress but it’s so pretty and flexible I can keep it as a normal dress after I’m back to normal...\" Read more 357 customers mention \"Quality\" 333 positive 24 negative Customers find the dress to be of good quality, with one customer specifically noting that the sleeves and top are great. \" Great dress , pretty color however, This was too short on me in the small. I’m 5’8. In the medium the length was right but then too big in the chest.\" Read more \" Love this dress , love the color. Fits long but I’m only 5’3” so that’s always expected....\" Read more \" Nice dress however the dress was just long enough for me but too big in the chest area. Ended up returning it. I’m 5’8.5”, 34D, and 180lbs....\" Read more \"I loved the fit of the dress! Great quality do wish the length was just a tad bit longer for heels but it worked perfect with flats\" Read more 179 customers mention \"Soft fabric\" 171 positive 8 negative Customers appreciate the soft fabric of the dress, describing it as nice velvet and comfortable against the skin, with one customer noting how the bottom half nicely blankets their cushioning. \"...The material is nice, it's soft and not see through. I wore this to a winter wedding and got a ton of compliments. I would definitley recommend this!\" Read more \" Very soft , comfortable material. very pretty shade of green. It is flattering to my body type. Very long. I'm 5'7 and i wore it with 6 inch heels....\" Read more \"...The material is soft and just the right thickness where it is not thin enough to see my under garments and not too heavy where I will be hot wearing...\" Read more \"This dress is wonderful! Beautiful color , super soft and made well. Fits perfect. I’m 5’4” 120lbs wear a small or 2-4 Fabric is nice quality....\" Read more 155 customers mention \"Pockets\" 140 positive 15 negative Customers love the dress's pockets, with one mentioning they are located along the side seams. \"...It fits so perfect, it’s comfy, quality material and it has pockets ! The color I bought (emerald green) was actually emerald green, not a shade off!...\" Read more \"Such a beautiful dress! The color is rich, it’s comfortable, AND IT HAS POCKETS ! I’m 5’8 and wore it when I was 25 weeks pregnant. Fit perfectly!\" Read more \"Great fall dress. Paired with a short jacket or by itself. Love the pockets . I'm 5'7, 140-148 lbs, 34C bust. Purchased size Med. Length at ankles....\" Read more \"Easy to put on and comfortable. Bonus that there are pockets . Flows nicely and has held up for two winter weddings and one other event. Washed easily.\" Read more 264 customers mention \"Length\" 137 positive 127 negative Customers have mixed opinions about the dress's length, with some finding it great and right at floor length, while others mention it runs a bit long and isn't suitable for tall people. \"I loved the dress. I'm 5:8, 255 lb. Fit like a glove. The length was perfect . I also loved the material. Really soft and confortable.\" Read more \"I thought this dress was SO cute but definitely too short ....\" Read more \"...I would absolutely buy other colors! It's super comfy and the perfect length . I worried that the sleeves might be baggy but they were perfect!...\" Read more \"The dress I got was very different than the one I ordered....and was VERY long . Didn't look like the picture at all.\" Read more 232 customers mention \"Fabric thickness\" 115 positive 117 negative Customers have mixed opinions about the dress's fabric thickness, with some finding it nice and forgiving, while others describe it as very thin, similar to a t-shirt. \"...The butt was really thin...Not see through, but thin material That's clingy in the back, so you're going to need Spanx or something. ***...\" Read more \"Perfect fit and length! ( I’m 5’11.) I love that it has pockets and great material ,\" Read more \"I really like the design but the quality of the fabric and bad. It’s very thin and flimsy and I don’t expect it to last the season.\" Read more \"Great dress! Very comfortable and not too heavy. Fabric is thin and light. Breastfeeding appropriate dress...\" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Perfect Christmas Dress",
        "body": "I wasn't sure what to expect with the velvet wine option. I was looking for an adorable and good quality velvet dress. There weren't very many reviews for this dress specifically, most of the reviews were for the other fabric type, so I was crossing my fingers. I am pleased to say this dress is exactly what I was looking for. The velvet material feels great, the quality and thickness are exactly what I would except a velvet material to be. It's shiny and soft. The dress fits true to size. I'm 5'3\" and125 lbs. Also, an added bonus, it DOES have pockets. I was trying to see if any of the other dresses had pockets on the reviews and I couldn't figure out if it would come with them or not. If you're on the fence about getting this dress, just do it! You won't regret it! Read more",
        "author": "TylerCrazyFace",
        "rating": 5.0,
        "date": "December 18, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71sOxADmSqL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/61h9vC1ruAL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71EQvjeSVCL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71mvaWh6BEL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71NYCWauLFL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Best dress ever",
        "body": "Absolutely one of the flattering dresses ever. I had so many complements on it. Definitely looks very high end & extremely comfortable. Love this dress. Read more",
        "author": "April L Cooper",
        "rating": 5.0,
        "date": "December 17, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Comfortable Fit, a bit long for a short girl, not awful",
        "body": "This is a super cute and comfy dress. I’m 5’2” and this hits the floor in bare feet. I can walk without tripping, but I do have to hold it up to go upstairs and not step on it. I wore it with heeled mules and it worked great without length issues. I loved the v-neck because it covered things nicely. I’m a 34D and I didn’t feel like I was spilling out, but I did show cleavage. I loved the pockets, but it did add bulk in the hip area. It could have been cut on the bottom with a little flare band that would have solved the problem. Instead it was cut straight down so it almost weirdly tapered at the bottom. I gave it a good stretch along the bottom and it was better, but it would have been a better design cut differently. It wasn’t enough to be super noticeable, I’m just aware of the hip area in everything I wear. Read more",
        "author": "Fancy Face",
        "rating": 4.0,
        "date": "December 22, 2020",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars ⭐️⭐️⭐️⭐️⭐️ Elegant, Comfortable, and Absolutely Stunning",
        "body": "The media could not be loaded. I wore this navy dress to an evening wedding and received compliments all night long. The design is simple, but that’s what makes it so timeless — it doesn’t try too hard, yet it makes such a statement. The deep navy color looked beautiful under both natural light outdoors and the softer lighting inside the reception. What I really loved was the fit. It hugged in the right places without being restrictive, and the fabric had enough give to move, dance, and sit comfortably through the entire evening. It felt elegant and sophisticated, but I never once felt overdressed or uncomfortable. This is one of those dresses you can pull out for any special occasion and feel instantly confident in. It’s understated, yet absolutely stunning. Read more",
        "author": "Bookmarked Reflections",
        "rating": 5.0,
        "date": "August 26, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71eWHHEJylL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/61VhDYX8+2L._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71TwfGLTzjL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/81Yih1ruOLL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "3.0 out of 5 stars Flattering but poor quality.",
        "body": "The fit is flattering but the quality is not great. Fabric is very thin. I do like the pockets. This is nice to use as a house dress. Read more",
        "author": "crazyrunningmom",
        "rating": 3.0,
        "date": "October 15, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Love these dresses",
        "body": "Very comfortable for wearing out or lounging in the house. Great colors.. I have ordered these dresses multiple times because I love them so much. The fit is true, the material is soft and light but not see-through and is of decent quality and stretches so even if you ate a little too much at that dinner out you will still be comfortable Read more",
        "author": "Kimberly Gipson",
        "rating": 5.0,
        "date": "July 1, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Love at first fit!!",
        "body": "I absolutely love This dress. I got so many compliments! And the fit is amazing Read more",
        "author": "Deborah Luedtke",
        "rating": 5.0,
        "date": "November 29, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Would recommend but black dye stained my skin",
        "body": "First just want to warn of dye transfer- it’s 3 days later and I’m still scrubbing off the dye that stained my skin. lol. I also would wash this completely alone or only with the same colored clothing. I definitely recommend sizing up because of the band below the chest if you have a larger chest size. I didn’t have enough time to exchange before the wedding and I made do. Just had to adjust a lot but was comfortable. I got a lot of compliments and it kept me warm when we were outside for the ceremony but didn’t suffocate me during the reception! It’s great for formal weddings because it looks formal but is super comfy. The material is beautiful and didn’t feel scratchy. Again only downside is the dye transfer Read more",
        "author": "Ivy c",
        "rating": 4.0,
        "date": "November 25, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Short Sleeve Maxi is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.",
  "about_this_item": "Womens Maxi Dress Short Sleeve Maxi is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.",
  "long_description": "Womens Maxi Dress Short Sleeve Maxi is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: G-velvet Green, A-dark Rose, A-black, G-velvet Navy, A-green, A-wine, G-velvet Wine Red, A-navy, G-velvet Black, G-velvet Haze Blue. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Short Sleeve Maxi is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: G-velvet Green, A-dark Rose, A-black, G-velvet Navy, A-green, A-wine, G-velvet Wine Red, A-navy, G-velvet Black, G-velvet Haze Blue. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "ae24f460-a0d7-4268-b27a-0012e7ac235f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ae24f460-a0d7-4268-b27a-0012e7ac235f/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ae24f460-a0d7-4268-b27a-0012e7ac235f/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/a1581a62-affb-48f7-b9ac-364df0354593.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "808ead2c-2ca0-4188-9101-395aca9f63ce",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/808ead2c-2ca0-4188-9101-395aca9f63ce/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/808ead2c-2ca0-4188-9101-395aca9f63ce/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/a1581a62-affb-48f7-b9ac-364df0354593.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "01efbbc1-905e-48f0-9400-c86bdae26814",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/01efbbc1-905e-48f0-9400-c86bdae26814/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/01efbbc1-905e-48f0-9400-c86bdae26814/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/a1581a62-affb-48f7-b9ac-364df0354593.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "40681962-db98-4f38-a76f-cf1b1ac4b5f4",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/40681962-db98-4f38-a76f-cf1b1ac4b5f4/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/40681962-db98-4f38-a76f-cf1b1ac4b5f4/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/a1581a62-affb-48f7-b9ac-364df0354593.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "3da929ab-23b7-4b6c-a7f8-7db5d6bcc94a",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3da929ab-23b7-4b6c-a7f8-7db5d6bcc94a/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3da929ab-23b7-4b6c-a7f8-7db5d6bcc94a/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/a1581a62-affb-48f7-b9ac-364df0354593.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "2c3da212-e595-4980-8900-eed4c02cbc04",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2c3da212-e595-4980-8900-eed4c02cbc04/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2c3da212-e595-4980-8900-eed4c02cbc04/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/a1581a62-affb-48f7-b9ac-364df0354593.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "39c6ac3a-fe9c-4d22-a303-e3d8f5ee9367",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/39c6ac3a-fe9c-4d22-a303-e3d8f5ee9367/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/39c6ac3a-fe9c-4d22-a303-e3d8f5ee9367/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/a1581a62-affb-48f7-b9ac-364df0354593.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "3d76ddf1-2bf4-4074-a00f-f2701ac425ec",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3d76ddf1-2bf4-4074-a00f-f2701ac425ec/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3d76ddf1-2bf4-4074-a00f-f2701ac425ec/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/a1581a62-affb-48f7-b9ac-364df0354593.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "4b43e1be-d35f-440e-91a5-49cef23a3276",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4b43e1be-d35f-440e-91a5-49cef23a3276/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4b43e1be-d35f-440e-91a5-49cef23a3276/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/a1581a62-affb-48f7-b9ac-364df0354593.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "beeae593-ab5a-43c4-a310-f28f678edc63",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/beeae593-ab5a-43c4-a310-f28f678edc63/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/beeae593-ab5a-43c4-a310-f28f678edc63/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/a1581a62-affb-48f7-b9ac-364df0354593.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "fb2e9244-9151-4586-af83-a37bf2cdd690",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/fb2e9244-9151-4586-af83-a37bf2cdd690/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/fb2e9244-9151-4586-af83-a37bf2cdd690/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/a1581a62-affb-48f7-b9ac-364df0354593.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "445ce9da-c475-4a74-80a7-7f90696003e7",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/445ce9da-c475-4a74-80a7-7f90696003e7/videopreview.jobtemplate.mp4.342X192P_20HZ_350KBPS_VER_1_0.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/445ce9da-c475-4a74-80a7-7f90696003e7/videopreview.jobtemplate.mp4.342X192P_20HZ_350KBPS_VER_1_0.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/a1581a62-affb-48f7-b9ac-364df0354593.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "G-velvet Green": "https://m.media-amazon.com/images/I/31BgUBP5qyL._AC_SR38,50_.jpg",
    "A-dark Rose": "https://m.media-amazon.com/images/I/31S0xtjZDHL._AC_SR38,50_.jpg",
    "A-black": "https://m.media-amazon.com/images/I/31JS+RWtevL._AC_SR38,50_.jpg",
    "G-velvet Navy": "https://m.media-amazon.com/images/I/31DPQwfsBLL._AC_SR38,50_.jpg",
    "A-green": "https://m.media-amazon.com/images/I/31w8Rp3OQJL._AC_SR38,50_.jpg",
    "A-wine": "https://m.media-amazon.com/images/I/31PCLjl2FnL._AC_SR38,50_.jpg",
    "G-velvet Wine Red": "https://m.media-amazon.com/images/I/318Xn618JEL._AC_SR38,50_.jpg",
    "A-navy": "https://m.media-amazon.com/images/I/31a41hHfBsL._AC_SR38,50_.jpg",
    "G-velvet Black": "https://m.media-amazon.com/images/I/31lciITowfL._AC_SR38,50_.jpg",
    "G-velvet Haze Blue": "https://m.media-amazon.com/images/I/31fmnAAbBlL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "G-velvet Green": "512-fi5h2JL",
    "A-dark Rose": "515qaV-OMuL",
    "A-black": "6188CUGeRIL",
    "G-velvet Navy": "51OuhJE49ML",
    "A-green": "61HAgYM1tDL",
    "A-wine": "61HvpF8S-FL",
    "G-velvet Wine Red": "51pU-JcR5ML",
    "A-navy": "61HbejB3p5L",
    "G-velvet Black": "51fg7rRoBzL",
    "G-velvet Haze Blue": "51xiUZ2d2HL"
  },
  "color_images": {
    "G-velvet Green": [
      "https://m.media-amazon.com/images/I/512-fi5h2JL._SL1500_.jpg"
    ],
    "A-dark Rose": [
      "https://m.media-amazon.com/images/I/515qaV-OMuL._SL1500_.jpg"
    ],
    "A-black": [
      "https://m.media-amazon.com/images/I/6188CUGeRIL._SL1500_.jpg"
    ],
    "G-velvet Navy": [
      "https://m.media-amazon.com/images/I/51OuhJE49ML._SL1500_.jpg"
    ],
    "A-green": [
      "https://m.media-amazon.com/images/I/61HAgYM1tDL._SL1500_.jpg"
    ],
    "A-wine": [
      "https://m.media-amazon.com/images/I/61HvpF8S-FL._SL1500_.jpg"
    ],
    "G-velvet Wine Red": [
      "https://m.media-amazon.com/images/I/51pU-JcR5ML._SL1500_.jpg"
    ],
    "A-navy": [
      "https://m.media-amazon.com/images/I/61HbejB3p5L._SL1500_.jpg"
    ],
    "G-velvet Black": [
      "https://m.media-amazon.com/images/I/51fg7rRoBzL._SL1500_.jpg"
    ],
    "G-velvet Haze Blue": [
      "https://m.media-amazon.com/images/I/51xiUZ2d2HL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-evening-formal-short-sleeve-cocktail-v-neck-maxi",
      "title": "Womens Maxi Dress Evening Formal Short Sleeve Cocktail V Neck Maxi",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61AaE2eUMIL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-v-neck-cocktail-short-sleeve",
      "title": "Womens Dress V Neck Cocktail Short Sleeve",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/711HWxZc3XL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-sleeveless-long-sleeve",
      "title": "Womens Maxi Dress Sleeveless Long Sleeve",
      "price": 58.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/815j-UbhFuL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-v-neck-long-sleeve-mermaid",
      "title": "Womens Maxi Dress V Neck Long Sleeve Mermaid",
      "price": 119.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51Is1P26ZtL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-formal-maxi-bodycon",
      "title": "Womens Maxi Dress Cocktail Formal Maxi Bodycon",
      "price": 44.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/51vt49ix1lL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress-sleeveless-ruched-boat-neck",
      "title": "Womens Dress Sleeveless Ruched Boat Neck",
      "price": 24.29,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51iPeZV6KDL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-bodycon-cocktail",
      "title": "Womens Dress Bodycon Cocktail",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61HFhbQgC2L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-short-sleeve",
      "title": "Womens Dress Short Sleeve",
      "price": 36.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71mJpfJK2VL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 63.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/81lblJbx42L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-maxi-cocktail",
      "title": "Womens Maxi Dress Long Sleeve Maxi Cocktail",
      "price": 62.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71u2Xray0mL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-v-neck-long-sleeve-maxi",
      "title": "Womens Maxi Dress V Neck Long Sleeve Maxi",
      "price": 29.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/716Rhy3XMjL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 44.29,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/612i75s-RUL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-mermaid",
      "title": "Womens Dress Mermaid",
      "price": 239.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61lZaNp9s1L._SL1500_.jpg"
      ]
    }
  ]
}