{
  "id": "womens-maxi-dress-formal-maxi",
  "handle": "womens-maxi-dress-formal-maxi",
  "sku": "JC2753",
  "asin": "B0C5WZLY1Y",
  "title": "Womens Maxi Dress Formal Maxi",
  "title_original": "Velvet Infinity Dress with Bandeau, Convertible Bridesmaid Dresses, Multiway Wrap Maxi Long Formal Wedding Guest Dress",
  "brand": "Visit the 72styles Store",
  "price": 64.99,
  "social_proof": {
    "bought_past_month": 1260,
    "text": "1260+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/61RWPo72AmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61hRN2n7JHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Fs7Av9GyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81q6a9ilT6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71X15iAdlSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61nd0JRk-aL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/617xsRYow4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ue7l61StL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51ElSswsvaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61UvnoFVpFL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/61RWPo72AmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61hRN2n7JHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Fs7Av9GyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81q6a9ilT6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71X15iAdlSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61nd0JRk-aL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/617xsRYow4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ue7l61StL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51ElSswsvaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61UvnoFVpFL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Date First Available ‏": "‎ May 22, 2023",
    "ASIN ‏": "‎ B0C5WXDWDK",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#81,987 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #1,934 in Women's Dresses",
    "Customer Reviews": "4.2 4.2 out of 5 stars (387)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Gold",
      "Burgundy",
      "Royal Blue",
      "Black",
      "Orange",
      "Green"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.2,
    "count": 387,
    "customers_say": "Customers find the dress visually appealing, with one noting it's designed to flatter various body types, and appreciate its versatility as it can be worn in multiple ways. Moreover, the dress fits well, being long enough to accommodate heels, and customers praise its quality, with one mentioning it feels like a more expensive piece. Additionally, the fabric receives positive feedback for its softness and comfort. However, opinions about the color are mixed, with some loving it while others find it bad. Select to learn more Look Fit Quality Versatility Fabric quality Comfort Softness Color 55 customers mention \"Look\" 50 positive 5 negative Customers find the dress pretty and well-made, with one mentioning it is designed to flatter any body type. \" Beautiful dress my daughter wore as a bridesmaid. Can be worn many ways and each bridesmaid chose how she wanted to wear this....\" Read more \"...for bridesmaids dresses for a late September wedding, they were beautiful ! Size small will work for a wide variety of body types and sizes....\" Read more \" Cute , good quality, lacking instructions...\" Read more \" Absolutely beautiful & versatile!...\" Read more 38 customers mention \"Fit\" 27 positive 11 negative Customers are satisfied with how the dress fits, noting that it is true to size, has a perfect length, and is long enough to accommodate heels. \" Perfect fit . Gift to my granddaughter.\" Read more \"This dress fit fine I’m a bit busty so the plus size probably would have been a better choice....\" Read more \"...It was a tad bit short on me though since I am so tall.\" Read more \"...The abundance of material impressed me the most, ensuring a flattering fit and a great twirl on the dance floor....\" Read more 28 customers mention \"Quality\" 27 positive 1 negative Customers find the dress to be of great quality. \"This is a great dress . I can’t figure out how I want to wear it but it’s great. Just wish it had pockets\" Read more \"...I used it for a Baphomet Occult party and it was a hit. Great quality , lots of stretch and super gooey.\" Read more \" Lovely dress with so many styling possibilities. Check out the company website to find even more style options....\" Read more \" Nice dress but it came smelling like perfume\" Read more 24 customers mention \"Versatility\" 23 positive 1 negative Customers appreciate the dress's versatility, as it can be worn in multiple ways and offers various styling options. \"I love how versatile this dress is! I got it for a Halloween wedding with the intention of being able to wear it different ways at future events....\" Read more \"...And it truly is so versatile . It's pretty comfy, but in the way I had it, it would sometimes slip around, and I had to adjust throughout the night....\" Read more \"I absolutely Loved this versatile dress . It can be worn as the description shows. I received so many compliments on the cruise at Captains Dinner ....\" Read more \"This is a very versatile dress that you can wear many ways. The Peacock color was beautiful....\" Read more 21 customers mention \"Fabric quality\" 18 positive 3 negative Customers love the fabric of the dress, describing it as beautiful and noting that it has plenty of material. \"Very cute with quality fabric . Velvet truly stretched. Fits true to size....\" Read more \"...I purchased the green one size. I'm 5'4\" 140lbs. I love the feel of the fabric & stretchiness of it, too!...\" Read more \"Great concept, lovely fabric , bit really cheaply made, raw edges on the entirety of the top straps....\" Read more \"...It’s amazing. The quality is very good and the fabric is beautiful . I got the burgundy. Love the color....\" Read more 16 customers mention \"Comfort\" 16 positive 0 negative Customers find the dress comfortable, with one mentioning it's not itchy. \"This dress is so neat....a lot of different ways to wear it and it's comfortable ! I'd definitely buy it again and get it in another color too!\" Read more \"...The bandau that comes with it is nice and comfy and gives extra coverage and allows for more styles.\" Read more \"Perfect and very comfortable !...\" Read more \"...The material is super comfortable and thicker but it didn’t make me sweat!...\" Read more 14 customers mention \"Softness\" 14 positive 0 negative Customers find the dress soft and comfortable, with one customer describing it as smooth as silk. \" Soft yet thick material. Doesn't wrinkle much and wears comfortably\" Read more \"The quality and color is great. The fabric is thick and very soft . The straps are extremely long, so you are able to tie it multiple ways....\" Read more \"...Wedding I was in. All the colors were vibrant and the material is so soft . It was flattering for everyone since everyone got to pick their own shape....\" Read more \"...This dress is super stretchy, thick fabric, and feels really nice on !...\" Read more 19 customers mention \"Color\" 13 positive 6 negative Customers have mixed opinions about the dress's color, with some loving it while others find it bad. \"...It was easy to style and the color was vibrant . Again, I can’t tell you how many people stopped just to compliment the dress and ask where I got it....\" Read more \"...Many different ways to wear and looks good every way! The blue is stunning ! And soo soft\" Read more \" Not the color I was expecting \" Read more \"...The color is just as pictured ....\" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Versatile and elegant",
        "body": "Lovely dress with so many styling possibilities. Check out the company website to find even more style options. The included bandeau is so helpful in feeling confident that no mishaps will occur and blends in well with the dress itself. Chose a one shoulder option and wrapped around one crisscrossed bra strap. Despite a 1.5hr drive the style remained intact all night long! Read more",
        "author": "Heather",
        "rating": 5.0,
        "date": "December 15, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71yM1Y5mVBL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/61wE3MSJV3L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Beautiful",
        "body": "Purchased 3 of these for bridesmaids dresses for a late September wedding, they were beautiful! Size small will work for a wide variety of body types and sizes. We used for normal sizes 0, 2, and 8, they all fit well! The girls were happy they could fashion them in different styles. Read more",
        "author": "Customer",
        "rating": 5.0,
        "date": "December 22, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/51h3rqEY3KL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Its worth it!",
        "body": "Absolutely loved it! Many different ways to wear and looks good every way! The blue is stunning! And soo soft Read more",
        "author": "SLewis",
        "rating": 5.0,
        "date": "November 27, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Beautiful dress!",
        "body": "It’s a beautiful color and looks great on anyone! The length is really long on shorter girls so it will need to be hemmed! Read more",
        "author": "hannah",
        "rating": 4.0,
        "date": "December 19, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Perfect in every way!!!",
        "body": "Absolutely love this dress!!! Striking blue color, impressive fabric, & designed to make any body type look great. I am picky about quality & design, but would not hesitate to order again. A perfect bridal dress solution for all (& purchase is as easy as it gets without leaving home). Would give 10 stars if possible! Read more",
        "author": "Shopper Lady",
        "rating": 5.0,
        "date": "November 4, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "1.0 out of 5 stars Bad color, bad sewing, no instructions",
        "body": "Clearly got a return, zero original packaging or instructions and this company wants you to pay for instructions to their product? Ridiculous! What they provide for free is so blurry you have no idea what they’re trying to relay. Agree with another reviewer that you have to have a massive bust for this dress to look okay. The top part that you tie around you has zero finish to the edges so expect it to fray, and hard to hide the back side of the fabric when tying. I am 5’6” and to get the “skirt” to not drag behind me, I had to have it just below my breasts. “Gold” color is more doodoo-throwup brown than gold. Oh and it smells bad. Sigh. Not keeping this. Read more",
        "author": "Kate M.",
        "rating": 1.0,
        "date": "December 7, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71A7N7InGVL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/81B22pzndjL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71VD3uedA7L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Comfy & Versatile",
        "body": "I love how versatile this dress is! I got it for a Halloween wedding with the intention of being able to wear it different ways at future events. It’s flattering and very comfortable! It was the perfect length for me to wear with heels without needing to shorten it. I wish I’d taken a photo in just the dress so you could see how I wore the top, but alas I did not. Read more",
        "author": "Allison Guill",
        "rating": 5.0,
        "date": "November 17, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/81vzOKxk7aL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Beautiful and soft",
        "body": "This is a great dress. I can’t figure out how I want to wear it but it’s great. Just wish it had pockets Read more",
        "author": "Beneta F.",
        "rating": 5.0,
        "date": "December 4, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Formal Maxi is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.",
  "about_this_item": "Womens Maxi Dress Formal Maxi is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.",
  "long_description": "Womens Maxi Dress Formal Maxi is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Gold, Burgundy, Royal Blue, Black, Orange, Green. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Formal Maxi is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Gold, Burgundy, Royal Blue, Black, Orange, Green. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "3fa14f06-182a-4bf3-b9a3-bc016d09a8cf",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3fa14f06-182a-4bf3-b9a3-bc016d09a8cf/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3fa14f06-182a-4bf3-b9a3-bc016d09a8cf/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "7336f447-11c0-4307-ad75-8d85a372284a",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7336f447-11c0-4307-ad75-8d85a372284a/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7336f447-11c0-4307-ad75-8d85a372284a/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "5a22c952-b3b4-457c-94ef-f75713ef804d",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5a22c952-b3b4-457c-94ef-f75713ef804d/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5a22c952-b3b4-457c-94ef-f75713ef804d/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "3dedfd9a-4c85-4246-af3b-1e066808a6d9",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3dedfd9a-4c85-4246-af3b-1e066808a6d9/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3dedfd9a-4c85-4246-af3b-1e066808a6d9/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "affcd6ff-f198-4d95-a6dd-79eb2dfe4ddd",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/affcd6ff-f198-4d95-a6dd-79eb2dfe4ddd/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/affcd6ff-f198-4d95-a6dd-79eb2dfe4ddd/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "5c7954ca-3639-411c-acb5-e35480becba7",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5c7954ca-3639-411c-acb5-e35480becba7/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5c7954ca-3639-411c-acb5-e35480becba7/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "244cc544-a828-4058-9d44-c16792029d1f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/244cc544-a828-4058-9d44-c16792029d1f/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/244cc544-a828-4058-9d44-c16792029d1f/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "6b8ff2be-0a8c-4fc8-ace8-96485f2d6d50",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6b8ff2be-0a8c-4fc8-ace8-96485f2d6d50/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6b8ff2be-0a8c-4fc8-ace8-96485f2d6d50/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "71c59d45-48ca-4ca0-b170-b6ffcec0d8a0",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/71c59d45-48ca-4ca0-b170-b6ffcec0d8a0/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/71c59d45-48ca-4ca0-b170-b6ffcec0d8a0/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "052ea8f1-3e90-47f6-ab94-a9ed61dd0117",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/052ea8f1-3e90-47f6-ab94-a9ed61dd0117/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/052ea8f1-3e90-47f6-ab94-a9ed61dd0117/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "90325f88-9844-404f-9965-2c11537534b4",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/90325f88-9844-404f-9965-2c11537534b4/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/90325f88-9844-404f-9965-2c11537534b4/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "7e4f4303-461e-47df-ae51-21da2a30a55f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7e4f4303-461e-47df-ae51-21da2a30a55f/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7e4f4303-461e-47df-ae51-21da2a30a55f/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Gold": "https://m.media-amazon.com/images/I/41fpOFlB6tL._AC_SR38,50_.jpg",
    "Burgundy": "https://m.media-amazon.com/images/I/41uoapJuRXL._AC_SR38,50_.jpg",
    "Royal Blue": "https://m.media-amazon.com/images/I/41Z0UrIbzaL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/41qcuG2FquL._AC_SR38,50_.jpg",
    "Orange": "https://m.media-amazon.com/images/I/41sOzxntt7L._AC_SR38,50_.jpg",
    "Green": "https://m.media-amazon.com/images/I/419HUhN-G8L._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Gold": "61nd0JRk-aL",
    "Burgundy": "617xsRYow4L",
    "Royal Blue": "61ue7l61StL",
    "Black": "51ElSswsvaL",
    "Orange": "61UvnoFVpFL",
    "Green": "61RWPo72AmL"
  },
  "color_images": {
    "Gold": [
      "https://m.media-amazon.com/images/I/61nd0JRk-aL._SL1500_.jpg"
    ],
    "Burgundy": [
      "https://m.media-amazon.com/images/I/617xsRYow4L._SL1500_.jpg"
    ],
    "Royal Blue": [
      "https://m.media-amazon.com/images/I/61ue7l61StL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/51ElSswsvaL._SL1500_.jpg"
    ],
    "Orange": [
      "https://m.media-amazon.com/images/I/61UvnoFVpFL._SL1500_.jpg"
    ],
    "Green": [
      "https://m.media-amazon.com/images/I/61RWPo72AmL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-formal-evening-v-neck",
      "title": "Womens Maxi Dress Formal Evening V Neck",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71Rq2skdBFL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-v-neck-ruched",
      "title": "Womens Maxi Dress Long Sleeve V Neck Ruched",
      "price": 41.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/41nKZb3yrHL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/81VEy9ZQg3L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-long-sleeve",
      "title": "Womens Maxi Dress Maxi Long Sleeve",
      "price": 19.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51Jw+rC-oXL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 84.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/511SyyioxkL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 7.96,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/91sKNbZ1WFL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-bodycon",
      "title": "Womens Maxi Dress Long Sleeve Bodycon",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71vLdkRmE5L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-formal-cocktail",
      "title": "Womens Dress Formal Cocktail",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61tH755L2gL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-off-shoulder",
      "title": "Womens Dress Off Shoulder",
      "price": 38.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/81yHjkOLSmL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail-v-neck-bodycon",
      "title": "Womens Dress Cocktail V Neck Bodycon",
      "price": 19.95,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/611HBMEYCCL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi",
      "title": "Womens Maxi Dress Maxi",
      "price": 31.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61pjj-1NYOL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51+ZvnP0Z4L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-maxi",
      "title": "Womens Maxi Dress Long Sleeve Maxi",
      "price": 29.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/614-6WTFsKL._SL1500_.jpg"
      ]
    }
  ]
}