{
  "id": "womens-maxi-dress-maxi-cocktail",
  "handle": "womens-maxi-dress-maxi-cocktail",
  "sku": "JC3261",
  "asin": "B0C61TQ2CG",
  "title": "Womens Maxi Dress Maxi Cocktail",
  "title_original": "ZESICA Women's Velvet Maxi Dress Fall 2026 Long Puff Sleeve Crew Neck Elastic High Waist Cocktail Party Bridesmaid Dresses",
  "brand": "Visit the ZESICA Store",
  "price": 55.99,
  "social_proof": {
    "bought_past_month": 423,
    "text": "423+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/61QxSHdZWuL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71odmUZuviL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81wK+nCJmmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71hpxJcP07L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61BlmR8W9oL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81qzMqemS-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81qzdaceYiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71HgILsQD4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71twbvE1IDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71auw26aB7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71XFR7Xd8sL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71AnXSGmh7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71GXGCEOkqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71OyPFu6NZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71NWiUAm3yL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/716J684TTuL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/7188tpMjngL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71O-Wnas1DL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71jvkqpkGGL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/61QxSHdZWuL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71odmUZuviL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81wK+nCJmmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71hpxJcP07L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61BlmR8W9oL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81qzMqemS-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81qzdaceYiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71HgILsQD4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71twbvE1IDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71auw26aB7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71XFR7Xd8sL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71AnXSGmh7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71GXGCEOkqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71OyPFu6NZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71NWiUAm3yL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/716J684TTuL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/7188tpMjngL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71O-Wnas1DL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71jvkqpkGGL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ May 23, 2023",
    "ASIN ‏": "‎ B0D4B4CCJD",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#27,267 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #59 in Women's Formal Dresses #250 in Women's Cocktail Dresses",
    "Customer Reviews": "4.2 4.2 out of 5 stars (452)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Dark Green",
      "Navy",
      "Rose",
      "Mauve",
      "Black",
      "Champagne",
      "Teal Green",
      "Caramel",
      "Dusty Blue",
      "Ponceau",
      "Cobalt"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.2,
    "count": 452,
    "customers_say": "Customers find the dress beautiful, with one noting it feels regal to wear, and appreciate its perfect fit and sturdy construction. They describe it as comfortable and soft, with one customer comparing it to a bathrobe, while offering different colors to choose from. The dress is versatile, working well for both holiday events and Halloween costumes, though opinions on sizing are mixed, with some finding it runs slightly large. Generated from the text of customer reviews Select to learn more Beauty (76) Fit (71) Quality (44) Comfort (39) Color (26) Soft fabric (23) Dress size (21) Size (18) 76 customers mention beauty, 72 positive, 4 negative 76 customers mention \"Beauty\" 72 positive 4 negative Customers find the dress beautiful, noting that it maintains its appearance without wrinkles and looks expensive. One customer mentions feeling regal while wearing it. \" This is a beautiful dress .... I needed a dress to wear to a traditional Jewish winter weather, and this dress was one of the options I purchased.... \" Read more \" This dress is so beautiful ! Looks just as pictured. I was very surprised at the quality and the dress has a nice heavy weight to it.... \" Read more \" It fit exactly as I hoped, it was warm, comfortable and elegant . It was a little shorter than I thought from the pics but that was fine.... \" Read more \" ...I am a size 6 medium and this dress fit perfectly. It is simply gorgeous . I will buy multiple colors! \" Read more 71 customers mention fit, 61 positive, 10 negative 71 customers mention \"Fit\" 61 positive 10 negative Customers love how the dress fits, with one mentioning it doesn't squeeze their stomach. \" ...This dress is gorgeous and absolutely perfect! Great fit , great weight of the fabric, made really well.... \" Read more \" I love the color, the fit , and how many compliments I received! I felt regal wearing this dress. Extremely comfortable as well. \" Read more \" Bought this dress for Christmas and I absolutely love it! Fits perfectly , size small, even though I'm short but like how it looks.... \" Read more \" I love this dress. It fit perfectly and I got a lot of compliments on it. \" Read more 44 customers mention quality, 41 positive, 3 negative 44 customers mention \"Quality\" 41 positive 3 negative Customers find the dress to be of good quality, describing it as sturdy and better than expected. \" Nice dress and great navy color but returned it for a similar one from amazon b/c the neck on this was high and felt annoying and tight when trying... \" Read more \" Good fit and seems to be well made . I enjoyed wearing it to a Christmas party. Very comfortable and I received many compliments on it. \" Read more \" Great quality ! You never know what youre gonna get but this one is good. Runs a TAD big but not big enough to size down.... \" Read more \" This dress really surprised me. I was not expecting such good quality and it looks just like the picture.... \" Read more 39 customers mention comfort, 38 positive, 1 negative 39 customers mention \"Comfort\" 38 positive 1 negative Customers find the dress comfortable, with one mentioning it's suitable for long evening wear. \" It fit exactly as I hoped, it was warm, comfortable and elegant. It was a little shorter than I thought from the pics but that was fine.... \" Read more \" ...My wife is about 260 lbs and 5'8\". She says it's very comfortable , and it looks very flattering on her. She got lots of compliments on it!... \" Read more \" Lovely and comfortable dress . Feels like good sturdy quality. A little heavy but fit well and is a bit stretchy. \" Read more \" This Dress is so comfy and cute! I like how you can tie a bow in the back. I got so many compliments when I wore it to a wedding. I recommend! \" Read more 26 customers mention color, 22 positive, 4 negative 26 customers mention \"Color\" 22 positive 4 negative Customers like the dress's color options, with one customer specifically mentioning the sapphire blue shade. \" ...I got the dark green which was a beautiful color , but the second I took it from the bag to try it on, I noticed that the material became very static-... \" Read more \" ...The theme of the ball was glacier ice, and the color was beautiful . I received compliments all evening. \" Read more \" I love the color . It's sapphire blue, comfortable enough to almost be a nightgown but very classy and sophisticated. I'm 5'7\" and 130 lbs.... \" Read more \" I loved this dress. The color was gorgeous , it fit to a T. I ordered it in a large because I have large girls so needed it to fit the bust.... \" Read more 23 customers mention soft fabric, 23 positive, 0 negative 23 customers mention \"Soft fabric\" 23 positive 0 negative Customers appreciate the dress's soft fabric, describing it as velvety and comfortable on the skin. \" ...PROS: Material: soft , thick, dressy, with a heavy flow. Doesn't really wrinkle. Cut: fits beautiful on the body.... \" Read more \" Floor length. Very soft and comfortable. Washes easily. Doesn’t collect lint. I was comfortable and warm all night in this dress. \" Read more \" ...this dress for my son's wedding.. it looks amazing and the fabric is so soft .. it is very Flattering... can't wait to wear it.. \" Read more \" ...Not fussy at all but elegant. The style is flattering. Fabric is soft and stretchy and it didn’t warp or wrinkle.... \" Read more 21 customers mention dress size, 21 positive, 0 negative 21 customers mention \"Dress size\" 21 positive 0 negative Customers find the dress suitable for various occasions, particularly holiday events and Christmas weddings, with some mentioning it works well as a shabbos robe and for special events like cruises. \" ...I will be purchasing in more colors! Perfect holiday dress ! \" Read more \" ...many compliments on this dress and I felt like it was perfect for the wedding . It truly looked great and was perfect. \" Read more \" Perfect Christmas dress \" Read more \" It was perfect for my Halloween costume and the price was extremely good for what it is! \" Read more 18 customers mention size, 12 positive, 6 negative 18 customers mention \"Size\" 12 positive 6 negative Customers have mixed opinions about the dress's fit, with some finding it true to size while others report it runs slightly large. \" Fits perfect! Soft to the touch! True to size ! Beautiful Christmas dress! Sleeves are a bit puffy, but I liked that. Great buy for the money. \" Read more \" ...You never know what youre gonna get but this one is good. Runs a TAD big but not big enough to size down.... \" Read more \" Very forgiving in size and, of course, feels great. Perfect for those cold hotel or club venues where one sits a lot.... \" Read more \" Was true to size \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Perfect Dress Very Pleased !",
        "body": "This dress is perfect for my granddaughter’s fall wedding.The material is very high quality ,soft and comfortable.More beautiful then I thought it would be.I received many compliments and would order it again in a different color if I had another special occasion.I ordered the navy in the xxl . It fit true to size and hid some lumps and bumps well. I also had a full length under slip on underneath to help with the “fall” of the dress. It gave it a very finished look. I’m 5ft 7in and the length was perfect with 2 inch kitten heals. The sleeves were perfect length and not tight or too lose. This dress looks expensive and tasteful. The color is rich and beautiful.You will not be disappointed. Delivery was very fast. Read more",
        "author": "Norwegian Girl",
        "rating": 5.0,
        "date": "November 13, 2023",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71rmdetlAIL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Beautiful dress and great fit",
        "body": "Beautiful dress! Fit was perfect - just as I wanted it. I am 5'6 and wear size M. The color is gorgeous! I wore it once so far and received many compliments. Looks great in pictures! Read more",
        "author": "ykh",
        "rating": 5.0,
        "date": "December 14, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Classic and comfortable",
        "body": "Wore this dress for my son’s November wedding. I normally wear a medium, it was too big, thankfully the small arrived the day before the wedding and fit perfect! Dress was comfy and washed well. Got lots of compliments so I guess it did the trick! Read more",
        "author": "Katherine Stewart",
        "rating": 5.0,
        "date": "December 8, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars A beautiful dress with a few cons.",
        "body": "This is a beautiful dress.... I needed a dress to wear to a traditional Jewish winter weather, and this dress was one of the options I purchased. (Thanks Amazon return policy !!) I decided against the this dress. I decided to wear a similar dress (material and length) because of two differences: 1. no puff at the shoulder (I like it with or without the puff, so that wasn't a real deal breaker) and 2. The dress I choose had a zipper in the back. It was the zipper that won out. CON: No Zipper: the lack of zipper really is a con to this dress. If you are one to put your dress and shoes last, then you can really mess up your hair and possibly make-up when pulling this dress over your head. A zipper would allow you to get your hair and make up done and slide the dress on without issue. Belt Loops: while the belt is a nice option to cinch in the waist - thus making this dress that much more flattering, it would have been better to have the loops more to the back of the dress and smaller and/or flatter. PROS: Material: soft, thick, dressy, with a heavy flow. Doesn't really wrinkle. Cut: fits beautiful on the body. I can see this dress flattering many figures. To be honest, I saw two of the Zesica dresses at the wedding on two different body types, and they looked gorgeous. Value for money: Although this dress was slightly heavier/thicker than the dress I chose, the one I ultimately used was $20 less than this one. Depending on your pocket book........you can decide. This is a beautiful dress. Nice winter weight. For special occasion or holiday parties..... If you can live with the cons. Read more",
        "author": "K.M.B.",
        "rating": 4.0,
        "date": "December 6, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Beautiful and great quality",
        "body": "Beautiful and flattering! I absolutely love it!! Read more",
        "author": "Griselda Sides",
        "rating": 5.0,
        "date": "December 15, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "1.0 out of 5 stars Packaging ruins this dress",
        "body": "The dress comes vacuum sealed, and it’s impossible to get out the wrinkles. Have asked for regular packaging, but received sealed once again. Love the dress, but packaging has to change if they want to sell this dress! Read more",
        "author": "Bailey Harrelson",
        "rating": 1.0,
        "date": "October 25, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Defective",
        "body": "Just received today and needed for a fall wedding tomorrow. The dress is all scratched up or defective when made. I'm not sure. Giving it three stars because it's cute. Otherwise 1 start for the quality.. So disappointed Read more",
        "author": "JoAnna",
        "rating": 3.0,
        "date": "September 5, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61kOuAgWnWL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Comfortable Dress: Champagne XL",
        "body": "Purchased: XL Champagne I really liked this dress. It's comfortable and fit well. Seems to fit larger busted ladies well. I wouldn't call it champagne though; it's not golden. This is a very light pink dress. Perhaps pink champagne would have been a better description. Luckily everything else labeled cream or khaki in my order was also pink/mauve tinged so it worked out fine. Christmas photos attached. I didn't have any issues with steaming the wrinkles away like another reviewer mentioned. Read more",
        "author": "Julia",
        "rating": 5.0,
        "date": "December 7, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71Mku5z+rPL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71bFlchZo6L._SY88._SL1500_.jpg"
        ]
      }
    ]
  },
  "short_description": "Womens Maxi Dress Maxi Cocktail is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.",
  "about_this_item": "Womens Maxi Dress Maxi Cocktail is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.",
  "long_description": "Womens Maxi Dress Maxi Cocktail is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Dark Green, Navy, Rose, Mauve, Black, Champagne, Teal Green, Caramel, Dusty Blue, Ponceau, Cobalt. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Maxi Cocktail is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Dark Green, Navy, Rose, Mauve, Black, Champagne, Teal Green, Caramel, Dusty Blue, Ponceau, Cobalt. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "1d404e78-5534-4fd9-a1c5-b4c9b06e11d8",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1d404e78-5534-4fd9-a1c5-b4c9b06e11d8/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1d404e78-5534-4fd9-a1c5-b4c9b06e11d8/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "1eb9a3db-e644-4bda-9586-136b7b11fbf9",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1eb9a3db-e644-4bda-9586-136b7b11fbf9/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1eb9a3db-e644-4bda-9586-136b7b11fbf9/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "f4e4007a-5e3f-49e5-af6b-ed1953623068",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f4e4007a-5e3f-49e5-af6b-ed1953623068/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f4e4007a-5e3f-49e5-af6b-ed1953623068/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "a25d9af3-2e2f-4f40-8429-f809592d5f52",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a25d9af3-2e2f-4f40-8429-f809592d5f52/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a25d9af3-2e2f-4f40-8429-f809592d5f52/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "431aa3a5-c216-436d-95bb-7296dd0ca54f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/431aa3a5-c216-436d-95bb-7296dd0ca54f/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/431aa3a5-c216-436d-95bb-7296dd0ca54f/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "ea9482e7-a849-4a50-a2b8-0f9ac80425f0",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ea9482e7-a849-4a50-a2b8-0f9ac80425f0/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ea9482e7-a849-4a50-a2b8-0f9ac80425f0/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Dark Green": "https://m.media-amazon.com/images/I/41TUNvBRPLL._AC_SR38,50_.jpg",
    "Navy": "https://m.media-amazon.com/images/I/41w6TGxp-xL._AC_SR38,50_.jpg",
    "Rose": "https://m.media-amazon.com/images/I/41MhV7smVwL._AC_SR38,50_.jpg",
    "Mauve": "https://m.media-amazon.com/images/I/41l8pSj6kDL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31r5VEH5FEL._AC_SR38,50_.jpg",
    "Champagne": "https://m.media-amazon.com/images/I/311RB95p7uL._AC_SR38,50_.jpg",
    "Teal Green": "https://m.media-amazon.com/images/I/41hbciwrB6L._AC_SR38,50_.jpg",
    "Caramel": "https://m.media-amazon.com/images/I/41iIM-sgIRL._AC_SR38,50_.jpg",
    "Dusty Blue": "https://m.media-amazon.com/images/I/41lZ4AQ-tLL._AC_SR38,50_.jpg",
    "Ponceau": "https://m.media-amazon.com/images/I/41YQV+VXquL._AC_SR38,50_.jpg",
    "Cobalt": "https://m.media-amazon.com/images/I/41CcFhDcdDL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Dark Green": "71auw26aB7L",
    "Navy": "71XFR7Xd8sL",
    "Rose": "71AnXSGmh7L",
    "Mauve": "71GXGCEOkqL",
    "Black": "61QxSHdZWuL",
    "Champagne": "71OyPFu6NZL",
    "Teal Green": "71NWiUAm3yL",
    "Caramel": "716J684TTuL",
    "Dusty Blue": "7188tpMjngL",
    "Ponceau": "71O-Wnas1DL",
    "Cobalt": "71jvkqpkGGL"
  },
  "color_images": {
    "Dark Green": [
      "https://m.media-amazon.com/images/I/71auw26aB7L._SL1500_.jpg"
    ],
    "Navy": [
      "https://m.media-amazon.com/images/I/71XFR7Xd8sL._SL1500_.jpg"
    ],
    "Rose": [
      "https://m.media-amazon.com/images/I/71AnXSGmh7L._SL1500_.jpg"
    ],
    "Mauve": [
      "https://m.media-amazon.com/images/I/71GXGCEOkqL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/61QxSHdZWuL._SL1500_.jpg"
    ],
    "Champagne": [
      "https://m.media-amazon.com/images/I/71OyPFu6NZL._SL1500_.jpg"
    ],
    "Teal Green": [
      "https://m.media-amazon.com/images/I/71NWiUAm3yL._SL1500_.jpg"
    ],
    "Caramel": [
      "https://m.media-amazon.com/images/I/716J684TTuL._SL1500_.jpg"
    ],
    "Dusty Blue": [
      "https://m.media-amazon.com/images/I/7188tpMjngL._SL1500_.jpg"
    ],
    "Ponceau": [
      "https://m.media-amazon.com/images/I/71O-Wnas1DL._SL1500_.jpg"
    ],
    "Cobalt": [
      "https://m.media-amazon.com/images/I/71jvkqpkGGL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/41HM+pXuZ5L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-sleeveless-bodycon-one-shoulder-ruched",
      "title": "Womens Dress Sleeveless Bodycon One Shoulder Ruched",
      "price": 29.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61UoZCqFMtL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-formal",
      "title": "Womens Maxi Dress Evening Formal",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61CLAYjFO6L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening-mermaid-one-shoulder-bodycon",
      "title": "Womens Maxi Dress Formal Evening Mermaid One Shoulder Bodycon",
      "price": 72.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/618lP17KUCL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-v-neck-formal-evening",
      "title": "Womens Maxi Dress V Neck Formal Evening",
      "price": 99.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61+20CgOoyL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-formal-bodycon-ruched-maxi-long-sleeve",
      "title": "Womens Maxi Dress Formal Bodycon Ruched Maxi Long Sleeve",
      "price": 61.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/513Uwep+gwL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal",
      "title": "Womens Maxi Dress Formal",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/613+0mbtjjL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal",
      "title": "Womens Maxi Dress Formal",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61IcEYiG5oL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi",
      "title": "Womens Maxi Dress Maxi",
      "price": 105.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61vjm25xN1L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening-mermaid",
      "title": "Womens Maxi Dress Formal Evening Mermaid",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51XOg-esG2L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-formal",
      "title": "Womens Maxi Dress Evening Formal",
      "price": 75.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Wedding Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/51U3YUlzbEL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-long-sleeve-ruched-bodycon",
      "title": "Womens Maxi Dress Cocktail Long Sleeve Ruched Bodycon",
      "price": 32.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61OCQ5rPyoL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-v-neck",
      "title": "Womens Maxi Dress Long Sleeve V Neck",
      "price": 42.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51bKKUvdMCL._SL1500_.jpg"
      ]
    }
  ]
}