{
  "id": "womens-dress-sleeveless-bodycon",
  "handle": "womens-dress-sleeveless-bodycon",
  "sku": "JC1585",
  "asin": "B0C7ZT7GFH",
  "title": "Womens Dress Sleeveless Bodycon",
  "title_original": "GRACE KARIN Sequin Dress for Women Sleeveless Sparkly Glitter Halter Dress Bodycon Mini Club Dresses 2025",
  "brand": "Visit the GRACE KARIN Store",
  "price": 59.99,
  "social_proof": {
    "bought_past_month": 73,
    "text": "73+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/71Cow7jfXpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81XfgIAHLpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ZqXODXz2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81nkRj1K4sL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/7183tt2L9vL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71zkpQsXb9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71netYfXYGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/710jOQsJOhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/616dFNslh4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71cSbK2-0KL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71VlbwheKbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71iaXlW0ExL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ERRBLB1nL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61N9fM-V7pL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/619V5CeYvbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61vBkbb6TJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Z-uvypb6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71bGicexoHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61nLagk8TaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/7175AbY6-iL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71GZzVXRCEL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/71Cow7jfXpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81XfgIAHLpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ZqXODXz2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81nkRj1K4sL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/7183tt2L9vL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71zkpQsXb9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71netYfXYGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/710jOQsJOhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/616dFNslh4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71cSbK2-0KL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71VlbwheKbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71iaXlW0ExL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ERRBLB1nL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61N9fM-V7pL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/619V5CeYvbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61vBkbb6TJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Z-uvypb6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71bGicexoHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61nLagk8TaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/7175AbY6-iL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71GZzVXRCEL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ March 30, 2024",
    "ASIN ‏": "‎ B0CZHXPPXN",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#14,576 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #64 in Women's Club & Night Out Dresses",
    "Customer Reviews": "4.2 4.2 out of 5 stars (719)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Brown",
      "Gold",
      "Black Gold",
      "Black Rose Gold",
      "Black",
      "Dark Gray",
      "Navy Blue",
      "Dark Red",
      "Colorful Black",
      "Dark Green",
      "Red",
      "Rose Red",
      "Silver",
      "Gray Pink",
      "Purple",
      "Royal Blue",
      "Black Silver"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.2,
    "count": 719,
    "customers_say": "Customers find the dress beautiful and comfortable, with no scratchy feeling, and one customer notes it's made of double-layer mesh with sequins that don't poke or scratch. Moreover, the dress fits well, with one mentioning it hits just above the knee, and customers appreciate its versatility for different occasions, including black and gold galas. Additionally, the material receives positive feedback, with one customer highlighting its suitability for summer evenings, and customers consider it good value for money. Select to learn more Fit Beauty Quality Comfort Material quality Dress size Fabric stretch Value for money 104 customers mention \"Fit\" 86 positive 18 negative Customers like how the dress fits, noting that it is flattering and curves well, with one customer mentioning it works perfectly for weddings and parties. \" Perfect fit . Size small, 4'9\", 110 lbs. Bought for a cruise and got lots of compliments. Loves it so much that I had to buy it in blue too.\" Read more \" Great fit Good quality material Color is as described Fits well Material is right to wear anytime of year, zipper works well\" Read more \"Well made. Washes well. Sooooooooo pretty. Fits well and has a little stretch to it....\" Read more \"...I’m 5’1’ 132 pounds ordered size 4-6 and it fits perfectly ! No gapping in the back per a couple reviews and length is perfect for me....\" Read more 103 customers mention \"Beauty\" 95 positive 8 negative Customers find the dress beautiful, with one mentioning it's never too old to wear something so stunning. \" Beautiful dress it fits perfect for a wedding or party or a night out I love mines Great price and a very nice Quality dress\" Read more \"Comfortable. Cute . Love the material. Soft. Wearing to my brother's wedding. Can't wait!!! The color is what I expected too....\" Read more \"This dress is stunning. It was to big for me but beautiful . It didn't arrive on time so I couldn't wear it but wish I could have.\" Read more \"This is a gorgeous dress !! She is comfortable, vibrant red and oh so sexy!! Grace Karin strikes again and I am impressed....\" Read more 64 customers mention \"Quality\" 58 positive 6 negative Customers find the dress to be of good quality, particularly noting it's perfect for special occasions like New Year's Eve and Vegas events. \" Great Dress , the quality was really nice, the fit was perfect, it was a hit for NYE!\" Read more \"...Plz if you found this page, buy the dress. I'm telling you it's well made , comfy, beautiful, I can't say enough good things about it. I was shocked....\" Read more \" Love the dress . It was perfect for my bday party\" Read more \"...Received so many compliments wearing it and found it to be of great quality .\" Read more 63 customers mention \"Comfort\" 48 positive 15 negative Customers find the dress comfortable, noting it has no scratchy feeling and doesn't irritate the skin. One customer specifically mentions the double-layer mesh with sequins that don't poke or scratch. \"This dress is pretty, comfortable and true to size. Used it at my son’s wedding. Will be able to use it more than just for the wedding. Love it!\" Read more \"It fits perfect. Very comfortable and fabric is smooth. Color is as shows in pictures, very light. It looks better than the picture....\" Read more \" Comfy and flattering dress! It ran true to size and hugged in all the right places. Length was great, hitting just above the knee....\" Read more \" Very scratchy and too uncomfortable to wear\" Read more 29 customers mention \"Material quality\" 21 positive 8 negative Customers love the material of the dress, particularly its velvet with sequins design, with one customer noting its double-layer mesh construction and another mentioning it's perfect for summer evenings. \"The dress was perfect. Great material ,great fit. The sequins were very sparkly and festive. Will buy from this company again.\" Read more \"...It’s nice and a good length. Washed great! Material felt nice .\" Read more \" Cheap fabric nothing like the picture.\" Read more \"...It is extremely flattering in spite of the fabric quality .\" Read more 26 customers mention \"Dress size\" 25 positive 1 negative Customers find the dress suitable for various occasions, from casual outings to formal events, with one customer mentioning it was perfect for a black and gold gala. \"...Has good stretch. Under the sequins is velvet so it would make a great holiday dress ....\" Read more \"This is a nice party dress , but it's a no for me. I'm almost 5'10, 200lbs curvy. Pros: lined, sparkly....\" Read more \"This dress is absolutely stunning. It is perfect for a holiday party , New Year’s Eve, or other formal event.\" Read more \" Perfect for the formal night on our Christmas Cruise. For was perfect and ideal....\" Read more 23 customers mention \"Fabric stretch\" 18 positive 5 negative Customers appreciate the dress's stretchy fabric, with one mentioning it provides room to move comfortably. \"Soft, stretchy and comfortable! Glitter was coming off on my wool coat other than that this dress was PERFECT!! Many compliments ☺️ THANK YOU\" Read more \"Wow. Forgiving. Has good stretch . Under the sequins is velvet so it would make a great holiday dress....\" Read more \"...The dress is flexible and solve so you have room to move.\" Read more \"...The fit and feel were great. The material has a little stretch to it but still hugged all the right curves in the right places. I highly recommend!!\" Read more 21 customers mention \"Value for money\" 17 positive 4 negative Customers find the dress to be good value for money. \"...it fits perfect for a wedding or party or a night out I love mines Great price and a very nice Quality dress\" Read more \"...Soft skin-touch lining. Easy care. Turn inside out & fold to pack. Value for money .\" Read more \"...It's a very classy dress for the price but material is iffy....\" Read more \"Not as described. Very cheap .\" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Gorgeous in person!",
        "body": "Dress was a perfect fit. Received so many compliments wearing it and found it to be of great quality. Read more",
        "author": "Tracey L. Bird",
        "rating": 5.0,
        "date": "December 18, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71cZr36XiML._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars This dress was a winner",
        "body": "I love this dress very comfortable and beautiful. Fit perfectly Read more",
        "author": "Danni",
        "rating": 5.0,
        "date": "December 8, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Cute!",
        "body": "Was a little big but great quality! Love this! Read more",
        "author": "Gia",
        "rating": 4.0,
        "date": "December 19, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Ravishing in Red",
        "body": "Comfy and flattering dress! It ran true to size and hugged in all the right places. Length was great, hitting just above the knee. The neckline needed adjusting during the evening, because the fabric tends to slip through the loop. I might try a stitch or two to keep it in place. I received many compliments. Read more",
        "author": "DC's Cookies n Crumbs",
        "rating": 5.0,
        "date": "December 14, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61YumG7a7mL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Soft sequins",
        "body": "I love this dress! It looked exactly like the photos and fit just as expected. I received so many compliments while wearing it. I was also surprised by how soft and comfortable it was, which I didn’t expect from a sequin dress at all. I would definitely recommend it! Read more",
        "author": "Sandi Lynn",
        "rating": 5.0,
        "date": "December 15, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61lXra-JRmL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Classy and sexy",
        "body": "This dress fits to size, if bustier size up. Flattering to body, great for a glamorous night on the town. Read more",
        "author": "Tina W",
        "rating": 5.0,
        "date": "November 20, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Seams don’t line up when worn",
        "body": "It looks gorgeous but wearing it was a different story. There must be something wrong with the sewing inside the dress because it would not lay right and the seams kept moving around. The back zipper kept twisting to my right side. It was so uncomfortable. Read more",
        "author": "Jamie",
        "rating": 3.0,
        "date": "December 1, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars True to size",
        "body": "The dress was perfect. Great material,great fit. The sequins were very sparkly and festive. Will buy from this company again. Read more",
        "author": "Jenner Martin",
        "rating": 4.0,
        "date": "December 9, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Dress Sleeveless Bodycon is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.",
  "about_this_item": "Womens Dress Sleeveless Bodycon is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.",
  "long_description": "Womens Dress Sleeveless Bodycon is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Brown, Gold, Black Gold, Black Rose Gold, Black, Dark Gray, Navy Blue, Dark Red, Colorful Black, Dark Green, Red, Rose Red, Silver, Gray Pink. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Dress Sleeveless Bodycon is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Brown, Gold, Black Gold, Black Rose Gold, Black, Dark Gray, Navy Blue, Dark Red, Colorful Black, Dark Green, Red, Rose Red, Silver, Gray Pink. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "3f57aa15-8d34-4929-bab6-cc778f64a9c5",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3f57aa15-8d34-4929-bab6-cc778f64a9c5/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3f57aa15-8d34-4929-bab6-cc778f64a9c5/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/a1581a62-affb-48f7-b9ac-364df0354593.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "05ccc34b-864b-4c36-8b45-d8b34aa0e082",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/05ccc34b-864b-4c36-8b45-d8b34aa0e082/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/05ccc34b-864b-4c36-8b45-d8b34aa0e082/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/a1581a62-affb-48f7-b9ac-364df0354593.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "c4275dc3-a10f-4259-9b41-ca326a30b1ba",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c4275dc3-a10f-4259-9b41-ca326a30b1ba/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c4275dc3-a10f-4259-9b41-ca326a30b1ba/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/a1581a62-affb-48f7-b9ac-364df0354593.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "b2e61a2d-6a48-4b94-a8fc-eabcf73e8a2b",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b2e61a2d-6a48-4b94-a8fc-eabcf73e8a2b/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b2e61a2d-6a48-4b94-a8fc-eabcf73e8a2b/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/a1581a62-affb-48f7-b9ac-364df0354593.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "e2272a1e-ca2c-483d-9ad6-c91f51327fe5",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e2272a1e-ca2c-483d-9ad6-c91f51327fe5/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e2272a1e-ca2c-483d-9ad6-c91f51327fe5/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/a1581a62-affb-48f7-b9ac-364df0354593.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "07a27d97-5100-41c0-9c45-03056c506ab6",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/07a27d97-5100-41c0-9c45-03056c506ab6/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/07a27d97-5100-41c0-9c45-03056c506ab6/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/a1581a62-affb-48f7-b9ac-364df0354593.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "1ded3ef4-ac5c-48f4-a2fb-5e7e2f30659b",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1ded3ef4-ac5c-48f4-a2fb-5e7e2f30659b/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1ded3ef4-ac5c-48f4-a2fb-5e7e2f30659b/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/a1581a62-affb-48f7-b9ac-364df0354593.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "1d34aec9-7c6a-4cfe-8ae3-2e5ee46eacff",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1d34aec9-7c6a-4cfe-8ae3-2e5ee46eacff/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1d34aec9-7c6a-4cfe-8ae3-2e5ee46eacff/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/a1581a62-affb-48f7-b9ac-364df0354593.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "f8f8fc69-7dde-4eca-9339-83e107255e5e",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f8f8fc69-7dde-4eca-9339-83e107255e5e/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f8f8fc69-7dde-4eca-9339-83e107255e5e/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/a1581a62-affb-48f7-b9ac-364df0354593.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "150d02c3-175d-4f61-b6e9-782ba1d258f4",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/150d02c3-175d-4f61-b6e9-782ba1d258f4/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/150d02c3-175d-4f61-b6e9-782ba1d258f4/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/a1581a62-affb-48f7-b9ac-364df0354593.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "b144ffc5-b980-43ab-890c-3011219899e8",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b144ffc5-b980-43ab-890c-3011219899e8/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b144ffc5-b980-43ab-890c-3011219899e8/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/a1581a62-affb-48f7-b9ac-364df0354593.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "f0640451-96c3-4820-acaf-cbf0c7b6cdea",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f0640451-96c3-4820-acaf-cbf0c7b6cdea/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f0640451-96c3-4820-acaf-cbf0c7b6cdea/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/a1581a62-affb-48f7-b9ac-364df0354593.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Brown": "https://m.media-amazon.com/images/I/41KZ9EBQ-UL._AC_SR38,50_.jpg",
    "Gold": "https://m.media-amazon.com/images/I/51GrgPlbzaL._AC_SR38,50_.jpg",
    "Black Gold": "https://m.media-amazon.com/images/I/51sly3iRhuL._AC_SR38,50_.jpg",
    "Black Rose Gold": "https://m.media-amazon.com/images/I/419UEi2p-TL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/41yC3JhytWL._AC_SR38,50_.jpg",
    "Dark Gray": "https://m.media-amazon.com/images/I/41HpVyVUDaL._AC_SR38,50_.jpg",
    "Navy Blue": "https://m.media-amazon.com/images/I/41SXNPyVcBL._AC_SR38,50_.jpg",
    "Dark Red": "https://m.media-amazon.com/images/I/41UkUjaIfjL._AC_SR38,50_.jpg",
    "Colorful Black": "https://m.media-amazon.com/images/I/51FrepHeuNL._AC_SR38,50_.jpg",
    "Dark Green": "https://m.media-amazon.com/images/I/41VKtNR-4PL._AC_SR38,50_.jpg",
    "Red": "https://m.media-amazon.com/images/I/41BmSkH4rzL._AC_SR38,50_.jpg",
    "Rose Red": "https://m.media-amazon.com/images/I/4188rizmQEL._AC_SR38,50_.jpg",
    "Silver": "https://m.media-amazon.com/images/I/41tDWbHBXaL._AC_SR38,50_.jpg",
    "Gray Pink": "https://m.media-amazon.com/images/I/41mHcUhUP6L._AC_SR38,50_.jpg",
    "Purple": "https://m.media-amazon.com/images/I/41SfGnHAgNL._AC_SR38,50_.jpg",
    "Royal Blue": "https://m.media-amazon.com/images/I/41m3VjyttYL._AC_SR38,50_.jpg",
    "Black Silver": "https://m.media-amazon.com/images/I/41-M2d9meRL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Brown": "71zkpQsXb9L",
    "Gold": "71Cow7jfXpL",
    "Black Gold": "71netYfXYGL",
    "Black Rose Gold": "710jOQsJOhL",
    "Black": "616dFNslh4L",
    "Dark Gray": "71cSbK2-0KL",
    "Navy Blue": "71VlbwheKbL",
    "Dark Red": "71iaXlW0ExL",
    "Colorful Black": "71ERRBLB1nL",
    "Dark Green": "61N9fM-V7pL",
    "Red": "619V5CeYvbL",
    "Rose Red": "61vBkbb6TJL",
    "Silver": "71Z-uvypb6L",
    "Gray Pink": "71bGicexoHL",
    "Purple": "61nLagk8TaL",
    "Royal Blue": "7175AbY6-iL",
    "Black Silver": "71GZzVXRCEL"
  },
  "color_images": {
    "Brown": [
      "https://m.media-amazon.com/images/I/71zkpQsXb9L._SL1500_.jpg"
    ],
    "Gold": [
      "https://m.media-amazon.com/images/I/71Cow7jfXpL._SL1500_.jpg"
    ],
    "Black Gold": [
      "https://m.media-amazon.com/images/I/71netYfXYGL._SL1500_.jpg"
    ],
    "Black Rose Gold": [
      "https://m.media-amazon.com/images/I/710jOQsJOhL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/616dFNslh4L._SL1500_.jpg"
    ],
    "Dark Gray": [
      "https://m.media-amazon.com/images/I/71cSbK2-0KL._SL1500_.jpg"
    ],
    "Navy Blue": [
      "https://m.media-amazon.com/images/I/71VlbwheKbL._SL1500_.jpg"
    ],
    "Dark Red": [
      "https://m.media-amazon.com/images/I/71iaXlW0ExL._SL1500_.jpg"
    ],
    "Colorful Black": [
      "https://m.media-amazon.com/images/I/71ERRBLB1nL._SL1500_.jpg"
    ],
    "Dark Green": [
      "https://m.media-amazon.com/images/I/61N9fM-V7pL._SL1500_.jpg"
    ],
    "Red": [
      "https://m.media-amazon.com/images/I/619V5CeYvbL._SL1500_.jpg"
    ],
    "Rose Red": [
      "https://m.media-amazon.com/images/I/61vBkbb6TJL._SL1500_.jpg"
    ],
    "Silver": [
      "https://m.media-amazon.com/images/I/71Z-uvypb6L._SL1500_.jpg"
    ],
    "Gray Pink": [
      "https://m.media-amazon.com/images/I/71bGicexoHL._SL1500_.jpg"
    ],
    "Purple": [
      "https://m.media-amazon.com/images/I/61nLagk8TaL._SL1500_.jpg"
    ],
    "Royal Blue": [
      "https://m.media-amazon.com/images/I/7175AbY6-iL._SL1500_.jpg"
    ],
    "Black Silver": [
      "https://m.media-amazon.com/images/I/71GZzVXRCEL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress-v-neck",
      "title": "Womens Dress V Neck",
      "price": 35.88,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61xktoXgNoL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-off-shoulder-bodycon-long-sleeve-maxi",
      "title": "Womens Maxi Dress Off Shoulder Bodycon Long Sleeve Maxi",
      "price": 53.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/611pJhxTuIL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-maxi-cocktail-long-sleeve",
      "title": "Womens Maxi Dress Bodycon Maxi Cocktail Long Sleeve",
      "price": 46.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/51SrMgxgBJL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail-off-shoulder-formal",
      "title": "Womens Dress Cocktail Off Shoulder Formal",
      "price": 55.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/5193C0svyaL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-long-sleeve",
      "title": "Womens Maxi Dress Bodycon Long Sleeve",
      "price": 48.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51lq6qHEjqL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 570.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61KAHPReuiL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 249.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71xXDpxNcML._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-long-sleeve",
      "title": "Womens Maxi Dress Bodycon Long Sleeve",
      "price": 37.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71aSg8G5uwL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-maxi-cocktail",
      "title": "Womens Maxi Dress Long Sleeve Maxi Cocktail",
      "price": 62.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71u2Xray0mL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 34.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71GbXZsvJTL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-formal-v-neck",
      "title": "Womens Maxi Dress Long Sleeve Formal V Neck",
      "price": 84.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51UvLPA1DyL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 66.15,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/712M7NaAfkL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-cocktail-maxi-v-neck",
      "title": "Womens Maxi Dress Formal Cocktail Maxi V Neck",
      "price": 56.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/81Oq1mKdfOL._SL1500_.jpg"
      ]
    }
  ]
}