{
  "id": "womens-maxi-dress-long-sleeve-cocktail",
  "handle": "womens-maxi-dress-long-sleeve-cocktail",
  "sku": "JC3218",
  "asin": "B0C8B6R9WT",
  "title": "Womens Maxi Dress Long Sleeve Cocktail",
  "title_original": "ZESICA Women's 2026 Fall Long Sleeve Ruffle Tiered Layered Chiffon Flowy Swing Wedding Guest Cocktail Party Midi Dress",
  "brand": "Visit the ZESICA Store",
  "price": 59.99,
  "social_proof": {
    "bought_past_month": 953,
    "text": "953+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/51qPRaBoU1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/612xeOMMExL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71C8UcWlcAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/715rRHQiPuL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71NuPC47HYL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51jOQ7n3jsL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51GmxzEVq1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51Z6X036NyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51-mEGDALsL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51RRbrKuDOL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51DtKzuuQfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/510zzdTos9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51KNwiolAQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/514Yrw98u6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51poqJ7NriL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51BOOZj8VJL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/51qPRaBoU1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/612xeOMMExL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71C8UcWlcAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/715rRHQiPuL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71NuPC47HYL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51jOQ7n3jsL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51GmxzEVq1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51Z6X036NyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51-mEGDALsL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51RRbrKuDOL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51DtKzuuQfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/510zzdTos9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51KNwiolAQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/514Yrw98u6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51poqJ7NriL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51BOOZj8VJL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Product Dimensions ‏": "‎ 1.97 x 0.79 x 0.39 inches; 3.53 ounces",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ June 16, 2023",
    "ASIN ‏": "‎ B0D4BCP9XX",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#33,715 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #307 in Women's Casual Dresses",
    "Customer Reviews": "4.2 4.2 out of 5 stars (1,011)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Darkgreen",
      "Khaki",
      "Pink",
      "White",
      "Blue",
      "Watermelon",
      "Mint",
      "Darkpurple",
      "Lightblue",
      "Apricot",
      "Rose",
      "Black"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.2,
    "count": 1011,
    "customers_say": "Customers find the dress chic and high-end looking, with plenty of fabric in the skirt and comfortable fit that accommodates long legs. They appreciate its quality, color, comfort, and flattering design, with one customer noting it's great for curvy body types. Opinions about sizing are mixed, with some finding it true to size while others say it runs big. Generated from the text of customer reviews Select to learn more Beauty (151) Fit (118) Quality (97) Color (51) Comfort (45) Material quality (38) Flattering (34) Size (34) 151 customers mention beauty, 138 positive, 13 negative 151 customers mention \"Beauty\" 138 positive 13 negative Customers find the dress beautiful, describing it as chic and high-end with a layered look that makes them feel glamorous. One customer mentions it gives brunch or wedding guest vibes. \" Beautiful dress , nice quality. It fits my long legs. It does not come all the way down my long arms but it’s okay.... \" Read more \" This dress is beautiful . I was uncertain at first, but once I put it on, it’s comfortable and I received a lot of compliments.... \" Read more \" Loved how simple and classy this dress was for my portraits! Fit true to size, very happy with quality for price.... \" Read more \" ...It is a very classy, elegant and sophisticated style. It washes (gentle cycle) easily without Wrinkles. Low heat dryer.... \" Read more 118 customers mention fit, 83 positive, 35 negative 118 customers mention \"Fit\" 83 positive 35 negative Customers are satisfied with how the dress fits, particularly noting that it accommodates long legs and has the right length, with one customer mentioning that the skirt starts right at the waist. \" Wore this dress to a wedding. Perfect fit and the flow of the dress was great for dancing! The color was also a great nude.... \" Read more \" Great fit , I have a larger chest and there was plenty of room, not too tight around waist. Needed steaming but that was expected.... \" Read more \" ...Beautiful dress, good quality, but it was too big on top . \" Read more \" ...I'm 5'6\" 120lbs and purchased the small. It fit perfectly and looked more expensive as the quality was good. I got black for a formal occasion.... \" Read more 97 customers mention quality, 94 positive, 3 negative 97 customers mention \"Quality\" 94 positive 3 negative Customers find the dress to be of nice quality, with one customer describing it as \"heavenly.\" \" For wedding, good quality , good coverage, color nice, fit was good a little long but not bad, it was not a good look on me, felt to formal for the... \" Read more \" ...losing weight and it still looked a little big on me.. but it was a great dress . Very comfy and had some weight to it, which I like. \" Read more \" Nice dress but unflattering fit... \" Read more \" a lovely dress with a good price tag. i’m glad i read the other reviews about size and fit \" Read more 51 customers mention color, 42 positive, 9 negative 51 customers mention \"Color\" 42 positive 9 negative Customers like the dress's color, particularly noting that it looks nice in black. \" I love this dress. I got the navy blue, such a beautiful color .... \" Read more \" Pretty dress and color , It is a layered dress and there’s a lot of fabric. Just made me look too bottom heavy so unfortunately had to return. \" Read more \" Gorgeous color ! But you better be slim and over 5’9’ . I looked like an Easter egg. \" Read more \" Beautiful Nice stretch Nice material True to color Is washable on delicate Don't dry \" Read more 45 customers mention comfort, 45 positive, 0 negative 45 customers mention \"Comfort\" 45 positive 0 negative Customers find the dress comfortable, with one mentioning it's not itchy. \" The dress is comfortable and flowy. I could have gone down in size. The waistband is very stretchy. The color is exact as shown in the image. \" Read more \" I love this dress! I ordered it for Easter. It’s very comfortable and true to size, I got a medium. I love the color and flow of the dress.... \" Read more \" I truly love my dress and enjoy ordering off of Amazon. The dress is very comfy . \" Read more \" This dress it’s really cute and comfy , look fancy. The material quality it’s good. \" Read more 38 customers mention material quality, 31 positive, 7 negative 38 customers mention \"Material quality\" 31 positive 7 negative Customers love the material of the dress, with plenty of fabric on the skirt, and one customer noting that it flows well. \" ...It's actually a lovely dress and good material . It arrived quickly too.... \" Read more \" fabric was ok and fit was super baggy despite getting a small size. \" Read more \" ...I was impressed with the fabric and construction! Nice fabric \" Read more \" ...Everyone loved this dress. I love the material and except for the sleeves, she's fully lined for modesty.... \" Read more 34 customers mention flattering, 28 positive, 6 negative 34 customers mention \"Flattering\" 28 positive 6 negative Customers find the dress flattering, with one mentioning it hides bulges and another noting it's great for curvy body types. \" ...I found it flattering and great quality. I’ve ordered maxi dresses from Amazon before and I’ve never loved the fitting as much as I did with this one. \" Read more \" I am very pleased with the dress. It is very flattering and comfortable. I plan to wear it to my sisters wedding in April. \" Read more \" This dress is so flattering and looks like an expensive one. It’s so beautiful and comfortable. I totally recommend it. \" Read more \" ...It still looks very flattering on . Did I get another style? \" Read more 34 customers mention size, 14 positive, 20 negative 34 customers mention \"Size\" 14 positive 20 negative Customers have mixed experiences with the dress's sizing, with some finding it true to size while others report that it runs big. \" ...I got a lot of compliments on it and it had a vintage look to it. It runs large so I sized down and still had some extra room. \" Read more \" ...I ordered it for Easter. It’s very comfortable and true to size , I got a medium. I love the color and flow of the dress. 10/10 recommend. \" Read more \" Super cute but runs big . The color is just like the picture, very well made but it wrinkles easily. \" Read more \" The size is true to size the large is about a 12 and the material is very soft \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Cute dress!",
        "body": "This dress is adorable, it is really nice quality for the price. It does run generous in size, so I ordered the size smaller, but very happy with the quality of the fabric. I plan on wearing it to a wedding. Read more",
        "author": "Cheri Brown",
        "rating": 5.0,
        "date": "October 10, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Very pretty",
        "body": "Distress is very cute. It lays really well and is very very comfortable! I would recommend this dress. It is also very fancy and pretty. I purchased two of the same one. I purchased the black one and then they’re really pretty green color. Read more",
        "author": "Amanda",
        "rating": 5.0,
        "date": "October 30, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars It’s a keeper!",
        "body": "Absolutely love this dress! Comfortable and flattering! Fit is relaxed. I ordered my usual size and I’m happy with it. Probably going to order in another color before they sell out. Favorite dress I’ve ever ordered. Read more",
        "author": "Jessamyn Hawkins",
        "rating": 5.0,
        "date": "December 19, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Cute",
        "body": "Fits true to size. The purple is a nice plum color. The look of the dress can be dowdy for a younger person but can be modernized with a nice belt and shoes. The ruffles on the bottom are flirty and gives the dress a unique look. Read more",
        "author": "Joy",
        "rating": 4.0,
        "date": "October 23, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Nice in black but the apricot is going back.",
        "body": "I got this dress in black and apricot. Really like the black on. At Amz, even tho almost everywhere else I am usually a M, I tend to need a L to fit best. However, reading the reviews, decided to stick w a M, and it fits perfectly. Will be wearing to my MILs funeral services next week, but it can have many other uses. I agree with some other reviewers that the inside slip definitely gets static. However, it's underneath and does not seem to alter the outer flow of the dress, so more just an irritation than making the dress look bad. It's a dress I'm happy to have in my closet as a go to. The apricot one (more like a winter white) just does not look good on me, tho fit is still great. Probably bc I have broad shoulders, but the bodice is not appealing where the lining starts. I was impressed that the lining was so good that you could not see through that portion to my black bra I was trying it on with, so the dresses do seem to be well made. Read more",
        "author": "Emily Bronte",
        "rating": 5.0,
        "date": "November 17, 2024",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Wishful",
        "body": "This was a dress purchased for my grandma as we're doing pictures with her great grandchildren. She loved the look which is why it's getting 3 stars. It's actually a lovely dress and good material. It arrived quickly too. However, it arrived today dirty as if someone wore and returned it, and then it was sold to me. So I'm returning it. I didn't have her try it on of course so I can't speak to fit. Read more",
        "author": "T Michelle",
        "rating": 3.0,
        "date": "August 5, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Runs large. Get 2 size smaller",
        "body": "It’s a really cute and fun dress. Buying for a wedding in winter. Think color too bright. Runs large. U normally wear an XL a medium fits best. Read more",
        "author": "Suzie Way",
        "rating": 5.0,
        "date": "October 14, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Nice dress",
        "body": "Pretty sure I was sent a used dress because the button on the neck enclosure had been ripped off. Otherwise, it seems ok. Read more",
        "author": "Amy Clack",
        "rating": 4.0,
        "date": "November 27, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Long Sleeve Cocktail is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.",
  "about_this_item": "Womens Maxi Dress Long Sleeve Cocktail is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.",
  "long_description": "Womens Maxi Dress Long Sleeve Cocktail is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Darkgreen, Khaki, Pink, White, Blue, Watermelon, Mint, Darkpurple, Lightblue, Apricot, Rose, Black. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Long Sleeve Cocktail is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Darkgreen, Khaki, Pink, White, Blue, Watermelon, Mint, Darkpurple, Lightblue, Apricot, Rose, Black. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "e9afd25d-5da4-4cc2-917e-6179133b6763",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e9afd25d-5da4-4cc2-917e-6179133b6763/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e9afd25d-5da4-4cc2-917e-6179133b6763/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/098fff51-6c40-471b-8236-1b1ae8d943cb.mp4/r/THUMBNAIL_1080P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "bd8604e5-f96a-442a-941a-c1b30e68fef8",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bd8604e5-f96a-442a-941a-c1b30e68fef8/embedded.cc.default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bd8604e5-f96a-442a-941a-c1b30e68fef8/embedded.cc.default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/098fff51-6c40-471b-8236-1b1ae8d943cb.mp4/r/THUMBNAIL_1080P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "bbafe77d-ea63-42f2-a237-adbb1d315418",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bbafe77d-ea63-42f2-a237-adbb1d315418/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bbafe77d-ea63-42f2-a237-adbb1d315418/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/098fff51-6c40-471b-8236-1b1ae8d943cb.mp4/r/THUMBNAIL_1080P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "fa147dc0-5916-499b-a7b4-1696f0c66ef3",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/fa147dc0-5916-499b-a7b4-1696f0c66ef3/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/fa147dc0-5916-499b-a7b4-1696f0c66ef3/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/098fff51-6c40-471b-8236-1b1ae8d943cb.mp4/r/THUMBNAIL_1080P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "41410795-dd7d-47a6-83f4-0c7af5db9d73",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/41410795-dd7d-47a6-83f4-0c7af5db9d73/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/41410795-dd7d-47a6-83f4-0c7af5db9d73/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/098fff51-6c40-471b-8236-1b1ae8d943cb.mp4/r/THUMBNAIL_1080P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "744e53ab-d0b9-4001-aee9-e6b46d2590c9",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/744e53ab-d0b9-4001-aee9-e6b46d2590c9/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/744e53ab-d0b9-4001-aee9-e6b46d2590c9/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/098fff51-6c40-471b-8236-1b1ae8d943cb.mp4/r/THUMBNAIL_1080P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "dac09482-1532-4fba-9285-b134f9ac7267",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/dac09482-1532-4fba-9285-b134f9ac7267/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/dac09482-1532-4fba-9285-b134f9ac7267/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/098fff51-6c40-471b-8236-1b1ae8d943cb.mp4/r/THUMBNAIL_1080P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "ba189f1c-12de-4e92-b3eb-c00c36408e40",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ba189f1c-12de-4e92-b3eb-c00c36408e40/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ba189f1c-12de-4e92-b3eb-c00c36408e40/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/098fff51-6c40-471b-8236-1b1ae8d943cb.mp4/r/THUMBNAIL_1080P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "ffedeacb-58f7-46f6-8005-1ab96e96aa98",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ffedeacb-58f7-46f6-8005-1ab96e96aa98/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ffedeacb-58f7-46f6-8005-1ab96e96aa98/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/098fff51-6c40-471b-8236-1b1ae8d943cb.mp4/r/THUMBNAIL_1080P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "e93f3585-fd7e-4194-9acb-d5aaddfa84b2",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e93f3585-fd7e-4194-9acb-d5aaddfa84b2/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e93f3585-fd7e-4194-9acb-d5aaddfa84b2/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/098fff51-6c40-471b-8236-1b1ae8d943cb.mp4/r/THUMBNAIL_1080P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "183dda12-49a0-4659-868b-38d42cb73e3c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/183dda12-49a0-4659-868b-38d42cb73e3c/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/183dda12-49a0-4659-868b-38d42cb73e3c/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/098fff51-6c40-471b-8236-1b1ae8d943cb.mp4/r/THUMBNAIL_1080P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "cbfa704e-ff61-4e40-8173-8b7cb088d326",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/cbfa704e-ff61-4e40-8173-8b7cb088d326/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/cbfa704e-ff61-4e40-8173-8b7cb088d326/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/098fff51-6c40-471b-8236-1b1ae8d943cb.mp4/r/THUMBNAIL_1080P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Darkgreen": "https://m.media-amazon.com/images/I/31-gn0VZbhL._AC_SR38,50_.jpg",
    "Khaki": "https://m.media-amazon.com/images/I/31kePw0+ccL._AC_SR38,50_.jpg",
    "Pink": "https://m.media-amazon.com/images/I/31BC9iuiqVL._AC_SR38,50_.jpg",
    "White": "https://m.media-amazon.com/images/I/31ya0D4xG+L._AC_SR38,50_.jpg",
    "Blue": "https://m.media-amazon.com/images/I/31ESqICGbxL._AC_SR38,50_.jpg",
    "Watermelon": "https://m.media-amazon.com/images/I/31vaOjdC-HL._AC_SR38,50_.jpg",
    "Mint": "https://m.media-amazon.com/images/I/315sYZ9zLjL._AC_SR38,50_.jpg",
    "Darkpurple": "https://m.media-amazon.com/images/I/31ZTCSYy9dL._AC_SR38,50_.jpg",
    "Lightblue": "https://m.media-amazon.com/images/I/31GuohhTAhL._AC_SR38,50_.jpg",
    "Apricot": "https://m.media-amazon.com/images/I/31QiK70qJrL._AC_SR38,50_.jpg",
    "Rose": "https://m.media-amazon.com/images/I/31SaAYzXUkL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31eWZSRQf7L._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Darkgreen": "51jOQ7n3jsL",
    "Khaki": "51GmxzEVq1L",
    "Pink": "51Z6X036NyL",
    "White": "51-mEGDALsL",
    "Blue": "51RRbrKuDOL",
    "Watermelon": "51DtKzuuQfL",
    "Mint": "510zzdTos9L",
    "Darkpurple": "51KNwiolAQL",
    "Lightblue": "514Yrw98u6L",
    "Apricot": "51poqJ7NriL",
    "Rose": "51BOOZj8VJL",
    "Black": "51qPRaBoU1L"
  },
  "color_images": {
    "Darkgreen": [
      "https://m.media-amazon.com/images/I/51jOQ7n3jsL._SL1500_.jpg"
    ],
    "Khaki": [
      "https://m.media-amazon.com/images/I/51GmxzEVq1L._SL1500_.jpg"
    ],
    "Pink": [
      "https://m.media-amazon.com/images/I/51Z6X036NyL._SL1500_.jpg"
    ],
    "White": [
      "https://m.media-amazon.com/images/I/51-mEGDALsL._SL1500_.jpg"
    ],
    "Blue": [
      "https://m.media-amazon.com/images/I/51RRbrKuDOL._SL1500_.jpg"
    ],
    "Watermelon": [
      "https://m.media-amazon.com/images/I/51DtKzuuQfL._SL1500_.jpg"
    ],
    "Mint": [
      "https://m.media-amazon.com/images/I/510zzdTos9L._SL1500_.jpg"
    ],
    "Darkpurple": [
      "https://m.media-amazon.com/images/I/51KNwiolAQL._SL1500_.jpg"
    ],
    "Lightblue": [
      "https://m.media-amazon.com/images/I/514Yrw98u6L._SL1500_.jpg"
    ],
    "Apricot": [
      "https://m.media-amazon.com/images/I/51poqJ7NriL._SL1500_.jpg"
    ],
    "Rose": [
      "https://m.media-amazon.com/images/I/51BOOZj8VJL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/51qPRaBoU1L._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress-sleeveless",
      "title": "Womens Dress Sleeveless",
      "price": 40.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71ROAXb9J3L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-sleeveless",
      "title": "Womens Dress Sleeveless",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71quZoNcLYL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-ruched-evening-long-sleeve-bodycon",
      "title": "Womens Maxi Dress Cocktail Ruched Evening Long Sleeve Bodycon",
      "price": 46.97,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51OQMF8VX5L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-maxi",
      "title": "Womens Maxi Dress Bodycon Maxi",
      "price": 40.17,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/41bSqtJhKaL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 48.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61IlS+ROtkL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-bodycon-evening-sleeveless-v-neck-maxi",
      "title": "Womens Maxi Dress Bodycon Evening Sleeveless V Neck Maxi",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61mWvWOD+8L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 36.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61gUSDNnB3L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-ruched-sleeveless-bodycon",
      "title": "Womens Dress Ruched Sleeveless Bodycon",
      "price": 41.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51tFezn1whL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 76.9,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Wedding Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/514+blcsiGL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-formal-one-shoulder-mermaid",
      "title": "Womens Maxi Dress Cocktail Formal One Shoulder Mermaid",
      "price": 69.79,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/71iYonizZ1L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 109.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/61VzPPZgQXL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal",
      "title": "Womens Maxi Dress Formal",
      "price": 84.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61KmvUJ0NXL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-long-sleeve",
      "title": "Womens Maxi Dress Bodycon Long Sleeve",
      "price": 28.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71JTLYi9l-L._SL1500_.jpg"
      ]
    }
  ]
}