{
  "id": "womens-maxi-dress-long-sleeve",
  "handle": "womens-maxi-dress-long-sleeve",
  "sku": "JC2127",
  "asin": "B0C998MMK6",
  "title": "Womens Maxi Dress Long Sleeve",
  "title_original": "OFEEFAN Womens Knit Sweater Dress with Pockets Square Neck Long Sleeve Dresses",
  "brand": "Visit the OFEEFAN Store",
  "price": 14.99,
  "social_proof": {
    "bought_past_month": 317,
    "text": "317+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/817AIn3TieL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/711a2eCsOiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/719N3rKKXsL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71O2RIAaxoL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81GtSu0+fQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81pSaEtFLZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81ufkZrO0OL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81FrZnOm9zL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81+b0GU+w+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81ritPgFHaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/717qpwPLoLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81-m7jP8lQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81onRK9xdVL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81JrdalUVFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81BwebpAy9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/8107C6w3DZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81p83XI-tEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81UxCeWGYOL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81IflMhFPhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/818zEkUI2HL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81iI1c5J5GL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/817AIn3TieL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/711a2eCsOiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/719N3rKKXsL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71O2RIAaxoL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81GtSu0+fQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81pSaEtFLZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81ufkZrO0OL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81FrZnOm9zL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81+b0GU+w+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81ritPgFHaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/717qpwPLoLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81-m7jP8lQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81onRK9xdVL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81JrdalUVFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81BwebpAy9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/8107C6w3DZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81p83XI-tEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81UxCeWGYOL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81IflMhFPhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/818zEkUI2HL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81iI1c5J5GL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Item model number ‏": "‎ OFE-WDR9020-1",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ February 20, 2023",
    "ASIN ‏": "‎ B0D9JJ4DJR",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#3,441 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #25 in Women's Dresses",
    "Customer Reviews": "4.3 4.3 out of 5 stars (1,128)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "14-dark Purple",
      "Striped Black",
      "03-black",
      "01-green",
      "Striped Caramel",
      "Deep Green",
      "02-caramel",
      "Burgundy",
      "07-deep Grey",
      "Hot Pink",
      "08-rose Pink",
      "04-blue",
      "11-army Green",
      "Camrel Brown",
      "05-purple",
      "10-navy Blue",
      "06-red",
      "13-coffee"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.3,
    "count": 1128,
    "customers_say": "Customers find the dress fits beautifully and is perfect for casual outings, with one mentioning it pairs well with knee-length suede boots. They describe it as super soft, comfortable, and well-made, particularly noting its amazing quality. Customers love the color, with one specifically mentioning the chocolate brown shade, and appreciate its warmth for winter months, making it great for events in colder weather. Customers find the dress flattering, with one noting it works well for different body types. Generated from the text of customer reviews Select to learn more Fit (138) Style (105) Comfort (94) Soft fabric (82) Quality (62) Color (46) Warmth (36) Flattering (35) 138 customers mention fit, 100 positive, 38 negative 138 customers mention \"Fit\" 100 positive 38 negative Customers find the dress fits beautifully and is the perfect length for casual outings, with one customer noting it pairs well with knee-length suede boots. \" It has pockets! Fits great and it is flattering. Sizing was accurate and material is soft. I recommend following cleaning instructions and hang dry. \" Read more \" ...It's incredibly comfortable and soft, and it fits true to size . I'm 5'6\" and 105 pounds, and the size small was perfect for me.... \" Read more \" I liked the dress but it’s too short for me \" Read more \" This dress is wonderful. Fits well , it’s very flattering! I now have 3, and waiting on my 4th dress! Lots of good colors!... \" Read more 105 customers mention style, 100 positive, 5 negative 105 customers mention \"Style\" 100 positive 5 negative Customers find the dress cute and nice, with some mentioning it can be dressed up for more formal occasions. \" I really like this dress, it is soft and cute . But it runs very large. I ordered a Small based on other reviews. I normally wear a Medium.... \" Read more \" Cute dress but like other reviews said the black is a little see through and the waist is tight and a little to high and hits me in a weird spot.... \" Read more \" This dress is super cute but runs a little small. I wear a size 12 ordered an xl and it was a little snugger than I would have liked.... \" Read more \" Very cute , great quality! \" Read more 94 customers mention comfort, 94 positive, 0 negative 94 customers mention \"Comfort\" 94 positive 0 negative Customers find the dress comfortable, describing it as cozy and nice, with one customer particularly appreciating the pockets. \" The material is soft and comfortable . The temperature outside is finally getting cool enough to be able to wear it. I got the blue and I love it. \" Read more \" It's cute and comfy . The fabric is very soft however it is pretty thin. I don't think it's worth the price point. \" Read more \" oh this fit so well and was so comfortable . Im here buying another one in a different color. Now I have one for Oct/Nov one for jan/feb.... \" Read more \" True to size. Very comfortable . Well worth the money. I bought another in a different color. Great for work. Has pockets \" Read more 82 customers mention soft fabric, 81 positive, 1 negative 82 customers mention \"Soft fabric\" 81 positive 1 negative Customers appreciate the dress's soft fabric. \" It is a soft and cute dress, but it is way too small on top. The seam on the dress is way too high up when it should be lower at the waist. \" Read more \" ...It is super soft , and flattering. For the price, I wish it was a little thicker, but it seems to be great quality otherwise! \" Read more \" SO COMFY most dresses are too short but it goes to my knees very soft and flexible for reference im 5'9 and about 260lb and it fit so nice pretty... \" Read more \" Fast delivery and size was right on perfect and made well and so soft !! Color was just like the picture!! Thank you!! \" Read more 62 customers mention quality, 47 positive, 15 negative 62 customers mention \"Quality\" 47 positive 15 negative Customers find the dress well-made and amazing in quality. \" Love this dress , warm for winter months and chilly fall weather. Fits perfect. Love the color \" Read more \" ...For the price, I wish it was a little thicker, but it seems to be great quality otherwise! \" Read more \" True to size. Good quality . \" Read more \" Didn’t like quality . \" Read more 46 customers mention color, 38 positive, 8 negative 46 customers mention \"Color\" 38 positive 8 negative Customers love the color of the dress, with one specifically mentioning the cherry red shade. \" Food for, comfortable fabric, but a little short. Love the color (as pictured). I’ve washed a few times no shrinking. \" Read more \" Great dress soft and love the pockets. Great color \" Read more \" ...The waist doesn't work for a longer torso. The color was beautiful , the weight was just right - now to heavy nor to light. \" Read more \" First why 4 stars, it’s too short. The fit , color , material are great though. \" Read more 36 customers mention warmth, 35 positive, 1 negative 36 customers mention \"Warmth\" 35 positive 1 negative Customers find the dress warm and versatile, particularly suitable for winter months and events in colder weather. \" This dress is flattering, has pockets, is warm & fit so cute! It has a good sweater weight to the dress and was not see through. \" Read more \" This is the perfect winter dress ! It’s very soft, and I love that the sleeves aren’t tight. The length is perfect, coming just above my knee.... \" Read more \" ...Fits true to size and it’s soft. It’s a great dress for winter \" Read more \" ...It is definitely a fall or winter dress , since the material is warm I love that you can dress it up with accessories or keep in simple. Very cute. \" Read more 35 customers mention flattering, 27 positive, 8 negative 35 customers mention \"Flattering\" 27 positive 8 negative Customers find the dress flattering, with one mentioning it covers all curves and another noting it hugs in all the right places. \" It has pockets! Fits great and it is flattering . Sizing was accurate and material is soft. I recommend following cleaning instructions and hang dry. \" Read more \" This dress is very flattering and soft. It is a little on the thinner side but yet still keeps me warm in the colder weather.... \" Read more \" ...It was a flattering dress , but just not for the size I got and my shape. Felt like it made me look a lot older than I was. Great value for it though! \" Read more \" It’s not flattering on me , but I kept it because it’s comfortable for winter. \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Short but cute",
        "body": "Nice fabric.not thin. Somewhat stretchy. It’s a short dress. You need leggings or opaque stockings. Love the pockets. This is an xl. Read more",
        "author": "diamond girl",
        "rating": 5.0,
        "date": "December 9, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71tCJohhgjL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/712Q1Xx300L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Warm versatile comfortable dress",
        "body": "So comfortable. True to size. Worked great for funeral and will be great for church. The dress is easy to wash and hang dry. The material is soft, breathable , but is not see through. Good quality for the money. Read more",
        "author": "Dilleygal",
        "rating": 5.0,
        "date": "November 30, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Sleeves are long & loose at hem",
        "body": "Cute style; very soft & comfortable. Length & size is good but sleeves were too wide at the cuff & too long Read more",
        "author": "Kay",
        "rating": 4.0,
        "date": "October 10, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Cute",
        "body": "So cute and true to size. Soft and comfy not scratchy. Love it with boots!!! Read more",
        "author": "Amanda",
        "rating": 5.0,
        "date": "November 3, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Very flattering dress",
        "body": "Love this dress! Very flattering to my figure since it’s fitted in the waist. I wear it with light brown boots. Also looks great with a belt. Lots of compliments. Read more",
        "author": "E. A. Clark",
        "rating": 5.0,
        "date": "December 21, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Cute but not worth the price point",
        "body": "It's cute and comfy. The fabric is very soft however it is pretty thin. I don't think it's worth the price point. Read more",
        "author": "Kris",
        "rating": 3.0,
        "date": "February 11, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Love this dress!",
        "body": "I was surprised at how much I love this dress. It’s so comfortable! Read more",
        "author": "Ashley",
        "rating": 5.0,
        "date": "November 25, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Super cute",
        "body": "Cute dress. Have not wore it yet but it fits well. Read more",
        "author": "Pamela",
        "rating": 5.0,
        "date": "December 16, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.",
  "about_this_item": "Womens Maxi Dress Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.",
  "long_description": "Womens Maxi Dress Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: 14-dark Purple, Striped Black, 03-black, 01-green, Striped Caramel, Deep Green, 02-caramel, Burgundy, 07-deep Grey, Hot Pink, 08-rose Pink, 04-blue, 11-army Green, Camrel Brown. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: 14-dark Purple, Striped Black, 03-black, 01-green, Striped Caramel, Deep Green, 02-caramel, Burgundy, 07-deep Grey, Hot Pink, 08-rose Pink, 04-blue, 11-army Green, Camrel Brown. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "7e94ca38-46a9-4094-909a-a9f01f031cb8",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7e94ca38-46a9-4094-909a-a9f01f031cb8/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7e94ca38-46a9-4094-909a-a9f01f031cb8/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "ca758e2a-00ce-4ce5-8109-2ce9d200d08e",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ca758e2a-00ce-4ce5-8109-2ce9d200d08e/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ca758e2a-00ce-4ce5-8109-2ce9d200d08e/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "078c2dc3-8edd-4e45-9e90-91c1c09b0814",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/078c2dc3-8edd-4e45-9e90-91c1c09b0814/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/078c2dc3-8edd-4e45-9e90-91c1c09b0814/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "67d6dfd4-7ca6-4ad4-ae4f-937b067796de",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/67d6dfd4-7ca6-4ad4-ae4f-937b067796de/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/67d6dfd4-7ca6-4ad4-ae4f-937b067796de/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "c1b22d4e-eb62-4c08-ab7c-96b21d386bb4",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c1b22d4e-eb62-4c08-ab7c-96b21d386bb4/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c1b22d4e-eb62-4c08-ab7c-96b21d386bb4/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "95c817e5-28cd-47bb-ab74-7560fd012f40",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/95c817e5-28cd-47bb-ab74-7560fd012f40/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/95c817e5-28cd-47bb-ab74-7560fd012f40/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "3dd04b7f-128e-4494-b94f-7c2377df8443",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3dd04b7f-128e-4494-b94f-7c2377df8443/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3dd04b7f-128e-4494-b94f-7c2377df8443/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "862906c4-b697-4061-b6b2-a1bb4c29813f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/862906c4-b697-4061-b6b2-a1bb4c29813f/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/862906c4-b697-4061-b6b2-a1bb4c29813f/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "38e02064-66a3-4b6c-8cbd-9f6b152cdd4c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/38e02064-66a3-4b6c-8cbd-9f6b152cdd4c/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/38e02064-66a3-4b6c-8cbd-9f6b152cdd4c/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "f9483594-7818-4770-99b2-7a2b23905d3e",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f9483594-7818-4770-99b2-7a2b23905d3e/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f9483594-7818-4770-99b2-7a2b23905d3e/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "b788a659-3a2b-4c6e-b531-562cdfdcc4d2",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b788a659-3a2b-4c6e-b531-562cdfdcc4d2/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b788a659-3a2b-4c6e-b531-562cdfdcc4d2/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "fb14dbea-c707-4669-9dda-d5653b3d5615",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/fb14dbea-c707-4669-9dda-d5653b3d5615/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/fb14dbea-c707-4669-9dda-d5653b3d5615/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "14-dark Purple": "https://m.media-amazon.com/images/I/51Op5UcDx+L._AC_SR38,50_.jpg",
    "Striped Black": "https://m.media-amazon.com/images/I/513VxDAllqL._AC_SR38,50_.jpg",
    "03-black": "https://m.media-amazon.com/images/I/41-6DyrLNmL._AC_SR38,50_.jpg",
    "01-green": "https://m.media-amazon.com/images/I/51KgubuPC0L._AC_SR38,50_.jpg",
    "Striped Caramel": "https://m.media-amazon.com/images/I/5115L8Onk7L._AC_SR38,50_.jpg",
    "Deep Green": "https://m.media-amazon.com/images/I/41rydbY0HqL._AC_SR38,50_.jpg",
    "02-caramel": "https://m.media-amazon.com/images/I/51zp3F7C6lL._AC_SR38,50_.jpg",
    "Burgundy": "https://m.media-amazon.com/images/I/41FkxD2zsWL._AC_SR38,50_.jpg",
    "07-deep Grey": "https://m.media-amazon.com/images/I/41+Yz87tp4L._AC_SR38,50_.jpg",
    "Hot Pink": "https://m.media-amazon.com/images/I/41Z73nEwwvL._AC_SR38,50_.jpg",
    "08-rose Pink": "https://m.media-amazon.com/images/I/417QqiPo-ZL._AC_SR38,50_.jpg",
    "04-blue": "https://m.media-amazon.com/images/I/51D4dB8v0LL._AC_SR38,50_.jpg",
    "11-army Green": "https://m.media-amazon.com/images/I/41wdgEeNbXL._AC_SR38,50_.jpg",
    "Camrel Brown": "https://m.media-amazon.com/images/I/41bfmvkBXxL._AC_SR38,50_.jpg",
    "05-purple": "https://m.media-amazon.com/images/I/51SeMXXcFiL._AC_SR38,50_.jpg",
    "10-navy Blue": "https://m.media-amazon.com/images/I/51ucnesXJPL._AC_SR38,50_.jpg",
    "06-red": "https://m.media-amazon.com/images/I/51D26vdcJAL._AC_SR38,50_.jpg",
    "13-coffee": "https://m.media-amazon.com/images/I/519PIfsdbML._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "14-dark Purple": "81GtSu0+fQL",
    "Striped Black": "81pSaEtFLZL",
    "03-black": "817AIn3TieL",
    "01-green": "81ufkZrO0OL",
    "Striped Caramel": "81FrZnOm9zL",
    "Deep Green": "81+b0GU+w+L",
    "02-caramel": "81ritPgFHaL",
    "Burgundy": "717qpwPLoLL",
    "07-deep Grey": "81-m7jP8lQL",
    "Hot Pink": "81onRK9xdVL",
    "08-rose Pink": "81JrdalUVFL",
    "04-blue": "81BwebpAy9L",
    "11-army Green": "8107C6w3DZL",
    "Camrel Brown": "81p83XI-tEL",
    "05-purple": "81UxCeWGYOL",
    "10-navy Blue": "81IflMhFPhL",
    "06-red": "818zEkUI2HL",
    "13-coffee": "81iI1c5J5GL"
  },
  "color_images": {
    "14-dark Purple": [
      "https://m.media-amazon.com/images/I/81GtSu0+fQL._SL1500_.jpg"
    ],
    "Striped Black": [
      "https://m.media-amazon.com/images/I/81pSaEtFLZL._SL1500_.jpg"
    ],
    "03-black": [
      "https://m.media-amazon.com/images/I/817AIn3TieL._SL1500_.jpg"
    ],
    "01-green": [
      "https://m.media-amazon.com/images/I/81ufkZrO0OL._SL1500_.jpg"
    ],
    "Striped Caramel": [
      "https://m.media-amazon.com/images/I/81FrZnOm9zL._SL1500_.jpg"
    ],
    "Deep Green": [
      "https://m.media-amazon.com/images/I/81+b0GU+w+L._SL1500_.jpg"
    ],
    "02-caramel": [
      "https://m.media-amazon.com/images/I/81ritPgFHaL._SL1500_.jpg"
    ],
    "Burgundy": [
      "https://m.media-amazon.com/images/I/717qpwPLoLL._SL1500_.jpg"
    ],
    "07-deep Grey": [
      "https://m.media-amazon.com/images/I/81-m7jP8lQL._SL1500_.jpg"
    ],
    "Hot Pink": [
      "https://m.media-amazon.com/images/I/81onRK9xdVL._SL1500_.jpg"
    ],
    "08-rose Pink": [
      "https://m.media-amazon.com/images/I/81JrdalUVFL._SL1500_.jpg"
    ],
    "04-blue": [
      "https://m.media-amazon.com/images/I/81BwebpAy9L._SL1500_.jpg"
    ],
    "11-army Green": [
      "https://m.media-amazon.com/images/I/8107C6w3DZL._SL1500_.jpg"
    ],
    "Camrel Brown": [
      "https://m.media-amazon.com/images/I/81p83XI-tEL._SL1500_.jpg"
    ],
    "05-purple": [
      "https://m.media-amazon.com/images/I/81UxCeWGYOL._SL1500_.jpg"
    ],
    "10-navy Blue": [
      "https://m.media-amazon.com/images/I/81IflMhFPhL._SL1500_.jpg"
    ],
    "06-red": [
      "https://m.media-amazon.com/images/I/818zEkUI2HL._SL1500_.jpg"
    ],
    "13-coffee": [
      "https://m.media-amazon.com/images/I/81iI1c5J5GL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress-cocktail-bodycon",
      "title": "Womens Dress Cocktail Bodycon",
      "price": 47.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61NfEwzl3xL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-one-shoulder-maxi-formal",
      "title": "Womens Maxi Dress Evening One Shoulder Maxi Formal",
      "price": 69.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/5150AIQL4eL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail",
      "title": "Womens Dress Cocktail",
      "price": 103.54,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61JApwce25L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-formal-bodycon-evening-sleeveless",
      "title": "Womens Maxi Dress Maxi Formal Bodycon Evening Sleeveless",
      "price": 61.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61s8qg6u1VL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 158.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71PmRANW40L._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress-bodycon-split-ruched-off-shoulder",
      "title": "Womens Dress Bodycon Split Ruched Off Shoulder",
      "price": 38.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/41JjYcPgcpL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 95.61,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Work",
      "images": [
        "https://m.media-amazon.com/images/I/71hVgSIB1jL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 138.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51PZNrlyY9L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-split-evening-formal",
      "title": "Womens Maxi Dress Split Evening Formal",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51BZ1BqPx8L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 65.97,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/81wr8PDg55L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-v-neck",
      "title": "Womens Dress V Neck",
      "price": 82.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/710bSTpZ9hL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 278.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/91YXeyW506L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening-long-sleeve",
      "title": "Womens Maxi Dress Formal Evening Long Sleeve",
      "price": 87.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61nnk+flvaL._SL1500_.jpg"
      ]
    }
  ]
}