{
  "id": "womens-maxi-dress-long-sleeve-maxi-v-neck",
  "handle": "womens-maxi-dress-long-sleeve-maxi-v-neck",
  "sku": "JC1229",
  "asin": "B0CBRZQ5XV",
  "title": "Womens Maxi Dress Long Sleeve Maxi V Neck",
  "title_original": "BTFBM Women Fall Maxi Dresses 2025 Long Sleeve V Neck Swiss Dots High Waisted A-Line Ruffle Boho Long Dress Vacation",
  "brand": "Visit the BTFBM Store",
  "price": 53.99,
  "social_proof": {
    "bought_past_month": 809,
    "text": "809+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/713UUM+RilL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71GLNJu-LIL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71c3B4AH0oL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Q7nL+uzAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71VnGdrAhrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Ic1Gq72-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71XKP61H-ML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71BEVMc6W1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71PdducuacL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71qcxSWQ15L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ov2gwcBAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61R-RgsZHhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71g4sxvn-DL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/716zd811iuL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/713s1kuG9tL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/714LSMftd4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61W8tbVEdbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/716QWxt2SfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ajmej3esL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61OlvhYhjQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ViOEz1-2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71qX5Om2oqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71e3Rfbea1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ymHjE7yQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71zSgsS7PFL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/713UUM+RilL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71GLNJu-LIL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71c3B4AH0oL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Q7nL+uzAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71VnGdrAhrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Ic1Gq72-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71XKP61H-ML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71BEVMc6W1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71PdducuacL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71qcxSWQ15L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ov2gwcBAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61R-RgsZHhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71g4sxvn-DL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/716zd811iuL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/713s1kuG9tL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/714LSMftd4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61W8tbVEdbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/716QWxt2SfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ajmej3esL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61OlvhYhjQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ViOEz1-2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71qX5Om2oqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71e3Rfbea1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ymHjE7yQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71zSgsS7PFL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Item model number ‏": "‎ ZD025",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ August 10, 2023",
    "ASIN ‏": "‎ B0CBRZS42P",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#37,017 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #104 in Women's Formal Dresses",
    "Customer Reviews": "4.2 4.2 out of 5 stars (1,139)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Sky Blue",
      "Blue",
      "Army Green",
      "Black",
      "Coffee",
      "Orange",
      "Dark Green",
      "Rose Red",
      "Navy",
      "Wine Red",
      "Khaki",
      "Pink",
      "White",
      "Beige",
      "Purple",
      "Yellow",
      "Royal Blue",
      "Light Khaki"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.2,
    "count": 1139,
    "customers_say": "Customers find the dress well-made and comfortable, with a perfect length that works well for various body types. They appreciate its versatility, noting it can be dressed up and styled, and one customer mentions it works well for both shapely and curvy figures. Customers like the fabric quality, with one describing it as light and flowy. Generated from the text of customer reviews Select to learn more Look (115) Fit (114) Quality (78) Size (68) Comfort (62) Color (44) Flattering (41) Fabric quality (34) 115 customers mention look, 102 positive, 13 negative 115 customers mention \"Look\" 102 positive 13 negative Customers find the dress visually appealing and versatile, noting it can be dressed up and styled in various ways. One customer mentions wearing it to church, while another appreciates its Shein quality. \" Beautiful dress , bought it for a Fall Wedding and it was exactly what I wanted. Fit runs a little smaller so order a size up. \" Read more \" Beautiful , carefree dress. Easy to wear great length and youthful but not too young. The details are great, extra snap at neckline.... \" Read more \" The dress is a cute , flattering silhouette however there were lots of strings on the dots that I’m afraid will disintegrate when it’s washed.... \" Read more \" Worn for my baby shower, loved it! Modest but still pretty , fits pregnancy boobs and has a little modesty clasp if you want more/less cleavage \" Read more 114 customers mention fit, 91 positive, 23 negative 114 customers mention \"Fit\" 91 positive 23 negative Customers like how the dress fits, with one mentioning it provides plenty of room and another noting it's not too long for the arms. \" I love this dress so much! It fit perfectly , and i feel like is a perfect color for fall! Can’t wait to wear it for my event \" Read more \" ...Super comfy. I’m a size 12/14 regular and am big busted. Fits great and is flattering around the arms, waist, and bust. It’s also a great length.... \" Read more \" Comfortable and great fit ! I felt beautiful in this dress! It’s not a heavy fabric but isn’t too thin either.... \" Read more \" Cute dress but not for my body type . I ordered the green one and the polka dots were very light green.... \" Read more 78 customers mention quality, 71 positive, 7 negative 78 customers mention \"Quality\" 71 positive 7 negative Customers find the dress to be well-made and of great quality. \" This is a great dress , fit is great and is a midi on someone 5’10”. Worn to a wedding with booties. \" Read more \" Dress is a great color and well made . It fits me perfectly and I always receive compliments on the color. \" Read more \" Fabric weight is perfect for most season. Great quality and functionality to change from casual to dress by using different accessories.... \" Read more \" Love this dress ! Washes up great and doesn't wrinkle in a suitcase. \" Read more 68 customers mention size, 49 positive, 19 negative 68 customers mention \"Size\" 49 positive 19 negative Customers are satisfied with the dress's sizing, particularly noting that the length is perfect and the sleeves are suitable for fall and winter wear. \" True to size but not a flattering cut for me at all. I also found the material to be scratchy and irritating to my skin. Not a keeper. \" Read more \" This is a great length , not too thick of a material, and can be dressed up and styled! I wore to a wedding and got so many compliments! \" Read more \" Runs a tad big , but very pretty! I love it! Nice, comfortable material. Would buy again in another color, for sure! \" Read more \" Length is great for a 5’7”. Looks great and pretty good quality. Can be used for any occasion from wedding to work to casual. \" Read more 62 customers mention comfort, 62 positive, 0 negative 62 customers mention \"Comfort\" 62 positive 0 negative Customers find the dress comfortable. \" I was very surprised with this dress. I needed something comfortable and dressy at the same time to speak at a conference and this more than did the... \" Read more \" I love the fabric and the length. The dress is very comfortable and the flow of the dress is perfect.... \" Read more \" ...Although the fabric is lightweight and a bit thin, but it is so comfortable . I love the fit and it is so flattering. \" Read more \" This is the most comfortable dress . The fabric is really nice and the dots on the fabric really make it look nice. It fit perfectly. \" Read more 44 customers mention color, 37 positive, 7 negative 44 customers mention \"Color\" 37 positive 7 negative Customers love the color of the dress, particularly its perfect Christmas green shade, and one customer mentions it comes in several shades. \" I love the color , the cut hides many flaws, provides plenty of room, I would size down if I purchased another one. It’s sassy and flirty! \" Read more \" ...but it's just the right lint I'm only 5'3 wrinkle resistant, beautiful color . \" Read more \" Loved the color . I liked the loose fitting as it was breathable. The material was good and you can definitely work it for casual setting.... \" Read more \" ...Received so many compliments on the style, material and color . Perfect dress for a fall wedding guest and would recommend highly.... \" Read more 41 customers mention flattering, 31 positive, 10 negative 41 customers mention \"Flattering\" 31 positive 10 negative Customers find the dress flattering, with one mentioning it works well for both shapely and curvy women. \" ...the dress moved and fell more from the upper waist than middle, very flattering and the material is so soft! Great buy! Washes up very nicely too. \" Read more \" ...The orange color is beautiful for fall. It was flattering with a stretchy waist, length was great, and the quality can’t be beat for the price.... \" Read more \" Super comfortable and flattering dress ! Love the details \" Read more \" ...waist with the elastic, the polka dots were in exact lines and was not flattering .... \" Read more 34 customers mention fabric quality, 26 positive, 8 negative 34 customers mention \"Fabric quality\" 26 positive 8 negative Customers like the fabric of the dress, describing it as nice and of good quality, with one customer noting its light and flowy texture. \" Beautiful dress, light flowy fabric , loved the dots. Great for many occasions \" Read more \" ...It's true to size and it looks so feminine. The fabric is amazing and the weight is perfect. The price was great too.... \" Read more \" ...I have to say that I love this dress!! The fabric is gorgeous . It is well made and absolutely stunning!!... \" Read more \" The design of the dress is beautiful however the material is not very pretty to me. Returning the dress. \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Beautiful dress. Fits amazing.",
        "body": "This dress is amazing! I received so many compliments. I ordered a size large.. I’m 5’3” & 160 lbs. The length came to my ankles, which is the length I was going for. I paired it with some wedges. It’s very comfortable. I would definitely order again Read more",
        "author": "yehshwhhsj",
        "rating": 5.0,
        "date": "October 26, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Beautiful dress",
        "body": "Beautiful color, good quality and fit Read more",
        "author": "norm",
        "rating": 5.0,
        "date": "November 16, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Well made, but not for bigger chested bodies",
        "body": "Cute dress but not for my body type. I ordered the green one and the polka dots were very light green. Along the waist with the elastic, the polka dots were in exact lines and was not flattering. Also, as someone else mentioned, with a bigger chest the snap pulls at the material. The dress fit well everywhere else and seems to be well made, but not for me. Read more",
        "author": "DTrees",
        "rating": 4.0,
        "date": "November 1, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/713RrodHlrL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/813Elhr-gLL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/81nWa4qsbcL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Amazing dress!",
        "body": "Amazing dress. So comfortable and I get so many compliments. Read more",
        "author": "Jaimie Brown",
        "rating": 5.0,
        "date": "December 18, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Colors and fit are accurate",
        "body": "I love this dress so much! The color is perfect for fall! I ordered the navy and the burgundy. I got it to wear to a fall wedding and now I’m torn between the colors. The fit is great. Very flattering and hides my bottom half which is not very lovely. The size is true to size. Read more",
        "author": "VickiSu",
        "rating": 5.0,
        "date": "September 6, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Shein quality for boutique price",
        "body": "This dress did come in clutch last minute for an event because my dress I ordered for the event was delayed however it is literally shein quality for boutique price. If it was 20 or 30 dollars I would give it 5 stars. Not worth 60. Read more",
        "author": "Kelsey",
        "rating": 3.0,
        "date": "October 31, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars White dress with long sleeves and longer length",
        "body": "I love this dress. I needed a longer white dress, and this one is perfect. It fits beautifully, is very comfortable, and I have had many compliments each time I have worn it. Read more",
        "author": "Betty",
        "rating": 5.0,
        "date": "October 27, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Great dress",
        "body": "Beautiful & comfortable dress. Good quality. Read more",
        "author": "kgehrhardt",
        "rating": 5.0,
        "date": "December 14, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Long Sleeve Maxi V Neck is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.",
  "about_this_item": "Womens Maxi Dress Long Sleeve Maxi V Neck is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.",
  "long_description": "Womens Maxi Dress Long Sleeve Maxi V Neck is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Sky Blue, Blue, Army Green, Black, Coffee, Orange, Dark Green, Rose Red, Navy, Wine Red, Khaki, Pink, White, Beige. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Long Sleeve Maxi V Neck is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Sky Blue, Blue, Army Green, Black, Coffee, Orange, Dark Green, Rose Red, Navy, Wine Red, Khaki, Pink, White, Beige. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "98fbf520-9b78-45f1-bb11-4eb96d873a9f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/98fbf520-9b78-45f1-bb11-4eb96d873a9f/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/98fbf520-9b78-45f1-bb11-4eb96d873a9f/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "ebb64c87-370c-426a-ad1a-883fa68a9bd5",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ebb64c87-370c-426a-ad1a-883fa68a9bd5/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ebb64c87-370c-426a-ad1a-883fa68a9bd5/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "7622cce2-b279-4014-b6d3-e2725f66f51c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7622cce2-b279-4014-b6d3-e2725f66f51c/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7622cce2-b279-4014-b6d3-e2725f66f51c/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "d6ceb3b2-6f63-4cc3-ac49-a35f4b8aeb77",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d6ceb3b2-6f63-4cc3-ac49-a35f4b8aeb77/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d6ceb3b2-6f63-4cc3-ac49-a35f4b8aeb77/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "0ed6a70d-1061-49c3-88ac-dfbd377b91b9",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0ed6a70d-1061-49c3-88ac-dfbd377b91b9/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0ed6a70d-1061-49c3-88ac-dfbd377b91b9/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "55e03bd4-1099-4086-93f9-89bd9c0f46c4",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/55e03bd4-1099-4086-93f9-89bd9c0f46c4/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/55e03bd4-1099-4086-93f9-89bd9c0f46c4/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "3cac070e-ba5d-46b9-be04-035e1682d492",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3cac070e-ba5d-46b9-be04-035e1682d492/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3cac070e-ba5d-46b9-be04-035e1682d492/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "ccbd9d98-9fc9-47a4-9155-05b290fd8e43",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ccbd9d98-9fc9-47a4-9155-05b290fd8e43/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ccbd9d98-9fc9-47a4-9155-05b290fd8e43/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "a741d8d2-2885-4a78-818e-d6cb7362010f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a741d8d2-2885-4a78-818e-d6cb7362010f/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a741d8d2-2885-4a78-818e-d6cb7362010f/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "c2d55e96-2868-4f2e-9138-ab89c9fac6e1",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c2d55e96-2868-4f2e-9138-ab89c9fac6e1/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c2d55e96-2868-4f2e-9138-ab89c9fac6e1/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "322aa4df-19e7-490d-856b-b699878308ba",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/322aa4df-19e7-490d-856b-b699878308ba/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/322aa4df-19e7-490d-856b-b699878308ba/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "7a8161e4-748d-4d1a-aac0-ff5d938c18b1",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7a8161e4-748d-4d1a-aac0-ff5d938c18b1/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7a8161e4-748d-4d1a-aac0-ff5d938c18b1/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Sky Blue": "https://m.media-amazon.com/images/I/4164MT8f-tL._AC_SR38,50_.jpg",
    "Blue": "https://m.media-amazon.com/images/I/41vyTdaI-9L._AC_SR38,50_.jpg",
    "Army Green": "https://m.media-amazon.com/images/I/31ZkDiA1eFL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/41yX-3gNMcL._AC_SR38,50_.jpg",
    "Coffee": "https://m.media-amazon.com/images/I/41uUyMY27CL._AC_SR38,50_.jpg",
    "Orange": "https://m.media-amazon.com/images/I/411uhaMaj3L._AC_SR38,50_.jpg",
    "Dark Green": "https://m.media-amazon.com/images/I/41EPvnp6WTL._AC_SR38,50_.jpg",
    "Rose Red": "https://m.media-amazon.com/images/I/31rMrHgNcEL._AC_SR38,50_.jpg",
    "Navy": "https://m.media-amazon.com/images/I/41WMSJDAZ7L._AC_SR38,50_.jpg",
    "Wine Red": "https://m.media-amazon.com/images/I/410c0BVlSVL._AC_SR38,50_.jpg",
    "Khaki": "https://m.media-amazon.com/images/I/41ILXuSBKHL._AC_SR38,50_.jpg",
    "Pink": "https://m.media-amazon.com/images/I/41dnw9fsr7L._AC_SR38,50_.jpg",
    "White": "https://m.media-amazon.com/images/I/31IDYDr-jXL._AC_SR38,50_.jpg",
    "Beige": "https://m.media-amazon.com/images/I/31zOBsOXloL._AC_SR38,50_.jpg",
    "Purple": "https://m.media-amazon.com/images/I/41jbwHfVE0L._AC_SR38,50_.jpg",
    "Yellow": "https://m.media-amazon.com/images/I/41DHc+KNMKL._AC_SR38,50_.jpg",
    "Royal Blue": "https://m.media-amazon.com/images/I/41STSewOO8L._AC_SR38,50_.jpg",
    "Light Khaki": "https://m.media-amazon.com/images/I/41fx+mfBLoL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Sky Blue": "71PdducuacL",
    "Blue": "71qcxSWQ15L",
    "Army Green": "71ov2gwcBAL",
    "Black": "61R-RgsZHhL",
    "Coffee": "71g4sxvn-DL",
    "Orange": "716zd811iuL",
    "Dark Green": "713s1kuG9tL",
    "Rose Red": "714LSMftd4L",
    "Navy": "61W8tbVEdbL",
    "Wine Red": "713UUM+RilL",
    "Khaki": "716QWxt2SfL",
    "Pink": "71ajmej3esL",
    "White": "61OlvhYhjQL",
    "Beige": "71ViOEz1-2L",
    "Purple": "71qX5Om2oqL",
    "Yellow": "71e3Rfbea1L",
    "Royal Blue": "71ymHjE7yQL",
    "Light Khaki": "71zSgsS7PFL"
  },
  "color_images": {
    "Sky Blue": [
      "https://m.media-amazon.com/images/I/71PdducuacL._SL1500_.jpg"
    ],
    "Blue": [
      "https://m.media-amazon.com/images/I/71qcxSWQ15L._SL1500_.jpg"
    ],
    "Army Green": [
      "https://m.media-amazon.com/images/I/71ov2gwcBAL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/61R-RgsZHhL._SL1500_.jpg"
    ],
    "Coffee": [
      "https://m.media-amazon.com/images/I/71g4sxvn-DL._SL1500_.jpg"
    ],
    "Orange": [
      "https://m.media-amazon.com/images/I/716zd811iuL._SL1500_.jpg"
    ],
    "Dark Green": [
      "https://m.media-amazon.com/images/I/713s1kuG9tL._SL1500_.jpg"
    ],
    "Rose Red": [
      "https://m.media-amazon.com/images/I/714LSMftd4L._SL1500_.jpg"
    ],
    "Navy": [
      "https://m.media-amazon.com/images/I/61W8tbVEdbL._SL1500_.jpg"
    ],
    "Wine Red": [
      "https://m.media-amazon.com/images/I/713UUM+RilL._SL1500_.jpg"
    ],
    "Khaki": [
      "https://m.media-amazon.com/images/I/716QWxt2SfL._SL1500_.jpg"
    ],
    "Pink": [
      "https://m.media-amazon.com/images/I/71ajmej3esL._SL1500_.jpg"
    ],
    "White": [
      "https://m.media-amazon.com/images/I/61OlvhYhjQL._SL1500_.jpg"
    ],
    "Beige": [
      "https://m.media-amazon.com/images/I/71ViOEz1-2L._SL1500_.jpg"
    ],
    "Purple": [
      "https://m.media-amazon.com/images/I/71qX5Om2oqL._SL1500_.jpg"
    ],
    "Yellow": [
      "https://m.media-amazon.com/images/I/71e3Rfbea1L._SL1500_.jpg"
    ],
    "Royal Blue": [
      "https://m.media-amazon.com/images/I/71ymHjE7yQL._SL1500_.jpg"
    ],
    "Light Khaki": [
      "https://m.media-amazon.com/images/I/71zSgsS7PFL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress-cocktail-sleeveless-v-neck",
      "title": "Womens Dress Cocktail Sleeveless V Neck",
      "price": 35.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61Rt2VP5kGL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-evening-mermaid-cocktail-one-shoulder-bodycon-formal",
      "title": "Womens Dress Evening Mermaid Cocktail One Shoulder Bodycon Formal",
      "price": 62.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/7143R-SBXLL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-maxi-evening-cocktail-bodycon-ruched",
      "title": "Womens Maxi Dress Formal Maxi Evening Cocktail Bodycon Ruched",
      "price": 53.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61FIQsn+WdL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 29.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/718V99KT1vL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-v-neck",
      "title": "Womens Dress V Neck",
      "price": 48.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61qpJfEpIXL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-long-sleeve-maxi",
      "title": "Womens Maxi Dress Long Sleeve Maxi",
      "price": 33.29,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51Z7G4x4yEL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 42.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71uOGI9UqTL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-formal-v-neck-bodycon",
      "title": "Womens Dress Formal V Neck Bodycon",
      "price": 36.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Work",
      "images": [
        "https://m.media-amazon.com/images/I/51qWqaIAjEL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening",
      "title": "Womens Maxi Dress Formal Evening",
      "price": 76.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/617cJEuOdgL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 20.9,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61Td-AslRfL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-long-sleeve",
      "title": "Womens Maxi Dress Bodycon Long Sleeve",
      "price": 48.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51lq6qHEjqL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-ruched-maxi-long-sleeve-formal",
      "title": "Womens Maxi Dress Bodycon Ruched Maxi Long Sleeve Formal",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51BYsb5uaCL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-bodycon",
      "title": "Womens Maxi Dress Long Sleeve Bodycon",
      "price": 149.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71IHmbVTrSL._SL1500_.jpg"
      ]
    }
  ]
}