{
  "id": "womens-maxi-dress-formal-maxi",
  "handle": "womens-maxi-dress-formal-maxi",
  "sku": "JC2567",
  "asin": "B0CBKMV2VW",
  "title": "Womens Maxi Dress Formal Maxi",
  "title_original": "Sissyaki Women's Retro V-Neck Velvet Maxi Dress Wedding Guest Formal Party Long Dresses",
  "brand": "Visit the Sissyaki Store",
  "price": 59.99,
  "social_proof": {
    "bought_past_month": 315,
    "text": "315+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/71vrdaLYp0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81fWl56heJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81NAlUeFq8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/815uKmvhi0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/817KzeyDh+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Ru5Lk8P+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71QCzuZ+3rL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ycXqiU4TL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Gxh2yFwAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61KZKcU3meL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/718PwjNoP9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71uoh6FIhQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71690Fv3LtL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71eqHiXkY0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71HLbxX2hWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/712izxdk5zL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71yplI-lbyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/713ouPlqWjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/610Nybq7HrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71E7ZvBubTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71n3WneQazL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/71vrdaLYp0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81fWl56heJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81NAlUeFq8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/815uKmvhi0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/817KzeyDh+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Ru5Lk8P+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71QCzuZ+3rL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ycXqiU4TL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Gxh2yFwAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61KZKcU3meL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/718PwjNoP9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71uoh6FIhQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71690Fv3LtL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71eqHiXkY0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71HLbxX2hWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/712izxdk5zL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71yplI-lbyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/713ouPlqWjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/610Nybq7HrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71E7ZvBubTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71n3WneQazL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ July 10, 2023",
    "ASIN ‏": "‎ B0DQ17N9PQ",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#39,493 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #102 in Women's Formal Dresses",
    "Customer Reviews": "4.3 4.3 out of 5 stars (357)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "C#burnt Orange",
      "A#leopard",
      "C#dark Green",
      "A#hazeblue",
      "A#chocolate",
      "C#coffee",
      "A#lake Blue",
      "Army Green",
      "A#coffee",
      "A#dark Green",
      "C#black",
      "A#burgundy",
      "C#red",
      "A#navy Blue",
      "A#purple",
      "A#dark Olive",
      "A#pumpkin"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.3,
    "count": 357,
    "customers_say": "Customers find the dress fits true to size with a flattering cut, and one mentions it's comfortable enough for chasing around two preschoolers. Moreover, the thick corded fabric makes it perfect for fall events, and customers appreciate its high-quality look, with one noting it matches all skin tones. Additionally, the dress receives positive feedback for its comfort, quality, and flattering design. Generated from the text of customer reviews Select to learn more Fit (73) Beauty (59) Comfort (48) Quality (42) Dress fit (30) Fabric quality (29) Flattering (27) Color accuracy (23) 73 customers mention fit, 58 positive, 15 negative 73 customers mention \"Fit\" 58 positive 15 negative Customers are satisfied with how the dress fits, noting that it is true to size and has a flattering cut. \" This dress was true to size and exactly how it looks in the advertised photo on the model; my family loved how it looked on me and I was very... \" Read more \" Highly recommend this dress! It was the perfect length and the perfect fit . The material is very comfortable as well.... \" Read more \" Fits true to size however the color was not what was pictured. Still a pretty and comfortable dress though! \" Read more \" ...I'm 25 anymore. The dress was comfortable. The sleeves were a little tight and would creep up thats the reason for not giving a 5 star.... \" Read more 59 customers mention beauty, 58 positive, 1 negative 59 customers mention \"Beauty\" 58 positive 1 negative Customers find the dress beautiful, describing it as gorgeous with a high-quality look, and one customer specifically mentions its attractive velvet green color. \" Beautiful dress , true to size and high quality. Perfect for wedding \" Read more \" This dress is beautiful ! The material was quality. It fit pretty tts. I am 5’4 140 and 38DD. The top was just too small for my bust.... \" Read more \" I ordered this dress for a wedding & it’s absolutely gorgeous . it is low cut so you might need a pin if you have a larger chest like I do.... \" Read more \" Cute but was not happy with material \" Read more 48 customers mention comfort, 48 positive, 0 negative 48 customers mention \"Comfort\" 48 positive 0 negative Customers find the dress comfortable. \" ...I ordered it for family pictures and was pleasantly surprised. It is comfortable , beautiful, and the material feels very well made, not cheap like... \" Read more \" I absolutely adore this dress! It is very comfortable and flattering. It was perfect for a wedding and to wear during the holiday season. \" Read more \" Super cute and comfy . I'm a size small and it's true to size. I'm wearing it to a wedding tomorrow and it's perfect. \" Read more \" ...The engagement party, a date night, and now a work holiday party. So comfortable and throw on very quickly to look instantly put together!... \" Read more 42 customers mention quality, 39 positive, 3 negative 42 customers mention \"Quality\" 39 positive 3 negative Customers find the dress to be of good quality and perfect for fall weddings, with one customer noting it's suitable for both dressing up and casual outings. \" Love this dress . Very comfortable, beautiful color, flattering neckline. Perfect! \" Read more \" Great quality and flattering. Also very comfortable and perfect length for me.... \" Read more \" Amazing dress \" Read more \" ...It only bothered me when I was sitting. Otherwise it was a great dress ! \" Read more 30 customers mention dress fit, 30 positive, 0 negative 30 customers mention \"Dress fit\" 30 positive 0 negative Customers find the dress fits well as a wedding guest outfit, particularly for fall and evening events, and one customer mentions it's suitable for casual outings. \" Was a great dress for a wedding guest . Had some stretch which was nice as a person with a larger top \" Read more \" Buy this dress!! It is positively gorgeous. The perfect fall wedding dress . I'm 5'6\", 126# and I purchased the small. The fit was spot on.... \" Read more \" ...It is very comfortable and flattering. It was perfect for a wedding and to wear during the holiday season. \" Read more \" ...I feel it could make for a good maternity dress too. The material is a good thickness and has some stretch.... \" Read more 29 customers mention fabric quality, 25 positive, 4 negative 29 customers mention \"Fabric quality\" 25 positive 4 negative Customers like the fabric of the dress, noting its thick corded texture, though some mention it is thin. \" Nice material , just didn’t sit right on my body. I looked Amish \" Read more \" Great fit, great material . I’m Short, and the length is perfect! The color (pumpkin) is gorgeous! \" Read more \" ...The cleavage area has a butt so you’re able to show more or less. Very thick dress . Overall, I loved it and would definitely buy again! \" Read more \" loved this dress! fit was as expected and fabric was nice !... \" Read more 27 customers mention flattering, 26 positive, 1 negative 27 customers mention \"Flattering\" 26 positive 1 negative Customers find the dress flattering, with one mentioning that it hugs all the right areas. \" This dress is a beautiful color it matches all skin tones.It is very flattering .You really can't go wrong.I wore this to a Christmas party.... \" Read more \" I absolutely adore this dress! It is very comfortable and flattering . It was perfect for a wedding and to wear during the holiday season. \" Read more \" This dress is so flattering ! The color is exactly what I was hoping for and fits true to size. I’m wearing it to an upcoming wedding. \" Read more \" Bought this dress for a fall wedding and it is sooooo cute. Super flattering , no wrinkles, and I feel like it's going to keep me warm.... \" Read more 23 customers mention color accuracy, 22 positive, 1 negative 23 customers mention \"Color accuracy\" 22 positive 1 negative Customers like the dress's color, with one mentioning it matches all skin tones. \" ...So soft and comfortable while feeling fancy. The color is gorgeous ! Looking forward to wearing it for Holiday acrds and Thanksgiving day. \" Read more \" I didn't like this dress at all. The color was accurate but the fit was too big and the fabric felt heavy but cheap.... \" Read more \" This dress is a beautiful color it matches all skin tones.It is very flattering.You really can't go wrong.I wore this to a Christmas party.... \" Read more \" ...The velvet is nice in quality and the color is vibrant !! Recommended! I was given so many compliments! Comfy too. \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Great for a winter party",
        "body": "I have an engagement party to go to in December and was looking for a dress appropriate for the occasion, but comfortable enough to chase around two preschoolers and this is perfect. Elegant, gorgeous green color, and extremely comfortable. I am normally a size 4/6 and the small is perfect fit. Will be easy to style as well and had zero wrinkles coming out of the packaging. Update: I am wearing this to my 3rd winter event tonight and continue to love this dress! The engagement party, a date night, and now a work holiday party. So comfortable and throw on very quickly to look instantly put together! The emerald color feels very rich. For reference I’m 5”2’ and it’s perfect length with my boots with about a 2 inch heel. Read more",
        "author": "Student Baker",
        "rating": 5.0,
        "date": "November 6, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Comfy and Classy!",
        "body": "True to size and gorgeous. For reference I am approx. 150 pounds, 5'6\" and athletic/curvy build - size medium fit perfectly. I was worried the dress would be too low cut for me to wear a bra (which oculd get away with, but my normal bra works perfectly. So soft and comfortable while feeling fancy. The color is gorgeous! Looking forward to wearing it for Holiday acrds and Thanksgiving day. Read more",
        "author": "Sarah",
        "rating": 5.0,
        "date": "November 25, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Perfect cocktail dress",
        "body": "I received many compliments wearing this dress. The neckline is low but I wore shapewear to help hide some of the cleveage. I'm 25 anymore. The dress was comfortable. The sleeves were a little tight and would creep up thats the reason for not giving a 5 star. I am 5'6 225. The quality of the fabric was nice and the color was perfect. The length kept me from having to wear hose which was perfect for here in the south. I ordered and XL. Great value for the price. Read more",
        "author": "MMurphy",
        "rating": 4.0,
        "date": "November 26, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71chhqNU5bL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Love this dress!",
        "body": "LOVE LOVE LOVE this dress - fit is spot on... these types of dresses are usually too long for me - I am 5'4\" and it was perfect - I did where 2.5 inch heels. Comfortable and very flattering! Read more",
        "author": "Elaine Artale",
        "rating": 5.0,
        "date": "November 24, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Gorgeous!",
        "body": "Gorgeous dress. Perfect for a fall shower/wedding. Soft velvet material in a gorgeous emerald green color. Extremely comfortable and a very nice weight. Not see through at all. Excellent quality. TTS Read more",
        "author": "Customer",
        "rating": 5.0,
        "date": "November 17, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/7166VcIK65L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "3.0 out of 5 stars Color off",
        "body": "Fits true to size however the color was not what was pictured. Still a pretty and comfortable dress though! Read more",
        "author": "nikhay",
        "rating": 3.0,
        "date": "November 13, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Such a beautiful dress for a reasonable price!",
        "body": "Absolutely love this dress! I purchased it to wear to go a gala I had to attend, and it was perfect for the occasion. The color is absolutely beautiful for autumn, and the velvet material is so comfortable! The dress does have a little bit of weight to it, but thats expected because of the material. The dress didn’t have me sweating, but still kept me warm.The dress is a little bit low cut , and because of the little bit of weight to it , the dress hung a little lower in the chest area then I wanted. I used a safety pin, and it was perfect! Easy fix! Also, I was so surprised that I didn’t need any alterations. I am only 5ft tall, and the dress wasn’t too long or dragging at all! I would 100% recommend this dress to anyone! Read more",
        "author": "Arianna",
        "rating": 5.0,
        "date": "October 7, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/717LPzw9WaL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Buy the dress",
        "body": "Buy. the. Dress. But size up. I ended up buying a small and a medium, the small fit like a glove very sexy but not long enough and didn’t fit/feel right around the breast area -but wasn’t noticeable- but still beautiful! High quality material, luxurious feeling and got so many compliments! The length could be longer in my opinion Read more",
        "author": "James Quinn",
        "rating": 5.0,
        "date": "November 27, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71r+ovi295L._SY88._SL1500_.jpg"
        ]
      }
    ]
  },
  "short_description": "Womens Maxi Dress Formal Maxi is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.",
  "about_this_item": "Womens Maxi Dress Formal Maxi is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.",
  "long_description": "Womens Maxi Dress Formal Maxi is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: C#burnt Orange, A#leopard, C#dark Green, A#hazeblue, A#chocolate, C#coffee, A#lake Blue, Army Green, A#coffee, A#dark Green, C#black, A#burgundy, C#red, A#navy Blue. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Formal Maxi is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: C#burnt Orange, A#leopard, C#dark Green, A#hazeblue, A#chocolate, C#coffee, A#lake Blue, Army Green, A#coffee, A#dark Green, C#black, A#burgundy, C#red, A#navy Blue. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "367843c9-1c64-4b5f-b76f-4a396863705f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/367843c9-1c64-4b5f-b76f-4a396863705f/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/367843c9-1c64-4b5f-b76f-4a396863705f/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/a1581a62-affb-48f7-b9ac-364df0354593.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "ce734a83-1fa8-49aa-8aa5-a96f235ca9ab",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ce734a83-1fa8-49aa-8aa5-a96f235ca9ab/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ce734a83-1fa8-49aa-8aa5-a96f235ca9ab/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/a1581a62-affb-48f7-b9ac-364df0354593.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "a321525f-b85b-434b-a737-7d1291b81a30",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a321525f-b85b-434b-a737-7d1291b81a30/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a321525f-b85b-434b-a737-7d1291b81a30/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/a1581a62-affb-48f7-b9ac-364df0354593.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "b22a89f8-682e-4ff8-ba43-9574777d25ae",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b22a89f8-682e-4ff8-ba43-9574777d25ae/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b22a89f8-682e-4ff8-ba43-9574777d25ae/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/a1581a62-affb-48f7-b9ac-364df0354593.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "f0f109dc-21ef-445e-a9c3-e0ebff7721f9",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f0f109dc-21ef-445e-a9c3-e0ebff7721f9/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f0f109dc-21ef-445e-a9c3-e0ebff7721f9/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/a1581a62-affb-48f7-b9ac-364df0354593.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "ec49ce69-21cd-43fb-8a6c-8be0677ef023",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ec49ce69-21cd-43fb-8a6c-8be0677ef023/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ec49ce69-21cd-43fb-8a6c-8be0677ef023/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/a1581a62-affb-48f7-b9ac-364df0354593.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "5d1d584c-3a3e-4638-bc6b-a5fa413ab741",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5d1d584c-3a3e-4638-bc6b-a5fa413ab741/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5d1d584c-3a3e-4638-bc6b-a5fa413ab741/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/a1581a62-affb-48f7-b9ac-364df0354593.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "1e94ceb1-8100-408f-b4c9-2c9b3ad7a7c3",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1e94ceb1-8100-408f-b4c9-2c9b3ad7a7c3/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1e94ceb1-8100-408f-b4c9-2c9b3ad7a7c3/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/a1581a62-affb-48f7-b9ac-364df0354593.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "51130c6a-2bd6-44c4-8658-c3b47a5997ef",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/51130c6a-2bd6-44c4-8658-c3b47a5997ef/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/51130c6a-2bd6-44c4-8658-c3b47a5997ef/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/a1581a62-affb-48f7-b9ac-364df0354593.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "874beb62-a71f-4aba-9a9e-39ff412fe4e9",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/874beb62-a71f-4aba-9a9e-39ff412fe4e9/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/874beb62-a71f-4aba-9a9e-39ff412fe4e9/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/a1581a62-affb-48f7-b9ac-364df0354593.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "f0e405d9-a80c-48e1-aa08-83b3c00903ea",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f0e405d9-a80c-48e1-aa08-83b3c00903ea/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f0e405d9-a80c-48e1-aa08-83b3c00903ea/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/a1581a62-affb-48f7-b9ac-364df0354593.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "57ab4579-e835-4827-ab95-0cc9e141cf08",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/57ab4579-e835-4827-ab95-0cc9e141cf08/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/57ab4579-e835-4827-ab95-0cc9e141cf08/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/a1581a62-affb-48f7-b9ac-364df0354593.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "C#burnt Orange": "https://m.media-amazon.com/images/I/41ZeAVlSxgL._AC_SR38,50_.jpg",
    "A#leopard": "https://m.media-amazon.com/images/I/41gI2Ao2+TL._AC_SR38,50_.jpg",
    "C#dark Green": "https://m.media-amazon.com/images/I/41s7MS5fbYL._AC_SR38,50_.jpg",
    "A#hazeblue": "https://m.media-amazon.com/images/I/31KiTC8iY3L._AC_SR38,50_.jpg",
    "A#chocolate": "https://m.media-amazon.com/images/I/31ur02AUBeL._AC_SR38,50_.jpg",
    "C#coffee": "https://m.media-amazon.com/images/I/41FaUlXqMcL._AC_SR38,50_.jpg",
    "A#lake Blue": "https://m.media-amazon.com/images/I/41VDT8qzqML._AC_SR38,50_.jpg",
    "Army Green": "https://m.media-amazon.com/images/I/31-qmhkjpLL._AC_SR38,50_.jpg",
    "A#coffee": "https://m.media-amazon.com/images/I/41ZmsIpyZ9L._AC_SR38,50_.jpg",
    "A#dark Green": "https://m.media-amazon.com/images/I/41Ec66OLEPL._AC_SR38,50_.jpg",
    "C#black": "https://m.media-amazon.com/images/I/41woURGbYaL._AC_SR38,50_.jpg",
    "A#burgundy": "https://m.media-amazon.com/images/I/31A49pxLCaL._AC_SR38,50_.jpg",
    "C#red": "https://m.media-amazon.com/images/I/41cOiwSW79L._AC_SR38,50_.jpg",
    "A#navy Blue": "https://m.media-amazon.com/images/I/31PAMWlgmdL._AC_SR38,50_.jpg",
    "A#purple": "https://m.media-amazon.com/images/I/31MwYFn9M8L._AC_SR38,50_.jpg",
    "A#dark Olive": "https://m.media-amazon.com/images/I/4182hzP4j-L._AC_SR38,50_.jpg",
    "A#pumpkin": "https://m.media-amazon.com/images/I/41RArBcyCFL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "C#burnt Orange": "71Ru5Lk8P+L",
    "A#leopard": "71QCzuZ+3rL",
    "C#dark Green": "61ycXqiU4TL",
    "A#hazeblue": "71Gxh2yFwAL",
    "A#chocolate": "61KZKcU3meL",
    "C#coffee": "718PwjNoP9L",
    "A#lake Blue": "71uoh6FIhQL",
    "Army Green": "71690Fv3LtL",
    "A#coffee": "71eqHiXkY0L",
    "A#dark Green": "71vrdaLYp0L",
    "C#black": "71HLbxX2hWL",
    "A#burgundy": "712izxdk5zL",
    "C#red": "71yplI-lbyL",
    "A#navy Blue": "713ouPlqWjL",
    "A#purple": "610Nybq7HrL",
    "A#dark Olive": "71E7ZvBubTL",
    "A#pumpkin": "71n3WneQazL"
  },
  "color_images": {
    "C#burnt Orange": [
      "https://m.media-amazon.com/images/I/71Ru5Lk8P+L._SL1500_.jpg"
    ],
    "A#leopard": [
      "https://m.media-amazon.com/images/I/71QCzuZ+3rL._SL1500_.jpg"
    ],
    "C#dark Green": [
      "https://m.media-amazon.com/images/I/61ycXqiU4TL._SL1500_.jpg"
    ],
    "A#hazeblue": [
      "https://m.media-amazon.com/images/I/71Gxh2yFwAL._SL1500_.jpg"
    ],
    "A#chocolate": [
      "https://m.media-amazon.com/images/I/61KZKcU3meL._SL1500_.jpg"
    ],
    "C#coffee": [
      "https://m.media-amazon.com/images/I/718PwjNoP9L._SL1500_.jpg"
    ],
    "A#lake Blue": [
      "https://m.media-amazon.com/images/I/71uoh6FIhQL._SL1500_.jpg"
    ],
    "Army Green": [
      "https://m.media-amazon.com/images/I/71690Fv3LtL._SL1500_.jpg"
    ],
    "A#coffee": [
      "https://m.media-amazon.com/images/I/71eqHiXkY0L._SL1500_.jpg"
    ],
    "A#dark Green": [
      "https://m.media-amazon.com/images/I/71vrdaLYp0L._SL1500_.jpg"
    ],
    "C#black": [
      "https://m.media-amazon.com/images/I/71HLbxX2hWL._SL1500_.jpg"
    ],
    "A#burgundy": [
      "https://m.media-amazon.com/images/I/712izxdk5zL._SL1500_.jpg"
    ],
    "C#red": [
      "https://m.media-amazon.com/images/I/71yplI-lbyL._SL1500_.jpg"
    ],
    "A#navy Blue": [
      "https://m.media-amazon.com/images/I/713ouPlqWjL._SL1500_.jpg"
    ],
    "A#purple": [
      "https://m.media-amazon.com/images/I/610Nybq7HrL._SL1500_.jpg"
    ],
    "A#dark Olive": [
      "https://m.media-amazon.com/images/I/71E7ZvBubTL._SL1500_.jpg"
    ],
    "A#pumpkin": [
      "https://m.media-amazon.com/images/I/71n3WneQazL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-formal-evening-v-neck",
      "title": "Womens Maxi Dress Formal Evening V Neck",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71Rq2skdBFL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-v-neck-ruched",
      "title": "Womens Maxi Dress Long Sleeve V Neck Ruched",
      "price": 41.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/41nKZb3yrHL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/81VEy9ZQg3L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-long-sleeve",
      "title": "Womens Maxi Dress Maxi Long Sleeve",
      "price": 19.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51Jw+rC-oXL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 84.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/511SyyioxkL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 7.96,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/91sKNbZ1WFL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-bodycon",
      "title": "Womens Maxi Dress Long Sleeve Bodycon",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71vLdkRmE5L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-formal-cocktail",
      "title": "Womens Dress Formal Cocktail",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61tH755L2gL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-off-shoulder",
      "title": "Womens Dress Off Shoulder",
      "price": 38.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/81yHjkOLSmL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail-v-neck-bodycon",
      "title": "Womens Dress Cocktail V Neck Bodycon",
      "price": 19.95,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/611HBMEYCCL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi",
      "title": "Womens Maxi Dress Maxi",
      "price": 31.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61pjj-1NYOL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51+ZvnP0Z4L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-maxi",
      "title": "Womens Maxi Dress Long Sleeve Maxi",
      "price": 29.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/614-6WTFsKL._SL1500_.jpg"
      ]
    }
  ]
}