{
  "id": "womens-dress-formal",
  "handle": "womens-dress-formal",
  "sku": "JC2568",
  "asin": "B0CBKDTV4V",
  "title": "Womens Dress Formal",
  "title_original": "Sissyaki Women's Velvet Formal Dresses for Wedding Guest 2025 Fall Winter Dress",
  "brand": "Visit the Sissyaki Store",
  "price": 59.99,
  "social_proof": {
    "bought_past_month": 396,
    "text": "396+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/61o5kzGtIvL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ErdJz09oL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71RdLhs9IhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71x7Cpq55UL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71hBcNihe9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71NUegV8rDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61cLuphghaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61+APvejYGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61PxZjLP5OL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Gc+IfUHiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61a7nMyWYhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71zdm6eL4JL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61+fUp0AQNL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51uhJkHYSZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51kmyq07t9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/719JlDP8UzL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/61o5kzGtIvL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ErdJz09oL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71RdLhs9IhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71x7Cpq55UL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71hBcNihe9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71NUegV8rDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61cLuphghaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61+APvejYGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61PxZjLP5OL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Gc+IfUHiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61a7nMyWYhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71zdm6eL4JL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61+fUp0AQNL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51uhJkHYSZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51kmyq07t9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/719JlDP8UzL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Item model number ‏": "‎ WBKL400",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ January 13, 2023",
    "ASIN ‏": "‎ B0CP26NDWB",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#43,446 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #130 in Women's Formal Dresses",
    "Customer Reviews": "4.3 4.3 out of 5 stars (426)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "07# Embossed-blue Leopard",
      "06# Floral Leopard",
      "02#lake Blue",
      "02#caramel",
      "02#red",
      "03#coffee",
      "05#brown",
      "07# Embossed-orange Leopard",
      "02#emerald Green",
      "02#navy Blue",
      "02#olive Green",
      "02#black",
      "07# Embossed-green Leopard"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.3,
    "count": 426,
    "customers_say": "Customers find this velvet dress beautiful, with one noting it looks expensive without breaking the bank, and another mentioning it's perfect for Christmas parties. The dress receives positive feedback for its fit, with one customer noting it hits right at the ankles, while others appreciate its thick fabric and flattering cut that accentuates the waist. Customers describe the dress as soft and comfortable, with one mentioning it makes them look taller with high heels, and another noting it shows just the right amount of cleavage. Select to learn more Style Fit Quality Comfort Color Fabric quality Flattering Soft fabric 80 customers mention \"Style\" 73 positive 7 negative Customers find the dress gorgeous, with one mentioning it looks expensive without breaking the bank. \" Beautiful dress , summer material but also lined, which I like! Fit me perfectly, I usually wear a large and this was spot on and flattering.\" Read more \"This dress is beautiful , comfortable, and true to size. I got so many compliments that I felt a little like a princess. Love and would buy again!\" Read more \"This dress is so cute and flattering. I ordered it for a winter wedding in both green and black. Chose the green because it shows more of the detail.\" Read more \"This dress is very pretty . Extremely comfortable and can be dressed up or more casual. Accentuates the figure....\" Read more 60 customers mention \"Fit\" 48 positive 12 negative Customers like how the dress fits, with one mentioning it hits perfectly at the ankles, while another notes it provides plenty of room for a baby bump. \"It’s a super pretty dress, nice weight and fit , and I’m currently breast feeding so I wanted it for “easy access” and it’s good for that!...\" Read more \"Dress is perfect, a little big but fits well and is super stretchy. Soft and great quality material. Seems more expensive then what I paid!\" Read more \"Love this! Great fit . Very flattering. Beautiful!!\" Read more \"This dress unfortunately did not fit me well . I'm leaving a one star review because although it says free returns it is not in fact free....\" Read more 45 customers mention \"Quality\" 41 positive 4 negative Customers find the dress to be well-made and perfect for wedding guest attire, with one customer noting it doesn't feel cheap. \" Great dress and very comfortable. If you like the plunging neckline, you might have to sew/tailor to have the button and loop removed....\" Read more \" Great quality ! Love the color! It did however run a tad big. I am a 6/8 and I ordered a Large.\" Read more \"Exceeded expectations and good quality . Wore it to my company post holiday party and received numerous compliments on it. Loved the color.\" Read more \"This dress is really pretty and high quality ....\" Read more 44 customers mention \"Comfort\" 44 positive 0 negative Customers find the dress comfortable, with one mentioning it feels elegant without being uncomfortable. \"This dress is beautiful, comfortable , and true to size. I got so many compliments that I felt a little like a princess. Love and would buy again!\" Read more \"Great dress and very comfortable . If you like the plunging neckline, you might have to sew/tailor to have the button and loop removed....\" Read more \" Comfy and soft! I am 5’3 and it definitely hit maxi length but it was what I wanted. Great weight to the material, perfect for a fall wedding!\" Read more \"The dress was SO comfortable & gave space to dance around. I got an XL, I’m 5’2 and wore 3in heels and the dress fell right past my ankles....\" Read more 30 customers mention \"Color\" 29 positive 1 negative Customers like the dress's color, describing it as a beautiful green velvet dress. \"... Beautiful color , comfy, soft fabric, nice drape.\" Read more \"I loved the color and the fabric, but I’m not tall and felt like I looked like a child in a Christmas pageant\" Read more \"Perfect fit & color ! I’ve never been so happy with clothes bought in amazon\" Read more \"...I ended up returning this one. I liked the color but the velvet & the cut of this dress made me feel like I was going to a renaissance fair or...\" Read more 29 customers mention \"Fabric quality\" 25 positive 4 negative Customers appreciate the fabric of the dress, describing it as thick and of great quality, with one customer noting that it doesn't cling to the body. \"Love Love Love this dress!! It’s beautiful fabric and feels so comfortable to wear. I’m going to buy more colors I love it that much!\" Read more \"...Accentuates the figure. The material is thick and velvety soft. Got this in emerald green and will look great in fall as well as holidays....\" Read more \"Super comfortable, super chic, and quality material . Recommend! I’m 5ft7 and 145lbs, and the Large is just right.\" Read more \"...The material of the dress was nice however. I’m bummed I couldn’t wear it to the wedding as planned\" Read more 28 customers mention \"Flattering\" 26 positive 2 negative Customers find the dress flattering, with one mentioning it accentuates the waist well and another noting it shows just the right amount of cleavage. \"This dress is beautiful and it is so flattering ! I get so many compliments when I wear it. I do pin the cleavage, since the cut is very low.\" Read more \"This dress is so cute and flattering . I ordered it for a winter wedding in both green and black. Chose the green because it shows more of the detail.\" Read more \"... Very flattering and fit perfect. I would definitely order it in other colors.\" Read more \"...The material is thick and has a high end look. Dress is super flattering and comfortable.\" Read more 20 customers mention \"Soft fabric\" 18 positive 2 negative Customers find the dress very soft, with one mentioning it felt like wearing pajamas. \"This dress exceeded my expectations. It is so soft and comfortable, and you don't have to worry about wrinkles. Very flattering and fit perfect....\" Read more \"...I absolutely love it! It's very soft , comfortable, and breathable. Perfect for a fall event.\" Read more \"Though I loved the dark coloring & feel of the dress , I really didn’t love the fit....\" Read more \"This dress surpassed my expectations! The fabric is very soft and seems much higher quality than I expected....\" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars I bought 3 colors…",
        "body": "This is the cutest dress EVER!! I literally bought 3 colors. It’s so flattering! The length is perfectly to the ankles, it’s not see-through at all, and it’s super stretchy. It’s really soft too, so it does not feel cheap. The thickness of the material also isn’t super thick or thin. It’s a great balance. Read more",
        "author": "RayAnn Noble",
        "rating": 5.0,
        "date": "December 3, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/51m91dzsJcL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Great fit and so comfortable!",
        "body": "Beautiful dress...well made and fits true to size. Perfect for a fall wedding with cowboy boots! Read more",
        "author": "Tim S. Lewis",
        "rating": 5.0,
        "date": "November 13, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Lovely and very comfortable",
        "body": "Ordered this for a holiday party. It’s a good quality, flowy striped velvet material. Sleeves cover my arms comfortably. Length was perfect on my 5’4” frame. The v-neck is too deep for my style preferences. Read more",
        "author": "Alma",
        "rating": 4.0,
        "date": "November 29, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Loves this dress! Feels & looks amazing!",
        "body": "Love this dress! Bought it for a wedding. The velvety texture feels and looks amazing. I’m 5’5 124 pounds size SM. The length and fit was perfect. Looks high quality for a great price. Highly recommend. Read more",
        "author": "MBEE",
        "rating": 5.0,
        "date": "November 13, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Beautiful and Elegant!",
        "body": "Beautiful fabric, very comfortable and an elegant dress. I ordered to wear as a Christmas dress, but it would be beautiful for more formal parties as well. I LOVE it. Read more",
        "author": "SHK",
        "rating": 5.0,
        "date": "December 9, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Would be great for a Halloween costume",
        "body": "I was looking for a wedding guest dress. I ended up returning this one. I liked the color but the velvet & the cut of this dress made me feel like I was going to a renaissance fair or something. Also when I held it up to the light the stripes between the velvet were somewhat see through Read more",
        "author": "Tanya Cipriani",
        "rating": 3.0,
        "date": "September 14, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Great style and comfort!",
        "body": "This dress is beautiful! I wore it to a wedding, and got so many compliments on the color. I absolutely love it! It's very soft, comfortable, and breathable. Perfect for a fall event. Read more",
        "author": "Allison",
        "rating": 5.0,
        "date": "November 17, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Perfect wedding guest dress",
        "body": "I wore to a cottagecore wedding and got a million compliments. Very comfortable and the cut is very flattering. Read more",
        "author": "Darren",
        "rating": 5.0,
        "date": "November 23, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Dress Formal is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.",
  "about_this_item": "Womens Dress Formal is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.",
  "long_description": "Womens Dress Formal is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: 07# Embossed-blue Leopard, 06# Floral Leopard, 02#lake Blue, 02#caramel, 02#red, 03#coffee, 05#brown, 07# Embossed-orange Leopard, 02#emerald Green, 02#navy Blue, 02#olive Green, 02#black, 07# Embossed-green Leopard. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Dress Formal is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: 07# Embossed-blue Leopard, 06# Floral Leopard, 02#lake Blue, 02#caramel, 02#red, 03#coffee, 05#brown, 07# Embossed-orange Leopard, 02#emerald Green, 02#navy Blue, 02#olive Green, 02#black, 07# Embossed-green Leopard. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "29405e9c-fb51-4a4f-8a4c-e468aba3e500",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/29405e9c-fb51-4a4f-8a4c-e468aba3e500/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/29405e9c-fb51-4a4f-8a4c-e468aba3e500/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "d684e330-4f34-4b04-98e2-3118631da609",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d684e330-4f34-4b04-98e2-3118631da609/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d684e330-4f34-4b04-98e2-3118631da609/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "737efa0d-b0b2-48f3-b7e5-b67922939c54",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/737efa0d-b0b2-48f3-b7e5-b67922939c54/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/737efa0d-b0b2-48f3-b7e5-b67922939c54/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "05508fd1-5f16-4be5-b551-e7e46d5bace2",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/05508fd1-5f16-4be5-b551-e7e46d5bace2/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/05508fd1-5f16-4be5-b551-e7e46d5bace2/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "2c3bfb96-c8a1-483a-8298-a931acf7a92b",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2c3bfb96-c8a1-483a-8298-a931acf7a92b/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2c3bfb96-c8a1-483a-8298-a931acf7a92b/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "af47972e-06d5-424b-84a0-359ce4649a34",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/af47972e-06d5-424b-84a0-359ce4649a34/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/af47972e-06d5-424b-84a0-359ce4649a34/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "c7b2540b-9495-48e3-bc67-0cf954b1bee1",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c7b2540b-9495-48e3-bc67-0cf954b1bee1/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c7b2540b-9495-48e3-bc67-0cf954b1bee1/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "c2da4e65-11d7-4c48-b523-fe987da6fabd",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c2da4e65-11d7-4c48-b523-fe987da6fabd/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c2da4e65-11d7-4c48-b523-fe987da6fabd/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "df60fdf7-c37d-49a4-87b8-0e20ece8e0e7",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/df60fdf7-c37d-49a4-87b8-0e20ece8e0e7/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/df60fdf7-c37d-49a4-87b8-0e20ece8e0e7/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "54db3649-a908-4f8c-b718-0c2aa5fd219a",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/54db3649-a908-4f8c-b718-0c2aa5fd219a/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/54db3649-a908-4f8c-b718-0c2aa5fd219a/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "c372c63a-7437-4c62-acda-c377cbe122b5",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c372c63a-7437-4c62-acda-c377cbe122b5/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c372c63a-7437-4c62-acda-c377cbe122b5/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "914886e4-e69a-43fd-ba7c-da62f1b9957d",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/914886e4-e69a-43fd-ba7c-da62f1b9957d/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/914886e4-e69a-43fd-ba7c-da62f1b9957d/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "07# Embossed-blue Leopard": "https://m.media-amazon.com/images/I/41iPGoPhl7L._AC_SR38,50_.jpg",
    "06# Floral Leopard": "https://m.media-amazon.com/images/I/4151-PNvS0L._AC_SR38,50_.jpg",
    "02#lake Blue": "https://m.media-amazon.com/images/I/414hnq3CeWL._AC_SR38,50_.jpg",
    "02#caramel": "https://m.media-amazon.com/images/I/41KNZT2u2UL._AC_SR38,50_.jpg",
    "02#red": "https://m.media-amazon.com/images/I/31vM5P57QbL._AC_SR38,50_.jpg",
    "03#coffee": "https://m.media-amazon.com/images/I/31U4d1kd2jL._AC_SR38,50_.jpg",
    "05#brown": "https://m.media-amazon.com/images/I/31oHp5L1xwL._AC_SR38,50_.jpg",
    "07# Embossed-orange Leopard": "https://m.media-amazon.com/images/I/41p7bFqOfhL._AC_SR38,50_.jpg",
    "02#emerald Green": "https://m.media-amazon.com/images/I/314WAkhBzUL._AC_SR38,50_.jpg",
    "02#navy Blue": "https://m.media-amazon.com/images/I/31Lv+WFRYAL._AC_SR38,50_.jpg",
    "02#olive Green": "https://m.media-amazon.com/images/I/51uhJkHYSZL._AC_SR38,50_.jpg",
    "02#black": "https://m.media-amazon.com/images/I/51kmyq07t9L._AC_SR38,50_.jpg",
    "07# Embossed-green Leopard": "https://m.media-amazon.com/images/I/41vo3sJwfaL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "07# Embossed-blue Leopard": "71hBcNihe9L",
    "06# Floral Leopard": "71NUegV8rDL",
    "02#lake Blue": "61cLuphghaL",
    "02#caramel": "61+APvejYGL",
    "02#red": "61PxZjLP5OL",
    "03#coffee": "61Gc+IfUHiL",
    "05#brown": "61a7nMyWYhL",
    "07# Embossed-orange Leopard": "71zdm6eL4JL",
    "02#emerald Green": "61o5kzGtIvL",
    "02#navy Blue": "61+fUp0AQNL",
    "02#olive Green": "51uhJkHYSZL",
    "02#black": "51kmyq07t9L",
    "07# Embossed-green Leopard": "719JlDP8UzL"
  },
  "color_images": {
    "07# Embossed-blue Leopard": [
      "https://m.media-amazon.com/images/I/71hBcNihe9L._SL1500_.jpg"
    ],
    "06# Floral Leopard": [
      "https://m.media-amazon.com/images/I/71NUegV8rDL._SL1500_.jpg"
    ],
    "02#lake Blue": [
      "https://m.media-amazon.com/images/I/61cLuphghaL._SL1500_.jpg"
    ],
    "02#caramel": [
      "https://m.media-amazon.com/images/I/61+APvejYGL._SL1500_.jpg"
    ],
    "02#red": [
      "https://m.media-amazon.com/images/I/61PxZjLP5OL._SL1500_.jpg"
    ],
    "03#coffee": [
      "https://m.media-amazon.com/images/I/61Gc+IfUHiL._SL1500_.jpg"
    ],
    "05#brown": [
      "https://m.media-amazon.com/images/I/61a7nMyWYhL._SL1500_.jpg"
    ],
    "07# Embossed-orange Leopard": [
      "https://m.media-amazon.com/images/I/71zdm6eL4JL._SL1500_.jpg"
    ],
    "02#emerald Green": [
      "https://m.media-amazon.com/images/I/61o5kzGtIvL._SL1500_.jpg"
    ],
    "02#navy Blue": [
      "https://m.media-amazon.com/images/I/61+fUp0AQNL._SL1500_.jpg"
    ],
    "02#olive Green": [
      "https://m.media-amazon.com/images/I/51uhJkHYSZL._SL1500_.jpg"
    ],
    "02#black": [
      "https://m.media-amazon.com/images/I/51kmyq07t9L._SL1500_.jpg"
    ],
    "07# Embossed-green Leopard": [
      "https://m.media-amazon.com/images/I/719JlDP8UzL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-high-split-formal-long-sleeve-split",
      "title": "Womens Maxi Dress High Split Formal Long Sleeve Split",
      "price": 42.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/519SM4mHYtL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-sleeveless-v-neck-maxi",
      "title": "Womens Maxi Dress Sleeveless V Neck Maxi",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61UUuyK1ToL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-bodycon-ruched",
      "title": "Womens Maxi Dress Long Sleeve Bodycon Ruched",
      "price": 27.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61QBIndFXfL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-mermaid-formal-evening",
      "title": "Womens Maxi Dress Mermaid Formal Evening",
      "price": 84.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51Mq79ag8sL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 95.73,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51wBkntt7NL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-off-shoulder",
      "title": "Womens Maxi Dress Off Shoulder",
      "price": 136.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71by9S5UuHL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-mermaid",
      "title": "Womens Dress Mermaid",
      "price": 139.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Wedding Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/61uHPL9XQ1L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-mermaid-off-shoulder-cocktail-formal",
      "title": "Womens Maxi Dress Evening Mermaid Off Shoulder Cocktail Formal",
      "price": 77.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61vimm3vKAL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-evening-cocktail",
      "title": "Womens Maxi Dress Long Sleeve Evening Cocktail",
      "price": 69.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61J0gUlQOnL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-ruched",
      "title": "Womens Dress Ruched",
      "price": 69.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51TiBqTTorL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-long-sleeve",
      "title": "Womens Maxi Dress Cocktail Long Sleeve",
      "price": 35.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51hH90659hL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-ruched-cocktail",
      "title": "Womens Dress Ruched Cocktail",
      "price": 47.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/81-Vk1vn3WL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-v-neck",
      "title": "Womens Maxi Dress Long Sleeve V Neck",
      "price": 35.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61c+AgO3PGL._SL1500_.jpg"
      ]
    }
  ]
}