{
  "id": "womens-maxi-dress-long-sleeve",
  "handle": "womens-maxi-dress-long-sleeve",
  "sku": "JC3222",
  "asin": "B0CC8ZHDHK",
  "title": "Womens Maxi Dress Long Sleeve",
  "title_original": "ZESICA Women's 2026 Ribbed Knit Dress Long Sleeve Mock Neck Slim Fit Side Slit Fall Elegant Sweater Dresses",
  "brand": "Visit the ZESICA Store",
  "price": 42.99,
  "social_proof": {
    "bought_past_month": 350,
    "text": "350+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/61RUb2Rhb2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71iwTKn+m1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/712sj41XEKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ioouARAFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91oI4U8b5IL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71RDNSIbUCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81cgmFN4D2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Ss7mcTLVL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Ho1sK74cL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61TNWG5oWXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/613XUspuMtL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71PfkDOJnNL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71bBwEFwUbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71O-5b1npoL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71cfSpWj2ZL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/61RUb2Rhb2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71iwTKn+m1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/712sj41XEKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ioouARAFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91oI4U8b5IL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71RDNSIbUCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81cgmFN4D2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Ss7mcTLVL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Ho1sK74cL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61TNWG5oWXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/613XUspuMtL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71PfkDOJnNL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71bBwEFwUbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71O-5b1npoL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71cfSpWj2ZL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Product Dimensions ‏": "‎ 1.97 x 0.79 x 0.39 inches; 3.53 ounces",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ July 19, 2023",
    "Manufacturer ‏": "‎ ZESICA",
    "ASIN ‏": "‎ B0D49Y3DM8",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#23,811 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #195 in Women's Casual Dresses",
    "Customer Reviews": "4.3 4.3 out of 5 stars (525)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Darkgreen",
      "Rust",
      "Ivory",
      "Purple",
      "Darkblue",
      "Lightblue",
      "Apricot",
      "Black",
      "Coffee"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.3,
    "count": 525,
    "customers_say": "Customers find the dress to be of good quality, comfortable, and soft, with one mentioning it's loose enough for all-day wear. The dress is flattering, hugging all the right places, and is particularly suitable for baby showers. The material thickness receives mixed feedback, with several customers noting it's not super thick. The slit receives negative feedback, with multiple customers finding it too high. Generated from the text of customer reviews Select to learn more Quality (69) Fit (65) Comfort (42) Dress fit (30) Flattering (24) Soft material (21) Material thickness (23) Slit (22) 69 customers mention quality, 66 positive, 3 negative 69 customers mention \"Quality\" 66 positive 3 negative Customers find the dress to be of good quality, describing it as nice and sexy, with one customer noting its revealing thigh peekaboo detail. \" ...This was a perfect fit. It was comfortable, cute , and warm for my December baby shower. The material was thick and soft with a lot of stretch. \" Read more \" A beautiful dress and it was a perfect fit! \" Read more \" Hugs all the right places. Modest but sexy for those that don't like to reveal too much. Wash before wearing, the material is so soft and cozy.... \" Read more \" So cute so comfortable! I will be ordering in many colors but black looked great with boots, heels, even sneakers and a Jean jacket! \" Read more 65 customers mention fit, 56 positive, 9 negative 65 customers mention \"Fit\" 56 positive 9 negative Customers like how the dress fits, with one mentioning it's loose enough for comfort throughout the day, while another notes it's perfect at mid-thigh length. \" great fit so comfortable, yet very sleek. you will definitely be pleased will be ordering again in other colors \" Read more \" This sweater dress is the perfect fit ! Not to mention amazing for the price. I NEED to have this dress in every color possible.... \" Read more \" The fabric is so soft and comfortable! Beautiful color! Fits true to size ! \" Read more \" LOVE! I bought this for a wedding and absolutely love it! The fit is flattering and the material is soft, not scratchy. \" Read more 42 customers mention comfort, 42 positive, 0 negative 42 customers mention \"Comfort\" 42 positive 0 negative Customers find the dress comfortable and cozy, with one mentioning it's not scratchy. \" Comfortable however I usually wear large so I ordered a large. It was a bit big so I recommend a size down. But very comfortable and cute indeed. \" Read more \" Love this dress. It is perfect for the cooler weather. Very comfortable and soft. I am 5’4 and this ends right in the middle of my shin.... \" Read more \" Dress is super soft & comfy . The slit makes it have a sexy yet conservative look bcz ur covered up everywhere else. It fit perfectly. \" Read more \" ...it wasnt that bad, and super comfy . loved it \" Read more 30 customers mention dress fit, 30 positive, 0 negative 30 customers mention \"Dress fit\" 30 positive 0 negative Customers find the dress fits well, with several mentioning it's perfect for baby showers, and one customer noting it's ideal for holiday wear. \" This is a great dress . It’s too bad to slit is so high. If the slit wasn’t so high, I would definitely keep this dress. Runs true to size. \" Read more \" Perfect Dress for a Baby Shower ! I absolutely love this white sweater dress! It’s so soft, cozy, and comfortable—perfect for a baby shower.... \" Read more \" This dress can be worn up or down. It is a great winter staple that you can put a cut coat over and is so comfortable and soft! \" Read more \" Perfect for winter . \" Read more 24 customers mention flattering, 24 positive, 0 negative 24 customers mention \"Flattering\" 24 positive 0 negative Customers find the dress flattering, particularly noting how it hugs their curves. \" Form fitting, flattering , not too thick or hot. I got it in blue. It’s pretty. I purchased a small. I’m 5’ 4” 119 lbs. \" Read more \" Not too thick, but super forgiving and very flattering . I’ve received many compliments on the dress and it fit as expected. \" Read more \" ...That said, it is a flattering dress if you don’t have a critical eye for fabric like I do. I ordered my normal size and it hugs my curves well.... \" Read more \" I love this dress! I’m 5foot and this was perfect on me and hugged my curves (I’m 114lbs). The slit is not too high and the dress was so comfortable!... \" Read more 21 customers mention soft material, 21 positive, 0 negative 21 customers mention \"Soft material\" 21 positive 0 negative Customers love the soft material and texture of the dress. \" ...Not too high of a mock neck, great fabric ( soft , stretchy, not too thick that it's hot but not too thin that it feels good quality).... \" Read more \" One of my favorite dresses. Color is beautiful, material is soft and stretchy, sizing is good, it’s worth the money for sure. \" Read more \" Dress is super soft & comfy. The slit makes it have a sexy yet conservative look bcz ur covered up everywhere else. It fit perfectly. \" Read more \" The fabric is so soft and comfortable! Beautiful color! Fits true to size! \" Read more 23 customers mention material thickness, 16 positive, 7 negative 23 customers mention \"Material thickness\" 16 positive 7 negative Customers have mixed opinions about the dress's material thickness, with several noting it is not super thick. \" ...The color was fantastic, it has some thickness but not too thick where it was hot inside, the material is stretchy and does not stick to you.... \" Read more \" ...Fits nicely, made well and very comfortable. The material is thick enough so it isn't see through.... \" Read more \" Cute dress, the material is thin and the cream is see through. A darker color would work better. \" Read more \" This dress fit like a glove. Great material. Nice and thick . Perfect legnth. I’m 5’ 4, 138lbs. I am on the hippier side. \" Read more 22 customers mention slit, 6 positive, 16 negative 22 customers mention \"Slit\" 6 positive 16 negative Customers have mixed opinions about the dress's slit, with several noting it is too high, and one customer mentioning it is very revealing. \" Went a size up and the slit was way too high . Didn’t look like the picture at all. \" Read more \" ...The slit was a little high for my personal preference but with tights, it was not a problem \" Read more \" ...The slit is not too high and the dress was so comfortable! Highly recommend! I was wearing this at a bridal shower.... \" Read more \" ...It's too long, and the slit is too high . I could alter it to make it work, but in the end, just too much work for the quality of dress.... \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Beautiful, comfortable dress",
        "body": "The media could not be loaded. I ordered the dress for a Christmas party and absolutely love it. It’s worn here without shape wear and is still very flattering. I love the slit up the leg, which gives it an eye catching look while still showing elegance. The material is thick and warm and a good length. I initially ordered in ivory and the material was see-through. I ended up ordering in the Coffee color and it is not see-through. I am 5‘7“ and 140 to 145 lbs. I am typically between a size small and medium. I ordered a medium and I’m very happy with the fit. Read more",
        "author": "Chelsea",
        "rating": 5.0,
        "date": "October 19, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71-NlOZ5SXL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/711rjNfmmnL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Cute!!",
        "body": "Not too thick, but super forgiving and very flattering. I’ve received many compliments on the dress and it fit as expected. Read more",
        "author": "McKenna Purves",
        "rating": 5.0,
        "date": "December 2, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Perfect Dress!",
        "body": "Perfect Dress for a Baby Shower! I absolutely love this white sweater dress! It’s so soft, cozy, and comfortable—perfect for a baby shower. The fit is flattering, and the material is thick enough to keep me warm without being too bulky. The dress has just the right amount of stretch, making it easy to move around in, and it looks elegant yet casual. I received so many compliments, and it was a great choice for the occasion. Highly recommend this dress for anyone looking for something stylish, comfortable, and perfect for a special event like a baby shower! Read more",
        "author": "Kelsey McClain",
        "rating": 4.0,
        "date": "April 6, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/710cHd3uU4L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Fits well",
        "body": "This is just a really beautiful classy sweater dress. It washes great I do have to run a lint brush over it after tho. I wore it to my graduation and I’d be able to wear it out to dinner it’s really versatile. Perfect length and the slit up the side is a nice peekaboo of the thigh. Read more",
        "author": "Customer",
        "rating": 5.0,
        "date": "December 13, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Great winter dress",
        "body": "Bought this dress for my baby shower. I first bought an xl but it was too big. I was 7 months pregnant and about 210lbs. I returned and got a size large. This was a perfect fit. It was comfortable, cute, and warm for my December baby shower. The material was thick and soft with a lot of stretch. Read more",
        "author": "Abby lupo",
        "rating": 5.0,
        "date": "May 28, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71fMiwLEs-L._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71masnBiFNL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "3.0 out of 5 stars Neck not snug",
        "body": "Quality of material seems nice enough but the neck is stretched out and the slit goes kind of high up the leg, a little higher than I would like. Read more",
        "author": "M",
        "rating": 3.0,
        "date": "November 24, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Love it!",
        "body": "Cute and comfy! Read more",
        "author": "Hailey",
        "rating": 5.0,
        "date": "November 17, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Great sweater dress",
        "body": "Fits perfectly. Read more",
        "author": "SBW",
        "rating": 5.0,
        "date": "December 4, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.",
  "about_this_item": "Womens Maxi Dress Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.",
  "long_description": "Womens Maxi Dress Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Darkgreen, Rust, Ivory, Purple, Darkblue, Lightblue, Apricot, Black, Coffee. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Darkgreen, Rust, Ivory, Purple, Darkblue, Lightblue, Apricot, Black, Coffee. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "9ec9b995-abc4-4fb2-b411-743be6180663",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9ec9b995-abc4-4fb2-b411-743be6180663/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9ec9b995-abc4-4fb2-b411-743be6180663/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/195ac649-05ac-46a3-ba50-0205b5e765b3.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "80f8b0ef-97ce-40e0-b8d7-dac8b911eb80",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/80f8b0ef-97ce-40e0-b8d7-dac8b911eb80/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/80f8b0ef-97ce-40e0-b8d7-dac8b911eb80/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/195ac649-05ac-46a3-ba50-0205b5e765b3.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "89c03ae3-2b20-4919-a4c8-5b4620976246",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/89c03ae3-2b20-4919-a4c8-5b4620976246/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/89c03ae3-2b20-4919-a4c8-5b4620976246/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/195ac649-05ac-46a3-ba50-0205b5e765b3.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "7db33dab-9d6d-4716-8a5f-08522e0b62f5",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7db33dab-9d6d-4716-8a5f-08522e0b62f5/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7db33dab-9d6d-4716-8a5f-08522e0b62f5/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/195ac649-05ac-46a3-ba50-0205b5e765b3.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "99918645-d86f-4a68-b597-6a069dcfa685",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/99918645-d86f-4a68-b597-6a069dcfa685/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/99918645-d86f-4a68-b597-6a069dcfa685/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/195ac649-05ac-46a3-ba50-0205b5e765b3.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "210a59fc-156f-46b5-b315-cc787156e54c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/210a59fc-156f-46b5-b315-cc787156e54c/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/210a59fc-156f-46b5-b315-cc787156e54c/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/195ac649-05ac-46a3-ba50-0205b5e765b3.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "9f146ce4-5096-48e2-8563-97e3d2467632",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9f146ce4-5096-48e2-8563-97e3d2467632/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9f146ce4-5096-48e2-8563-97e3d2467632/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/195ac649-05ac-46a3-ba50-0205b5e765b3.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "ce89e413-f7d6-4a58-ba7d-e5a9eb51f71c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ce89e413-f7d6-4a58-ba7d-e5a9eb51f71c/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ce89e413-f7d6-4a58-ba7d-e5a9eb51f71c/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/195ac649-05ac-46a3-ba50-0205b5e765b3.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "43da580f-bb0a-460d-8a72-944ed250c48c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/43da580f-bb0a-460d-8a72-944ed250c48c/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/43da580f-bb0a-460d-8a72-944ed250c48c/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/195ac649-05ac-46a3-ba50-0205b5e765b3.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "9e672815-c0f0-40c1-9bcc-8a811e9afd85",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9e672815-c0f0-40c1-9bcc-8a811e9afd85/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9e672815-c0f0-40c1-9bcc-8a811e9afd85/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/195ac649-05ac-46a3-ba50-0205b5e765b3.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Darkgreen": "https://m.media-amazon.com/images/I/31eGnuViR6L._AC_SR38,50_.jpg",
    "Rust": "https://m.media-amazon.com/images/I/31RhYdLN4rL._AC_SR38,50_.jpg",
    "Ivory": "https://m.media-amazon.com/images/I/21kILi2SNzL._AC_SR38,50_.jpg",
    "Purple": "https://m.media-amazon.com/images/I/21k4MEmlruL._AC_SR38,50_.jpg",
    "Darkblue": "https://m.media-amazon.com/images/I/31sMdKajF-L._AC_SR38,50_.jpg",
    "Lightblue": "https://m.media-amazon.com/images/I/21urCbCCKqL._AC_SR38,50_.jpg",
    "Apricot": "https://m.media-amazon.com/images/I/21+UuUiLp5L._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/21LuCJxGJZL._AC_SR38,50_.jpg",
    "Coffee": "https://m.media-amazon.com/images/I/31LF8v1sFpL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Darkgreen": "61Ss7mcTLVL",
    "Rust": "71Ho1sK74cL",
    "Ivory": "61TNWG5oWXL",
    "Purple": "613XUspuMtL",
    "Darkblue": "71PfkDOJnNL",
    "Lightblue": "71bBwEFwUbL",
    "Apricot": "71O-5b1npoL",
    "Black": "61RUb2Rhb2L",
    "Coffee": "71cfSpWj2ZL"
  },
  "color_images": {
    "Darkgreen": [
      "https://m.media-amazon.com/images/I/61Ss7mcTLVL._SL1500_.jpg"
    ],
    "Rust": [
      "https://m.media-amazon.com/images/I/71Ho1sK74cL._SL1500_.jpg"
    ],
    "Ivory": [
      "https://m.media-amazon.com/images/I/61TNWG5oWXL._SL1500_.jpg"
    ],
    "Purple": [
      "https://m.media-amazon.com/images/I/613XUspuMtL._SL1500_.jpg"
    ],
    "Darkblue": [
      "https://m.media-amazon.com/images/I/71PfkDOJnNL._SL1500_.jpg"
    ],
    "Lightblue": [
      "https://m.media-amazon.com/images/I/71bBwEFwUbL._SL1500_.jpg"
    ],
    "Apricot": [
      "https://m.media-amazon.com/images/I/71O-5b1npoL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/61RUb2Rhb2L._SL1500_.jpg"
    ],
    "Coffee": [
      "https://m.media-amazon.com/images/I/71cfSpWj2ZL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress-cocktail-bodycon",
      "title": "Womens Dress Cocktail Bodycon",
      "price": 47.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61NfEwzl3xL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-one-shoulder-maxi-formal",
      "title": "Womens Maxi Dress Evening One Shoulder Maxi Formal",
      "price": 69.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/5150AIQL4eL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail",
      "title": "Womens Dress Cocktail",
      "price": 103.54,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61JApwce25L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-formal-bodycon-evening-sleeveless",
      "title": "Womens Maxi Dress Maxi Formal Bodycon Evening Sleeveless",
      "price": 61.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61s8qg6u1VL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 158.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71PmRANW40L._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress-bodycon-split-ruched-off-shoulder",
      "title": "Womens Dress Bodycon Split Ruched Off Shoulder",
      "price": 38.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/41JjYcPgcpL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 95.61,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Work",
      "images": [
        "https://m.media-amazon.com/images/I/71hVgSIB1jL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 138.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51PZNrlyY9L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-split-evening-formal",
      "title": "Womens Maxi Dress Split Evening Formal",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51BZ1BqPx8L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 65.97,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/81wr8PDg55L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-v-neck",
      "title": "Womens Dress V Neck",
      "price": 82.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/710bSTpZ9hL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 278.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/91YXeyW506L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening-long-sleeve",
      "title": "Womens Maxi Dress Formal Evening Long Sleeve",
      "price": 87.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61nnk+flvaL._SL1500_.jpg"
      ]
    }
  ]
}