{
  "id": "womens-maxi-dress-long-sleeve-formal-cocktail",
  "handle": "womens-maxi-dress-long-sleeve-formal-cocktail",
  "sku": "JC1138",
  "asin": "B0CFZX9C69",
  "title": "Womens Maxi Dress Long Sleeve Formal Cocktail",
  "title_original": "Bbonlinedress Women Long Sleeve Velvet Vintage Tea Dress Formal Cocktail Wedding Guest Midi Prom V-Neck Fit and Flare Dress",
  "brand": "Visit the Bbonlinedress Store",
  "price": 48.99,
  "social_proof": {
    "bought_past_month": 56,
    "text": "56+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/61W9LD7yFrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71wmOmSDFkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71y2NfwgOBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/7124H-XY39L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ZuqWNeVWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71XX-5ZrviL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71IthF33XML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71BWNe44wKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71jDWeT41UL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ZcsMlusFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71nijfQl0IL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71YPE7I8SyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ZBUpAHXGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71YduIN962L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71h0pQ5Jq6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71sKgvopuTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61m2KH+saqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71kE1nwbpVL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Grx5bki9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71tIIm5A8XL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71lTLG8w2GL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71dcVMDIq1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/615By0LWiSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/716Fcq-4YLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61-Lzntu1xL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71dj07xLU4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71u4Iocq5wL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71QYvM0V+QL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61sQK83p2ZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71-YfrzCzzL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/61W9LD7yFrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71wmOmSDFkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71y2NfwgOBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/7124H-XY39L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ZuqWNeVWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71XX-5ZrviL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71IthF33XML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71BWNe44wKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71jDWeT41UL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ZcsMlusFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71nijfQl0IL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71YPE7I8SyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ZBUpAHXGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71YduIN962L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71h0pQ5Jq6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71sKgvopuTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61m2KH+saqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71kE1nwbpVL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Grx5bki9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71tIIm5A8XL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71lTLG8w2GL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71dcVMDIq1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/615By0LWiSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/716Fcq-4YLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61-Lzntu1xL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71dj07xLU4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71u4Iocq5wL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71QYvM0V+QL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61sQK83p2ZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71-YfrzCzzL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ November 19, 2020",
    "ASIN ‏": "‎ B0CDTG5NP1",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#108,127 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #262 in Women's Cocktail Dresses",
    "Customer Reviews": "4.2 4.2 out of 5 stars (1,855)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Dark Green",
      "V-navy",
      "V-burgundy",
      "Black",
      "Dark Red"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.2,
    "count": 1855,
    "customers_say": "Customers find the dress gorgeous, well-made, and comfortable, with nice soft velvet fabric that's perfect for holiday parties and winter events. The color receives positive feedback, and one customer notes it looks like an expensive dress after washing. The fit and flattering aspects receive mixed reviews - while some find it fits nicely, others say it's not true to size, and while some find it flattering, others say it's not flattering. Generated from the text of customer reviews Select to learn more Looks (69) Quality (57) Comfort (40) Color (37) Fabric softness (29) Dress size (25) Fit (114) Flattering (30) 69 customers mention looks, 65 positive, 4 negative 69 customers mention \"Looks\" 65 positive 4 negative Customers find the dress gorgeous, with one mentioning it looks like an expensive piece and another noting it maintains its appearance after washing. \" It’s a beautiful dress . true to size. Love the color. \" Read more \" This dress is beautiful , feels great and fits perfect. I plan to order in the non-velvet option. \" Read more \" Very nice dress , fit as expected. I was disappointed because I received the dress, and it had been worn.... \" Read more \" Pretty dress , beautiful green. Velvet makes it a bit heavy. I wanted to love it, but the dress was not flattering for my body type. \" Read more 57 customers mention quality, 49 positive, 8 negative 57 customers mention \"Quality\" 49 positive 8 negative Customers find the dress to be nicely made and well-constructed. \" Great dress , fits well. Well made and the velvet is a very nice thickness and stretches just right, \" Read more \" The dress is gorgeous, well made , and true to the color online. I'm 5'2\" and it's just too long in torso that it's not flattering. \" Read more \" ...I appreciate the great quality in all of the clothes I buy from Amazon; not one has been wrinkled or dirty or missing buttons, etc.... \" Read more \" ...is a little heavier than normal for a summer dress, but it was still nice and comfortable. The dress was not see thru at all. I would order it again.... \" Read more 40 customers mention comfort, 40 positive, 0 negative 40 customers mention \"Comfort\" 40 positive 0 negative Customers find the dress comfortable and very forgiving. \" This dress is so comfortable and so cute and so stylish I am going to order it in another color! You cannot go wrong with this. It is adorable.!! \" Read more \" I wore this to my nephew's wedding. It was very comfortable and the pockets held my keys and phone so i didnt have to carry a purse around and it... \" Read more \" ...Otherwise it didn't wrinkle like crazy and it was so comfortable . You can definitely dress it up with a fancy belt and that's a plus.... \" Read more \" ...The fabric is so soft and very forgiving . The dress allows you to breath and flows with you.... \" Read more 37 customers mention color, 31 positive, 6 negative 37 customers mention \"Color\" 31 positive 6 negative Customers love the color of the dress. \" Loved the dress! The color was beautiful ! I’m 5ft 160 lbs and ordered a large! I wore heels and it feel well! \" Read more \" I love the color and fit. Normally would have gotten a large but erred on the side of caution and glad I did. X large for nice.... \" Read more \" ...regular size of xl... fits so well... not tight.. wiggle room... beautiful color .... \" Read more \" I liked its design and color , but it’s too big for me. I’m gonna have to return it. \" Read more 29 customers mention fabric softness, 27 positive, 2 negative 29 customers mention \"Fabric softness\" 27 positive 2 negative Customers appreciate the fabric of the dress, describing it as nice and soft, with one customer noting that the velvet is perfect for the holidays. \" This was a great value for the money! Soft , stretchy material and a great color for our Christmas pictures. \" Read more \" Fits perfectly as sized. The fabric is soft and will be great for throwing in a suitcase for wrinkle free travel.... \" Read more \" ...The material is a little thick but that is to be expected from a nice velvet . If you need a new christmas dress, this is it! \" Read more \" ...Looks great! Very soft and comfortable. \" Read more 25 customers mention dress size, 25 positive, 0 negative 25 customers mention \"Dress size\" 25 positive 0 negative Customers find this dress suitable for holiday parties and winter events, with one customer mentioning it's perfect for a December wedding and another noting it's great for a winter cruise. \" Perfect holiday dress .... \" Read more \" Beautiful color, perfect for winter wedding ... \" Read more \" ...Waist really accentuates my figure. This will also be a great dress for holiday parties . I received a lot of complements.... \" Read more \" ...I think this cut is flattering on most body types. An amazing dress for any occasion . \" Read more 114 customers mention fit, 77 positive, 37 negative 114 customers mention \"Fit\" 77 positive 37 negative Customers have mixed experiences with the dress's fit, with some finding it comfortable and true to size, while others report it runs large and the sleeves are too tight. \" This dress for fit perfectly it is true to size and very comfortable \" Read more \" It’s a really nice dress. It is a little loose but fits well . Super comfy and perfect for weddings, outings and formal gatherings.... \" Read more \" Nice material but runs small \" Read more \" Love this dress and got a ton of compliments. Fit true to size and just how I wanted it.... \" Read more 30 customers mention flattering, 19 positive, 11 negative 30 customers mention \"Flattering\" 19 positive 11 negative Customers have mixed opinions about how flattering the dress is, with some finding it attractive while others disagree. \" Love this dress! So comfortable and flattering . Good quality especially for the fabulous price!... \" Read more \" ...I'm 5'2\" and it's just too long in torso that it's not flattering . \" Read more \" ...This dress is very flattering . The bust is lined. My only complaint is that the skirt of the dress is not lined.... \" Read more \" The material is solid, yet lightweight. It's incredibly flattering , very comfortable, and worth every penny.... \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Lovely and comfortable",
        "body": "This dress is very flattering but also quite comfortable. It is soft and well fitting. I wore it to a semi formal event and got lots of compliments. This is a great value for the money. It looks quite elegant. Read more",
        "author": "Kelly",
        "rating": 5.0,
        "date": "December 8, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Burgundy xl dress",
        "body": "I ordered my regular size of xl... fits so well... not tight.. wiggle room... beautiful color. I do carry my weight in my belly... and I still feel like this dress is forgiving and flares out in a way that compliments my body. Its not a heavy dress lightweight Read more",
        "author": "maria",
        "rating": 5.0,
        "date": "December 9, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Nice and comfortable",
        "body": "Nice and comfortable Read more",
        "author": "Kristine Sombrea",
        "rating": 4.0,
        "date": "December 1, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Great Dress",
        "body": "The dress is cute and quality is great, but the style is not for me. Read more",
        "author": "Customer",
        "rating": 5.0,
        "date": "November 25, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Good quality fabric/ nicely made",
        "body": "I loved this dress but had to return it. The fit was very nicely contoured but it didn't match my petite proportions (it was too long in the waist for me). I wish the company would consider making these dresses in a petite size. Read more",
        "author": "Lisa M",
        "rating": 3.0,
        "date": "January 4, 2024",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Buy the dress!",
        "body": "Buy this dress! I was blown away by the quality and how beautiful the velvet was. The fit is so flattering especially for us curvy ladies. The material is a little thick but that is to be expected from a nice velvet. If you need a new christmas dress, this is it! Read more",
        "author": "Cass VonD",
        "rating": 5.0,
        "date": "November 29, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "1.0 out of 5 stars Don’t",
        "body": "It’s a cute fit but so cheap. Walmart has better quality. First there is the waist ribbon that has nothing to hold it in place so it rolls up when you walk instead of staying at the waste where it should. Second the arms roll up?? Idk how that’s even a thing but they curl and roll up on themselves whilst wearing it. The final straw was that I purchased this for pictures. ONLY wore it for pictures and before I even got the first one taken noticed there is a run in the fabric on the front. I have already taken the tags off and honestly can’t tell if it came that way or if it’s so cheap getting from the house to my car somehow caused a run. 1/5 stars because in the 5 minutes I had it on before the belt started to roll and wouldn’t stay in place/the sleeves rolled up and I discovered the run it was a cute fit if only cheap fabric. Absurd price for a one time outfit that I’m sure didn’t photograph well. Will add more pics when I get photos back if photographer can’t edit out the above issues Read more",
        "author": "Jade & Icia",
        "rating": 1.0,
        "date": "November 20, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71G6iobgZyL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/714FRmrSDGL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Beautiful dress and great value.",
        "body": "Purchased for a fall wedding. I’m 5’4 and ordered a large. I ordered burgundy and absolutely love it. Pics are from straight out of the bag. I really like the heaviness of the material and how it hangs. :) I’m not a heels person, so I’m pairing it with a pair of burgundy velvet loafers. :) Read more",
        "author": "Jenny Carroll",
        "rating": 5.0,
        "date": "October 7, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71G88Jk1sLL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71VRxjmTZXL._SY88._SL1500_.jpg"
        ]
      }
    ]
  },
  "short_description": "Womens Maxi Dress Long Sleeve Formal Cocktail is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.",
  "about_this_item": "Womens Maxi Dress Long Sleeve Formal Cocktail is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.",
  "long_description": "Womens Maxi Dress Long Sleeve Formal Cocktail is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Dark Green, V-navy, V-burgundy, Black, Dark Red. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Long Sleeve Formal Cocktail is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Dark Green, V-navy, V-burgundy, Black, Dark Red. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "f503d07c-4d26-443e-9e98-e4aa2eff3103",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f503d07c-4d26-443e-9e98-e4aa2eff3103/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f503d07c-4d26-443e-9e98-e4aa2eff3103/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "2cc25640-73f7-45b8-babd-297b19fce0ef",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2cc25640-73f7-45b8-babd-297b19fce0ef/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2cc25640-73f7-45b8-babd-297b19fce0ef/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "304c56f1-1e6d-4a8e-a765-64986914d97b",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/304c56f1-1e6d-4a8e-a765-64986914d97b/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/304c56f1-1e6d-4a8e-a765-64986914d97b/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "0fff428b-6032-4502-9275-7bff00dc331c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0fff428b-6032-4502-9275-7bff00dc331c/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0fff428b-6032-4502-9275-7bff00dc331c/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "90edbef1-9cb0-4f76-8eb7-d30838392a54",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/90edbef1-9cb0-4f76-8eb7-d30838392a54/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/90edbef1-9cb0-4f76-8eb7-d30838392a54/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "a41a3a6b-5bce-43a6-892b-d2bdf5cc454d",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a41a3a6b-5bce-43a6-892b-d2bdf5cc454d/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a41a3a6b-5bce-43a6-892b-d2bdf5cc454d/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "60eb0783-6b93-4fd9-a374-2530ed26bd00",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/60eb0783-6b93-4fd9-a374-2530ed26bd00/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/60eb0783-6b93-4fd9-a374-2530ed26bd00/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "35c96b7f-bf0e-4318-9880-8ca89a245a99",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/35c96b7f-bf0e-4318-9880-8ca89a245a99/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/35c96b7f-bf0e-4318-9880-8ca89a245a99/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Dark Green": "https://m.media-amazon.com/images/I/41SZv78QJgL._AC_SR38,50_.jpg",
    "V-navy": "https://m.media-amazon.com/images/I/41iRkd55aRL._AC_SR38,50_.jpg",
    "V-burgundy": "https://m.media-amazon.com/images/I/41pXBqzqsML._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31l0Lthm-3L._AC_SR38,50_.jpg",
    "Dark Red": "https://m.media-amazon.com/images/I/41hiQunRvFL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Dark Green": "71IthF33XML",
    "V-navy": "71ZBUpAHXGL",
    "V-burgundy": "61W9LD7yFrL",
    "Black": "61Grx5bki9L",
    "Dark Red": "61-Lzntu1xL"
  },
  "color_images": {
    "Dark Green": [
      "https://m.media-amazon.com/images/I/71IthF33XML._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71BWNe44wKL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71jDWeT41UL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71ZcsMlusFL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71nijfQl0IL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71YPE7I8SyL._SL1500_.jpg"
    ],
    "V-navy": [
      "https://m.media-amazon.com/images/I/71ZBUpAHXGL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71YduIN962L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71h0pQ5Jq6L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71sKgvopuTL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61m2KH+saqL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71kE1nwbpVL._SL1500_.jpg"
    ],
    "V-burgundy": [
      "https://m.media-amazon.com/images/I/61W9LD7yFrL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71wmOmSDFkL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71y2NfwgOBL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/7124H-XY39L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61ZuqWNeVWL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71XX-5ZrviL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/61Grx5bki9L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71tIIm5A8XL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71lTLG8w2GL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71dcVMDIq1L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/615By0LWiSL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/716Fcq-4YLL._SL1500_.jpg"
    ],
    "Dark Red": [
      "https://m.media-amazon.com/images/I/61-Lzntu1xL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71dj07xLU4L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71u4Iocq5wL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71QYvM0V+QL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61sQK83p2ZL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71-YfrzCzzL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress-short-sleeve-cocktail-v-neck",
      "title": "Womens Dress Short Sleeve Cocktail V Neck",
      "price": 38.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/711qjQG4GEL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-evening-formal-cocktail",
      "title": "Womens Maxi Dress Maxi Evening Formal Cocktail",
      "price": 43.31,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61xHz823hmL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 249.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71WPcn+elVL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-formal-sleeveless",
      "title": "Womens Dress Formal Sleeveless",
      "price": 44.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61vk1m8RMeL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 95.73,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51wBkntt7NL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-maxi-formal-evening",
      "title": "Womens Maxi Dress Maxi Formal Evening",
      "price": 52.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61NaRoByawL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail-short-sleeve-ruched",
      "title": "Womens Dress Cocktail Short Sleeve Ruched",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/51EAoXP7IGL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening-v-neck",
      "title": "Womens Maxi Dress Formal Evening V Neck",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71Rq2skdBFL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-v-neck-cocktail-evening-long-sleeve",
      "title": "Womens Maxi Dress V Neck Cocktail Evening Long Sleeve",
      "price": 64.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/71jdGTmoWkL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-v-neck-sleeveless",
      "title": "Womens Dress V Neck Sleeveless",
      "price": 12.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71Kjq5yq53L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-mermaid-evening-v-neck",
      "title": "Womens Maxi Dress Formal Mermaid Evening V Neck",
      "price": 94.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61l4ipCOEHL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-evening",
      "title": "Womens Maxi Dress Maxi Evening",
      "price": 89.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/71L6G0c3luL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-off-shoulder-evening-bodycon-formal-maxi",
      "title": "Womens Maxi Dress Off Shoulder Evening Bodycon Formal Maxi",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71nsTQYF-GL._SL1500_.jpg"
      ]
    }
  ]
}