{
  "id": "womens-maxi-dress-long-sleeve",
  "handle": "womens-maxi-dress-long-sleeve",
  "sku": "JC1050",
  "asin": "B0CFXFF22J",
  "title": "Womens Maxi Dress Long Sleeve",
  "title_original": "Alaster Queen Women's Corduroy Long Sleeve Short Dresses Fall Winter Button Down Work Tunic Dress with Pocket",
  "brand": "Visit the Alaster Queen Store",
  "price": 42.99,
  "social_proof": {
    "bought_past_month": 1011,
    "text": "1011+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/71bqoI3Xa8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71GTX9M4UTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61dTIlEhSAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61SjLcbQTZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81jHUcU1XfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71zYpoh2psL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/714mh5+aKjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61jM4vmGTLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61KV2xq2OTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/916kRl0MklL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61XMi63yNFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61rbwT3ySDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61+hIjF-JmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61eY64bNwiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/711U1gM6VgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61xg+27C6nL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61YcoOwvk4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71hFq59XH1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61K0hZpFaiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81-Ul-5WVGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71iEpA90HSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/719cRSvbVBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61g-hfoHLpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61dNlfijdJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/913wDkNZN-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/610mfUZc16L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61FQTIFauCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/618M+K5-qVL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61w5vFUiD4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81BrDdxbhIL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71PAU2g9FRL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61TCvw2TVDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/717xVYBd4wL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61UeimYtqsL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91wGKWMMwwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61vIdGl-tUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61l0K28q1GL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71CifoFOdcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/616dKGBbukL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81QqqVGHWuL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/71bqoI3Xa8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71GTX9M4UTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61dTIlEhSAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61SjLcbQTZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81jHUcU1XfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71zYpoh2psL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/714mh5+aKjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61jM4vmGTLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61KV2xq2OTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/916kRl0MklL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61XMi63yNFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61rbwT3ySDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61+hIjF-JmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61eY64bNwiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/711U1gM6VgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61xg+27C6nL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61YcoOwvk4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71hFq59XH1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61K0hZpFaiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81-Ul-5WVGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71iEpA90HSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/719cRSvbVBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61g-hfoHLpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61dNlfijdJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/913wDkNZN-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/610mfUZc16L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61FQTIFauCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/618M+K5-qVL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61w5vFUiD4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81BrDdxbhIL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71PAU2g9FRL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61TCvw2TVDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/717xVYBd4wL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61UeimYtqsL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91wGKWMMwwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61vIdGl-tUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61l0K28q1GL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71CifoFOdcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/616dKGBbukL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81QqqVGHWuL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ September 27, 2023",
    "ASIN ‏": "‎ B0CJY26K84",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#18,152 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #131 in Women's Casual Dresses",
    "Customer Reviews": "4.2 4.2 out of 5 stars (317)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Red",
      "Brown",
      "White",
      "Blue",
      "Apricot",
      "Black",
      "Coffee",
      "Green"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.2,
    "count": 317,
    "customers_say": "Customers find the dress looks cute, well-made, and comfortable, with soft corduroy fabric and accurate color representation. The dress receives positive feedback for its material quality, with one customer noting it's regular corduroy. Customers disagree on the sizing, with some finding it true to size while others say it runs small. The fit receives mixed reviews, with some finding it perfect while others note the sleeves are too short. Generated from the text of customer reviews Select to learn more Looks great (54) Quality (42) Comfort (21) Material quality (18) Color accuracy (17) Soft material (17) Fit (76) Sizing (23) 54 customers mention looks great, 51 positive, 3 negative 54 customers mention \"Looks great\" 51 positive 3 negative Customers find the dress very cute and of high quality. \" Nice quality, cute , a little large in shoulders, returning and ordering a smaller size in different color \" Read more \" Super Cute . The weather warmed up too soon for me to wear it so I am looking foward to the fall. \" Read more \" So cute . You can dress it up with shoes for work or dress it down somewhat with high boots. \" Read more \" ...Super comfortable, really cute , & perfect length! I did buy a waist belt just for extra flair and it made the dress 10x better! \" Read more 42 customers mention quality, 40 positive, 2 negative 42 customers mention \"Quality\" 40 positive 2 negative Customers find the dress to be well-made and of good quality. \" Love this dress . Fits so nicely. Nice soft material. Love the color. Very happy with it. \" Read more \" I LOVE this dress. Seems to be well made . I could have bought the XL but got the XXL it is just a little big, but still look great on.... \" Read more \" ...So maybe a medium would have been longer I don’t know. Good quality and worked perfect with a hat and boots for the rodeo. \" Read more \" Nice dress \" Read more 21 customers mention comfort, 21 positive, 0 negative 21 customers mention \"Comfort\" 21 positive 0 negative Customers find the dress comfortable and cozy. \" Super cute and comfortable . I am 180 lbs 5’4 and ordered a large but could have possibly gotten a medium for a more snug fit. I recommend!! \" Read more \" Comfy , cute, and has pockets!... \" Read more \" Super comfortable , soft semi- wide wale corduroy dress, LOVE the pockets. Feels well made, sturdy and looks well sewn for a change.... \" Read more \" ...Can open a few more buttons if you wear a cami under it. Very comfortable , and not too heavy/hot. \" Read more 18 customers mention material quality, 16 positive, 2 negative 18 customers mention \"Material quality\" 16 positive 2 negative Customers love the material of the dress, describing it as very nice, with one customer noting it feels like cotton corduroy. \" Nice fabric and workmanship but sizing is way off. There was no size marked on the dress anyplace.... \" Read more \" Love the material Thick Love the pockets Runs a little small in chest area I got a small but I should have got a medium. \" Read more \" Great material , decently warm without being too heavy or hot to wear indoors. Soft and moves very well, true to color, with a relaxed fit. Very cute.... \" Read more \" Size, length, and material was perfect but the color is orange. (Not brown) \" Read more 17 customers mention color accuracy, 12 positive, 5 negative 17 customers mention \"Color accuracy\" 12 positive 5 negative Customers are satisfied with the dress's color accuracy. \" ...Soft and moves very well, true to color , with a relaxed fit. Very cute. Long delivery time, but otherwise an excellent purchase! \" Read more \" Love this dress! Purchased in navy. Color was on point and great quality material. Length is just right.... \" Read more \" I live the dress! Very cute for boots. The color is not brown , it is Orange! \" Read more \" ...Overall the color is exact and shipping was faster than expected. \" Read more 17 customers mention soft material, 17 positive, 0 negative 17 customers mention \"Soft material\" 17 positive 0 negative Customers love the soft corduroy fabric of the dress. \" ...bulge out...the corduroy is beautiful in both black and white...it is soft and Icomplimentary to my shape....the picture really doesn't do it justice... \" Read more \" I love this dress. It's so soft and it fits great. I'm going to buy more in different colors. \" Read more \" ...I will be ordering a different color for fall weather. I love the feel of this dress and how well it fit. \" Read more \" Absolutely love this dress! Fabric is super soft ! Great length also \" Read more 76 customers mention fit, 52 positive, 24 negative 76 customers mention \"Fit\" 52 positive 24 negative Customers have mixed opinions about the dress's fit, with some finding it perfect and noting it's long enough to wear with tights, while others mention it runs a bit big and the sleeves are too short on small sizes. \" ...I ordered a XL and it’s a perfect fit . I ordered a XL in this and its tight across the bust line.... \" Read more \" Fits true to size , flattering and tummy flattering. I am round in the middle and this hid it well. The length is just to the knee .... \" Read more \" I like this shirt dress! I ordered size S my normal size. But its too big , for me it’s like M size on me. Hope they had XS this shirt dress run big!! \" Read more \" This was a great fit and great quality- pretty color and perfect for a Christmas party \" Read more 23 customers mention sizing, 7 positive, 16 negative 23 customers mention \"Sizing\" 7 positive 16 negative Customers have mixed experiences with the sizing of the dress, with some finding it true to size while others report that it runs a tad small. \" Nice fabric and workmanship but sizing is way off . There was no size marked on the dress anyplace.... \" Read more \" This was not true to size . Couldn’t wear as a dress because the buttons pull \" Read more \" ...Very comfortable fitting. Nice material. True to size . I will be ordering a different color for fall weather.... \" Read more \" ...Purchased 2 different sizes and had to send both back. Dress runs very small . If it had fit, dress is cute and material felt good. \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Perfect!",
        "body": "I love this dress! It fits perfectly. For reference, I’m 5’4” and 175-180lbs, small D in the chest. I bought a Large. It has pockets and the corduroy is soft and true to color. Love! Read more",
        "author": "David Ewing",
        "rating": 5.0,
        "date": "December 4, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Super comfy",
        "body": "Im 5’3 curvy about 175lbs I got a size Large and I feel super cute wearing this! I get so may compliments everytime, it’s not heavy but it keeps me warm. I love pairing it with knee high boots or doc martens Read more",
        "author": "MarkLupeFulcher",
        "rating": 5.0,
        "date": "December 19, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Great cold weather staple dress! Size up or cami for D cups and up",
        "body": "Super comfortable, soft semi- wide wale corduroy dress, LOVE the pockets. Feels well made, sturdy and looks well sewn for a change. Material does not stretch or give, functional front button closure. Haven’t washed yet, so can’t speak regarding how it will hold up to laundering, but my general rule for these types of clothes is cold gentle/hand wash setting on the machine, hang to drip dry or dry flat, or even do Dryel if it’s super delicate. This isn’t, so I digress. That may not work for everyone but I’ve gotten tons more mileage out of my “fast fashion” cheapish Amazon clothes by babying them a little. I’m 5’3.5” tall, 162 lbs, 38DDD. Ordered a Large. this hits perfectly at my knees. This will look good with tights and boots, flats, easy to style. Can do a belt if you don’t mind a belt over the center buttons. Love the fact that it is slightly shaped so it doesn’t hang like a sack BUT- PLEASE BE WARNED- if you have anything bigger than a C cup, you will not be able to button across your chest without either sizing up (which will impact the neat semi fitted look) or being prepared to wear a cami underneath , as you will have that awful pulling/ gapping across your boobs, which is up there with camel toe, VPL and the like lol. I have to do a cami with the size L on DDD cups, as an XL would have added too much bulk overall just to get the upper buttons without gapping. Left off one star for the lack of room for bigger chests, that’s really the only fault I found! Well worth a shot if you keep that in mind for fit. Read more",
        "author": "\"L\"",
        "rating": 4.0,
        "date": "December 3, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Perfect Corduroy Dress",
        "body": "The quality of this dress is outstanding! It fits perfectly. I read the reviews and followed their sizing recommendations. I am 5'3 - 135 1b and the Medium is a perfect fit. The Material is good quality and will be a great addition to my wardrobe throughout the fall and winter seasons. Read more",
        "author": "B. L. Smith",
        "rating": 5.0,
        "date": "November 21, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Nice fabric & fit except…",
        "body": "I bought an XXL & the fit was fine. I agree with other reviewers that the fabric is very nice. My problem was that the sleeves have a puff or lift at the shoulders. That, coupled with the placement of the pockets, I looked like a linebacker. It is probably cute on someone very petite and thin. I’m short but not thin. I had to return it. Read more",
        "author": "K. S.",
        "rating": 3.0,
        "date": "December 16, 2024",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars I really like this dress!",
        "body": "This is a really cute, comfortable dress. It has some stretch to it, which I love. My only issue is that the button holes are a tad small, but that's better than them being loose and it coming unbuttoned. It does seem to fit a little bit small, so if you tend to hover between two sizes, consider sizing up, especially if you have an ample chest. Read more",
        "author": "Lisa R Smith",
        "rating": 5.0,
        "date": "January 13, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars LOVE THIS DRESS!",
        "body": "ORDERED TO WEAR FOR FALL. DOES RUN A TAD SMALL. I'M A 4-6 ORDERED A SMALL. FITS TO A TEE BUT IF I WERE TO GAIN 5 LBS OR ACCIDENTALLY SHRINK IT....WOULD DEFINATELY NEED A MEDIUM. OTHERWISE LOVE IT FOR THE PRICE!!! Read more",
        "author": "SJS",
        "rating": 5.0,
        "date": "October 27, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "1.0 out of 5 stars Not true to size",
        "body": "This was not true to size. Couldn’t wear as a dress because the buttons pull Read more",
        "author": "Kate",
        "rating": 1.0,
        "date": "December 7, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.",
  "about_this_item": "Womens Maxi Dress Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.",
  "long_description": "Womens Maxi Dress Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Red, Brown, White, Blue, Apricot, Black, Coffee, Green. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Red, Brown, White, Blue, Apricot, Black, Coffee, Green. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "741075dc-b355-4f8c-82a2-c8336d3c39e3",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/741075dc-b355-4f8c-82a2-c8336d3c39e3/embedded.cc.default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/741075dc-b355-4f8c-82a2-c8336d3c39e3/embedded.cc.default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "2cefad29-8fae-4e7e-ae0c-c8ed1661180f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2cefad29-8fae-4e7e-ae0c-c8ed1661180f/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2cefad29-8fae-4e7e-ae0c-c8ed1661180f/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "b4557ae0-47b7-46eb-b20d-b921468d7f24",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b4557ae0-47b7-46eb-b20d-b921468d7f24/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b4557ae0-47b7-46eb-b20d-b921468d7f24/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "ae904089-fef0-4a48-b945-24f94988a269",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ae904089-fef0-4a48-b945-24f94988a269/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ae904089-fef0-4a48-b945-24f94988a269/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "20c0f1ef-9cc4-492b-bf56-79469445da0f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/20c0f1ef-9cc4-492b-bf56-79469445da0f/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/20c0f1ef-9cc4-492b-bf56-79469445da0f/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "2c15b50e-809f-4c8b-a9ff-4d237ff2c8e5",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2c15b50e-809f-4c8b-a9ff-4d237ff2c8e5/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2c15b50e-809f-4c8b-a9ff-4d237ff2c8e5/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "a7349e81-cdfc-44d6-9172-8338ea7dbceb",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a7349e81-cdfc-44d6-9172-8338ea7dbceb/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a7349e81-cdfc-44d6-9172-8338ea7dbceb/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "825c295a-77df-4a7c-97ff-b242592fadf4",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/825c295a-77df-4a7c-97ff-b242592fadf4/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/825c295a-77df-4a7c-97ff-b242592fadf4/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "848172b8-1098-4cb6-9c53-85dd35265c14",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/848172b8-1098-4cb6-9c53-85dd35265c14/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/848172b8-1098-4cb6-9c53-85dd35265c14/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "b68a2bcb-d342-4e31-8d2c-faf84418867e",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b68a2bcb-d342-4e31-8d2c-faf84418867e/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b68a2bcb-d342-4e31-8d2c-faf84418867e/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "294d5fae-3f54-4312-8659-5323824ae399",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/294d5fae-3f54-4312-8659-5323824ae399/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/294d5fae-3f54-4312-8659-5323824ae399/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "0c4d23b4-664c-49bd-8122-5bfb3e5cf225",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0c4d23b4-664c-49bd-8122-5bfb3e5cf225/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0c4d23b4-664c-49bd-8122-5bfb3e5cf225/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Red": "https://m.media-amazon.com/images/I/410t2KIXtiL._AC_SR38,50_.jpg",
    "Brown": "https://m.media-amazon.com/images/I/41jbj1tmB+L._AC_SR38,50_.jpg",
    "White": "https://m.media-amazon.com/images/I/41IGQloPfSL._AC_SR38,50_.jpg",
    "Blue": "https://m.media-amazon.com/images/I/419Go821ITL._AC_SR38,50_.jpg",
    "Apricot": "https://m.media-amazon.com/images/I/41EjfhB-mLL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/41NmqjddxuL._AC_SR38,50_.jpg",
    "Coffee": "https://m.media-amazon.com/images/I/413Iki3rwZL._AC_SR38,50_.jpg",
    "Green": "https://m.media-amazon.com/images/I/415H2G8f6CL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Red": "71bqoI3Xa8L",
    "Brown": "71zYpoh2psL",
    "White": "61XMi63yNFL",
    "Blue": "61xg+27C6nL",
    "Apricot": "71iEpA90HSL",
    "Black": "610mfUZc16L",
    "Coffee": "71PAU2g9FRL",
    "Green": "61vIdGl-tUL"
  },
  "color_images": {
    "Red": [
      "https://m.media-amazon.com/images/I/71bqoI3Xa8L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71GTX9M4UTL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61dTIlEhSAL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61SjLcbQTZL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81jHUcU1XfL._SL1500_.jpg"
    ],
    "Brown": [
      "https://m.media-amazon.com/images/I/71zYpoh2psL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/714mh5+aKjL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61jM4vmGTLL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61KV2xq2OTL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/916kRl0MklL._SL1500_.jpg"
    ],
    "White": [
      "https://m.media-amazon.com/images/I/61XMi63yNFL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61rbwT3ySDL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61+hIjF-JmL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61eY64bNwiL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/711U1gM6VgL._SL1500_.jpg"
    ],
    "Blue": [
      "https://m.media-amazon.com/images/I/61xg+27C6nL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61YcoOwvk4L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71hFq59XH1L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61K0hZpFaiL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81-Ul-5WVGL._SL1500_.jpg"
    ],
    "Apricot": [
      "https://m.media-amazon.com/images/I/71iEpA90HSL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/719cRSvbVBL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61g-hfoHLpL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61dNlfijdJL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/913wDkNZN-L._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/610mfUZc16L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61FQTIFauCL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/618M+K5-qVL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61w5vFUiD4L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81BrDdxbhIL._SL1500_.jpg"
    ],
    "Coffee": [
      "https://m.media-amazon.com/images/I/71PAU2g9FRL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61TCvw2TVDL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/717xVYBd4wL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61UeimYtqsL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/91wGKWMMwwL._SL1500_.jpg"
    ],
    "Green": [
      "https://m.media-amazon.com/images/I/61vIdGl-tUL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61l0K28q1GL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71CifoFOdcL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/616dKGBbukL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81QqqVGHWuL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress-cocktail-bodycon",
      "title": "Womens Dress Cocktail Bodycon",
      "price": 47.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61NfEwzl3xL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-one-shoulder-maxi-formal",
      "title": "Womens Maxi Dress Evening One Shoulder Maxi Formal",
      "price": 69.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/5150AIQL4eL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail",
      "title": "Womens Dress Cocktail",
      "price": 103.54,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61JApwce25L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-formal-bodycon-evening-sleeveless",
      "title": "Womens Maxi Dress Maxi Formal Bodycon Evening Sleeveless",
      "price": 61.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61s8qg6u1VL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 158.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71PmRANW40L._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress-bodycon-split-ruched-off-shoulder",
      "title": "Womens Dress Bodycon Split Ruched Off Shoulder",
      "price": 38.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/41JjYcPgcpL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 95.61,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Work",
      "images": [
        "https://m.media-amazon.com/images/I/71hVgSIB1jL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 138.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51PZNrlyY9L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-split-evening-formal",
      "title": "Womens Maxi Dress Split Evening Formal",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51BZ1BqPx8L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 65.97,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/81wr8PDg55L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-v-neck",
      "title": "Womens Dress V Neck",
      "price": 82.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/710bSTpZ9hL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 278.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/91YXeyW506L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening-long-sleeve",
      "title": "Womens Maxi Dress Formal Evening Long Sleeve",
      "price": 87.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61nnk+flvaL._SL1500_.jpg"
      ]
    }
  ]
}