{
  "id": "womens-maxi-dress-long-sleeve-cocktail",
  "handle": "womens-maxi-dress-long-sleeve-cocktail",
  "sku": "JC3135",
  "asin": "B0CFFK99MC",
  "title": "Womens Maxi Dress Long Sleeve Cocktail",
  "title_original": "Yanfoam Women's Puff Long Sleeve Sweetheart Round Neck Dress Flowy Loose Chiffon for Cocktail Party Mini Dress",
  "brand": "Yanfoam",
  "price": 45.99,
  "social_proof": {
    "bought_past_month": 72,
    "text": "72+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/41skVXwCPbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51lh47N8V+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/517svic7pJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51NiV8VtoSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61XtRvDEugL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41AL74Vdl6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41fCusW1n6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41NTsHrWkjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41R6-WozQ5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41FcRibyfNL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/414PdlGwXwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41FnoNseQOL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51rkrnN3GLL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/41skVXwCPbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51lh47N8V+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/517svic7pJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51NiV8VtoSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61XtRvDEugL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41AL74Vdl6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41fCusW1n6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41NTsHrWkjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41R6-WozQ5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41FcRibyfNL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/414PdlGwXwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41FnoNseQOL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51rkrnN3GLL._SL1500_.jpg"
  ],
  "aplus_images": [
    "https://m.media-amazon.com/images/I/31dcV%2B-rITL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31a4qCpEb1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31-nmQcurOL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31vugUKGESL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/417IO%2BXUUAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41OrzxMfceL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/412CiHV80pL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/418V-56wdhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31s63foH2KL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41CBigU-CbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/312AN2iznxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31XB0HziP4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31oTfzfjq8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41jRVnRWE-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31rf1CPRmcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41BsgVHmevL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31jlll3jRWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51T8yY6xgxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/510eSNrWv6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41mD-B43zlL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41%2BXlg0tERL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31pKxgZFjuL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41xyxf6oSFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/411e0wgmcXL._SL1500_.jpg"
  ],
  "description_images": [
    "https://m.media-amazon.com/images/I/31dcV%2B-rITL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31a4qCpEb1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31-nmQcurOL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31vugUKGESL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/417IO%2BXUUAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41OrzxMfceL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/412CiHV80pL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/418V-56wdhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31s63foH2KL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41CBigU-CbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/312AN2iznxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31XB0HziP4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31oTfzfjq8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41jRVnRWE-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31rf1CPRmcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41BsgVHmevL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31jlll3jRWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51T8yY6xgxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/510eSNrWv6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41mD-B43zlL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41%2BXlg0tERL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31pKxgZFjuL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41xyxf6oSFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/411e0wgmcXL._SL1500_.jpg"
  ],
  "bullets": [],
  "specs": {
    "Package Dimensions ‏": "‎ 13.78 x 7.87 x 0.39 inches; 8.82 ounces",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ August 11, 2023",
    "ASIN ‏": "‎ B0CFFHJH8P",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#46,857 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #542 in Women's Casual Dresses",
    "Customer Reviews": "4.2 4.2 out of 5 stars (277)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Brown",
      "Green2",
      "White",
      "Purple",
      "Yellow",
      "Apricot",
      "Black",
      "Orange",
      "Green"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.2,
    "count": 277,
    "customers_say": "Customers find the dress beautiful and well-made, with a sheer fabric that's airy and comfortable to wear. They appreciate its versatility, with one customer noting it's perfect for a sail-away cruise party, and consider it excellent value for money. The sizing receives mixed feedback - while some say it fits true to size, others find it too big. The color quality is also mixed, with some customers loving it while others express dissatisfaction. Select to learn more Style Quality Material quality Comfort Dress style Value for money Size Color quality 50 customers mention \"Style\" 48 positive 2 negative Customers find the dress pretty and like its color, with one customer noting it's suitable for special occasions and another mentioning it's cool to wear in summer months. \"Dress arrived and had like lotion or oil stains I believe. Beautiful dress . I bought in M & L because I wasn't sure of size....\" Read more \"Its cute but It doesn't fit my body type (pear shape). It probably looks better with fuller breast.\" Read more \"...I would say that it worked well. Just a gorgeous, classy dress for sure!\" Read more \"Although I returned it, this dress is super cute ! I returned it bc it was way too long on me. I think it’s odd anyone thinks it’s “too short.”...\" Read more 26 customers mention \"Quality\" 23 positive 3 negative Customers have mixed opinions about the dress's quality, with some finding it beautifully made and absolutely loving it, while others report terrible quality. \"Bought for my sister, she loved the dress . Wore to her women's conference at church and was a hit!\" Read more \" Love the dress , fits true to size BUT that bow is NOT as full as it is in the photo. Worth buying though!\" Read more \" Good quality , could have used a size down, longer than I'd have liked. Returning though I'd recommend it.\" Read more \" Nice Dress , great material...\" Read more 14 customers mention \"Material quality\" 12 positive 2 negative Customers like the material of the dress, describing it as nice and sheer, with one customer noting that it is airy. \"Beautiful Dress, Many compliments. Overall great material \" Read more \"The material was nice quality and flowy\" Read more \"Beautiful dress. Great fabric !\" Read more \" Material is nice and cool , wear m/l got my exact fit and looks good, many compliments. Curvey girl!\" Read more 13 customers mention \"Comfort\" 12 positive 1 negative Customers find the dress comfortable. \"Was perfect for our sail away cruise party. Comfortable and light. I normally wear XL but sized up due to most reviews say they dress is short....\" Read more \"True to size, color is beautiful. Very comfortable , flow nicely and light weight fabric. Would recommend.\" Read more \" Comfortable dress , length is okay for me, no wrinkles after washing, it’s not see through , i love the color, I won’t mind buying another colour ,...\" Read more \"...The fabric is so airy, feels so comfortable , looks amazing, quality is amazing fit is perfect excellent value\" Read more 10 customers mention \"Dress style\" 9 positive 1 negative Customers like the dress's style, with individual reviews mentioning it works well for various occasions including weddings, date nights, cruise parties, church events, and work. \"...This dress was so beautiful on!! Well made and perfect for a summer wedding !! Sz L.... 5ft 9inches 197lbs...\" Read more \"I’m received a lot of compliments on this dress. You can dress it up or down .\" Read more \"I love this dress! It's perfect for a date night , a classy black-tie event, or an elegant after-five outfit.\" Read more \"...Do not hesitate to buy this dress! So pretty! Perfect for work , church, and night out, or a party! Highly recommend!\" Read more 7 customers mention \"Value for money\" 6 positive 1 negative Customers find the dress to be excellent value for money. \"... Price , quality and size was on point too.\" Read more \"I love it!! Received so many compliments. Fit perfectly, and price was a steal .\" Read more \"...so comfortable, looks amazing, quality is amazing fit is perfect excellent value \" Read more \"...But this dress was not only very comfortable but I surely got my moneys worth ....\" Read more 43 customers mention \"Size\" 28 positive 15 negative Customers have mixed opinions about the dress's size, with some finding it true to size with a great flowing fit and perfect length, while others report it being way too big or too short. \"...The material is as described, and true to size .. The quality is good, and the length is above my knees (I’m 5’3)....\" Read more \" Too large , preferably asmaller size.\" Read more \"I love it!! Received so many compliments. Fit perfectly , and price was a steal.\" Read more \"Love the dress, fits true to size BUT that bow is NOT as full as it is in the photo. Worth buying though!\" Read more 12 customers mention \"Color quality\" 7 positive 5 negative Customers have mixed opinions about the dress's color, with some finding it great while others consider it bad. \"...Great flowing fit so shape wear wasn’t necessary. Color was vibrant and eye catching!...\" Read more \"I received this dress used. I ordered it as new. The color is dull , the dress is wrinkled and smells like the worst body odor ever....\" Read more \"True to size, color is beautiful . Very comfortable, flow nicely and light weight fabric. Would recommend.\" Read more \"...It would take too much time to get it to look like the picture. The color was off . The bow tie wasn't happening....\" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Beautiful!",
        "body": "You couldn’t tell me nothing when I put this on! Worn to family wedding and all eyes were on us! Great flowing fit so shape wear wasn’t necessary. Color was vibrant and eye catching! The fabric is a little thin so I’ll only wear in spring and summer. I’ve already ordered 3 other colors Read more",
        "author": "BamasFinest",
        "rating": 5.0,
        "date": "December 9, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71WFIGbwCoL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Cute dress!",
        "body": "The material was not cheap looking. The dress was cute. It did not flare much, but it was still a nice look. I received multiple compliments. I would recommend. DO NOT ORDER THE PURPLE! The color is bad. Black was perfect. Read more",
        "author": "Ms. O",
        "rating": 5.0,
        "date": "December 21, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Perfect look",
        "body": "The media could not be loaded. Comfortable dress, length is okay for me, no wrinkles after washing, it’s not see through , i love the color, I won’t mind buying another colour , value of money , i received a lot of compliments from people. Read more",
        "author": "Lily L",
        "rating": 5.0,
        "date": "December 13, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71PqZ8K4y0L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "1.0 out of 5 stars Terrible quality",
        "body": "Gross fabric 1000 percent thick polyester. Dress is extremely oversized. Would not order Read more",
        "author": "AMY",
        "rating": 1.0,
        "date": "September 30, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Cute dress",
        "body": "This is a classy dress, BUT if you’re short, you’ll definitely have to make some adjustments. That’s why I gave it 4 stars. I had to sew mine and make it work for a shorter look bc it was long to my knees,and it looks better mid thigh length like a short bubbly dress! Please go down a size. I wear an XL, and ordered a L & I’m glad I did. Perfect fit. The dress is not see through, I ordered black bc the birthday event was black attire. Definitely not a Church dress, I’d suggest a birthday dinner or date night! Read more",
        "author": "LaToya Dickson",
        "rating": 4.0,
        "date": "May 23, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Bubble dress",
        "body": "Beautiful dress. Great fabric! Read more",
        "author": "Marci",
        "rating": 5.0,
        "date": "December 21, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Elegant look for a low price",
        "body": "Loved this dress! I wore it out for my birthday dinner with my friends. I was worried about how to get the folding wrinkles out, but I put it in the dryer for about 15 mins and hung it up. Turned out great!! I’m 5’ 3” about 150 lbs I purchased a medium. Read more",
        "author": "Jimia",
        "rating": 5.0,
        "date": "September 24, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71m3fl7BrAL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Disappointed",
        "body": "The material is soft, the dress is even more adorable than the picture. I ordered a small and it fits perfect. I love love it. The dress ripped down the back seam. I had bought the dress a month in advance. I was very self conscious because I literally had to wear the dress anyway. Read more",
        "author": "paula",
        "rating": 5.0,
        "date": "September 3, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Long Sleeve Cocktail is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.",
  "about_this_item": "Womens Maxi Dress Long Sleeve Cocktail is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.",
  "long_description": "Womens Maxi Dress Long Sleeve Cocktail is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Brown, Green2, White, Purple, Yellow, Apricot, Black, Orange, Green. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Long Sleeve Cocktail is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/31dcV%2B-rITL._SL1500_.jpg",
      "alt": "Womens Maxi Dress Long Sleeve Cocktail details image 1"
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/31a4qCpEb1L._SL1500_.jpg",
      "alt": "Womens Maxi Dress Long Sleeve Cocktail details image 2"
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/31-nmQcurOL._SL1500_.jpg",
      "alt": "Womens Maxi Dress Long Sleeve Cocktail details image 3"
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/31vugUKGESL._SL1500_.jpg",
      "alt": "Womens Maxi Dress Long Sleeve Cocktail details image 4"
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Brown, Green2, White, Purple, Yellow, Apricot, Black, Orange, Green. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/417IO%2BXUUAL._SL1500_.jpg",
      "alt": "Womens Maxi Dress Long Sleeve Cocktail details image 5"
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "5f1b12cc-4bee-47de-b489-192044d3b182",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5f1b12cc-4bee-47de-b489-192044d3b182/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5f1b12cc-4bee-47de-b489-192044d3b182/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "c5292568-4123-4525-8e5c-fdbf1458dd11",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c5292568-4123-4525-8e5c-fdbf1458dd11/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c5292568-4123-4525-8e5c-fdbf1458dd11/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "334a8fde-c38c-48a4-9d45-3c78c3354e8f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/334a8fde-c38c-48a4-9d45-3c78c3354e8f/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/334a8fde-c38c-48a4-9d45-3c78c3354e8f/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "22bd6a58-32c6-4ec3-98bf-eafc65d9577d",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/22bd6a58-32c6-4ec3-98bf-eafc65d9577d/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/22bd6a58-32c6-4ec3-98bf-eafc65d9577d/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "6f1c4eda-ec75-4d4d-bca4-9554018591bc",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6f1c4eda-ec75-4d4d-bca4-9554018591bc/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6f1c4eda-ec75-4d4d-bca4-9554018591bc/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "45ef519d-ec62-4035-8572-426c47878474",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/45ef519d-ec62-4035-8572-426c47878474/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/45ef519d-ec62-4035-8572-426c47878474/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Brown": "https://m.media-amazon.com/images/I/31zA2Y7vYYL._AC_SR38,50_.jpg",
    "Green2": "https://m.media-amazon.com/images/I/41fCusW1n6L._AC_SR38,50_.jpg",
    "White": "https://m.media-amazon.com/images/I/31dcV+-rITL._AC_SR38,50_.jpg",
    "Purple": "https://m.media-amazon.com/images/I/31SF0V0HawL._AC_SR38,50_.jpg",
    "Yellow": "https://m.media-amazon.com/images/I/31a4qCpEb1L._AC_SR38,50_.jpg",
    "Apricot": "https://m.media-amazon.com/images/I/318D3iifSBL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31vugUKGESL._AC_SR38,50_.jpg",
    "Orange": "https://m.media-amazon.com/images/I/31xkF1sJB+L._AC_SR38,50_.jpg",
    "Green": "https://m.media-amazon.com/images/I/31-nmQcurOL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Brown": "41AL74Vdl6L",
    "Green2": "41fCusW1n6L",
    "White": "41NTsHrWkjL",
    "Purple": "41R6-WozQ5L",
    "Yellow": "41FcRibyfNL",
    "Apricot": "414PdlGwXwL",
    "Black": "41skVXwCPbL",
    "Orange": "41FnoNseQOL",
    "Green": "51rkrnN3GLL"
  },
  "color_images": {
    "Brown": [
      "https://m.media-amazon.com/images/I/41AL74Vdl6L._SL1500_.jpg"
    ],
    "Green2": [
      "https://m.media-amazon.com/images/I/41fCusW1n6L._SL1500_.jpg"
    ],
    "White": [
      "https://m.media-amazon.com/images/I/41NTsHrWkjL._SL1500_.jpg"
    ],
    "Purple": [
      "https://m.media-amazon.com/images/I/41R6-WozQ5L._SL1500_.jpg"
    ],
    "Yellow": [
      "https://m.media-amazon.com/images/I/41FcRibyfNL._SL1500_.jpg"
    ],
    "Apricot": [
      "https://m.media-amazon.com/images/I/414PdlGwXwL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/41skVXwCPbL._SL1500_.jpg"
    ],
    "Orange": [
      "https://m.media-amazon.com/images/I/41FnoNseQOL._SL1500_.jpg"
    ],
    "Green": [
      "https://m.media-amazon.com/images/I/51rkrnN3GLL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress-sleeveless",
      "title": "Womens Dress Sleeveless",
      "price": 40.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71ROAXb9J3L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-sleeveless",
      "title": "Womens Dress Sleeveless",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71quZoNcLYL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-ruched-evening-long-sleeve-bodycon",
      "title": "Womens Maxi Dress Cocktail Ruched Evening Long Sleeve Bodycon",
      "price": 46.97,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51OQMF8VX5L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-maxi",
      "title": "Womens Maxi Dress Bodycon Maxi",
      "price": 40.17,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/41bSqtJhKaL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 48.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61IlS+ROtkL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-bodycon-evening-sleeveless-v-neck-maxi",
      "title": "Womens Maxi Dress Bodycon Evening Sleeveless V Neck Maxi",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61mWvWOD+8L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 36.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61gUSDNnB3L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-ruched-sleeveless-bodycon",
      "title": "Womens Dress Ruched Sleeveless Bodycon",
      "price": 41.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51tFezn1whL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 76.9,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Wedding Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/514+blcsiGL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-formal-one-shoulder-mermaid",
      "title": "Womens Maxi Dress Cocktail Formal One Shoulder Mermaid",
      "price": 69.79,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/71iYonizZ1L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 109.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/61VzPPZgQXL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal",
      "title": "Womens Maxi Dress Formal",
      "price": 84.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61KmvUJ0NXL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-long-sleeve",
      "title": "Womens Maxi Dress Bodycon Long Sleeve",
      "price": 28.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71JTLYi9l-L._SL1500_.jpg"
      ]
    }
  ]
}