{
  "id": "womens-maxi-dress-long-sleeve-maxi-bodycon",
  "handle": "womens-maxi-dress-long-sleeve-maxi-bodycon",
  "sku": "JC2394",
  "asin": "B0CFXDK9JL",
  "title": "Womens Maxi Dress Long Sleeve Maxi Bodycon",
  "title_original": "REORIA Womens Basic Sexy Square Neck Long Sleeve Soft Lounge Long Dress Fall Casual Ribbed Bodycon Maxi Dresses",
  "brand": "Visit the REORIA Store",
  "price": 39.97,
  "social_proof": {
    "bought_past_month": 1199,
    "text": "1199+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/51KrRZOevJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41Dg9UxeygL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41b37H-UpaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51pA87TepML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51-W2spS+ML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51KBd3VbRZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51X61XpAgcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51in3GwQAaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/519I+Xhc30L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51yJhQpra+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51A+E1M-SiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51zh-RBZtjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/514T3-6TChL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/51KrRZOevJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41Dg9UxeygL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41b37H-UpaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51pA87TepML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51-W2spS+ML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51KBd3VbRZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51X61XpAgcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51in3GwQAaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/519I+Xhc30L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51yJhQpra+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51A+E1M-SiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51zh-RBZtjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/514T3-6TChL._SL1500_.jpg"
  ],
  "aplus_images": [
    "https://m.media-amazon.com/images/I/417beEv0PTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31w9XuhB9uL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41sW3thFuXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41L5HECZ9HL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/418aDRj4zfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/4135IJAH53L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41S4U1ZB9mL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41G41DmnIbL._SL1500_.jpg"
  ],
  "description_images": [
    "https://m.media-amazon.com/images/I/417beEv0PTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31w9XuhB9uL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41sW3thFuXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41L5HECZ9HL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/418aDRj4zfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/4135IJAH53L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41S4U1ZB9mL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41G41DmnIbL._SL1500_.jpg"
  ],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ August 17, 2023",
    "ASIN ‏": "‎ B0CK4GQY9C",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#23,342 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #191 in Women's Casual Dresses",
    "Customer Reviews": "4.6 4.6 out of 5 stars (902)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Red",
      "Rose Red",
      "Khaki",
      "Blue",
      "Burgundy",
      "Olive Green",
      "Black",
      "Coffee",
      "Light Grey"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.6,
    "count": 902,
    "customers_say": "Customers find this dress comfortable and flattering, noting it hugs their curves and fits well over a bump. The dress is soft, stretchy, and long enough to cover toes, making it suitable for tall women. While some it's non-see through, others find it somewhat see-through. Generated from the text of customer reviews Select to learn more Quality (98) Fit (79) Comfort (68) Stretchiness (59) Softness (56) Flattering (45) Length (43) See through (44) 98 customers mention quality, 95 positive, 3 negative 98 customers mention \"Quality\" 95 positive 3 negative Customers find the dress beautiful and of good quality, with one mentioning it's perfect for a baby shower. \" Great dress ! Very comfortable and giving. I’m 30 weeks pregnant in this dress and it was extremely comfortable.... \" Read more \" Super cute I love it! Fabric is bomb i’m about 5’7 and the dress is long it reaches my feet I’m also 7 months pregnant and it’s super comfortable! \" Read more \" A must by. Beautiful dress \" Read more \" I really love this dress, it’s so cozy and cute , lightweight. \" Read more 79 customers mention fit, 69 positive, 10 negative 79 customers mention \"Fit\" 69 positive 10 negative Customers like how the dress fits, particularly noting that it accommodates bumps well and reaches the ankles. \" ...small but being 30 weeks pregnant I got it in a medium and it fits like a glove . Super soft and very stretchy!! Would highly recommend \" Read more \" ...It is unbelievably comfortable, amazing quality, great stretch, perfect fit I could go on and on.... \" Read more \" I bought this for my baby shower and it fits great ! It’s extremely soft and stretchy.... \" Read more \" Great fit ! Long sleeves and isn’t short \" Read more 68 customers mention comfort, 67 positive, 1 negative 68 customers mention \"Comfort\" 67 positive 1 negative Customers find the dress comfortable, with one mentioning it makes them feel better than wearing sweatpants. \" ...Fabric is soft, stretchy, comfortable and not see through whatsoever. It is form fitting throughout the top half, so bra choice is important \" Read more \" So light, comfy and stretchy! Looks amazing and can dress up or down. Not see thru so that’s definitely a plus for me! \" Read more \" ...I’m literally obsessed with it. Fits perfectly. Not see through and so comfortable . I want to buy more in different colors! \" Read more \" very comfortable and stretchy size down. i tend to wear L and i got a medium i wish i would have ordered a small since it does have a lot of stretch.... \" Read more 59 customers mention stretchiness, 59 positive, 0 negative 59 customers mention \"Stretchiness\" 59 positive 0 negative Customers like the dress's stretchiness, with one mentioning it's soft and another noting it's comfortable enough to wear over a bump. \" ...It’s extremely soft and stretchy . I would however recommend wearing a solid colored undergarments as it can be a bit see through.... \" Read more \" Not only is it super stretchy but it’s also super buttery. Not see through and the perfect dress for a bump. Sized up one from my pre pregnancy size.... \" Read more \" Very stretchy and thick material! Had to wear specific undergarments so lines wouldn’t show but overall fit well with a bump \" Read more \" I got this sooooo long ago and i still have it and i love it it’s so stretchy i literally thought of getting another one in black and fits me very... \" Read more 56 customers mention softness, 56 positive, 0 negative 56 customers mention \"Softness\" 56 positive 0 negative Customers find the dress incredibly soft, with one describing it as super buttery. \" I really love the fabric on this dress. It feels very comfortable and soft . The length is perfect. It is durable for multiple occasions.... \" Read more \" This dress is so soft and has the perfect amount of stretch. I’m 5’4, 242 and ordered the XL. It wasn’t too long for me either.... \" Read more \" ...I’m 5ft so I did have to get it altered but it’s super soft , comfortable & not transparent. I got so many compliments on it. \" Read more \" I wore this dress to a Wedding. Very flattering very soft and so comfortable !! \" Read more 45 customers mention flattering, 44 positive, 1 negative 45 customers mention \"Flattering\" 44 positive 1 negative Customers find the dress flattering, noting that it hugs their curves and is perfect for showing off a bump. \" ...The cut is so simple and flattering . My only problem is that the scoop neck is pretty wide and I couldn’t find a bra to wear with it.... \" Read more \" I wore this for maternity pictures and it was so flattering and looked great. Very stretchy material. Fitted but not tight enough to be unflattering.... \" Read more \" I’m 5’8” 150 lbs and purchased a Medium. Very flattering dress !! \" Read more \" I absolutely love these dresses. I'm a size 16/18 and it fits and hugs every curve . \" Read more 43 customers mention length, 35 positive, 8 negative 43 customers mention \"Length\" 35 positive 8 negative Customers like the dress's length, particularly noting it's perfect for tall women, with one customer mentioning it's long enough to wear heels. \" I loooove this dress. It is extremely flattering and tall girl friendly . I’m 5’9 and it goes to my ankles.... \" Read more \" ...an inch or two longer, but if you're a bit shorter it would be the perfect length .... \" Read more \" Obsessed with everything about this dress! I’m 5’10 and the length was perfect ! I wish the sleeves were a little longer but they still fit nicely!... \" Read more \" This dress is perfect when it comes to the fit, the length , the feeling, and thickness. I'm 5 7 and it's long enough for me. I love how it hugs me.... \" Read more 44 customers mention see through, 27 positive, 17 negative 44 customers mention \"See through\" 27 positive 17 negative Customers have mixed opinions about the dress's transparency, with some finding it non-see through while others report it being somewhat transparent. \" Not only is it super stretchy but it’s also super buttery. Not see through and the perfect dress for a bump. Sized up one from my pre pregnancy size.... \" Read more \" ...I got a medium for reference. It’s slightly see through but only when bending down. Would highly recommend. \" Read more \" ...The dress was not see through at all , even though it was stretching over a baby bump.... \" Read more \" ...The material was great and not see through at all ! \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Cute and comfortable",
        "body": "Wore this dress for my pregnancy announcement photos and absolutely loved it. Received many compliments on the fit of the dress. Fabric is soft, stretchy, comfortable and not see through whatsoever. It is form fitting throughout the top half, so bra choice is important Read more",
        "author": "Skye Nicole Wellman",
        "rating": 5.0,
        "date": "September 8, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61pbcX6QwqL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Love the fit!",
        "body": "Hugs your body in all the right places. Warm, color is spot on! The quality is great & not see through! The size was perfect I’m 5 ft 3in & and 123lbs. Great buy! Read more",
        "author": "Tanya",
        "rating": 5.0,
        "date": "November 19, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71NcewzeJ9L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Sexy for spoon, pear and hour glass shapes.",
        "body": "Super sexy! I’m 5’2 and around 125-28. 33” bust 26-27” waist and 36.5-37 hips. XS was the best. I bought both sizes and the small was good but the xs was BOMBBB. soft ribbed fabric. Not see through. Got lots of compliments. I do wish they had this with a slit. My friend was awesome and was able to sew a slit for me! Game changer even more. Not crazy too long. Was nice with 4” platform nude heels. Made it off the floor. Read more",
        "author": "cynthia",
        "rating": 5.0,
        "date": "December 14, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Great purchase!",
        "body": "Super cute dress, material is comfortable, thick, and not even remotely see through. It also fits throughout pregnancy! I have a large bust and if pulled up enough it is still modest and doesn’t show your boobs, or you can have it pulled down more for the opposite! Highly recommend. Read more",
        "author": "Sz",
        "rating": 5.0,
        "date": "October 22, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71ocGQxKSZL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "4.0 out of 5 stars I LOVE THE QUALITY OF THE FABRIC",
        "body": "Why did you pick this product vs others?: It hugs my body in all the right places and the material is very soft and stretchy I bought a Medium and i weigh 140 lbs 5\"2. This is def the perfect maxi dress for a bargain. Read more",
        "author": "Nandy",
        "rating": 4.0,
        "date": "July 11, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Perfect Baby Shower Dress",
        "body": "Great dress for maternity. Very stretchy, comfortable fabric. I bought no show underwear to go under to reduce lines. I’m wearing a size medium at 32 weeks pregnant and 200 lbs. Read more",
        "author": "Makayla",
        "rating": 5.0,
        "date": "December 14, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/812+S9hElTL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Must buy!!",
        "body": "So happy with my purchase!! Fit perfectly and was long enough. I’m 5’11 and 170 lbs and this was the perfect dress for Thanksgiving. I will be buying more colors. Read more",
        "author": "Alayja",
        "rating": 5.0,
        "date": "November 29, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61xfuLpgF1L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Found My Fall Season Dress",
        "body": "I really love the fabric on this dress. It feels very comfortable and soft. The length is perfect. It is durable for multiple occasions. You can dress it down. Wear flat shoes or dress it up with high heels. The fabric is warm and not see through. Love is color brown. I want different colors in this dress. Read more",
        "author": "Princess TD Alexander",
        "rating": 5.0,
        "date": "October 31, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Long Sleeve Maxi Bodycon is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.",
  "about_this_item": "Womens Maxi Dress Long Sleeve Maxi Bodycon is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.",
  "long_description": "Womens Maxi Dress Long Sleeve Maxi Bodycon is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Red, Rose Red, Khaki, Blue, Burgundy, Olive Green, Black, Coffee, Light Grey. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Long Sleeve Maxi Bodycon is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/417beEv0PTL._SL1500_.jpg",
      "alt": "Womens Maxi Dress Long Sleeve Maxi Bodycon details image 1"
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/31w9XuhB9uL._SL1500_.jpg",
      "alt": "Womens Maxi Dress Long Sleeve Maxi Bodycon details image 2"
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/41sW3thFuXL._SL1500_.jpg",
      "alt": "Womens Maxi Dress Long Sleeve Maxi Bodycon details image 3"
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/41L5HECZ9HL._SL1500_.jpg",
      "alt": "Womens Maxi Dress Long Sleeve Maxi Bodycon details image 4"
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Red, Rose Red, Khaki, Blue, Burgundy, Olive Green, Black, Coffee, Light Grey. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/418aDRj4zfL._SL1500_.jpg",
      "alt": "Womens Maxi Dress Long Sleeve Maxi Bodycon details image 5"
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "569dd360-01ba-46d8-a2de-59671f6de617",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/569dd360-01ba-46d8-a2de-59671f6de617/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/569dd360-01ba-46d8-a2de-59671f6de617/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/48a5c487-f45b-4362-8970-b85e5f752e45.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "0c697ddc-fb45-496c-a396-1883a35b75e9",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0c697ddc-fb45-496c-a396-1883a35b75e9/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0c697ddc-fb45-496c-a396-1883a35b75e9/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/48a5c487-f45b-4362-8970-b85e5f752e45.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "151c2914-bd7b-46bf-9844-fdaf8bdfe9f8",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/151c2914-bd7b-46bf-9844-fdaf8bdfe9f8/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/151c2914-bd7b-46bf-9844-fdaf8bdfe9f8/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/48a5c487-f45b-4362-8970-b85e5f752e45.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "ba8f4528-d00c-44c5-96d8-8d4092b17e59",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ba8f4528-d00c-44c5-96d8-8d4092b17e59/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ba8f4528-d00c-44c5-96d8-8d4092b17e59/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/48a5c487-f45b-4362-8970-b85e5f752e45.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "946e975d-dd00-4329-9016-af3da1d3f9d4",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/946e975d-dd00-4329-9016-af3da1d3f9d4/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/946e975d-dd00-4329-9016-af3da1d3f9d4/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/48a5c487-f45b-4362-8970-b85e5f752e45.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "819a46c2-7330-4e4c-b96a-4d9b14bb50fb",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/819a46c2-7330-4e4c-b96a-4d9b14bb50fb/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/819a46c2-7330-4e4c-b96a-4d9b14bb50fb/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/48a5c487-f45b-4362-8970-b85e5f752e45.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "97a4fd7b-8213-434f-9776-c6036c4a961f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/97a4fd7b-8213-434f-9776-c6036c4a961f/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/97a4fd7b-8213-434f-9776-c6036c4a961f/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/48a5c487-f45b-4362-8970-b85e5f752e45.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "2d5287c6-245e-4466-a7d4-3c19e8d5b61a",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2d5287c6-245e-4466-a7d4-3c19e8d5b61a/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2d5287c6-245e-4466-a7d4-3c19e8d5b61a/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/48a5c487-f45b-4362-8970-b85e5f752e45.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "d5592bd5-1e28-4ab6-9fa5-3c304ccafce2",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d5592bd5-1e28-4ab6-9fa5-3c304ccafce2/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d5592bd5-1e28-4ab6-9fa5-3c304ccafce2/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/48a5c487-f45b-4362-8970-b85e5f752e45.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "42630c2a-9999-4426-8d20-b2a382c492f3",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/42630c2a-9999-4426-8d20-b2a382c492f3/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/42630c2a-9999-4426-8d20-b2a382c492f3/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/48a5c487-f45b-4362-8970-b85e5f752e45.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "b482c972-5c26-4219-bfb5-0c15beab3ca0",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b482c972-5c26-4219-bfb5-0c15beab3ca0/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b482c972-5c26-4219-bfb5-0c15beab3ca0/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/48a5c487-f45b-4362-8970-b85e5f752e45.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "2c6d1719-b10f-429b-8ac0-1b4d700ac723",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2c6d1719-b10f-429b-8ac0-1b4d700ac723/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2c6d1719-b10f-429b-8ac0-1b4d700ac723/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/48a5c487-f45b-4362-8970-b85e5f752e45.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Red": "https://m.media-amazon.com/images/I/31FVvOYc8hL._AC_SR38,50_.jpg",
    "Rose Red": "https://m.media-amazon.com/images/I/31fzKRjNu7L._AC_SR38,50_.jpg",
    "Khaki": "https://m.media-amazon.com/images/I/21jtsHmDxvL._AC_SR38,50_.jpg",
    "Blue": "https://m.media-amazon.com/images/I/21r5PP6UR2L._AC_SR38,50_.jpg",
    "Burgundy": "https://m.media-amazon.com/images/I/31bUd1ZnwNL._AC_SR38,50_.jpg",
    "Olive Green": "https://m.media-amazon.com/images/I/31QoZ9joPRL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31UUQ4SqomL._AC_SR38,50_.jpg",
    "Coffee": "https://m.media-amazon.com/images/I/31NZFlTYhlL._AC_SR38,50_.jpg",
    "Light Grey": "https://m.media-amazon.com/images/I/21YrevCYE9L._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Red": "51KBd3VbRZL",
    "Rose Red": "51X61XpAgcL",
    "Khaki": "51in3GwQAaL",
    "Blue": "519I+Xhc30L",
    "Burgundy": "51yJhQpra+L",
    "Olive Green": "51A+E1M-SiL",
    "Black": "51KrRZOevJL",
    "Coffee": "51zh-RBZtjL",
    "Light Grey": "514T3-6TChL"
  },
  "color_images": {
    "Red": [
      "https://m.media-amazon.com/images/I/51KBd3VbRZL._SL1500_.jpg"
    ],
    "Rose Red": [
      "https://m.media-amazon.com/images/I/51X61XpAgcL._SL1500_.jpg"
    ],
    "Khaki": [
      "https://m.media-amazon.com/images/I/51in3GwQAaL._SL1500_.jpg"
    ],
    "Blue": [
      "https://m.media-amazon.com/images/I/519I+Xhc30L._SL1500_.jpg"
    ],
    "Burgundy": [
      "https://m.media-amazon.com/images/I/51yJhQpra+L._SL1500_.jpg"
    ],
    "Olive Green": [
      "https://m.media-amazon.com/images/I/51A+E1M-SiL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/51KrRZOevJL._SL1500_.jpg"
    ],
    "Coffee": [
      "https://m.media-amazon.com/images/I/51zh-RBZtjL._SL1500_.jpg"
    ],
    "Light Grey": [
      "https://m.media-amazon.com/images/I/514T3-6TChL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 31.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/61IPbiN-fHL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 40.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/710dnDgmBGL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-ruched-long-sleeve",
      "title": "Womens Maxi Dress Ruched Long Sleeve",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/51v9eDDHRvL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-formal-long-sleeve",
      "title": "Womens Maxi Dress Evening Formal Long Sleeve",
      "price": 89.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51-DeL2MGRL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-maxi-v-neck",
      "title": "Womens Maxi Dress Long Sleeve Maxi V Neck",
      "price": 45.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/712aBRGRgPL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-bodycon-long-sleeve",
      "title": "Womens Maxi Dress Bodycon Long Sleeve",
      "price": 29.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61oTio8HZmL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 320.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/81CXQt0W+wL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-off-shoulder-evening-high-split-formal-split",
      "title": "Womens Maxi Dress Off Shoulder Evening High Split Formal Split",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/41fCm0LLrUL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 29.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71sjQot2RbL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-bodycon",
      "title": "Womens Maxi Dress Long Sleeve Bodycon",
      "price": 24.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61iVwwdZBkL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 7.96,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/91sKNbZ1WFL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-long-sleeve",
      "title": "Womens Maxi Dress Bodycon Long Sleeve",
      "price": 35.34,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/714ggKRsMTL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-formal-maxi-long-sleeve",
      "title": "Womens Maxi Dress Cocktail Formal Maxi Long Sleeve",
      "price": 45.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61NXa9j1ztL._SL1500_.jpg"
      ]
    }
  ]
}