{
  "id": "womens-maxi-dress-long-sleeve-cocktail-formal",
  "handle": "womens-maxi-dress-long-sleeve-cocktail-formal",
  "sku": "JC1639",
  "asin": "B0CGHLMVKW",
  "title": "Womens Maxi Dress Long Sleeve Cocktail Formal",
  "title_original": "HomRain Women's Long Sleeve Velvet Midi Dresses for Wedding Guest Church Formal Winter Christmas Cocktail Party",
  "brand": "Visit the HomRain Store",
  "price": 45.99,
  "social_proof": {
    "bought_past_month": 570,
    "text": "570+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/71Z++Kp+nsL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71rQe2Gg5LL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/719c58Ir53L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71bA-LxBLgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71lsWSagAcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71jGroF7vvL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/719uMZyo8oL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71fk8jgjTnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71YaeJU8a9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71wNvyp4qrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71rAuXgvDtL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71FjId8rxxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71cYcdBEw9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71a2lUqgcgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71LVQRkZKwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71M6GBTBPIL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/71Z++Kp+nsL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71rQe2Gg5LL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/719c58Ir53L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71bA-LxBLgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71lsWSagAcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71jGroF7vvL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/719uMZyo8oL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71fk8jgjTnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71YaeJU8a9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71wNvyp4qrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71rAuXgvDtL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71FjId8rxxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71cYcdBEw9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71a2lUqgcgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71LVQRkZKwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71M6GBTBPIL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ August 24, 2023",
    "ASIN ‏": "‎ B0CX1XWSKB",
    "Best Sellers Rank": "#43,491 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #68 in Women's Cocktail Dresses",
    "Customer Reviews": "4.3 4.3 out of 5 stars (416)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Velvet-black",
      "Navy Yellow Flower",
      "White Flower",
      "Velvet-burgundy",
      "Velvet-grape",
      "Velvet-navy",
      "Velvet-royalblue",
      "Velvet-darkred",
      "Velvet-darkgreen",
      "Velvet-turquoise"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.3,
    "count": 416,
    "customers_say": "Customers find the dress comfortable and appreciate its pretty silhouette, with one noting its loose ruffle details. The fabric feels dreamy, and customers love its color, with one describing it as a \"velvety green holiday dress.\" The dress is perfect for both Christmas parties and winter weddings. While some it runs true to size, others mention it runs a little small. Select to learn more Quality Fit Comfort Elegance Color Dress fit Fabric quality Size 53 customers mention \"Quality\" 51 positive 2 negative Customers find the dress to be of good quality, with a pretty silhouette, and one customer specifically mentions its loose ruffle details. \" Beautiful dress and is well made. It is heavier weight but very warm for winter wear. Would be beautiful for Christmas or attending a wedding....\" Read more \"I love this dress great dress ...\" Read more \" Pretty dress . I ordered in my normal size and it’s way too small and tight. I would recommend going up a size....\" Read more \"Its a very nice dress , very good fit. True to size. Thin though. But still very nice. Comfortable. You'll need warm clothes under it....\" Read more 52 customers mention \"Fit\" 44 positive 8 negative Customers like how the dress fits, with one mentioning it sits well on the body. \"Material was very nice. Fits well . Fits close so if you prefer a looser fit maybe try a size up. But it does fit true to size.\" Read more \"Very pretty vibrant colors. Perfect fit . Fabric is very soft with a little stretch.\" Read more \"...It's high quality, fits great and so comfortable. I rode in the car for an hour and a half to the wedding and it didn't wrinkle at all....\" Read more \"Everyone loved my dress and it fit me perfectly . I paid $30 and my dress was the least expensive but looked fantastic....\" Read more 21 customers mention \"Comfort\" 20 positive 1 negative Customers find the dress comfortable. \"...True to size. Thin though. But still very nice. Comfortable . You'll need warm clothes under it. But I'd still recommend it.\" Read more \"...It's high quality, fits great and so comfortable . I rode in the car for an hour and a half to the wedding and it didn't wrinkle at all....\" Read more \"The size is precise, the color is beautiful, very comfortable . Very lovely, such a nice dress for a nice event.\" Read more \"...I felt good wearing this dress !\" Read more 19 customers mention \"Elegance\" 18 positive 1 negative Customers find the dress beautiful. \"I got so many compliments on this dress. It’s beautiful , nicely fitting, even for a hourglass figure....\" Read more \"...the navy blue with flowers and it is so pretty on and very modest and classy yet is fitted in all the right areas to accentuate your curves and...\" Read more \"Simple but elegant ...\" Read more \"this dress was so pretty .. great for a fall, winter or holiday party. they way it hung and comfort of it was good....\" Read more 18 customers mention \"Color\" 18 positive 0 negative Customers love the color of the dress, with one describing it as a velvety green holiday dress. \"...this item a low or high score as the dress itself is well made, beautiful color but does not fit my body well at all....\" Read more \"Very comfortable fitting. Beautiful colors and love the material very giving.\" Read more \"...It was the solid winner. The color is so rich , fabric feels dreamy and high quality, and I felt really beautiful and classy....\" Read more \"I wanted to love this dress. Shape & fabric is pretty, color is gorgeous ....\" Read more 17 customers mention \"Dress fit\" 16 positive 1 negative Customers find the dress fits well for holiday parties and winter weddings, with one customer noting it's suitable for dinner events. \"Not as flattering as I had hoped but was perfect for a winter wedding .\" Read more \"...TTS. I was really happy with this purchase. Perfect holiday party dress .\" Read more \"This is a great holiday dress . I got it for our Christmas photos and it was amazing. Super comfortable and fit nicely.\" Read more \"Oh my gosh this dress was perfect for the wedding I attended last week! It is so comfortable and I received soooo many compliments on this dress!!...\" Read more 14 customers mention \"Fabric quality\" 10 positive 4 negative Customers like the fabric of the dress, describing it as dreamy and of nice quality. \"Beautiful dress. Size up a size. This is a clingy material , and fits to the shape of your body.\" Read more \"I wanted to love this dress. The fabric was lovely but the fit was not for my body type which is rather pear shaped....\" Read more \"I ordered the dress for a holiday party. The quality of the fabric was very poor and dress itself lacks design....\" Read more \" Lovely fabric . Velvet that is a bit stretchy and not heavy....\" Read more 16 customers mention \"Size\" 11 positive 5 negative Customers have mixed opinions about the dress size, with some finding it just right while others say it runs a little small. \"Its a very nice dress, very good fit. True to size . Thin though. But still very nice. Comfortable. You'll need warm clothes under it....\" Read more \" Dress is true to size and it has stretch which allows give and comfort....\" Read more \"Pretty dress. I ordered in my normal size and it’s way too small and tight. I would recommend going up a size....\" Read more \"For my daughter and ran true to size . She used it for a Christmas church service\" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars A Happy Purchase",
        "body": "As a gym girly with a wider frame AND a rectangular body shape--33 inch waistline--this dress will compliment you. Because of my waist measurement I did not want to go up to a size XL, since I know the dress would not fit me properly, so I risked it with a size L. Y'all. The dress fit me fabulously and has medium-stretch to it! The fabric thickness is not heavy or light, and it is not sheer nor cheap (imo, I'd say the quality is quite great). This dress can definitely be worn in late Spring through Summer to early Autumn without an outer layer added on for warmth. I am pleased and happy with this purchase and plan to order a few more in different colors. Read more",
        "author": "Chai_13",
        "rating": 5.0,
        "date": "November 14, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71N9kwcYb8L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Good quality",
        "body": "Dress is true to size and it has stretch which allows give and comfort. I pressed it inside out to remove shipping wrinkles and it did not wrinkle with wear. I’m 5’5” and the length was like a midi. Good value for the money. The dress had good flow and was not see through so it required no slip. No pockets on this dress. Read more",
        "author": "I have a 16 x 80 trailer and the underpinning is what I called beige but the sand was a perfect match and fit well.",
        "rating": 5.0,
        "date": "December 8, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Such a great buy",
        "body": "This dress is absolutely beautiful. I ordered both small and medium due to the comments, and the small fit perfectly. The sleeves were the perfect length, the lower part really flowed nice. The material thickness was great, I thought i would need a coat since it was velvet fabric but I stayed warm. Read more",
        "author": "Amanda Warner",
        "rating": 5.0,
        "date": "December 16, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Nice dress nd good fittings",
        "body": "The dress was very good. I havent washed it yet but looks really nice when worn. Thanks Read more",
        "author": "Pavitra Rao",
        "rating": 4.0,
        "date": "November 20, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Festive, comfortable, classy: win!",
        "body": "I got this dress alongside 3 others from Gown Town so I could choose from a few for my husband's work holiday party. It was the solid winner. The color is so rich, fabric feels dreamy and high quality, and I felt really beautiful and classy. I am shy to show my arms and cleavage especially at more formal events, so this was perfect! I also tend to slump and become unaware of leaning forward in pics when alcohol flows, so this was perfect and buzzproof. Highly recommend! Read more",
        "author": "Hilary Smith",
        "rating": 5.0,
        "date": "December 15, 2023",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61+DZ+wUKnL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "3.0 out of 5 stars Velvet dress",
        "body": "This goes over the head, runs small material wasn’t good. Read more",
        "author": "Shirley White",
        "rating": 3.0,
        "date": "December 11, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "1.0 out of 5 stars Not a winner for me",
        "body": "I cannot give this item a low or high score as the dress itself is well made, beautiful color but does not fit my body well at all. Going by the size chart and reviews I ordered the medium. This dress is not designed for large, out front chests and sizing up didn't help with arm hole placement and set waist placement. Again, not the fault of the dress! I'm 5'1\", 114 lbs, 34DD. I am returning this one. Read more",
        "author": "shannon aportadera",
        "rating": 1.0,
        "date": "October 10, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Lovely dress",
        "body": "Loved this dress. I ordered a size small and it fit me perfectly! Perfect for my Christmas party. Read more",
        "author": "Charlotte",
        "rating": 5.0,
        "date": "December 11, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61UojHoIdXL._SY88._SL1500_.jpg"
        ]
      }
    ]
  },
  "short_description": "Womens Maxi Dress Long Sleeve Cocktail Formal is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.",
  "about_this_item": "Womens Maxi Dress Long Sleeve Cocktail Formal is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.",
  "long_description": "Womens Maxi Dress Long Sleeve Cocktail Formal is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Velvet-black, Navy Yellow Flower, White Flower, Velvet-burgundy, Velvet-grape, Velvet-navy, Velvet-royalblue, Velvet-darkred, Velvet-darkgreen, Velvet-turquoise. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Long Sleeve Cocktail Formal is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Velvet-black, Navy Yellow Flower, White Flower, Velvet-burgundy, Velvet-grape, Velvet-navy, Velvet-royalblue, Velvet-darkred, Velvet-darkgreen, Velvet-turquoise. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "5755aa1d-9bb1-44ef-ae69-f3de94b91c17",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5755aa1d-9bb1-44ef-ae69-f3de94b91c17/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5755aa1d-9bb1-44ef-ae69-f3de94b91c17/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "bdc99fc0-e1d7-40b0-bfd7-ab882f531556",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bdc99fc0-e1d7-40b0-bfd7-ab882f531556/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bdc99fc0-e1d7-40b0-bfd7-ab882f531556/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "252071d0-adb1-405d-8c00-1c9478dcc737",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/252071d0-adb1-405d-8c00-1c9478dcc737/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/252071d0-adb1-405d-8c00-1c9478dcc737/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "197e2f7b-6342-49bf-9724-2a6d09121739",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/197e2f7b-6342-49bf-9724-2a6d09121739/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/197e2f7b-6342-49bf-9724-2a6d09121739/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "5d5e7c51-331b-4f9d-999b-761bc6780891",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5d5e7c51-331b-4f9d-999b-761bc6780891/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5d5e7c51-331b-4f9d-999b-761bc6780891/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "c5a7b6b5-688a-4c31-ab5e-a3d8c6e6dbdb",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c5a7b6b5-688a-4c31-ab5e-a3d8c6e6dbdb/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c5a7b6b5-688a-4c31-ab5e-a3d8c6e6dbdb/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Velvet-black": "https://m.media-amazon.com/images/I/415R+WEeUGL._AC_SR38,50_.jpg",
    "Navy Yellow Flower": "https://m.media-amazon.com/images/I/51rZOiurx-L._AC_SR38,50_.jpg",
    "White Flower": "https://m.media-amazon.com/images/I/41CPXuHZ12L._AC_SR38,50_.jpg",
    "Velvet-burgundy": "https://m.media-amazon.com/images/I/41mi8jyz9rL._AC_SR38,50_.jpg",
    "Velvet-grape": "https://m.media-amazon.com/images/I/41ww8pqUHyL._AC_SR38,50_.jpg",
    "Velvet-navy": "https://m.media-amazon.com/images/I/411Z5STJarL._AC_SR38,50_.jpg",
    "Velvet-royalblue": "https://m.media-amazon.com/images/I/413dT44Ki5L._AC_SR38,50_.jpg",
    "Velvet-darkred": "https://m.media-amazon.com/images/I/41L4SX4ERlL._AC_SR38,50_.jpg",
    "Velvet-darkgreen": "https://m.media-amazon.com/images/I/41sr1ItZB5L._AC_SR38,50_.jpg",
    "Velvet-turquoise": "https://m.media-amazon.com/images/I/41pLP-nbE1L._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Velvet-black": "71fk8jgjTnL",
    "Navy Yellow Flower": "71YaeJU8a9L",
    "White Flower": "71wNvyp4qrL",
    "Velvet-burgundy": "71rAuXgvDtL",
    "Velvet-grape": "71FjId8rxxL",
    "Velvet-navy": "71cYcdBEw9L",
    "Velvet-royalblue": "71a2lUqgcgL",
    "Velvet-darkred": "71LVQRkZKwL",
    "Velvet-darkgreen": "71Z++Kp+nsL",
    "Velvet-turquoise": "71M6GBTBPIL"
  },
  "color_images": {
    "Velvet-black": [
      "https://m.media-amazon.com/images/I/71fk8jgjTnL._SL1500_.jpg"
    ],
    "Navy Yellow Flower": [
      "https://m.media-amazon.com/images/I/71YaeJU8a9L._SL1500_.jpg"
    ],
    "White Flower": [
      "https://m.media-amazon.com/images/I/71wNvyp4qrL._SL1500_.jpg"
    ],
    "Velvet-burgundy": [
      "https://m.media-amazon.com/images/I/71rAuXgvDtL._SL1500_.jpg"
    ],
    "Velvet-grape": [
      "https://m.media-amazon.com/images/I/71FjId8rxxL._SL1500_.jpg"
    ],
    "Velvet-navy": [
      "https://m.media-amazon.com/images/I/71cYcdBEw9L._SL1500_.jpg"
    ],
    "Velvet-royalblue": [
      "https://m.media-amazon.com/images/I/71a2lUqgcgL._SL1500_.jpg"
    ],
    "Velvet-darkred": [
      "https://m.media-amazon.com/images/I/71LVQRkZKwL._SL1500_.jpg"
    ],
    "Velvet-darkgreen": [
      "https://m.media-amazon.com/images/I/71Z++Kp+nsL._SL1500_.jpg"
    ],
    "Velvet-turquoise": [
      "https://m.media-amazon.com/images/I/71M6GBTBPIL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-off-shoulder",
      "title": "Womens Maxi Dress Off Shoulder",
      "price": 129.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61wC5ifxGwL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-ruched",
      "title": "Womens Dress Ruched",
      "price": 45.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/819T+NSIXLL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-sleeveless-bodycon-cocktail-ruched",
      "title": "Womens Dress Sleeveless Bodycon Cocktail Ruched",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/81kioSYTBsL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-v-neck",
      "title": "Womens Maxi Dress Formal V Neck",
      "price": 59.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61REbgnV7iL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-short-sleeve-formal-cocktail-evening",
      "title": "Womens Maxi Dress Short Sleeve Formal Cocktail Evening",
      "price": 69.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51DeWKM261L._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-cocktail-formal-maxi-long-sleeve",
      "title": "Womens Maxi Dress Cocktail Formal Maxi Long Sleeve",
      "price": 45.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61NXa9j1ztL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-sleeveless-bodycon-ruched",
      "title": "Womens Dress Sleeveless Bodycon Ruched",
      "price": 42.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/61h8nvJmO0L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-long-sleeve",
      "title": "Womens Maxi Dress Maxi Long Sleeve",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71KYiqVCQZL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-bodycon-one-shoulder",
      "title": "Womens Dress Bodycon One Shoulder",
      "price": 38.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51LTPZDa1AL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-mermaid-formal-sleeveless",
      "title": "Womens Maxi Dress Evening Mermaid Formal Sleeveless",
      "price": 74.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/519D--hcQeL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-long-sleeve",
      "title": "Womens Maxi Dress Bodycon Long Sleeve",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61irsEw4YoL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-long-sleeve",
      "title": "Womens Maxi Dress Maxi Long Sleeve",
      "price": 51.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/716+ABkyJTL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-long-sleeve",
      "title": "Womens Maxi Dress Bodycon Long Sleeve",
      "price": 36.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/715ViFUJneL._SL1500_.jpg"
      ]
    }
  ]
}