{
  "id": "womens-dress-short-sleeve",
  "handle": "womens-dress-short-sleeve",
  "sku": "JC1939",
  "asin": "B0CG2X789K",
  "title": "Womens Dress Short Sleeve",
  "title_original": "Memoriesea Women's Elegant Casual Short Sleeve Work Party A-Line Dress with Pockets",
  "brand": "Visit the Memoriesea Store",
  "price": 43.99,
  "social_proof": {
    "bought_past_month": 1508,
    "text": "1508+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/51SC0J3glyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71JPg5hZi5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71DLfD-4vbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81DLLOvDjUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Ksgres8dL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51Uf+Qxke-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/619IWa58iLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51IlSKu3L9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/516uhLI1nWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51aGk9wIqiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ipQZF2dUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/617yJm+fdXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61VIA+rbHIL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61rR+e-H0xL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51D-UCK1qEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51v0qSFZ7BL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51yZoggCxVL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51VYZS2UDdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51r+9axADEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51egoAgGarL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/519CA4vVKKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51N2iZ3SQkL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/51SC0J3glyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71JPg5hZi5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71DLfD-4vbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81DLLOvDjUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Ksgres8dL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51Uf+Qxke-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/619IWa58iLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51IlSKu3L9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/516uhLI1nWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51aGk9wIqiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ipQZF2dUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/617yJm+fdXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61VIA+rbHIL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61rR+e-H0xL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51D-UCK1qEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51v0qSFZ7BL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51yZoggCxVL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51VYZS2UDdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51r+9axADEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51egoAgGarL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/519CA4vVKKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51N2iZ3SQkL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Product Dimensions ‏": "‎ 7.09 x 6.3 x 0.79 inches; 1.54 Pounds",
    "Item model number ‏": "‎ ME042",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ August 19, 2023",
    "ASIN ‏": "‎ B0CG2YP9QY",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#10,837 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #67 in Women's Casual Dresses",
    "Customer Reviews": "4.4 4.4 out of 5 stars (2,522)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Brown",
      "Violet",
      "Burgundy",
      "Army Green",
      "Black",
      "Orange",
      "Light Blue",
      "Red",
      "Rose Red",
      "Lake Blue",
      "Pink",
      "White",
      "Purple",
      "Yellow",
      "Peacock Blue",
      "Royal Blue",
      "Navyblue",
      "Green"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.4,
    "count": 2522,
    "customers_say": "Customers find the dress elegant, with one noting it's particularly flattering for those 5'7\" and taller, and appreciate its well-made construction and smooth fabric. The length receives mixed feedback - while some find it perfect for tall girls, others say it's too long. The material thickness and weight also get mixed reviews, with some praising the thickness while others find it too heavy for warm weather. Generated from the text of customer reviews Select to learn more Fit (316) Elegance (313) Quality (222) Material quality (150) Color (114) Length (154) Material weight (150) Material thickness (118) 316 customers mention fit, 284 positive, 32 negative 316 customers mention \"Fit\" 284 positive 32 negative Customers like how the dress fits, with one mentioning it accommodates their curves well. \" ...I still have plenty of stretch and room in the dress. I had a great fit and the color I chose the purple was absolutely gorgeous.... \" Read more \" Perfect Fit ! Love fabric, beautiful fit, comfortable, perfect length! OMG pockets, my kind of dress! I bought 3 colors just in case Ioved this dress! \" Read more \" ...The color came exactly as the picture. Fits well . Over rall it gave me a perfect look that i was looking for. I received many compliments ☺️ \" Read more \" ...It had beautiful lines It fits perfectly and is gorgeous. Got lots of compliments. Flattering: Looks good on all curves... \" Read more 313 customers mention elegance, 310 positive, 3 negative 313 customers mention \"Elegance\" 310 positive 3 negative Customers find the dress elegant, describing it as gorgeous with a good pattern that feels and looks amazing when worn. One customer mentions it presents fantastically on the dance floor. \" this was a beautiful dress I needed it for a white event, but I came with make up on the collar and dingy in color as if it appeared to have been... \" Read more \" The compliments I received confirmed what I already felt.. beautiful . fabric is great like a lite scuba. I'm gonna purchase this one in another coĺor. \" Read more \" Absolutely beautiful, its elegant , comfortable,fits just right, it has a bit of weight to it but its enough that it won't blow in the wind.... \" Read more \" I loved the material and fit. Cute, chic and classy . The bow has to be tied tight or it will come a loose. Only down part, the dress had a smell.... \" Read more 222 customers mention quality, 212 positive, 10 negative 222 customers mention \"Quality\" 212 positive 10 negative Customers praise the dress's construction, describing it as beautiful and well-made. \" A nice dress material will fuzzup a little bit after its wear. but it’s pretty and a good fit. I need to cut some of the length off. But good product. \" Read more \" ...The fabric is thick and of a great quality . It has a nice stretch, along with a side zipper. I love that the dress comes with two side pockets.... \" Read more \" The dress is beautiful, good quality , but was worn returned not cleaned and most definitely not inspected.. I ordered 4 same dresses out of those 2... \" Read more \" Love this dress . Heavier material and very flattering if you are a curvy cutie. I wore to a convention and received so many compliments. \" Read more 150 customers mention material quality, 124 positive, 26 negative 150 customers mention \"Material quality\" 124 positive 26 negative Customers like the dress's material, describing it as smooth and nice. \" Well made. Great material , one of the most comfortable dresses I’ve ever worn. Stretchy and Very flattering for the body.... \" Read more \" I love the material , how it fits, and how it looks classy! I received a lot of compliments on this dress.... \" Read more \" Great quality and material . Make sure you receive the right style as ordered. There was a slight mix up but it was cleared up instantly.... \" Read more \" This dress is beautiful in person, good material , great fit. I would recommend to others and purchase another color. \" Read more 114 customers mention color, 94 positive, 20 negative 114 customers mention \"Color\" 94 positive 20 negative Customers like the dress's color, particularly its bright white and nice light blue options, with some noting it comes in multiple colors. \" ...Love a dress with pockets! Beautiful color . Nice little side zipper. Nice full skirt \" Read more \" ...and it came down to my feet like it is a large or extra large... love the color and thickness but the size is ridiculous I'm 5'0\" 119lb so... \" Read more \" Dress fitted perfectly True to color Only issue, tie was to big \" Read more \" ...Maintains its structure and shape nicely. The color is gorgeous and exactly what I anticipated.... \" Read more 154 customers mention length, 98 positive, 56 negative 154 customers mention \"Length\" 98 positive 56 negative Customers have mixed opinions about the dress's length, with some finding it just right and perfect for their size, while others report it being too long. \" It's a lovely dress and true to size . The reason why I'm not giving it 5 stars is due to the material the dress is made of. It is extremely heavy.... \" Read more \" ...The only downside was it was too long . Near my ankles long. So if you are 5’0-5-5 this may drag when you wear it. \" Read more \" Received my dress and I love it! The material is good quality, perfect size , and the pricing is worth it! Will be ordering again. \" Read more \" ...The color matched, the length was great , and the fit was like it was tailored for me.... \" Read more 150 customers mention material weight, 70 positive, 80 negative 150 customers mention \"Material weight\" 70 positive 80 negative Customers have mixed opinions about the dress's material weight, with some appreciating its nice weight while others find it too heavy, particularly noting it's not suitable for warm weather. \" ...if it fits because I was not able to try in a dirty dress .. It's very heavy but the material is soft...I couldn't wear this in Florida weather... \" Read more \" I wore this dress to a funeral. It was well made, nice and heavy , but not too heavy material. Great for fall. Not see through and doesn’t wrinkle.... \" Read more \" ... Very heavy material . Overall look was nice, got a lot of compliments. \" Read more \" ...The color is wonderful the material is heavy but not too heavy, it falls really nicely, it's very soft perfectly stretchy but not too stretchy.... \" Read more 118 customers mention material thickness, 76 positive, 42 negative 118 customers mention \"Material thickness\" 76 positive 42 negative Customers have mixed opinions about the dress's material thickness, with some appreciating that it is thick, while others find it too heavy for summer wear. \" ...The color is stunning and the price was great. The material is nice and thick not to heavy but just rightyand very Functional and comfortable and... \" Read more \" The dress is very thick if that makes sense. It runs small. Very pretty just to small for me. \" Read more \" Beautiful dress, thick material . Received a lot of compliments. Reason for only four stars after one wear I started to see fuzzy patches. \" Read more \" ...The material is thick and of good quality and the dress fits true to size. I’m 5ft 7inches tall, 235 lbs and ordered an XL and it fit perfectly.... \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars it is a beautiful Blue dress",
        "body": "Title: Perfect Dress for Teachers – Comfortable & Professional Review: I purchased the PrettyGarden blue dress and absolutely love it. As a teacher, I need clothing that is comfortable, modest, and professional, and this dress checks all the boxes. The fabric is soft and breathable, making it easy to wear all day in the classroom. The fit is flattering without being tight, the length is appropriate for work, and the blue color looks polished and professional. It’s easy to move in and still looks great from morning to afternoon. This is a great option for teachers or anyone who needs a stylish but practical dress for work. Highly recommend! Read more",
        "author": "Yaniree Mcgrath",
        "rating": 5.0,
        "date": "December 14, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars A beautiful piece",
        "body": "I purchased this dress as a last minute redemption. I needed a cute and flattering white dress for my Halloween costume. The fit was perfect, it didn't hug me and there was no need for me to iron after washing. I love a good quality made piece of clothing. I wasn't expect it to be amazing for the price I paid. To be wrinkle free and affordable is a blessing. I washed it and there were no tears or change in the material. Of course because it was white it did end up getting stained. The stains came out with the tide pen, keep those on handy if you're wearing light colors! Everyone said I looked beautiful in this dress. I'm going to buy this in a few more colors. Read more",
        "author": "Rozo A.",
        "rating": 5.0,
        "date": "November 27, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Elegant Wedding Attire",
        "body": "This was the perfect dress for the wedding ceremony. The color matched, the length was great, and the fit was like it was tailored for me. It was comfortable and presented fantastically on the dance floor as the skirt twirled majestically. My brooch added style, sophistication, and the appropriate amount of bling for the occasion. The weight of the material kept me warm in the outdoor setting in a windy 40 - 50 degree climate. Everyone should feel fashionably elegant in this dress! I would purchase in every color offered! Read more",
        "author": "Disappointed",
        "rating": 5.0,
        "date": "October 17, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars A dress you will love",
        "body": "I brought this dress for a church function, and it is beautiful, fits very well, feel well; the material is great. I received so many compliments of the way it fit Read more",
        "author": "Woman of God",
        "rating": 4.0,
        "date": "November 12, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars I suggest you buy one before they are all gone.",
        "body": "This dress is amazing, I love the fit, so soft & elegant. The length is perfect, I will wear this dress every chance I get. No wrinkles, This dress is a keeper. Read more",
        "author": "catherine",
        "rating": 5.0,
        "date": "December 2, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Must buy!",
        "body": "This dress is even cuter on! The material is nice and thick. The fit was perfect and true to size. I would definitely recommend! Read more",
        "author": "N. Blade",
        "rating": 5.0,
        "date": "December 2, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Nice thick fabric & POCKETS",
        "body": "Love this dress. I received it today. I’m normally an XL. But, my busts are a 40DD. So, I sized up. It fits perfectly. The fabric is nice & think. The first thing I noticed was that the dress was heavy. So, the fabric is thick. Not cheaply made and it has POCKETS!! This Sunday is breast cancer awareness. It will be just on time. Read more",
        "author": "Shelley Hunt",
        "rating": 5.0,
        "date": "October 22, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Pretty dress, but not perfect",
        "body": "The dress looks elegant and the bow detail is really cute, but the fit wasn’t exactly what I expected. The material is decent but a bit stiffer than it looks in the photos, and the sizing feels slightly off not bad, just not great. It’s still wearable and the pockets are a nice bonus, but overall it didn’t wow me the way I hoped. ( My mother ) Read more",
        "author": "Andres Eger",
        "rating": 3.0,
        "date": "December 2, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Dress Short Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.",
  "about_this_item": "Womens Dress Short Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.",
  "long_description": "Womens Dress Short Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Brown, Violet, Burgundy, Army Green, Black, Orange, Light Blue, Red, Rose Red, Lake Blue, Pink, White, Purple, Yellow. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Dress Short Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Brown, Violet, Burgundy, Army Green, Black, Orange, Light Blue, Red, Rose Red, Lake Blue, Pink, White, Purple, Yellow. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "e31a65b7-0c2c-439c-907f-7e386986c66f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e31a65b7-0c2c-439c-907f-7e386986c66f/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e31a65b7-0c2c-439c-907f-7e386986c66f/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "4ef3879e-3f0b-49b6-8fd0-aacdeeea0955",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4ef3879e-3f0b-49b6-8fd0-aacdeeea0955/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4ef3879e-3f0b-49b6-8fd0-aacdeeea0955/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Brown": "https://m.media-amazon.com/images/I/31+QuAaBYYL._AC_SR38,50_.jpg",
    "Violet": "https://m.media-amazon.com/images/I/31PIPT8uYJL._AC_SR38,50_.jpg",
    "Burgundy": "https://m.media-amazon.com/images/I/31nVwwCZIAL._AC_SR38,50_.jpg",
    "Army Green": "https://m.media-amazon.com/images/I/31lrfYbia8L._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31ixXVqXJ6L._AC_SR38,50_.jpg",
    "Orange": "https://m.media-amazon.com/images/I/41PFirTX7mL._AC_SR38,50_.jpg",
    "Light Blue": "https://m.media-amazon.com/images/I/31DYXQRaQ-L._AC_SR38,50_.jpg",
    "Red": "https://m.media-amazon.com/images/I/31c0BUe7DHL._AC_SR38,50_.jpg",
    "Rose Red": "https://m.media-amazon.com/images/I/31vNgVFmcCL._AC_SR38,50_.jpg",
    "Lake Blue": "https://m.media-amazon.com/images/I/31jpjy7KwdL._AC_SR38,50_.jpg",
    "Pink": "https://m.media-amazon.com/images/I/315pDZNyK-L._AC_SR38,50_.jpg",
    "White": "https://m.media-amazon.com/images/I/31XDVZRik1L._AC_SR38,50_.jpg",
    "Purple": "https://m.media-amazon.com/images/I/319VENCutyL._AC_SR38,50_.jpg",
    "Yellow": "https://m.media-amazon.com/images/I/31I3hFNHteL._AC_SR38,50_.jpg",
    "Peacock Blue": "https://m.media-amazon.com/images/I/31ak8SbNofL._AC_SR38,50_.jpg",
    "Royal Blue": "https://m.media-amazon.com/images/I/31KTjAeg-jL._AC_SR38,50_.jpg",
    "Navyblue": "https://m.media-amazon.com/images/I/315a0UrLntL._AC_SR38,50_.jpg",
    "Green": "https://m.media-amazon.com/images/I/31AUlk0bhbL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Brown": "51Uf+Qxke-L",
    "Violet": "619IWa58iLL",
    "Burgundy": "51IlSKu3L9L",
    "Army Green": "516uhLI1nWL",
    "Black": "51aGk9wIqiL",
    "Orange": "61ipQZF2dUL",
    "Light Blue": "617yJm+fdXL",
    "Red": "51SC0J3glyL",
    "Rose Red": "61VIA+rbHIL",
    "Lake Blue": "61rR+e-H0xL",
    "Pink": "51D-UCK1qEL",
    "White": "51v0qSFZ7BL",
    "Purple": "51yZoggCxVL",
    "Yellow": "51VYZS2UDdL",
    "Peacock Blue": "51r+9axADEL",
    "Royal Blue": "51egoAgGarL",
    "Navyblue": "519CA4vVKKL",
    "Green": "51N2iZ3SQkL"
  },
  "color_images": {
    "Brown": [
      "https://m.media-amazon.com/images/I/51Uf+Qxke-L._SL1500_.jpg"
    ],
    "Violet": [
      "https://m.media-amazon.com/images/I/619IWa58iLL._SL1500_.jpg"
    ],
    "Burgundy": [
      "https://m.media-amazon.com/images/I/51IlSKu3L9L._SL1500_.jpg"
    ],
    "Army Green": [
      "https://m.media-amazon.com/images/I/516uhLI1nWL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/51aGk9wIqiL._SL1500_.jpg"
    ],
    "Orange": [
      "https://m.media-amazon.com/images/I/61ipQZF2dUL._SL1500_.jpg"
    ],
    "Light Blue": [
      "https://m.media-amazon.com/images/I/617yJm+fdXL._SL1500_.jpg"
    ],
    "Red": [
      "https://m.media-amazon.com/images/I/51SC0J3glyL._SL1500_.jpg"
    ],
    "Rose Red": [
      "https://m.media-amazon.com/images/I/61VIA+rbHIL._SL1500_.jpg"
    ],
    "Lake Blue": [
      "https://m.media-amazon.com/images/I/61rR+e-H0xL._SL1500_.jpg"
    ],
    "Pink": [
      "https://m.media-amazon.com/images/I/51D-UCK1qEL._SL1500_.jpg"
    ],
    "White": [
      "https://m.media-amazon.com/images/I/51v0qSFZ7BL._SL1500_.jpg"
    ],
    "Purple": [
      "https://m.media-amazon.com/images/I/51yZoggCxVL._SL1500_.jpg"
    ],
    "Yellow": [
      "https://m.media-amazon.com/images/I/51VYZS2UDdL._SL1500_.jpg"
    ],
    "Peacock Blue": [
      "https://m.media-amazon.com/images/I/51r+9axADEL._SL1500_.jpg"
    ],
    "Royal Blue": [
      "https://m.media-amazon.com/images/I/51egoAgGarL._SL1500_.jpg"
    ],
    "Navyblue": [
      "https://m.media-amazon.com/images/I/519CA4vVKKL._SL1500_.jpg"
    ],
    "Green": [
      "https://m.media-amazon.com/images/I/51N2iZ3SQkL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 44.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/813GmOhQ3+L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-v-neck-long-sleeve",
      "title": "Womens Maxi Dress V Neck Long Sleeve",
      "price": 28.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71K7SViYxIL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi",
      "title": "Womens Maxi Dress Maxi",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51wgEJMRyXL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-short-sleeve",
      "title": "Womens Maxi Dress Formal Short Sleeve",
      "price": 74.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61323sb10xL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-v-neck-bodycon",
      "title": "Womens Dress V Neck Bodycon",
      "price": 71.36,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71Y6PrsU2WL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-sleeveless-maxi-evening-formal",
      "title": "Womens Maxi Dress Sleeveless Maxi Evening Formal",
      "price": 69.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61oUnVj-05L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-sleeveless-v-neck",
      "title": "Womens Dress Sleeveless V Neck",
      "price": 35.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51DAlqSWLsL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 46.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/615rmgyupRL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-short-sleeve-off-shoulder-formal-high-split-v-neck-evening",
      "title": "Womens Maxi Dress Short Sleeve Off Shoulder Formal High Split V Neck Evening",
      "price": 44.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61gNNmMSaoL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-cocktail-maxi-long-sleeve-formal-ruched",
      "title": "Womens Maxi Dress Bodycon Cocktail Maxi Long Sleeve Formal Ruched",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51Q-kYjWqFL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-long-sleeve-maxi",
      "title": "Womens Maxi Dress Bodycon Long Sleeve Maxi",
      "price": 14.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/5122JE3lxEL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-off-shoulder",
      "title": "Womens Dress Off Shoulder",
      "price": 123.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/81UP9NAqKaL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail-bodycon",
      "title": "Womens Dress Cocktail Bodycon",
      "price": 42.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61pBXGPf12L._SL1500_.jpg"
      ]
    }
  ]
}