{
  "id": "womens-maxi-dress-bodycon-v-neck-long-sleeve-ruched",
  "handle": "womens-maxi-dress-bodycon-v-neck-long-sleeve-ruched",
  "sku": "JC1145",
  "asin": "B0CG5MF238",
  "title": "Womens Maxi Dress Bodycon V Neck Long Sleeve Ruched",
  "title_original": "BEAGIMEG Women's Sexy Bodycon Long Sleeve Ruched Deep V Neck Solid Party Club Midi Dress",
  "brand": "Visit the BEAGIMEG Store",
  "price": 36.99,
  "social_proof": {
    "bought_past_month": 337,
    "text": "337+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/51TARubmowL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61gXfle-9PL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61lcZVuWF7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61-BHGpEbzL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/617hULQSVnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ZSs0DarLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61mbSVG6EeL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51y2oBpS2YL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61+KkQsFP3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61yDCCVET9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51IMfHFNblL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61uMeo50VHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61FXbkxOVpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61RNLjc44bL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41QGCXv-5oL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61DOEjxlNeL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61As7e+P2aL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51i2tXoUjwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61fjILfM9BL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61EX3CwyZ5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61FPMLXr3vL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/51TARubmowL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61gXfle-9PL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61lcZVuWF7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61-BHGpEbzL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/617hULQSVnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ZSs0DarLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61mbSVG6EeL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51y2oBpS2YL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61+KkQsFP3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61yDCCVET9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51IMfHFNblL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61uMeo50VHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61FXbkxOVpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61RNLjc44bL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41QGCXv-5oL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61DOEjxlNeL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61As7e+P2aL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51i2tXoUjwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61fjILfM9BL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61EX3CwyZ5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61FPMLXr3vL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Item model number ‏": "‎ BA300",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ August 21, 2023",
    "ASIN ‏": "‎ B0CG5L3Y6P",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#79,122 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #454 in Women's Club & Night Out Dresses",
    "Customer Reviews": "4.4 4.4 out of 5 stars (324)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Red",
      "White",
      "Black"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.4,
    "count": 324,
    "customers_say": "Customers find the dress fits well, with one mentioning it accommodates a baby bump, and they appreciate its flattering ruching that hugs curves perfectly. The dress is comfortable and not see-through, with one customer noting it's perfect for Valentine's Day. They like the material, with one describing it as double-layered, and find it elegant, particularly when paired with stiletto heels. Generated from the text of customer reviews Select to learn more Fit (38) Elegance (29) Quality (19) Flattering (18) Material thickness (17) Comfort (14) Ruching (10) See through (9) 38 customers mention fit, 36 positive, 2 negative 38 customers mention \"Fit\" 36 positive 2 negative Customers are satisfied with how the dress fits, with one mentioning it accommodates a baby bump well and another noting it sits just below the knee. \" ...5ft even 162 lbs 38DD. Perfect fit . I \" Read more \" This dress fits great . I ordered it in black as well. The material is just thick enough, and it stays put. \" Read more \" ...I’m 5’6 Measurements 36 31 43 I loved the fit will buy in other colors \" Read more \" Fit amazing . Stretchy fits great, breathable. Makes you look very toned. \" Read more 29 customers mention elegance, 28 positive, 1 negative 29 customers mention \"Elegance\" 28 positive 1 negative Customers find the dress beautiful and sexy when paired with stiletto heels, with one customer describing it as a perfect little black dress. \" ...Brought it for a funeral, last minute. It gave respectable, yet sexy . Also purchased Amazon 10 PC necklace set to make the dress even more classy. \" Read more \" Beautiful dress , Very satisfied, received lots of compliments. I’m 5’4, 196lbs I ordered a XL and it was PERFECT.... \" Read more \" Cute dress , got a nice stretch to it as well. \" Read more \" I Love This Dress it is Very Sexy & Comfortable \" Read more 19 customers mention quality, 19 positive, 0 negative 19 customers mention \"Quality\" 19 positive 0 negative Customers find the dress impressive in quality, with one mentioning it's a great choice for Valentine's Day. \" ...The material wasn’t thick but it wasn’t really thin either, overall great quality and the price wasn’t ridiculous. Highly recommended!!!!!!!!!! \" Read more \" The perfect dress !... \" Read more \" Great dress !!!... \" Read more \" The dress is nice but it came dirty and smelled like perfume. It’s obvious that someone used this before. It’s really gross.... \" Read more 18 customers mention flattering, 17 positive, 1 negative 18 customers mention \"Flattering\" 17 positive 1 negative Customers find the dress flattering, with the ruching accentuating curves and hugging them in all the right places. One customer mentions it enhances their chest and rear end, while another notes it covers the belly area. \" This dress is super flattering and covers your belly if you’re self conscience about it. It’s about a midi length. \" Read more \" ...Fits the curves very nice. It's very flattering . I love the ruched style around the tummy area. I'm about to add more colors to cart.... \" Read more \" ...Looks fantastic, very comfortable, extremely flattering . \" Read more \" ...photo shoot pictures in, and I loved how this dress hugged me in all the right places while given me comfort.... \" Read more 17 customers mention material thickness, 16 positive, 1 negative 17 customers mention \"Material thickness\" 16 positive 1 negative Customers like the material of the dress, with one mentioning it is double-layered and another noting it accentuates the figure. \" ...The material is good quality and it’s not see through.... \" Read more \" This is a great date dress m, party dress or night club. It’s cool fabric so you’re not hot all Evening long.... \" Read more \" ...This is a nice dress. I purchased XL. It's stretchy. The material was thick enough , so it's not see through. The white is that pure white color.... \" Read more \" This dress fits great. I ordered it in black as well. The material is just thick enough , and it stays put. \" Read more 14 customers mention comfort, 14 positive, 0 negative 14 customers mention \"Comfort\" 14 positive 0 negative Customers find the dress comfortable. \" ...Looks fantastic, very comfortable , extremely flattering. \" Read more \" Comfortable , good material, fit amazing. Very impressed!!! \" Read more \" ...It’s a soft material that is super comfortable , and kind of slinky without feeling cheap.... \" Read more \" ...The fabric is very comfortable and double lined in the front.... \" Read more 10 customers mention ruching, 7 positive, 3 negative 10 customers mention \"Ruching\" 7 positive 3 negative Customers like the ruching design of the dress, particularly around the tummy area, with one customer noting how it helps hide body imperfections. \" ...It's very flattering. I love the ruched style around the tummy area . I'm about to add more colors to cart. This is a nice dress. I purchased XL.... \" Read more \" ...It also has a little bit of ripples in the belly area which was very nice for us bigger belly girls.... \" Read more \" ...It arrived inside out and had deoderant all over it . It had deoderant marks on the outside as well. That can cause diseases and is dirty.... \" Read more \" Fits great, luv the ruching to hide my pudge . Arms are tall girl friendly \" Read more 9 customers mention see through, 8 positive, 1 negative 9 customers mention \"See through\" 8 positive 1 negative Customers appreciate that the dress is not see-through. \" ...It's stretchy. The material was thick enough, so it's not see through . The white is that pure white color. It had a smell to me.... \" Read more \" Love the thickness and how stretchy it is. Not see through at all . Will definitely recommend for thick thighs and big behind \" Read more \" ...The material is double layered so it’s no see through . Good stretch with a little shape wear effect. \" Read more \" ...- the whitest of the whitest, Quality -100%, and definitely not a see through . It is overall the best. I got the 2XL \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Sexy Dress",
        "body": "This dress is sexy! I didn't even try it on before my event, but when I put it on the day of, I was like, \"Oh, this is nice!\" Fits the curves very nice. It's very flattering. I love the ruched style around the tummy area. I'm about to add more colors to cart. This is a nice dress. I purchased XL. It's stretchy. The material was thick enough, so it's not see through. The white is that pure white color. It had a smell to me. Thanks to other reviews, I am pleased with my purchase. Read more",
        "author": "Customer",
        "rating": 5.0,
        "date": "December 22, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61pL3JbtLRL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars The perfect dress",
        "body": "This is such a beautiful dress! I am 5’3 134 lb but I ordered a size large because the medium was kind of snug and showed my love handles lol but the large fit perfect. The material is good quality and it’s not see through. The dress is very elegant I ordered two a red for Christmas and white for New years I’m all set and happy. Read more",
        "author": "The Medium",
        "rating": 5.0,
        "date": "December 9, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Great quality!!",
        "body": "Comfortable, good material, fit amazing. Very impressed!!! Read more",
        "author": "Tami Pruitt",
        "rating": 5.0,
        "date": "December 14, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61gVyy1BCyL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "4.0 out of 5 stars Very sexy",
        "body": "This is a great date dress m, party dress or night club. It’s cool fabric so you’re not hot all Evening long. The red color is vibrant and the fit is true to size. 5ft even 162 lbs 38DD. Perfect fit. I Read more",
        "author": "Donna",
        "rating": 4.0,
        "date": "December 14, 2024",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61YocqLFTTL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Beautiful",
        "body": "Loved this dress fit really nice on body. And true to size. Material is very soft. Read more",
        "author": "Cici c",
        "rating": 5.0,
        "date": "November 30, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Must HAVE!",
        "body": "Beautiful dress, Very satisfied, received lots of compliments. I’m 5’4, 196lbs I ordered a XL and it was PERFECT. Materiel stretched just right, no smells, very comfort-able, the length fell right at the calf Read more",
        "author": "Danielle Urquhart",
        "rating": 5.0,
        "date": "November 24, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61izIuCggZL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71V9wK9BL7L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "1.0 out of 5 stars Worn and used",
        "body": "Arrive soiled with a bunch of white marks like deodorant. Appears to be worn and used. Not worth the price. Read more",
        "author": "ms demseh31",
        "rating": 1.0,
        "date": "December 8, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61E6Ao4gDXL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Love this dress",
        "body": "I ordered this dress to take my 40th birthday photo shoot pictures in, and I loved how this dress hugged me in all the right places while given me comfort. It also has a little bit of ripples in the belly area which was very nice for us bigger belly girls. I loved how this dress was not see through and it didn’t smell like it’s been sitting in someone’s trunk went I got it. The material wasn’t thick but it wasn’t really thin either, overall great quality and the price wasn’t ridiculous. Highly recommended!!!!!!!!!! Read more",
        "author": "B. Walker",
        "rating": 5.0,
        "date": "December 20, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71OH5+SlQ0L._SY88._SL1500_.jpg"
        ]
      }
    ]
  },
  "short_description": "Womens Maxi Dress Bodycon V Neck Long Sleeve Ruched is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.",
  "about_this_item": "Womens Maxi Dress Bodycon V Neck Long Sleeve Ruched is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.",
  "long_description": "Womens Maxi Dress Bodycon V Neck Long Sleeve Ruched is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Red, White, Black. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Bodycon V Neck Long Sleeve Ruched is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Red, White, Black. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "1572c829-ae42-4182-981a-521a51f36a70",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1572c829-ae42-4182-981a-521a51f36a70/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1572c829-ae42-4182-981a-521a51f36a70/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "3287fe23-71de-4d87-b35e-40217f9b992f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3287fe23-71de-4d87-b35e-40217f9b992f/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3287fe23-71de-4d87-b35e-40217f9b992f/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "4287bdf4-e7fe-4e26-bb1f-3082c0a73aa5",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4287bdf4-e7fe-4e26-bb1f-3082c0a73aa5/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4287bdf4-e7fe-4e26-bb1f-3082c0a73aa5/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "af569043-9c87-4c95-84a7-735ddef2dad8",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/af569043-9c87-4c95-84a7-735ddef2dad8/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/af569043-9c87-4c95-84a7-735ddef2dad8/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Red": "https://m.media-amazon.com/images/I/412YjiB1R1L._AC_SR38,50_.jpg",
    "White": "https://m.media-amazon.com/images/I/31y6MFcRgIL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/319HJQDaylL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Red": "51y2oBpS2YL",
    "White": "41QGCXv-5oL",
    "Black": "51TARubmowL"
  },
  "color_images": {
    "Red": [
      "https://m.media-amazon.com/images/I/51y2oBpS2YL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61+KkQsFP3L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61yDCCVET9L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/51IMfHFNblL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61uMeo50VHL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61FXbkxOVpL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61RNLjc44bL._SL1500_.jpg"
    ],
    "White": [
      "https://m.media-amazon.com/images/I/41QGCXv-5oL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61DOEjxlNeL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61As7e+P2aL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/51i2tXoUjwL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61fjILfM9BL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61EX3CwyZ5L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61FPMLXr3vL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/51TARubmowL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61gXfle-9PL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61lcZVuWF7L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61-BHGpEbzL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/617hULQSVnL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61ZSs0DarLL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61mbSVG6EeL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress-bodycon-short-sleeve",
      "title": "Womens Dress Bodycon Short Sleeve",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61a6bHOzK-L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 90.3,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/615pWkY1BGL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-mermaid",
      "title": "Womens Maxi Dress Evening Mermaid",
      "price": 84.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71Wjc13RbCL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-split-formal-maxi",
      "title": "Womens Maxi Dress Evening Split Formal Maxi",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61AzmhqDt-L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-sleeveless",
      "title": "Womens Dress Sleeveless",
      "price": 52.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71FxZ+YlsFL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress-cocktail",
      "title": "Womens Dress Cocktail",
      "price": 103.54,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61JApwce25L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-boat-neck-bodycon",
      "title": "Womens Maxi Dress Long Sleeve Boat Neck Bodycon",
      "price": 57.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61n4ziehnaL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-ruched-bodycon-long-sleeve-formal",
      "title": "Womens Maxi Dress Cocktail Ruched Bodycon Long Sleeve Formal",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/51gnTehrHcL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-mermaid-formal-evening",
      "title": "Womens Maxi Dress Mermaid Formal Evening",
      "price": 89.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51ZwWhqKP8L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-sleeveless",
      "title": "Womens Dress Sleeveless",
      "price": 47.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71gSCnzqz-L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-v-neck",
      "title": "Womens Maxi Dress Long Sleeve V Neck",
      "price": 40.84,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Work",
      "images": [
        "https://m.media-amazon.com/images/I/61ZKTvMhh-L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 88.49,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61imYyqh0TL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-v-neck-long-sleeve-formal-maxi",
      "title": "Womens Maxi Dress V Neck Long Sleeve Formal Maxi",
      "price": 56.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71GACW7ZGeL._SL1500_.jpg"
      ]
    }
  ]
}