{
  "id": "womens-maxi-dress-long-sleeve",
  "handle": "womens-maxi-dress-long-sleeve",
  "sku": "JC2363",
  "asin": "B0CG9MZMVC",
  "title": "Womens Maxi Dress Long Sleeve",
  "title_original": "QINSEN Womens Square Neck Bodice Dress Long Sleeve Side Slit Flare Mini Dresses",
  "brand": "Visit the QINSEN Store",
  "price": 39.99,
  "social_proof": {
    "bought_past_month": 1544,
    "text": "1544+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/51L8j8K6FgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/5147C4iMPuL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/511cjCWs7fL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51r3ikcjhPL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51dXHwrmwtL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71S+1irXuCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/514b-16krmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51xBbOll-3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/517DiguIaAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51sKjzQfTbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51D4eGFSKkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/512OdaAwvjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51Dc6KaEoPL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/51L8j8K6FgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/5147C4iMPuL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/511cjCWs7fL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51r3ikcjhPL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51dXHwrmwtL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71S+1irXuCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/514b-16krmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51xBbOll-3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/517DiguIaAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51sKjzQfTbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51D4eGFSKkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/512OdaAwvjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51Dc6KaEoPL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ August 22, 2023",
    "ASIN ‏": "‎ B0CG9LWV71",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#33,467 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #164 in Women's Club & Night Out Dresses",
    "Customer Reviews": "4.1 4.1 out of 5 stars (1,591)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Carob Brown",
      "White",
      "Airy Blue",
      "Chestnut",
      "Light Green",
      "Black",
      "Tea Leaf",
      "Azalea"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.1,
    "count": 1591,
    "customers_say": "Customers find the dress flattering, particularly appreciating its square neckline and how it accentuates their figure, while also praising its thick, athletic material and comfortable fit. The dress receives positive feedback for its quality and style, making customers feel sexy. However, the sizing and length receive mixed reviews - while some find the length good, others say it runs small and is too long in the back. The fit is also mixed, with some finding it nice while others describe it as insanely tight. Generated from the text of customer reviews Select to learn more Style (167) Material quality (110) Comfort (80) Quality (69) Flattering (68) Fit (219) Length (70) Size (79) 167 customers mention style, 158 positive, 9 negative 167 customers mention \"Style\" 158 positive 9 negative Customers find the dress cute and sexy. \" ...had a baby 8 months ago so body is still bloop but it’s flattering and cute . For reference 5’5 , 140lbs with a pudge! And ordered a large!... \" Read more \" ...The tag was on it but it just doesn’t seem new. It was super cute so I returned it and will re order. Didn’t try it on because it was probably worn. \" Read more \" This dress is so cute and made me feel so good! I got several compliments when wearing it and it’s easy to change how you style it.... \" Read more \" Love this square neck long sleeve flare minidress. It is very cute and modern looking. The fabric is as expected. Shiny and stretchy.... \" Read more 110 customers mention material quality, 87 positive, 23 negative 110 customers mention \"Material quality\" 87 positive 23 negative Customers like the material of the dress, describing it as athletic and thick, with one customer noting its buttery texture. \" Great material but the arms and chest were a but too tight - ALSO these don't have shorts underneath which would help since it is a pretty short dress \" Read more \" this dress is EVERYTHING. It is so flattering and the material is thick and not see through. I will be buying in more colors. \" Read more \" I LOVE this dress! It is very true to size and has almost an athletic material to it. It is super comfy, flattering, and cute! Highly recommend! \" Read more \" ...No see through. Super soft material. It’s thick material . Feels expensive. DONT SLEEP ON THIS DRESS!... \" Read more 80 customers mention comfort, 74 positive, 6 negative 80 customers mention \"Comfort\" 74 positive 6 negative Customers find the dress comfortable. \" Super flattering, comfortable , good length- I do recommend shorts under. Great value- COMFORT! Wore for Greece trip and will be for Disney too! \" Read more \" I got this dress for a rock concert. I love how comfy it is and how it hugs my body. At first I thought it was tight but it stretches so it’s great.... \" Read more \" Wore to a wedding and added a sparkly belt! Very comfortable , but a little too short for my liking, kept pulling my dress down the whole night, but... \" Read more \" Was in a pinch to find something slimming and it’s so comfortable the right length and size I got a size up so a medium is perfect \" Read more 69 customers mention quality, 63 positive, 6 negative 69 customers mention \"Quality\" 63 positive 6 negative Customers praise the dress's quality, describing it as an absolute perfection that works well as a workout outfit. \" Great dress but, as everyone says, tight. I am 5’4”, 112lbs, and the medium was a flattering but a tight fit. Good quality, not see-through.... \" Read more \" Love this color, the fabric is pretty thick and great quality . However, I ordered a Medium and it fits like at XS \" Read more \" This dress made me look so snatched and was such good quality !!... \" Read more \" Love this dress , athletic material you can dress up or down, just wish it had built in shorts because it is too short to wear without anything... \" Read more 68 customers mention flattering, 61 positive, 7 negative 68 customers mention \"Flattering\" 61 positive 7 negative Customers find the dress flattering, particularly appreciating its square neckline and how it accentuates curves and shapes the body. \" ...had a baby 8 months ago so body is still bloop but it’s flattering and cute. For reference 5’5 , 140lbs with a pudge! And ordered a large!... \" Read more \" This dress is so flattering and SO soft! I love the cut on the bust and the fit is perfect. I just wish it had shorts built in! \" Read more \" I really liked the fit of the dress, found it very flattering . It was snug to try and put on but once on, was great! I am 172ish lbs and 5'5\" \" Read more \" Super flattering , comfortable, good length- I do recommend shorts under. Great value- COMFORT! Wore for Greece trip and will be for Disney too! \" Read more 219 customers mention fit, 120 positive, 99 negative 219 customers mention \"Fit\" 120 positive 99 negative Customers have mixed opinions about the dress's fit, with some finding it nice while others describe it as insanely tight and compare it to a swimsuit. \" ...of my measurements but they're something around 36\"28\"40\" and it fits like a glove ! Not see through from what I can tell and very flattering. \" Read more \" ...I'm about 5'9\", 174 lbs, 38C bra and I ordered a Large, it's very tight , little bit short too. So I'm gonna send back for an XLarge.... \" Read more \" Great fit , nice material. Good support. Better than expected. \" Read more \" This would have been great, but it is just too tight . I wish it came in larger sizes. \" Read more 70 customers mention length, 33 positive, 37 negative 70 customers mention \"Length\" 33 positive 37 negative Customers have mixed opinions about the dress's length, with some finding it good while others say it's too short, particularly noting that the skirt part is too long. \" Cute but too long it’s for long torso ppl, also neck line is pretty low \" Read more \" Super flattering, comfortable, good length - I do recommend shorts under. Great value- COMFORT! Wore for Greece trip and will be for Disney too! \" Read more \" Love the material but it is SKIN TIGHT and short . I have curves and it was tight underneath the armpits. Fabric was good and so was the color. \" Read more \" I am 5’10.5” and this dress is just long enough for me . I got so many compliments and it’s so comfy! The neckline is very flattering.... \" Read more 79 customers mention size, 19 positive, 60 negative 79 customers mention \"Size\" 19 positive 60 negative Customers report that the dress runs small, particularly in the chest area. \" ...Super stretchy but runs small . I’m usually XS in everything and ordered the small. I would have been more comfortable in Medium. 10/10 would recommend \" Read more \" It is extremely small did not fit. Not true to size . \" Read more \" I got a size large my usual size and it was too small , not great if you’re busty or curvy. Size up!! \" Read more \" ...This makes me feel so comfortable in any room. Great material and true to size . I highly recommend this dress. \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars I love this dress!",
        "body": "I love this dress! The material is thick enough to feel high-quality but still breathable, so it’s great for warm days or running around. It has a sporty, athletic feel, but the fit is super flattering and dressy, so you can wear it casually or easily dress it up. No weird smell, very comfortable, and the stretch makes it easy to move in. I also love that it doesn’t show sweat easily - huge win. Definitely worth it! Read more",
        "author": "Macy",
        "rating": 5.0,
        "date": "November 23, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/81U1yyAoFwL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars The perfect little black dress",
        "body": "Fits beautifully, hugging you in all the right places. Heavy weight and durable fabric. The fabric feels like athletic leggings. Did not have an odor upon opening. Read more",
        "author": "madelyn",
        "rating": 5.0,
        "date": "December 1, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars It's great! You can't go wrong for this price and this fit",
        "body": "A solid 4.5 ⭐. This dress was affordable and cute so I had to give it a try. I am always looking for confortable outfits and this one does not disappoint. But it really depends on your body type and looking at reviews the measurements they put. I'm normall a Medium in GAP, and I sized up to a large. I have 31 inch waist, 41 inch hip and small bust but wider ribcage 37.5 ish. I'm 5'3\" and 155 lbs, my weight distribution is pretty even, I have an athletic body type and my arms have weight to them. So all that to say is I really did not know what to expect. Pro: -The dress material is soft and has some stretch, the black color is classic and the fit is good. -the length is alright not too short and not long, but I'm 5'3, so for me it's a tad long. Some conservative peeps might find this to be the perfect length, but for me, I might just tailor it up and inch. -perfect fall/winter date dress -perfect shopping/city travel dress Con: -The chest and stomach area is fitted, which makes my small chest \"A\" look a bit squeezed in and a bit flatter (but I'll try this dress with a bra and see if that fixes it, although I really want to make this work without a bra, since it's so soft and compressive already). I do have to point out that on my body, despite the more compressive parts of the chest and stomach, it's not uncomfortable, but I can imagine my larger chested girlies finding this to be too tight and \"the girls\" squished in. Overall, small minus, mostly pros, and I will be looking at other colors too! Read more",
        "author": "FC",
        "rating": 4.0,
        "date": "November 17, 2024",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61yf7VWrMBL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "3.0 out of 5 stars Not chubby girl approved, though it really could've been.",
        "body": "I share in what other reviewers say about how sturdy the fabric is. This dress does compress well and isn't visually see through. I am, however, returning it for the following reasons: It's not VISUALLY see-through, but the fabric is so tight you can see any shapewear or underwear underneath it, barring maybe like a full unitard, which I don't own. The muffintop at the top of tights would also show :( I can't wear a proper bra, which would be nice at my size and build. The square neckline is very wide and the bra will show no matter what. I do like the styling of a wide neck, and I think it keeps the dress from being too boring, but with how unforgiving the tight fabric is I don't feel confident letting my tig ol biddies do whatever they want. The seem to want to sit in my armpits in this dress. On me, this comes VERY short. XL is my standard size--there was nothing for me to size up to--and I feel like more size options would've made me exchange this instead of returning it. If you're midsized (US size 12) or smaller and comfortable with little-to-no structure underneath,, this is a well-constructed and gorgeous little dress. You should size up for more breathing room! The airy blue is true to color and very feminine and flattering. I'll come back if they ever add more sizes! Read more",
        "author": "n/a",
        "rating": 3.0,
        "date": "December 30, 2023",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Súper cute",
        "body": "I loved the dress, the super pretty color, I am size L, I ordered size M, it fit me perfectly, it fits the body, elastic, the fabric is super rich, I loved how it looked on me, I recommend it Read more",
        "author": "Christian Rivera",
        "rating": 5.0,
        "date": "October 23, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/719VNDsxeRL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/711o-a7YzuL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Great dress",
        "body": "The media could not be loaded. I seriously can’t say enough great things about this dress! I had very low expectations for it, bc usually how Amazon clothes are pictured vs how they actually are IRL are vastly different. This one is spot-on and so flattering! I think it could be great for all body sizes and a majority of chest sizes (unless you have like super duper huge boobs, but I could be wrong). The square neckline is also surprisingly flattering. I have a small chest (small B cup) and a single mastectomy and it was flattering/ didn’t gap on my flat side. The material is very comfortable, like an athletic dress and the quality of the material was better than expected (again, usually amazons clothing is pretty cheap). The dress has some stretch and the material is not see-through. I sized to a large and I was very comfortable in it (I don’t Iike things super tight). For reference, I am 5’7” and ~140#. I think if I ordered a medium, it would have been ok, but just a little tight in the arms and also possibly a bit too short, as other buyers had mentioned. I definitely can’t recommend this dress enough— I want to buy it in every color! Go on and order one! Read more",
        "author": "C. S.",
        "rating": 5.0,
        "date": "January 12, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71fncYA-WUL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "2.0 out of 5 stars Cute, but DIRTY",
        "body": "Came COMPLETELY filthy. I ordered for a specific occasion, with no time to return (shipping to Alaska takes 3 weeks). You can clearly see the pit and deodorant stains. Other than that, it fits well. However, the waist is quite itchy. I hope to wear it after a good wash. Read more",
        "author": "Trish Casady",
        "rating": 2.0,
        "date": "October 4, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71Uw5Z4scyL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71MXE8NZgsL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71uHZxcuNdL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Love this dress.",
        "body": "I love this dress. Great quality. Thick material. I did size up to a large. It is tight but I'm a larger chested lady and its tight enough it holds the girls in and I dont have to wear a bra. Read more",
        "author": "casey",
        "rating": 5.0,
        "date": "October 17, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.",
  "about_this_item": "Womens Maxi Dress Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.",
  "long_description": "Womens Maxi Dress Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Carob Brown, White, Airy Blue, Chestnut, Light Green, Black, Tea Leaf, Azalea. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Carob Brown, White, Airy Blue, Chestnut, Light Green, Black, Tea Leaf, Azalea. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "77b474ec-29a3-4e41-97c7-d5e3a2a205ee",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/77b474ec-29a3-4e41-97c7-d5e3a2a205ee/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/77b474ec-29a3-4e41-97c7-d5e3a2a205ee/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/195ac649-05ac-46a3-ba50-0205b5e765b3.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "863854b5-526b-4864-b73a-3d8b6753f64f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/863854b5-526b-4864-b73a-3d8b6753f64f/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/863854b5-526b-4864-b73a-3d8b6753f64f/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/195ac649-05ac-46a3-ba50-0205b5e765b3.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "7128c1ff-8d5e-4f58-8a97-9fe8ef8994a6",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7128c1ff-8d5e-4f58-8a97-9fe8ef8994a6/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7128c1ff-8d5e-4f58-8a97-9fe8ef8994a6/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/195ac649-05ac-46a3-ba50-0205b5e765b3.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "ff4674cb-23c5-4158-b5c4-64b7a959acdb",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ff4674cb-23c5-4158-b5c4-64b7a959acdb/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ff4674cb-23c5-4158-b5c4-64b7a959acdb/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/195ac649-05ac-46a3-ba50-0205b5e765b3.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "fc59fb2d-2589-43da-98e3-9ca1bc4c4ca4",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/fc59fb2d-2589-43da-98e3-9ca1bc4c4ca4/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/fc59fb2d-2589-43da-98e3-9ca1bc4c4ca4/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/195ac649-05ac-46a3-ba50-0205b5e765b3.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "9e854165-fb35-4ec7-b148-c73eb5f6c70b",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9e854165-fb35-4ec7-b148-c73eb5f6c70b/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9e854165-fb35-4ec7-b148-c73eb5f6c70b/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/195ac649-05ac-46a3-ba50-0205b5e765b3.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "f993e957-d8e7-47d4-b76b-5b0560c2cfe3",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f993e957-d8e7-47d4-b76b-5b0560c2cfe3/embedded.cc.default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f993e957-d8e7-47d4-b76b-5b0560c2cfe3/embedded.cc.default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/195ac649-05ac-46a3-ba50-0205b5e765b3.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "c29ff5fb-cf81-4ab3-9d71-6b74670370b0",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c29ff5fb-cf81-4ab3-9d71-6b74670370b0/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c29ff5fb-cf81-4ab3-9d71-6b74670370b0/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/195ac649-05ac-46a3-ba50-0205b5e765b3.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "8940245b-4997-4d73-a4ca-253bca19c167",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8940245b-4997-4d73-a4ca-253bca19c167/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8940245b-4997-4d73-a4ca-253bca19c167/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/195ac649-05ac-46a3-ba50-0205b5e765b3.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "49515daa-ff6d-4f70-9f2b-335279f2f9d8",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/49515daa-ff6d-4f70-9f2b-335279f2f9d8/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/49515daa-ff6d-4f70-9f2b-335279f2f9d8/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/195ac649-05ac-46a3-ba50-0205b5e765b3.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "803f0403-764b-42e2-93da-6fa60cc1594f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/803f0403-764b-42e2-93da-6fa60cc1594f/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/803f0403-764b-42e2-93da-6fa60cc1594f/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/195ac649-05ac-46a3-ba50-0205b5e765b3.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "87965f08-169c-416c-a062-4c7bf449e87a",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/87965f08-169c-416c-a062-4c7bf449e87a/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/87965f08-169c-416c-a062-4c7bf449e87a/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/195ac649-05ac-46a3-ba50-0205b5e765b3.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Carob Brown": "https://m.media-amazon.com/images/I/31IuJRBm2cL._AC_SR38,50_.jpg",
    "White": "https://m.media-amazon.com/images/I/318rUclKcxL._AC_SR38,50_.jpg",
    "Airy Blue": "https://m.media-amazon.com/images/I/31B5e29YY2L._AC_SR38,50_.jpg",
    "Chestnut": "https://m.media-amazon.com/images/I/31nXrl7W7QL._AC_SR38,50_.jpg",
    "Light Green": "https://m.media-amazon.com/images/I/31EzhBs0EHL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31kypZGGidL._AC_SR38,50_.jpg",
    "Tea Leaf": "https://m.media-amazon.com/images/I/318nS7agjXL._AC_SR38,50_.jpg",
    "Azalea": "https://m.media-amazon.com/images/I/319ewxJxLoL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Carob Brown": "514b-16krmL",
    "White": "51xBbOll-3L",
    "Airy Blue": "517DiguIaAL",
    "Chestnut": "51sKjzQfTbL",
    "Light Green": "51D4eGFSKkL",
    "Black": "51L8j8K6FgL",
    "Tea Leaf": "512OdaAwvjL",
    "Azalea": "51Dc6KaEoPL"
  },
  "color_images": {
    "Carob Brown": [
      "https://m.media-amazon.com/images/I/514b-16krmL._SL1500_.jpg"
    ],
    "White": [
      "https://m.media-amazon.com/images/I/51xBbOll-3L._SL1500_.jpg"
    ],
    "Airy Blue": [
      "https://m.media-amazon.com/images/I/517DiguIaAL._SL1500_.jpg"
    ],
    "Chestnut": [
      "https://m.media-amazon.com/images/I/51sKjzQfTbL._SL1500_.jpg"
    ],
    "Light Green": [
      "https://m.media-amazon.com/images/I/51D4eGFSKkL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/51L8j8K6FgL._SL1500_.jpg"
    ],
    "Tea Leaf": [
      "https://m.media-amazon.com/images/I/512OdaAwvjL._SL1500_.jpg"
    ],
    "Azalea": [
      "https://m.media-amazon.com/images/I/51Dc6KaEoPL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress-cocktail-bodycon",
      "title": "Womens Dress Cocktail Bodycon",
      "price": 47.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61NfEwzl3xL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-one-shoulder-maxi-formal",
      "title": "Womens Maxi Dress Evening One Shoulder Maxi Formal",
      "price": 69.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/5150AIQL4eL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail",
      "title": "Womens Dress Cocktail",
      "price": 103.54,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61JApwce25L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-formal-bodycon-evening-sleeveless",
      "title": "Womens Maxi Dress Maxi Formal Bodycon Evening Sleeveless",
      "price": 61.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61s8qg6u1VL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 158.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71PmRANW40L._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress-bodycon-split-ruched-off-shoulder",
      "title": "Womens Dress Bodycon Split Ruched Off Shoulder",
      "price": 38.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/41JjYcPgcpL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 95.61,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Work",
      "images": [
        "https://m.media-amazon.com/images/I/71hVgSIB1jL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 138.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51PZNrlyY9L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-split-evening-formal",
      "title": "Womens Maxi Dress Split Evening Formal",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51BZ1BqPx8L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 65.97,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/81wr8PDg55L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-v-neck",
      "title": "Womens Dress V Neck",
      "price": 82.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/710bSTpZ9hL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 278.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/91YXeyW506L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening-long-sleeve",
      "title": "Womens Maxi Dress Formal Evening Long Sleeve",
      "price": 87.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61nnk+flvaL._SL1500_.jpg"
      ]
    }
  ]
}