{
  "id": "womens-maxi-dress-v-neck-long-sleeve",
  "handle": "womens-maxi-dress-v-neck-long-sleeve",
  "sku": "JC2358",
  "asin": "B0CHFG2YC4",
  "title": "Womens Maxi Dress V Neck Long Sleeve",
  "title_original": "QACOHU Fall Dresses for Women 2025 Casual V Neck Long Sleeves Flowy Mini Tunic Dress",
  "brand": "Visit the QACOHU Store",
  "price": 42.99,
  "social_proof": {
    "bought_past_month": 51,
    "text": "51+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/51RyJKoz39L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Guu+29zwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/613cSEW+DGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61qN-o07w5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61NE6is2AHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61VGj8HvmBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61KrN+QF6RL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51g8hGeYOQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61KHE0VYDzL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61J9EcInMHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61vKCJnbDxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51PTiHCa5tL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/513gG8fzjvL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61CEpQC3-4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/516jXiU2b8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51qcn-XYLiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51+DbGa38UL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51VXzmWDrtL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51yLfttc2UL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61W4vfp-+LL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51eDeRbh6EL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51XY2ulqylL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61jef1D+QXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ysU3PYz4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61JPNt4Xw+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61nae4Q7bDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61LMJ2098ML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61jC5S-pFBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51Zya5bC2PL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/613+was4nwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51Q2+fhjIHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51nKJh5jPYL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61VgMGtRDhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51w2vdyL4rL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ZuV1DWO2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61bW56-xzKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51PBx5NMdKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51RhuQPpVoL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/51RyJKoz39L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Guu+29zwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/613cSEW+DGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61qN-o07w5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61NE6is2AHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61VGj8HvmBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61KrN+QF6RL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51g8hGeYOQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61KHE0VYDzL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61J9EcInMHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61vKCJnbDxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51PTiHCa5tL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/513gG8fzjvL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61CEpQC3-4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/516jXiU2b8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51qcn-XYLiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51+DbGa38UL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51VXzmWDrtL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51yLfttc2UL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61W4vfp-+LL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51eDeRbh6EL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51XY2ulqylL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61jef1D+QXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ysU3PYz4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61JPNt4Xw+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61nae4Q7bDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61LMJ2098ML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61jC5S-pFBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51Zya5bC2PL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/613+was4nwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51Q2+fhjIHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51nKJh5jPYL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61VgMGtRDhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51w2vdyL4rL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ZuV1DWO2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61bW56-xzKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51PBx5NMdKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51RhuQPpVoL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ February 18, 2024",
    "ASIN ‏": "‎ B0CSDXJ24V",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#23,918 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #406 in Women's Dresses",
    "Customer Reviews": "4.0 4.0 out of 5 stars (1,060)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "X2-geometry",
      "X-green",
      "X2-black Flower",
      "Y-dark Blue",
      "Y-royal Blue",
      "X-brown",
      "X-black",
      "Y-rose",
      "X1-black",
      "X-dark Green",
      "X-pink",
      "X-navy Blue",
      "X1-red Wine",
      "X0-caramel",
      "X0-blackish Green",
      "X-red Wine",
      "Y-dark Green",
      "Y-red",
      "X1-blue",
      "X2-orange Flowers",
      "X-caramel",
      "X1-green",
      "X-beige",
      "X2-tie Green",
      "X-red",
      "X-purple",
      "X-royal Blue",
      "Y-red Wine",
      "X-coffee",
      "X2-leopard",
      "Y-green",
      "X-blue",
      "X-rose"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.0,
    "count": 1060,
    "customers_say": "Customers find the dress comfortable and versatile, suitable for various occasions including graduations, weddings, and semi-formal events. They appreciate its flattering cut, soft material, and consider it a good quality piece that can be dressed up or down. The fit and length receive mixed feedback - while some say it's true to size and the length is perfect, others find it too tight and the sleeves too long. Generated from the text of customer reviews Select to learn more Style (96) Quality (70) Comfort (37) Fabric quality (37) Versatility (32) Flattering (29) Fit (98) Length (36) 96 customers mention style, 87 positive, 9 negative 96 customers mention \"Style\" 87 positive 9 negative Customers find the dress visually appealing, with one customer noting it can be dressed up or down, while another mentions it effectively hides figure flaws. \" Beautiful dress . Perfect for summer . Dress up with heels and lovely purse or dress down with sandals. Length is perfect. lightweight and breathable. \" Read more \" Nothing to dislike, such a pretty dress , helps hide a bit of a tummy with this style. I just need a larger size and will reorder. \" Read more \" ...i had to use my ole sweater bands to hold up the sleves. cute dress . fit well. and it was as pictured. just that the sleeves were too long. \" Read more \" Cute but the size is not accurate. By a smaller size. Material a little cheap. Not sure it will last more then a couple washes. \" Read more 70 customers mention quality, 63 positive, 7 negative 70 customers mention \"Quality\" 63 positive 7 negative Customers find the dress to be of good quality, describing it as a perfect spring and holiday outfit. \" Great dress ! Got a lot of compliments on it. The only reason I didn't give it 5 stars is because the fabric is thin. \" Read more \" Love this dress ! True to size, comfortable and I felt great in it for my 51st birthday. Will be buying in other colors \" Read more \" Nice material nice dress like the style \" Read more \" Xl Love the dress but wish I ordered a size down, put a belt with it and looks cute \" Read more 37 customers mention comfort, 36 positive, 1 negative 37 customers mention \"Comfort\" 36 positive 1 negative Customers find the dress comfortable, with one mentioning it kept them cool in hot weather. \" This dress was bought for a funeral. It was comfortable and easy to wear for the long day. It was flattering on me. I got lots of compliments.... \" Read more \" Super cute on. Not too short and very comfortable . It is lightweight but not see through. I love the color. A nice maroon. Not too red or too pink.... \" Read more \" Fits really well and comfy . Really pretty and good fit. Great for all seasons, work and casual. \" Read more \" ...Looks nice while being super comfortable ! \" Read more 37 customers mention fabric quality, 26 positive, 11 negative 37 customers mention \"Fabric quality\" 26 positive 11 negative Customers like the fabric of the dress, describing it as nice and soft. \" ...Very pretty dress, nice fabric just too large for me. \" Read more \" Nice material nice dress like the style \" Read more \" It’s runs small and the fabric has no give in the boob area they looked flat as a pancake. Not flattering at all.... \" Read more \" The fabric is nice , the look and feel is great. Should have bought more! \" Read more 32 customers mention versatility, 32 positive, 0 negative 32 customers mention \"Versatility\" 32 positive 0 negative Customers find the dress versatile, being perfect for any occasion and summer wear, with one customer noting it works well for both formal and casual settings. \" Beautiful dress . Perfect for summer . Dress up with heels and lovely purse or dress down with sandals. Length is perfect. lightweight and breathable. \" Read more \" ...It's versatile and suits many occasions. It washes very well – I put it in the delicate cycle and hang to dry, and it doesn't require ironing.... \" Read more \" ...sleeves come right above my elbows and just the absolutely perfect dress for any occasion . i received so many compliments.... \" Read more \" PERFECT ANYTIME DRESS IF AS IT SHOULD AND LOOKS GREAT ON. \" Read more 29 customers mention flattering, 23 positive, 6 negative 29 customers mention \"Flattering\" 23 positive 6 negative Customers find the dress flattering, with one mentioning that it can be dressed up or down and another noting that it hides a tummy. \" ...So comfortable and flattering ! It was not boxy like some of these style dresses could be. Obsessed with the color and material.... \" Read more \" ...It fits true to size and is very flattering . The fit and lightweight material make it very comfortable.... \" Read more \" Super Flattering ... \" Read more \" ... Not flattering at all . The arm cuffs were uncomfortable and didn’t give much time to return. Bummed out I couldn’t return \" Read more 98 customers mention fit, 63 positive, 35 negative 98 customers mention \"Fit\" 63 positive 35 negative Customers have mixed opinions about the dress's fit, with some finding it perfect and true to size, while others report it runs small and is too tight all around. \" Love this dress! True to size , comfortable and I felt great in it for my 51st birthday. Will be buying in other colors \" Read more \" ...I ordered the red very true red, BUT it was too big , I ordered the suggested size but it was so big , returning and ordering one size down highly... \" Read more \" Fits true to size . I like to add a belt or long necklace to dress it up. Flattering ruffle on the shoulder. \" Read more \" ...I am plus size and don’t like things tight anywhere on me. Was a great fit and good quality fabric! \" Read more 36 customers mention length, 18 positive, 18 negative 36 customers mention \"Length\" 18 positive 18 negative Customers have mixed opinions about the dress length, with some finding it perfect and hitting right above the knee, while others report it being too short. \" I receive so many compliments when I wear this dress. It is the perfect length (I'm 5'5\") \" Read more \" Really nice dress but too short on my 5’7” body (several inches above my knees). \" Read more \" Super cute on. Not too short and very comfortable. It is lightweight but not see through. I love the color. A nice maroon. Not too red or too pink.... \" Read more \" The dress runs short and the fabric is not as expected. \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Nice for a Semi-Formal Event",
        "body": "This dress looks really cute on and it hangs nicely. I think the size is good and tts. I’m 5’6” 188 lb and carry most of my weight in the belly and I like the way it fits and it doesn’t cling anywhere. If you’re in doubt, I would probably size up. The sleeves don’t go all the way to the wrist. They’re a little bit shorter than wrist length. The length is a few inches above the knee. I think it will be very comfortable. I plan to wear it to a more casual wedding dinner and it will be just right for that. Read more",
        "author": "Nice slip covers but need to be straightened often.",
        "rating": 5.0,
        "date": "November 13, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Great dress, would purchase in other colors",
        "body": "Fun dress for an event, fits true to size. Beautiful quality. Did not wrinkle and looked great all night Read more",
        "author": "Katgirl",
        "rating": 5.0,
        "date": "December 7, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71oB+1SxCzL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Absolute must-have piece in your closet. The perfect dress in your little black dress collection.",
        "body": "I love this dress. It fit true to size and looks way nicer than expected. I would call it nicer than 'casual' though. I have worn it to a wedding, a funeral, and even added sparkly shoes with lots of jewelry for a formal gala type dinner. I purchased black, and now this is one of my 'must have' staples in my closet. Additionally, you can put through the washer and dryer with zero issues. Read more",
        "author": "Momma Jenn",
        "rating": 5.0,
        "date": "October 16, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Flowing and comfortable",
        "body": "This dress works great with some leggings for a nice winter or holiday outfit. I wore it to a concert and was comfortable and it looked quite nice. It is not fitted, but this is what makes it comfortable and cute. Read more",
        "author": "Texastam71",
        "rating": 4.0,
        "date": "May 9, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/719yMfTqz5L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "3.0 out of 5 stars Plunging and short!",
        "body": "The dress itself is really cute. I bought this dress to be able to wear to church. It won’t work. I bought the Small. I am a petite, 5 feet tall, 128 pounds. The neck line was plunging on me, showed way too much cleavage. And barefoot without heels on, it was about 3 inches above my knee way too short. Also, if you have any kind of a chest, it just doesn’t lay right. If I wasn’t buying it specifically for church, I might keep it. Read more",
        "author": "Customer",
        "rating": 3.0,
        "date": "October 16, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Perfect winter dress.",
        "body": "What a perfect cold weather dress. Material is very nice and heavy enough to not be too summery for a winter church dress. The fit is excellent but I am going to send it back. I usually get an XL but I was afraid it would be too small so I ordered an XXL. Way too big for this 5'6\" 175 pound woman. I have ordered it again in 3 colors. Read more",
        "author": "Anita L.",
        "rating": 5.0,
        "date": "November 18, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars I like this dress!",
        "body": "Very nice dress to wear with or without a belt! I love the material,it can be worn in the winter or chilly nights! Read more",
        "author": "Sheila Johnson",
        "rating": 5.0,
        "date": "October 29, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Went up a size and it was a better loose fit, drapes well.",
        "body": "The size suggested was XL, which is usually correct as I am a size 14. I ordered this in XXL as I wanted it loose which would make me feel better. It fits perfect for what I wanted. It hangs well, comfortable and a very flattering cut without being fitted. The only negative is the wrist was very large but not a problem. This certain item had been possibly worn before as there were no attached tags. I am keeping it so that isn’t a problem, just washing it. I am 5’6 192 lbs. Read more",
        "author": "Customer",
        "rating": 5.0,
        "date": "September 21, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress V Neck Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.",
  "about_this_item": "Womens Maxi Dress V Neck Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.",
  "long_description": "Womens Maxi Dress V Neck Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: X2-geometry, X-green, X2-black Flower, Y-dark Blue, Y-royal Blue, X-brown, X-black, Y-rose, X1-black, X-dark Green, X-pink, X-navy Blue, X1-red Wine, X0-caramel. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress V Neck Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: X2-geometry, X-green, X2-black Flower, Y-dark Blue, Y-royal Blue, X-brown, X-black, Y-rose, X1-black, X-dark Green, X-pink, X-navy Blue, X1-red Wine, X0-caramel. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "e2637370-38ac-4029-82ef-b6e8a0cd3d84",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e2637370-38ac-4029-82ef-b6e8a0cd3d84/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e2637370-38ac-4029-82ef-b6e8a0cd3d84/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "78a5ab6d-10e1-42ea-a6a9-cc8f3f3a318d",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/78a5ab6d-10e1-42ea-a6a9-cc8f3f3a318d/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/78a5ab6d-10e1-42ea-a6a9-cc8f3f3a318d/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "bdc1499f-8c7d-415c-bf91-5f54e5bd0521",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bdc1499f-8c7d-415c-bf91-5f54e5bd0521/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bdc1499f-8c7d-415c-bf91-5f54e5bd0521/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "345ca575-daba-4f2e-829e-61db431385fa",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/345ca575-daba-4f2e-829e-61db431385fa/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/345ca575-daba-4f2e-829e-61db431385fa/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "bf6f9ecd-6c9a-4e88-b2f4-5a6de39d110f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bf6f9ecd-6c9a-4e88-b2f4-5a6de39d110f/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bf6f9ecd-6c9a-4e88-b2f4-5a6de39d110f/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "e827657e-605c-4259-a397-2994c8fb16c7",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e827657e-605c-4259-a397-2994c8fb16c7/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e827657e-605c-4259-a397-2994c8fb16c7/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "1eda013b-7aa6-43a9-9747-6bbace0795ab",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1eda013b-7aa6-43a9-9747-6bbace0795ab/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1eda013b-7aa6-43a9-9747-6bbace0795ab/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "f035b7f4-fa62-467e-b554-36f5ead66df7",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f035b7f4-fa62-467e-b554-36f5ead66df7/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f035b7f4-fa62-467e-b554-36f5ead66df7/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "X2-geometry": "https://m.media-amazon.com/images/I/41LCnYCxIsL._AC_SR38,50_.jpg",
    "X-green": "https://m.media-amazon.com/images/I/3194q4fA5yL._AC_SR38,50_.jpg",
    "X2-black Flower": "https://m.media-amazon.com/images/I/41fXaekcfSL._AC_SR38,50_.jpg",
    "Y-dark Blue": "https://m.media-amazon.com/images/I/31DTP0zuuXL._AC_SR38,50_.jpg",
    "Y-royal Blue": "https://m.media-amazon.com/images/I/31B4gRqoLTL._AC_SR38,50_.jpg",
    "X-brown": "https://m.media-amazon.com/images/I/31Di-VOKJdL._AC_SR38,50_.jpg",
    "X-black": "https://m.media-amazon.com/images/I/31f4OXDMhLL._AC_SR38,50_.jpg",
    "Y-rose": "https://m.media-amazon.com/images/I/31Bi7AlLzvL._AC_SR38,50_.jpg",
    "X1-black": "https://m.media-amazon.com/images/I/31tF9EKh31L._AC_SR38,50_.jpg",
    "X-dark Green": "https://m.media-amazon.com/images/I/31r2jQGcNKL._AC_SR38,50_.jpg",
    "X-pink": "https://m.media-amazon.com/images/I/31Z-3xDLmGL._AC_SR38,50_.jpg",
    "X-navy Blue": "https://m.media-amazon.com/images/I/31pqIOLr9tL._AC_SR38,50_.jpg",
    "X1-red Wine": "https://m.media-amazon.com/images/I/31uV3AH0JgL._AC_SR38,50_.jpg",
    "X0-caramel": "https://m.media-amazon.com/images/I/31qE5iRSM8L._AC_SR38,50_.jpg",
    "X0-blackish Green": "https://m.media-amazon.com/images/I/31oA3rXmXaL._AC_SR38,50_.jpg",
    "X-red Wine": "https://m.media-amazon.com/images/I/319A77EddHL._AC_SR38,50_.jpg",
    "Y-dark Green": "https://m.media-amazon.com/images/I/31vHt6vbzcL._AC_SR38,50_.jpg",
    "Y-red": "https://m.media-amazon.com/images/I/31EOcXVY4fL._AC_SR38,50_.jpg",
    "X1-blue": "https://m.media-amazon.com/images/I/31VL0hLNXVL._AC_SR38,50_.jpg",
    "X2-orange Flowers": "https://m.media-amazon.com/images/I/31A5xXuXlCL._AC_SR38,50_.jpg",
    "X-caramel": "https://m.media-amazon.com/images/I/31Nq+v9qDcL._AC_SR38,50_.jpg",
    "X1-green": "https://m.media-amazon.com/images/I/31FNrEGZ3JL._AC_SR38,50_.jpg",
    "X-beige": "https://m.media-amazon.com/images/I/31XpSdeN-jL._AC_SR38,50_.jpg",
    "X2-tie Green": "https://m.media-amazon.com/images/I/41qfiwU7gNL._AC_SR38,50_.jpg",
    "X-red": "https://m.media-amazon.com/images/I/31WCfYgmBQL._AC_SR38,50_.jpg",
    "X-purple": "https://m.media-amazon.com/images/I/31zKRK711oL._AC_SR38,50_.jpg",
    "X-royal Blue": "https://m.media-amazon.com/images/I/31VFSlLS4eL._AC_SR38,50_.jpg",
    "Y-red Wine": "https://m.media-amazon.com/images/I/31+gDHyKA+L._AC_SR38,50_.jpg",
    "X-coffee": "https://m.media-amazon.com/images/I/311ptEfiEmL._AC_SR38,50_.jpg",
    "X2-leopard": "https://m.media-amazon.com/images/I/41zQrAlSFkL._AC_SR38,50_.jpg",
    "Y-green": "https://m.media-amazon.com/images/I/314di7aMo7L._AC_SR38,50_.jpg",
    "X-blue": "https://m.media-amazon.com/images/I/31uPOOwMwFL._AC_SR38,50_.jpg",
    "X-rose": "https://m.media-amazon.com/images/I/31EB7odzO8L._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "X2-geometry": "61KrN+QF6RL",
    "X-green": "51g8hGeYOQL",
    "X2-black Flower": "61KHE0VYDzL",
    "Y-dark Blue": "61J9EcInMHL",
    "Y-royal Blue": "61vKCJnbDxL",
    "X-brown": "51PTiHCa5tL",
    "X-black": "513gG8fzjvL",
    "Y-rose": "61CEpQC3-4L",
    "X1-black": "516jXiU2b8L",
    "X-dark Green": "51qcn-XYLiL",
    "X-pink": "51+DbGa38UL",
    "X-navy Blue": "51VXzmWDrtL",
    "X1-red Wine": "51yLfttc2UL",
    "X0-caramel": "61W4vfp-+LL",
    "X0-blackish Green": "51eDeRbh6EL",
    "X-red Wine": "51XY2ulqylL",
    "Y-dark Green": "61jef1D+QXL",
    "Y-red": "61ysU3PYz4L",
    "X1-blue": "61JPNt4Xw+L",
    "X2-orange Flowers": "61nae4Q7bDL",
    "X-caramel": "61LMJ2098ML",
    "X1-green": "61jC5S-pFBL",
    "X-beige": "51Zya5bC2PL",
    "X2-tie Green": "613+was4nwL",
    "X-red": "51RyJKoz39L",
    "X-purple": "51Q2+fhjIHL",
    "X-royal Blue": "51nKJh5jPYL",
    "Y-red Wine": "61VgMGtRDhL",
    "X-coffee": "51w2vdyL4rL",
    "X2-leopard": "71ZuV1DWO2L",
    "Y-green": "61bW56-xzKL",
    "X-blue": "51PBx5NMdKL",
    "X-rose": "51RhuQPpVoL"
  },
  "color_images": {
    "X2-geometry": [
      "https://m.media-amazon.com/images/I/61KrN+QF6RL._SL1500_.jpg"
    ],
    "X-green": [
      "https://m.media-amazon.com/images/I/51g8hGeYOQL._SL1500_.jpg"
    ],
    "X2-black Flower": [
      "https://m.media-amazon.com/images/I/61KHE0VYDzL._SL1500_.jpg"
    ],
    "Y-dark Blue": [
      "https://m.media-amazon.com/images/I/61J9EcInMHL._SL1500_.jpg"
    ],
    "Y-royal Blue": [
      "https://m.media-amazon.com/images/I/61vKCJnbDxL._SL1500_.jpg"
    ],
    "X-brown": [
      "https://m.media-amazon.com/images/I/51PTiHCa5tL._SL1500_.jpg"
    ],
    "X-black": [
      "https://m.media-amazon.com/images/I/513gG8fzjvL._SL1500_.jpg"
    ],
    "Y-rose": [
      "https://m.media-amazon.com/images/I/61CEpQC3-4L._SL1500_.jpg"
    ],
    "X1-black": [
      "https://m.media-amazon.com/images/I/516jXiU2b8L._SL1500_.jpg"
    ],
    "X-dark Green": [
      "https://m.media-amazon.com/images/I/51qcn-XYLiL._SL1500_.jpg"
    ],
    "X-pink": [
      "https://m.media-amazon.com/images/I/51+DbGa38UL._SL1500_.jpg"
    ],
    "X-navy Blue": [
      "https://m.media-amazon.com/images/I/51VXzmWDrtL._SL1500_.jpg"
    ],
    "X1-red Wine": [
      "https://m.media-amazon.com/images/I/51yLfttc2UL._SL1500_.jpg"
    ],
    "X0-caramel": [
      "https://m.media-amazon.com/images/I/61W4vfp-+LL._SL1500_.jpg"
    ],
    "X0-blackish Green": [
      "https://m.media-amazon.com/images/I/51eDeRbh6EL._SL1500_.jpg"
    ],
    "X-red Wine": [
      "https://m.media-amazon.com/images/I/51XY2ulqylL._SL1500_.jpg"
    ],
    "Y-dark Green": [
      "https://m.media-amazon.com/images/I/61jef1D+QXL._SL1500_.jpg"
    ],
    "Y-red": [
      "https://m.media-amazon.com/images/I/61ysU3PYz4L._SL1500_.jpg"
    ],
    "X1-blue": [
      "https://m.media-amazon.com/images/I/61JPNt4Xw+L._SL1500_.jpg"
    ],
    "X2-orange Flowers": [
      "https://m.media-amazon.com/images/I/61nae4Q7bDL._SL1500_.jpg"
    ],
    "X-caramel": [
      "https://m.media-amazon.com/images/I/61LMJ2098ML._SL1500_.jpg"
    ],
    "X1-green": [
      "https://m.media-amazon.com/images/I/61jC5S-pFBL._SL1500_.jpg"
    ],
    "X-beige": [
      "https://m.media-amazon.com/images/I/51Zya5bC2PL._SL1500_.jpg"
    ],
    "X2-tie Green": [
      "https://m.media-amazon.com/images/I/613+was4nwL._SL1500_.jpg"
    ],
    "X-red": [
      "https://m.media-amazon.com/images/I/51RyJKoz39L._SL1500_.jpg"
    ],
    "X-purple": [
      "https://m.media-amazon.com/images/I/51Q2+fhjIHL._SL1500_.jpg"
    ],
    "X-royal Blue": [
      "https://m.media-amazon.com/images/I/51nKJh5jPYL._SL1500_.jpg"
    ],
    "Y-red Wine": [
      "https://m.media-amazon.com/images/I/61VgMGtRDhL._SL1500_.jpg"
    ],
    "X-coffee": [
      "https://m.media-amazon.com/images/I/51w2vdyL4rL._SL1500_.jpg"
    ],
    "X2-leopard": [
      "https://m.media-amazon.com/images/I/71ZuV1DWO2L._SL1500_.jpg"
    ],
    "Y-green": [
      "https://m.media-amazon.com/images/I/61bW56-xzKL._SL1500_.jpg"
    ],
    "X-blue": [
      "https://m.media-amazon.com/images/I/51PBx5NMdKL._SL1500_.jpg"
    ],
    "X-rose": [
      "https://m.media-amazon.com/images/I/51RhuQPpVoL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress-v-neck-sleeveless",
      "title": "Womens Dress V Neck Sleeveless",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/81T7G18uRnL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-boat-neck-sleeveless",
      "title": "Womens Dress Boat Neck Sleeveless",
      "price": 19.79,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/518oJldZIfL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-formal",
      "title": "Womens Dress Formal",
      "price": 69.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51vneqmjy1L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-bodycon-sleeveless",
      "title": "Womens Dress Bodycon Sleeveless",
      "price": 40.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61nnB4TWroL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 324.43,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/41gTuGV5SBL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-formal-evening",
      "title": "Womens Maxi Dress Formal Evening",
      "price": 94.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61fzKHOQJGL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-ruched-v-neck-cocktail-maxi-formal",
      "title": "Womens Maxi Dress Ruched V Neck Cocktail Maxi Formal",
      "price": 129.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71i8AuwBqUL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-off-shoulder-maxi",
      "title": "Womens Maxi Dress Bodycon Off Shoulder Maxi",
      "price": 36.89,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61DDKd5ehZL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-v-neck-bodycon",
      "title": "Womens Maxi Dress Long Sleeve V Neck Bodycon",
      "price": 47.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61QbwpUJEwL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 76.9,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Wedding Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/514+blcsiGL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening",
      "title": "Womens Maxi Dress Formal Evening",
      "price": 77.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61Hj4-S+4eL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-cocktail-ruched",
      "title": "Womens Maxi Dress Bodycon Cocktail Ruched",
      "price": 37.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/91HL3aBO+gL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-v-neck-cocktail-evening-long-sleeve",
      "title": "Womens Maxi Dress V Neck Cocktail Evening Long Sleeve",
      "price": 64.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/71jdGTmoWkL._SL1500_.jpg"
      ]
    }
  ]
}