{
  "id": "womens-dress-cocktail",
  "handle": "womens-dress-cocktail",
  "sku": "JC1618",
  "asin": "B0CJQ4D8RT",
  "title": "Womens Dress Cocktail",
  "title_original": "Happy Sailed Women's Velvet Dress Fall Fashion Lantern Sleeve High Waist A-Line Skater Cocktail Party Dresses with Belt",
  "brand": "Visit the Happy Sailed Store",
  "price": 53.99,
  "social_proof": {
    "bought_past_month": 335,
    "text": "335+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/714nH89uD8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71e63tDmGML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81lji3-z7WL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71tzSbN1+UL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71RXgbmqstL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71SGdqAPiEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71orutniDyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/7169BURsMAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71tIdaNKwcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Z2Txde+mL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71lsImKwqiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/714Oke2tSXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71djeDvdoGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71OSewyO09L._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/714nH89uD8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71e63tDmGML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81lji3-z7WL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71tzSbN1+UL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71RXgbmqstL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71SGdqAPiEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71orutniDyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/7169BURsMAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71tIdaNKwcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Z2Txde+mL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71lsImKwqiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/714Oke2tSXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71djeDvdoGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71OSewyO09L._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Item model number ‏": "‎ HS5W6116657-P",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ July 28, 2023",
    "ASIN ‏": "‎ B0CBTMFF3D",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#13,685 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #55 in Women's Cocktail Dresses",
    "Customer Reviews": "4.1 4.1 out of 5 stars (353)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Red",
      "Brown",
      "Pink",
      "Blue",
      "Purple",
      "Black",
      "Khaki Ivory Color",
      "Green"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.1,
    "count": 353,
    "customers_say": "Customers find the dress gorgeous with just enough shimmer, and one mentions it's styled well with black knee-high boots. The dress fits well, with one noting it hits perfectly at mid-calf, and customers appreciate its comfort, soft material, and beautiful color. They describe it as flattering, with one customer specifically mentioning it works well for larger ladies, and one noting how the long sleeves balance out the shorter length beautifully. Select to learn more Style Fit Comfort Material quality Soft material Figure flattering Color Length 65 customers mention \"Style\" 58 positive 7 negative Customers appreciate the dress's style, describing it as gorgeous with just enough shimmer that makes it look very expensive. One customer mentions styling it with black knee-high boots, while another notes it can be dressed down for a more casual look. \" Beautiful dress that fits perfectly! Classy and comfortable! 5’5”, 120 wearing a small\" Read more \"This dress is so cute and comfortable. The color is amazing. I like the dress, especially for holidays !!!! But it came without a tag.\" Read more \"...just gorgeous, the material is soft, the length was perfect and is a nice dress you can dress up or down\" Read more \"It's very cute and comfy too. My only complaint is that it's slightly see-through\" Read more 36 customers mention \"Fit\" 31 positive 5 negative Customers find the dress fits well and flatters various body types, with one customer noting it hits perfectly at the mid-calf. \"...It fits true to size , I am approx 200lbs, 5’5”, and I ordered and XL. The material is heavy enough that I wasn’t freezing outside in Midwest October....\" Read more \"Elegant soft gold color is not over powering. Provides a flattering fit with fabric belt to clinch waist. It’s soft, comfortable, and functional.\" Read more \"This was a nice party dress for the price. Fit was good and material good quality. Price was excellent too\" Read more \"It is pretty and fits well . It’s a little brighter than I anticipated but will be perfect for a Christmas event\" Read more 23 customers mention \"Comfort\" 23 positive 0 negative Customers find the dress comfortable. \"This dress is so cute and comfortable . The color is amazing. I like the dress, especially for holidays !!!! But it came without a tag.\" Read more \"Very soft and comfy . Feels great, but makes me look a little frumpy. Would look great on someone much thinner than I am.\" Read more \"Loved this dress! Bought to wear to a wedding. Very comfortable and easily dressed up! Could dress down for a more casual look also!...\" Read more \"Beautiful dress! So comfortable and flattering!...\" Read more 20 customers mention \"Material quality\" 18 positive 2 negative Customers love the material of the dress, with one customer noting its flowy texture and another mentioning its subtle shimmer, while another appreciates its breathability for dancing. \"Beautiful color and fabric . However the waistband doesn’t hit me well and tend to ride up. Not a fan of the belt....\" Read more \"...Quality is good. Material is flowy and lightweight. I'd say it's a bit longer on me than the model but I have shorter legs/longer torso.\" Read more \"...Love the long sleeves for winter time. Pretty material !\" Read more \"Fit, color, feel of fabric , cut, figure flattering..over all great for curvy ladies...wish you added few more larger sizes...\" Read more 20 customers mention \"Soft material\" 18 positive 2 negative Customers appreciate the dress's soft material, with one describing it as luxurious and another noting its velvety texture. \"...Provides a flattering fit with fabric belt to clinch waist. It’s soft , comfortable, and functional.\" Read more \" Very soft and comfy. Feels great, but makes me look a little frumpy. Would look great on someone much thinner than I am.\" Read more \"Dress is as exactly as pictured! Absolutely beautiful! Try to size, super soft , and made from great material!\" Read more \" Beautiful soft dress with a little shimmer. Not over the top, just right.\" Read more 18 customers mention \"Figure flattering\" 17 positive 1 negative Customers find the dress flattering, with one mentioning it hugs in all the right places. \"I really like this dress. It's comfortable and flattering . It would be nice if it was just a couple inches longer....\" Read more \"This is a super flattering dress and it's really comfortable! The material is great and soft but that thick weighted material so it falls perfectly....\" Read more \"Fit, color, feel of fabric, cut, figure flattering ..over all great for curvy ladies...wish you added few more larger sizes...\" Read more \"This dress is so flattering ! I was unsure with the pictures but they don’t do it justice. This would be great for a holiday or family pics.\" Read more 16 customers mention \"Color\" 14 positive 2 negative Customers like the dress's color. \" Beautiful color and fabric. However the waistband doesn’t hit me well and tend to ride up. Not a fan of the belt....\" Read more \"The fabric and color are gorgeous . Very soft. The subtle shimmer makes this beautiful and very expensive looking....\" Read more \"...the perfect dress for the holidays - modest, pretty, nice length, gorgeous color but too late.\" Read more \"This dress is so cute and comfortable. The color is amazing . I like the dress, especially for holidays !!!! But it came without a tag.\" Read more 15 customers mention \"Length\" 11 positive 4 negative Customers like the dress's length, with one mentioning that the long sleeves complement the shorter part beautifully. \"...the purple and it is just gorgeous, the material is soft, the length was perfect and is a nice dress you can dress up or down\" Read more \"The material was soft and I loved the long sleeves but at 5’11” I did not like how short it was, also the material was see through and it came with...\" Read more \"I likes this a lot. It was a little short so I’ll be returning it but the quality was good and the material felt soft.\" Read more \"...I'm 5'2\" and the length was great for me . The fabric is very lightweight, so I wouldn't recommend it if you're looking for something warm....\" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Chic, Flattering & Perfect for Any Occasion!",
        "body": "This velvet long sleeved, mini dress is stunning! The velvet fabric feels soft, luxurious, and has just the right amount of stretch for a comfortable yet flattering fit. The long sleeve balance out the shorter length beautifully, giving it a classy, but still fun look. It hugs in all the right places without feeling too tight, and the material has a subtle shimmer that makes it perfect for evenings out, holiday parties, or date night. I love that it’s easy to dress up with heels and accessories, but still simple enough to wear with boots for a more casual vibe. The quality is impressive for the price – no loose threads, nice stitching, and it holds its shape well. Overall, it’s a gorgeous, versatile piece that makes me confident every time I wear it! Read more",
        "author": "Carissa M",
        "rating": 5.0,
        "date": "August 19, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars BUY IT!",
        "body": "LOVE! Wore to a fall wedding and felt so gorgeous! This dress is so pretty and so comfy. The elastic waist gives it shape but is not too tight or uncomfortable. It fits true to size, I am approx 200lbs, 5’5”, and I ordered and XL. The material is heavy enough that I wasn’t freezing outside in Midwest October. I saw other reviews about it being see through, which it was when I held it up to the light but not noticeable when I was wearing it out. Would definitely pick this dress again for my next event! Read more",
        "author": "Talie",
        "rating": 5.0,
        "date": "October 31, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61clHMIikfL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/610GZcBSvfL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "4.0 out of 5 stars Nice dress for wedding",
        "body": "The dress is pretty nice, fits true to size. I wish the color was more shimmery but it will be nice for a holiday party or wedding. Quality is good. Material is flowy and lightweight. I'd say it's a bit longer on me than the model but I have shorter legs/longer torso. Read more",
        "author": "SRA",
        "rating": 4.0,
        "date": "November 25, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71AcZw9Ju2L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Beautiful green!",
        "body": "Beautiful dress that fits perfectly! Classy and comfortable! 5’5”, 120 wearing a small Read more",
        "author": "C. Speck",
        "rating": 5.0,
        "date": "December 11, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/81I8XRgCPSL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "3.0 out of 5 stars Missing belt!! :-(",
        "body": "My Dress came, and it's very nice and comfortable, but the belt was missing! :-( , wish they would send the belt or I'll have to go out and but something else they will work as a belt for this dress before my Christmas party! Read more",
        "author": "Mel k.",
        "rating": 3.0,
        "date": "December 1, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "1.0 out of 5 stars It looks shiny and velvety, just came in a very used condition with a fabric softener smell.",
        "body": "Came without a tag, inside out and has a very strong smell of fabric softener. Not sure if it was a return? But I am returning it. It is a very cute dress and will consider reordering. Read more",
        "author": "Mandi",
        "rating": 1.0,
        "date": "August 1, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars True to size and flattering.",
        "body": "Fits true to size, very flattering and I’m pregnant. Read more",
        "author": "Logan Neely",
        "rating": 5.0,
        "date": "December 10, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Dress material",
        "body": "Pretty color and style!! Material super thin and see thru. Read more",
        "author": "Haley chavis",
        "rating": 5.0,
        "date": "December 13, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Dress Cocktail is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.",
  "about_this_item": "Womens Dress Cocktail is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.",
  "long_description": "Womens Dress Cocktail is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Red, Brown, Pink, Blue, Purple, Black, Khaki Ivory Color, Green. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Dress Cocktail is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Red, Brown, Pink, Blue, Purple, Black, Khaki Ivory Color, Green. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "4f60502b-47c0-4305-a572-4ce7b65e665d",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4f60502b-47c0-4305-a572-4ce7b65e665d/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4f60502b-47c0-4305-a572-4ce7b65e665d/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "aab59a80-8e52-437b-a8ae-4fd3f40db2cc",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/aab59a80-8e52-437b-a8ae-4fd3f40db2cc/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/aab59a80-8e52-437b-a8ae-4fd3f40db2cc/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "7b10a594-18de-481e-9c8a-a8d36c7b9658",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7b10a594-18de-481e-9c8a-a8d36c7b9658/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7b10a594-18de-481e-9c8a-a8d36c7b9658/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "0fc330f1-ee66-4da0-8431-63900d2ef74f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0fc330f1-ee66-4da0-8431-63900d2ef74f/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0fc330f1-ee66-4da0-8431-63900d2ef74f/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "77f0820d-00db-4e60-ba30-65b4831dabef",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/77f0820d-00db-4e60-ba30-65b4831dabef/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/77f0820d-00db-4e60-ba30-65b4831dabef/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "a31cda5f-bf89-4d5f-86a2-2560eb18d4f8",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a31cda5f-bf89-4d5f-86a2-2560eb18d4f8/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a31cda5f-bf89-4d5f-86a2-2560eb18d4f8/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "de51e2f2-7d75-4b11-8c7a-793171d11a49",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/de51e2f2-7d75-4b11-8c7a-793171d11a49/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/de51e2f2-7d75-4b11-8c7a-793171d11a49/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "53f5fd50-f378-49f5-9155-4df9882ecdb4",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/53f5fd50-f378-49f5-9155-4df9882ecdb4/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/53f5fd50-f378-49f5-9155-4df9882ecdb4/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "690bf6b0-40ab-4b31-9e05-00059a0b37b2",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/690bf6b0-40ab-4b31-9e05-00059a0b37b2/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/690bf6b0-40ab-4b31-9e05-00059a0b37b2/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "e4ac3fbd-0b17-4dd2-aa0a-1ace9a1bc7e9",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e4ac3fbd-0b17-4dd2-aa0a-1ace9a1bc7e9/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e4ac3fbd-0b17-4dd2-aa0a-1ace9a1bc7e9/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "d739aaa2-939d-45f3-a327-4b7afe4ebd02",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d739aaa2-939d-45f3-a327-4b7afe4ebd02/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d739aaa2-939d-45f3-a327-4b7afe4ebd02/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "9c6bd2c2-ce1e-4f3b-afa5-40a63ed7e434",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9c6bd2c2-ce1e-4f3b-afa5-40a63ed7e434/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9c6bd2c2-ce1e-4f3b-afa5-40a63ed7e434/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Red": "https://m.media-amazon.com/images/I/51Afalgt-yL._AC_SR38,50_.jpg",
    "Brown": "https://m.media-amazon.com/images/I/41dlVwB5SjL._AC_SR38,50_.jpg",
    "Pink": "https://m.media-amazon.com/images/I/41G6kr7ZkML._AC_SR38,50_.jpg",
    "Blue": "https://m.media-amazon.com/images/I/51KwMe5PeRL._AC_SR38,50_.jpg",
    "Purple": "https://m.media-amazon.com/images/I/412yA+XP1vL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/41pNVejpsiL._AC_SR38,50_.jpg",
    "Khaki Ivory Color": "https://m.media-amazon.com/images/I/412EgChrLGL._AC_SR38,50_.jpg",
    "Green": "https://m.media-amazon.com/images/I/51U654ZcpXL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Red": "7169BURsMAL",
    "Brown": "71tIdaNKwcL",
    "Pink": "714nH89uD8L",
    "Blue": "71Z2Txde+mL",
    "Purple": "71lsImKwqiL",
    "Black": "714Oke2tSXL",
    "Khaki Ivory Color": "71djeDvdoGL",
    "Green": "71OSewyO09L"
  },
  "color_images": {
    "Red": [
      "https://m.media-amazon.com/images/I/7169BURsMAL._SL1500_.jpg"
    ],
    "Brown": [
      "https://m.media-amazon.com/images/I/71tIdaNKwcL._SL1500_.jpg"
    ],
    "Pink": [
      "https://m.media-amazon.com/images/I/714nH89uD8L._SL1500_.jpg"
    ],
    "Blue": [
      "https://m.media-amazon.com/images/I/71Z2Txde+mL._SL1500_.jpg"
    ],
    "Purple": [
      "https://m.media-amazon.com/images/I/71lsImKwqiL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/714Oke2tSXL._SL1500_.jpg"
    ],
    "Khaki Ivory Color": [
      "https://m.media-amazon.com/images/I/71djeDvdoGL._SL1500_.jpg"
    ],
    "Green": [
      "https://m.media-amazon.com/images/I/71OSewyO09L._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-ruched-long-sleeve-off-shoulder",
      "title": "Womens Maxi Dress Ruched Long Sleeve Off Shoulder",
      "price": 65.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/610S-XUGzwL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-sleeveless-v-neck-cocktail-maxi-bodycon",
      "title": "Womens Maxi Dress Sleeveless V Neck Cocktail Maxi Bodycon",
      "price": 44.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51eoMzKwaqL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-formal-cocktail",
      "title": "Womens Maxi Dress Long Sleeve Formal Cocktail",
      "price": 45.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/610egGe2LwL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-v-neck-ruched",
      "title": "Womens Maxi Dress Long Sleeve V Neck Ruched",
      "price": 41.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/41nKZb3yrHL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 33.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61W5l+uioHL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-evening",
      "title": "Womens Maxi Dress Evening",
      "price": 72.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61ifQNM1WAL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening",
      "title": "Womens Maxi Dress Evening",
      "price": 66.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61jhboT-KdL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-bodycon-ruched-off-shoulder",
      "title": "Womens Maxi Dress Cocktail Bodycon Ruched Off Shoulder",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/51pNtXYlEDL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 70.57,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/512WgWMyYLL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-one-shoulder-formal-mermaid",
      "title": "Womens Maxi Dress Evening One Shoulder Formal Mermaid",
      "price": 69.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/613xHpbpN5L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-off-shoulder",
      "title": "Womens Dress Off Shoulder",
      "price": 93.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71+G9PIEq1L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-short-sleeve",
      "title": "Womens Dress Short Sleeve",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61Gm5oBtjDL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-bodycon-cocktail",
      "title": "Womens Dress Bodycon Cocktail",
      "price": 55.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61k-qoz2M6L._SL1500_.jpg"
      ]
    }
  ]
}