{
  "id": "womens-maxi-dress-ruched-long-sleeve-bodycon",
  "handle": "womens-maxi-dress-ruched-long-sleeve-bodycon",
  "sku": "JC1551",
  "asin": "B0CJJF4CG4",
  "title": "Womens Maxi Dress Ruched Long Sleeve Bodycon",
  "title_original": "GOBLES Women's Sexy Off The Shoulder Slope Neck Long Sleeve Ruched Bodycon Mini Club Dress",
  "brand": "Visit the GOBLES Store",
  "price": 31.99,
  "social_proof": {
    "bought_past_month": 808,
    "text": "808+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/51zwWMjriiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71KfEekjDIL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81uSvO+63fL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71+6JzEf25L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/718JG2+oJQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Hf54UgGDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71xGD+qMQhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61bm-rfysgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71q+nZC7N5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81tWoxzdPwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81fkeZpyIRL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71hq60MXVRL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Zk6LsKgRL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71JbuBaO1vL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61LODc6E3QL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71bZOOGIs+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81EA302NksL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81+o+5VQkhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/716xmCl-pJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71vdwwz7l9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71iSJqd60CL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/51zwWMjriiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71KfEekjDIL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81uSvO+63fL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71+6JzEf25L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/718JG2+oJQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Hf54UgGDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71xGD+qMQhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61bm-rfysgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71q+nZC7N5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81tWoxzdPwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81fkeZpyIRL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71hq60MXVRL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Zk6LsKgRL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71JbuBaO1vL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61LODc6E3QL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71bZOOGIs+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81EA302NksL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81+o+5VQkhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/716xmCl-pJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71vdwwz7l9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71iSJqd60CL._SL1500_.jpg"
  ],
  "aplus_images": [
    "https://m.media-amazon.com/images/I/41YslhTz43L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/312yAHwBOwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31wlTTYvHfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/313Qu9HrikL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41ZWM270lbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51MWyKTr8lL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/417rfbT7fbL._SL1500_.jpg"
  ],
  "description_images": [
    "https://m.media-amazon.com/images/I/41YslhTz43L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/312yAHwBOwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31wlTTYvHfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/313Qu9HrikL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41ZWM270lbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51MWyKTr8lL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/417rfbT7fbL._SL1500_.jpg"
  ],
  "bullets": [],
  "specs": {
    "Item model number ‏": "‎ GO306",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ September 21, 2023",
    "ASIN ‏": "‎ B0CJJ996KV",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#82,439 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #481 in Women's Club & Night Out Dresses #1,264 in Women's Casual Dresses",
    "Customer Reviews": "4.3 4.3 out of 5 stars (212)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Red",
      "White",
      "Black"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.3,
    "count": 212,
    "customers_say": "Customers find this dress gorgeous and well-made, with a thick fabric that hugs the body in the right spots. The dress offers a perfect fit, with one customer noting it's double-lined for comfort, and customers appreciate its stretchiness. They describe it as comfortable and true to size, with one mentioning it's suitable for dinner and various occasions. Generated from the text of customer reviews Select to learn more Design (31) Fit (24) Quality (21) Material quality (19) Comfort (13) Flattering (12) Size (9) Stretchiness (9) 31 customers mention design, 30 positive, 1 negative 31 customers mention \"Design\" 30 positive 1 negative Customers love the dress's design, describing it as absolutely gorgeous. \" ...It's sexy and I love the detail of the one shoulder. Fits really nice and is nice and stretchy. Great value for the money. \" Read more \" This is a beautiful dress . I loved the vibrant color and the snatching that the fabric gave me. I recommend this dress. \" Read more \" This dress is so flattering and cute . Wore to a concert and received many compliments. \" Read more \" This dress is so affordable and classy . It got a bit of stretch to it. Put it together with the right accessories and you will look fabulous.... \" Read more 24 customers mention fit, 21 positive, 3 negative 24 customers mention \"Fit\" 21 positive 3 negative Customers are satisfied with how the dress fits, with one mentioning it's double lined for comfort and another noting its off-the-shoulder neckline. \" I like how form fitting this dress it. \" Read more \" Perfect dress, fits perfectly . Definitely will buy other colors. If you’re thinking about it buy ittttt! Dress it also thick sleeves are long. \" Read more \" ...soft, and has the perfect amount of stretch for a comfortable yet flattering fit . The color is a rich, vibrant red that stands out beautifully.... \" Read more \" This dress was a show stopper! I got lots of compliments. Super fitted and comfortable. My favorite part was the flared sleeves. Great material. \" Read more 21 customers mention quality, 20 positive, 1 negative 21 customers mention \"Quality\" 20 positive 1 negative Customers find the dress to be well-made and of great quality. \" Great quality ! I love it! \" Read more \" Love this dress ! I just wish it was a different material. \" Read more \" Such a great dress . Sucks you in and snatches you. I’m between a medium and small. I have a smaller chest, average waist and larger butt/thighs.... \" Read more \" It feels so soft and nice . Fits perfectly and it’s not see through \" Read more 19 customers mention material quality, 15 positive, 4 negative 19 customers mention \"Material quality\" 15 positive 4 negative Customers like the dress's material, noting it feels thick and nice, with one customer describing it as buttery soft. \" Cute. It looks just like the image. Fabric is thick and not see through. \" Read more \" The material is like BUTTER ! And not see through. As you can tell I’m plus size I got a large I didn’t have to constantly pull it down.... \" Read more \" I loved this dress the material was so nice then I loved the way it hugged my body in the right spots \" Read more \" Cheap fabric do not buy I purchased the red version on the dress, you can not wear any type of jewelry if you do the dress will get ruined that type... \" Read more 13 customers mention comfort, 12 positive, 1 negative 13 customers mention \"Comfort\" 12 positive 1 negative Customers find the dress comfortable. \" Comfy ! Sexy! True to size. \" Read more \" ...I got lots of compliments. Super fitted and comfortable . My favorite part was the flared sleeves. Great material. \" Read more \" Has ruching in all the right places, matieral soft & strechy Downside came with stains but was able to get them out with shout stain remover \" Read more \" So comfortable and super flattering! True to size \" Read more 12 customers mention flattering, 11 positive, 1 negative 12 customers mention \"Flattering\" 11 positive 1 negative Customers find the dress flattering and figure-hugging, with one customer noting how it holds the body. \" This dress is so flattering and cute. Wore to a concert and received many compliments. \" Read more \" ...It hugs in all the right places without feeling too tight, and the design is both elegant and classy.... \" Read more \" So comfortable and super flattering ! True to size \" Read more \" Very nice dress. Super comfortable, easy to take on and off. It’s very flattering too. Would be great for a night out or maybe even a wedding.... \" Read more 9 customers mention size, 9 positive, 0 negative 9 customers mention \"Size\" 9 positive 0 negative Customers find the dress true to size, with one mentioning it's suitable for dinner and various occasions, while another notes it's great for a night out. \" This dress is so cute! True to size and double lined so it fits real nice and is not see-through. \" Read more \" This dress was a show stopper ! I got lots of compliments. Super fitted and comfortable. My favorite part was the flared sleeves. Great material. \" Read more \" ...It’s very flattering too. Would be great for a night out or maybe even a wedding. Very elegant! \" Read more \" ... Great for date night . \" Read more 9 customers mention stretchiness, 9 positive, 0 negative 9 customers mention \"Stretchiness\" 9 positive 0 negative Customers like the dress's stretchiness, with one mentioning that the material can expand. \" I love this dress. The quality is perfect. Thick and stretchy and I love how the neck dips off the shoulder. I love the overly long sleeves.... \" Read more \" ...The fabric is high-quality, soft, and has the perfect amount of stretch for a comfortable yet flattering fit.... \" Read more \" I love it!! Stretchiness , perfect fit \" Read more \" This dress is so affordable and classy. It got a bit of stretch to it . Put it together with the right accessories and you will look fabulous.... \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Good material",
        "body": "Absolutely Stunning Red Dress! I am beyond thrilled with this red dress! The fabric is high-quality, soft, and has the perfect amount of stretch for a comfortable yet flattering fit. The color is a rich, vibrant red that stands out beautifully. It hugs in all the right places without feeling too tight, and the design is both elegant and classy. I received so many compliments when I wore it to an event! Shipping was fast, and the dress arrived in perfect condition. If you're looking for a show-stopping outfit, this is the one. Highly recommend! Read more",
        "author": "Shanice❤️",
        "rating": 5.0,
        "date": "February 3, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Sexy and great quality!",
        "body": "Great quality dress! Double lined so I feel very secure in it and the fabric feels thick. It's sexy and I love the detail of the one shoulder. Fits really nice and is nice and stretchy. Great value for the money. Read more",
        "author": "shanhookah",
        "rating": 5.0,
        "date": "January 21, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Sexy",
        "body": "This dress is so affordable and classy. It got a bit of stretch to it. Put it together with the right accessories and you will look fabulous. The quality is not bad either, and it fits close but not tight just a really nice feel and fit Read more",
        "author": "Tiffany",
        "rating": 5.0,
        "date": "January 13, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61+P8YoNXaL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/6102kfyGWGL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Very Classy",
        "body": "The dress quality is great , it hugs my body and is suitable for dinner and various occasions, it’s stretchy and is worth every penny spent .. Read more",
        "author": "Marika",
        "rating": 5.0,
        "date": "January 8, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Perfect",
        "body": "Beautiful dress Read more",
        "author": "Customer",
        "rating": 4.0,
        "date": "March 9, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Buy Itttttttttt!!!",
        "body": "Perfect dress, fits perfectly. Definitely will buy other colors. If you’re thinking about it buy ittttt! Dress it also thick sleeves are long. Read more",
        "author": "Shay Williams",
        "rating": 5.0,
        "date": "November 28, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/714ZHaYCRVL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "1.0 out of 5 stars Cheap fabric",
        "body": "Cheap fabric do not buy I purchased the red version on the dress, you can not wear any type of jewelry if you do the dress will get ruined that type fabric. I will be returning Read more",
        "author": "yourhonestbestie",
        "rating": 1.0,
        "date": "November 17, 2023",
        "verified": false,
        "images": []
      },
      {
        "title": "2.0 out of 5 stars wrong color, beautiful dress",
        "body": "Dress is beautiful but i ordered a black dress and was send the brownish nude one. slightly disappointed. Read more",
        "author": "Maya G",
        "rating": 2.0,
        "date": "September 18, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Ruched Long Sleeve Bodycon is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.",
  "about_this_item": "Womens Maxi Dress Ruched Long Sleeve Bodycon is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.",
  "long_description": "Womens Maxi Dress Ruched Long Sleeve Bodycon is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Red, White, Black. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Ruched Long Sleeve Bodycon is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/41YslhTz43L._SL1500_.jpg",
      "alt": "Womens Maxi Dress Ruched Long Sleeve Bodycon details image 1"
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/312yAHwBOwL._SL1500_.jpg",
      "alt": "Womens Maxi Dress Ruched Long Sleeve Bodycon details image 2"
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/31wlTTYvHfL._SL1500_.jpg",
      "alt": "Womens Maxi Dress Ruched Long Sleeve Bodycon details image 3"
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/313Qu9HrikL._SL1500_.jpg",
      "alt": "Womens Maxi Dress Ruched Long Sleeve Bodycon details image 4"
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Red, White, Black. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/41ZWM270lbL._SL1500_.jpg",
      "alt": "Womens Maxi Dress Ruched Long Sleeve Bodycon details image 5"
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "c45628a6-83a8-4625-a05e-f2c3dca8d74c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c45628a6-83a8-4625-a05e-f2c3dca8d74c/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c45628a6-83a8-4625-a05e-f2c3dca8d74c/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "67dbb604-bc2b-44fc-b745-d2323c45fee8",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/67dbb604-bc2b-44fc-b745-d2323c45fee8/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/67dbb604-bc2b-44fc-b745-d2323c45fee8/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "8cec8a14-98c7-443a-adaa-5cfc0d5821c2",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8cec8a14-98c7-443a-adaa-5cfc0d5821c2/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8cec8a14-98c7-443a-adaa-5cfc0d5821c2/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "187c4fc9-3eb5-4391-8de9-a84cea87b14a",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/187c4fc9-3eb5-4391-8de9-a84cea87b14a/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/187c4fc9-3eb5-4391-8de9-a84cea87b14a/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "90277ba0-a8f8-46b6-9642-737c3a5cb156",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/90277ba0-a8f8-46b6-9642-737c3a5cb156/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/90277ba0-a8f8-46b6-9642-737c3a5cb156/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "10f70b57-d2ac-43ba-8841-fb34bf93beb6",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/10f70b57-d2ac-43ba-8841-fb34bf93beb6/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/10f70b57-d2ac-43ba-8841-fb34bf93beb6/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "50ad0ecd-3888-4932-a7ee-2cce93ac56d8",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/50ad0ecd-3888-4932-a7ee-2cce93ac56d8/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/50ad0ecd-3888-4932-a7ee-2cce93ac56d8/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "68992dc4-6ccf-4e7a-8c7a-63653cde8910",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/68992dc4-6ccf-4e7a-8c7a-63653cde8910/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/68992dc4-6ccf-4e7a-8c7a-63653cde8910/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "8323f037-34ca-40ae-a42a-c5c02a6c9ff8",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8323f037-34ca-40ae-a42a-c5c02a6c9ff8/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8323f037-34ca-40ae-a42a-c5c02a6c9ff8/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "14197a34-be11-4169-8f51-f1522f9fff7e",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/14197a34-be11-4169-8f51-f1522f9fff7e/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/14197a34-be11-4169-8f51-f1522f9fff7e/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "657da5b4-9ae5-47d9-a847-a8e357ac0081",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/657da5b4-9ae5-47d9-a847-a8e357ac0081/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/657da5b4-9ae5-47d9-a847-a8e357ac0081/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Red": "https://m.media-amazon.com/images/I/41rnFrbSSkL._AC_SR38,50_.jpg",
    "White": "https://m.media-amazon.com/images/I/31g4Fe6tlWL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31rjOew37lL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Red": "61bm-rfysgL",
    "White": "61LODc6E3QL",
    "Black": "51zwWMjriiL"
  },
  "color_images": {
    "Red": [
      "https://m.media-amazon.com/images/I/61bm-rfysgL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71q+nZC7N5L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81tWoxzdPwL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81fkeZpyIRL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71hq60MXVRL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71Zk6LsKgRL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71JbuBaO1vL._SL1500_.jpg"
    ],
    "White": [
      "https://m.media-amazon.com/images/I/61LODc6E3QL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71bZOOGIs+L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81EA302NksL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81+o+5VQkhL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/716xmCl-pJL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71vdwwz7l9L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71iSJqd60CL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/51zwWMjriiL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71KfEekjDIL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81uSvO+63fL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71+6JzEf25L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/718JG2+oJQL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71Hf54UgGDL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71xGD+qMQhL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-long-sleeve-one-shoulder-bodycon",
      "title": "Womens Maxi Dress Long Sleeve One Shoulder Bodycon",
      "price": 25.95,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/61TOJU-dkgL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 34.39,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71l7SpDyHyL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 242.55,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61YEzN0MyBL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-bodycon-cocktail-formal-ruched",
      "title": "Womens Dress Bodycon Cocktail Formal Ruched",
      "price": 43.39,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51eAtybOXyL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-mermaid",
      "title": "Womens Dress Mermaid",
      "price": 239.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61lZaNp9s1L._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-long-sleeve-bodycon",
      "title": "Womens Maxi Dress Long Sleeve Bodycon",
      "price": 42.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/617bKl41xVL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 47.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61-lxeYStCL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-long-sleeve-evening",
      "title": "Womens Maxi Dress Formal Long Sleeve Evening",
      "price": 76.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61KQSs2k72L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-long-sleeve-v-neck-ruched-bodycon",
      "title": "Womens Maxi Dress Cocktail Long Sleeve V Neck Ruched Bodycon",
      "price": 53.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61u2cS0RRdL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 56.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/81-Ei6AlfUL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-long-sleeve-ruched-cocktail-off-shoulder-bodycon",
      "title": "Womens Maxi Dress Formal Long Sleeve Ruched Cocktail Off Shoulder Bodycon",
      "price": 46.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71xihJgY9BL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-formal-evening",
      "title": "Womens Maxi Dress Maxi Formal Evening",
      "price": 52.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61NaRoByawL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 165.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/614rKT8yRfL._SL1500_.jpg"
      ]
    }
  ]
}