{
  "id": "womens-maxi-dress-long-sleeve-v-neck",
  "handle": "womens-maxi-dress-long-sleeve-v-neck",
  "sku": "JC1403",
  "asin": "B0CKPB7NW1",
  "title": "Womens Maxi Dress Long Sleeve V Neck",
  "title_original": "Dokotoo Winter Dresses for Women Trendy V Neck Knit A Line Long Sleeve Dress Sweater Dress",
  "brand": "Visit the Dokotoo Store",
  "price": 35.99,
  "social_proof": {
    "bought_past_month": 927,
    "text": "927+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/61c+AgO3PGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81E-pbpFxNL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81dbrvt9w2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61KZx5MECHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61tVySH-7WL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71WaRHvvHGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/716xn8Hx9EL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/618unrM4DoL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71j-6R47l4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/717oAfWRHCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/619OVKv0rkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Vj4uPH7JL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/711NUloaU7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71LGE7GzfEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71KZ-9d5TjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/713haG2YXLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71RyZ55tc4L._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/61c+AgO3PGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81E-pbpFxNL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81dbrvt9w2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61KZx5MECHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61tVySH-7WL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71WaRHvvHGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/716xn8Hx9EL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/618unrM4DoL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71j-6R47l4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/717oAfWRHCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/619OVKv0rkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Vj4uPH7JL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/711NUloaU7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71LGE7GzfEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71KZ-9d5TjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/713haG2YXLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71RyZ55tc4L._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ July 17, 2023",
    "ASIN ‏": "‎ B0CC21XJBD",
    "Best Sellers Rank": "#34,114 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #354 in Women's Casual Dresses",
    "Customer Reviews": "4.2 4.2 out of 5 stars (1,004)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Light Blue",
      "A1 Apricot",
      "A1 Black",
      "Ashleigh Blue",
      "A1 Gray",
      "A1 Green",
      "Simply Taupe",
      "Mist Green",
      "A1 Pink",
      "Sea Green"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.2,
    "count": 1004,
    "customers_say": "Customers find the dress fits well, with one noting it hits below the knees, and appreciate its simple style that matches the product photos. Moreover, the dress is well-made, comfortable, and flattering, with one customer mentioning it shows off their figure nicely. Additionally, the fabric receives positive feedback for its soft texture, and customers like its size, with one noting it keeps dresses from ballooning out. Generated from the text of customer reviews Select to learn more Fit (134) Style (107) Quality (72) Comfort (68) Flattering (45) Fabric softness (43) Material quality (37) Size (36) 134 customers mention fit, 100 positive, 34 negative 134 customers mention \"Fit\" 100 positive 34 negative Customers are satisfied with how the dress fits, particularly noting that it works well for pink events and has a good length, with one customer mentioning that the sleeves are wide enough. \" Great fit and comfortable! Beautiful color. Wore with tall boots in the winter and was warm enough \" Read more \" So cute, perfect size and fit . Love the color on me. The fabric is soft and warm. Looks amazing with boots. \" Read more \" My daughter ordrrrd this for Xmas and hated it was too long and too fitted at her waist unlike picture showed! \" Read more \" Love the fit and the soft material. Not to thick, not to thin. Very flattering on. Hopefully the washing will hold up. \" Read more 107 customers mention style, 105 positive, 2 negative 107 customers mention \"Style\" 105 positive 2 negative Customers like the dress's style, finding it cute and true to the picture, with one customer specifically mentioning it works well for church events. \" This is such a cute and warm dress! It’s literally my favorite dress that I own now! The fabric is thick but breathable.... \" Read more \" Cute dress . The material is really soft and not too thick or too thin. Overall I really liked it but it was just too long for my taste.... \" Read more \" Very nice dress . Not too heavy. It was perfect for my job. It was very comfortable. I would love it in every color. ❤️ \" Read more \" Very cute . Will try to upload photo soon. Quality is nice and as expected. Small fits me well and has decent amount of stretch for bust area. \" Read more 72 customers mention quality, 68 positive, 4 negative 72 customers mention \"Quality\" 68 positive 4 negative Customers find the dress to be well-made, with one customer noting that the seams are well stitched. \" It’s a nice dress with soft color, comfy material and nice texture, perfect dress for fall and church, but unfortunately they don’t have size XS for... \" Read more \" ...5 feet, so pretty curvy booty & this is so flattering, sexy & great quality ! I ordered a small & love the fit! \" Read more \" Great dress but the XL was too big. Returned for a large \" Read more \" ...Color is as shown, true to size and nice quality . It wasn't too thin or too heavy and was soft and comfortable.... \" Read more 68 customers mention comfort, 67 positive, 1 negative 68 customers mention \"Comfort\" 67 positive 1 negative Customers find the dress comfortable, with one mentioning that the material is not itchy and another noting they didn't sweat while wearing it. \" ...I am about a 34G. Material is soft and comfortable , not super heavy. I probably could have sized down but I don't like my sleeves to be too short.... \" Read more \" Very comfortable and firm fitting without being tight and restrictive. Loved this sweater dress. Wore them with tights and boots and was so cute.... \" Read more \" I love this dress! Its comfy and fits pretty well. I did have to tighten it a little bit around my waist but besides that, i absolutely adore it.... \" Read more \" It’s a nice dress with soft color, comfy material and nice texture, perfect dress for fall and church, but unfortunately they don’t have size XS for... \" Read more 45 customers mention flattering, 35 positive, 10 negative 45 customers mention \"Flattering\" 35 positive 10 negative Customers find the dress flattering, with one mentioning that it shows off their figure nicely and another noting that it works well for maternity wear. \" ...but it did fit well without being tight anywhere and was very flattering (I hope!). Although lightweight, which I wanted, it's not sheer.... \" Read more \" My wife says it's a nice dress and finds it flattering . I really think she should try it on herself... but I'll model whatever she wants! :p \" Read more \" This dress is so flattering and the material is so nice. It has a texture to it that is thick and makes it feel like its a lot more expensive.... \" Read more \" The dress was way too small and not flattering at all . I don’t think it would have looked after better sized up. Also the material was very thin. \" Read more 43 customers mention fabric softness, 42 positive, 1 negative 43 customers mention \"Fabric softness\" 42 positive 1 negative Customers love the fabric of the dress, describing it as super soft with an amazing texture. \" Love this dress!!! It is comfy and soft . Fits perfect, except a little short. I'm going to keep it anyway. I may even buy another color! \" Read more \" ...I am about a 34G. Material is soft and comfortable, not super heavy. I probably could have sized down but I don't like my sleeves to be too short.... \" Read more \" ...It’s not see through whatsoever. The sizing is pretty great and the fabric is soft ! I have no complaints whatsoever \" Read more \" This dress was everything and more! I felt amazing in it . \" Read more 37 customers mention material quality, 28 positive, 9 negative 37 customers mention \"Material quality\" 28 positive 9 negative Customers like the material of the dress, describing it as nice and textured, with one customer specifically mentioning the cute pattern on the black fabric. \" It fit nicely and was nice material . It was a little longer than I expected it to be, I think it would fit a person with longer legs much better.... \" Read more \" Cute dress. Quality material . Had to return because of sizing. Size up! \" Read more \" ...Its so perfect. I love everything about it. The color, material , length! Great find. Getting another one in a different color as well. \" Read more \" Very thin and cheap material . \" Read more 36 customers mention size, 27 positive, 9 negative 36 customers mention \"Size\" 27 positive 9 negative Customers find the dress fits well, with one mentioning it doesn't pull across the chest and another noting it keeps dresses from ballooning out at all. \" ...The fit was very flattering. It was true to size and did NOT pull across my chest or make my hips look big like others I have tried.... \" Read more \" Dresses, perfect for me Color, size , fit. Looks great, I happy with this order \" Read more \" I needed a larger size i usually wear a large but this one was too small ! \" Read more \" I’m 5’3”, 150 lbs, 34C. Small is perfect , flattering, so pretty. Medium also fits. Ordered another color I love this so much. \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Love this dress",
        "body": "Very comfortable and firm fitting without being tight and restrictive. Loved this sweater dress. Wore them with tights and boots and was so cute. Material was good quality and just the right thickness for fall. The next line was a flattering cut. Read more",
        "author": "Joanna",
        "rating": 5.0,
        "date": "November 16, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Meets size requirements",
        "body": "Lovely. Fit my curves perfectly. I’m 5’8 and weigh 127lbs and I got a small. Material is soft and stretchy. Read more",
        "author": "Brittany king",
        "rating": 5.0,
        "date": "December 4, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars I loved this so much I bought a second one - but it's not warm for winter",
        "body": "It's very comfortable and looks wonderful. However, it is listed as a \"winter dress\" and with the material on the thin side, it's not for being out in the winter weather for very long. As the title of this review says, I liked it enough to buy a second one. Read more",
        "author": "JH",
        "rating": 4.0,
        "date": "December 3, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Effortless Style in a Perfect Fit",
        "body": "I really like the feel of this dress. It’s thick enough to keep me warm, yet lightweight enough not to feel too hot. The neckline is perfect, and the length hit a couple of inches above my knee. It’s versatile too — you can wear it just as described: as a wedding guest dress with heels, for a night out with tall boots, or to work with a pair of heels. I am 5'6\" and 125# and purchased a size Medium due to my bust size. A size small would have fit just as well. Read more",
        "author": "Sherry M",
        "rating": 5.0,
        "date": "December 1, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Not a sweater but it is a nice dress",
        "body": "This is a nice dress, it’s comfortable and I like the design, but it is not by any means a sweater. I’m not trying to flex, but I can see my abs through this dress. Expect it to show everything. Read more",
        "author": "Jennifer",
        "rating": 3.0,
        "date": "November 24, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71dD1YZjLsL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71NeZdyGymL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars So happy with this find",
        "body": "I just got this dress. Its so perfect. I love everything about it. The color, material, length! Great find. Getting another one in a different color as well. Read more",
        "author": "Tabita Iozsa",
        "rating": 5.0,
        "date": "December 13, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "1.0 out of 5 stars Poor quality",
        "body": "Extremely disappointed in this dress! I only had this dress on for two hours when I noticed it started to snag across the belly out of nowhere. As you can see, I’m wearing without a snag. Pic #2 shows the snag where it had stopped. Should I gave worn it any longer, It probably would’ve continued all the way around the torso. I did not return it because I did wear it. I had perfume on so that wasn’t an option! I have purchased many items from this company but now I will think twice. The sad reality is that it’s a beautiful color, with a perfect true to size fit and I got a total of two hours out of it!! Read more",
        "author": "KMA",
        "rating": 1.0,
        "date": "November 22, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/81cQEe6fhRL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/711UZnDwSzL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Easy, Comfortable, and Pretty",
        "body": "I bought this dress to wear out on date night with my husband. It was easy to wear and flattering. I liked it so much, I ordered another in a different color. Read more",
        "author": "Dwaine Stevens",
        "rating": 5.0,
        "date": "November 30, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Long Sleeve V Neck is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.",
  "about_this_item": "Womens Maxi Dress Long Sleeve V Neck is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.",
  "long_description": "Womens Maxi Dress Long Sleeve V Neck is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Light Blue, A1 Apricot, A1 Black, Ashleigh Blue, A1 Gray, A1 Green, Simply Taupe, Mist Green, A1 Pink, Sea Green. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Long Sleeve V Neck is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Light Blue, A1 Apricot, A1 Black, Ashleigh Blue, A1 Gray, A1 Green, Simply Taupe, Mist Green, A1 Pink, Sea Green. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "0a68282b-6899-4d3b-a3d6-ed3446c35f17",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0a68282b-6899-4d3b-a3d6-ed3446c35f17/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0a68282b-6899-4d3b-a3d6-ed3446c35f17/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "38aad9e6-9170-413d-86cb-858c5cf6ca4d",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/38aad9e6-9170-413d-86cb-858c5cf6ca4d/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/38aad9e6-9170-413d-86cb-858c5cf6ca4d/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "c4cfcdbe-0b87-405f-a282-a2f3d725191d",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c4cfcdbe-0b87-405f-a282-a2f3d725191d/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c4cfcdbe-0b87-405f-a282-a2f3d725191d/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "d85b4b2d-e017-4371-b265-0d961beaa877",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d85b4b2d-e017-4371-b265-0d961beaa877/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d85b4b2d-e017-4371-b265-0d961beaa877/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "2e54e109-b132-4914-a27e-90cce3b972ee",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2e54e109-b132-4914-a27e-90cce3b972ee/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2e54e109-b132-4914-a27e-90cce3b972ee/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "435bec25-ecab-496e-ba63-d1a6ca34059f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/435bec25-ecab-496e-ba63-d1a6ca34059f/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/435bec25-ecab-496e-ba63-d1a6ca34059f/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "04a006f9-c329-4e6d-8476-3a29a8f00bca",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/04a006f9-c329-4e6d-8476-3a29a8f00bca/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/04a006f9-c329-4e6d-8476-3a29a8f00bca/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "5a8405c1-6b58-4ce8-aea6-211729699001",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5a8405c1-6b58-4ce8-aea6-211729699001/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5a8405c1-6b58-4ce8-aea6-211729699001/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "10d05f2b-396b-4f67-ade8-c92762d41576",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/10d05f2b-396b-4f67-ade8-c92762d41576/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/10d05f2b-396b-4f67-ade8-c92762d41576/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "8311647b-3ac5-4e1f-ae4e-c77b9c835710",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8311647b-3ac5-4e1f-ae4e-c77b9c835710/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8311647b-3ac5-4e1f-ae4e-c77b9c835710/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "efd94742-95c1-4d7c-ae1c-98d3d99c3186",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/efd94742-95c1-4d7c-ae1c-98d3d99c3186/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/efd94742-95c1-4d7c-ae1c-98d3d99c3186/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "b5c1c0fb-8cf4-4f06-99fc-ba10b85d9032",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b5c1c0fb-8cf4-4f06-99fc-ba10b85d9032/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b5c1c0fb-8cf4-4f06-99fc-ba10b85d9032/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Light Blue": "https://m.media-amazon.com/images/I/41CVJvL8z2L._AC_SR38,50_.jpg",
    "A1 Apricot": "https://m.media-amazon.com/images/I/41lo67t-MmL._AC_SR38,50_.jpg",
    "A1 Black": "https://m.media-amazon.com/images/I/41NvPy7zITL._AC_SR38,50_.jpg",
    "Ashleigh Blue": "https://m.media-amazon.com/images/I/41rUZaXVawL._AC_SR38,50_.jpg",
    "A1 Gray": "https://m.media-amazon.com/images/I/41oiXSzc3qL._AC_SR38,50_.jpg",
    "A1 Green": "https://m.media-amazon.com/images/I/41PAtZ+Jc2L._AC_SR38,50_.jpg",
    "Simply Taupe": "https://m.media-amazon.com/images/I/41VnlfEDERL._AC_SR38,50_.jpg",
    "Mist Green": "https://m.media-amazon.com/images/I/41Y+ScgeVXL._AC_SR38,50_.jpg",
    "A1 Pink": "https://m.media-amazon.com/images/I/41S6Pr30osL._AC_SR38,50_.jpg",
    "Sea Green": "https://m.media-amazon.com/images/I/416g5Tfec4L._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Light Blue": "71j-6R47l4L",
    "A1 Apricot": "717oAfWRHCL",
    "A1 Black": "619OVKv0rkL",
    "Ashleigh Blue": "71Vj4uPH7JL",
    "A1 Gray": "711NUloaU7L",
    "A1 Green": "71LGE7GzfEL",
    "Simply Taupe": "71KZ-9d5TjL",
    "Mist Green": "61c+AgO3PGL",
    "A1 Pink": "713haG2YXLL",
    "Sea Green": "71RyZ55tc4L"
  },
  "color_images": {
    "Light Blue": [
      "https://m.media-amazon.com/images/I/71j-6R47l4L._SL1500_.jpg"
    ],
    "A1 Apricot": [
      "https://m.media-amazon.com/images/I/717oAfWRHCL._SL1500_.jpg"
    ],
    "A1 Black": [
      "https://m.media-amazon.com/images/I/619OVKv0rkL._SL1500_.jpg"
    ],
    "Ashleigh Blue": [
      "https://m.media-amazon.com/images/I/71Vj4uPH7JL._SL1500_.jpg"
    ],
    "A1 Gray": [
      "https://m.media-amazon.com/images/I/711NUloaU7L._SL1500_.jpg"
    ],
    "A1 Green": [
      "https://m.media-amazon.com/images/I/71LGE7GzfEL._SL1500_.jpg"
    ],
    "Simply Taupe": [
      "https://m.media-amazon.com/images/I/71KZ-9d5TjL._SL1500_.jpg"
    ],
    "Mist Green": [
      "https://m.media-amazon.com/images/I/61c+AgO3PGL._SL1500_.jpg"
    ],
    "A1 Pink": [
      "https://m.media-amazon.com/images/I/713haG2YXLL._SL1500_.jpg"
    ],
    "Sea Green": [
      "https://m.media-amazon.com/images/I/71RyZ55tc4L._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 41.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71gLnAI8qnL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-ruched-evening-high-split-split",
      "title": "Womens Maxi Dress Maxi Ruched Evening High Split Split",
      "price": 72.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71omaPs6UqL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-short-sleeve-evening",
      "title": "Womens Dress Short Sleeve Evening",
      "price": 89.88,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61vi9CZReDL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-formal-cocktail-evening",
      "title": "Womens Dress Formal Cocktail Evening",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71ctK4kwdWL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 45.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/712FTzeTFLL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-formal-mermaid-evening-ruched",
      "title": "Womens Maxi Dress Formal Mermaid Evening Ruched",
      "price": 74.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61qHc0kmHEL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 37.79,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51WFZKRzSdL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 43.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Work",
      "images": [
        "https://m.media-amazon.com/images/I/81JXmyg5QfL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-sleeveless-split-formal-cocktail-v-neck",
      "title": "Womens Maxi Dress Sleeveless Split Formal Cocktail V Neck",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/51jHZEGYXHL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-ruched",
      "title": "Womens Maxi Dress Long Sleeve Ruched",
      "price": 49.29,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61P6bkbQawL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-one-shoulder-maxi-long-sleeve",
      "title": "Womens Maxi Dress One Shoulder Maxi Long Sleeve",
      "price": 45.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61UljfUsK4L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-long-sleeve-evening-formal",
      "title": "Womens Maxi Dress Cocktail Long Sleeve Evening Formal",
      "price": 46.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/6190eiFreBL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-formal-long-sleeve-evening",
      "title": "Womens Maxi Dress Maxi Formal Long Sleeve Evening",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51enCkUtvSL._SL1500_.jpg"
      ]
    }
  ]
}