{
  "id": "womens-dress-sleeveless-v-neck",
  "handle": "womens-dress-sleeveless-v-neck",
  "sku": "JC1359",
  "asin": "B0CKFCB4NW",
  "title": "Womens Dress Sleeveless V Neck",
  "title_original": "CUPSHE Fall Dresses for Women V Neck Plaid Sleeveless Wide Strpas Pockets Casual Pinafore Mini Overall Dress",
  "brand": "Visit the CUPSHE Store",
  "price": 42.99,
  "social_proof": {
    "bought_past_month": 419,
    "text": "419+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/81TTbT66ylL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/810KcVz6rhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81bz9MG-r1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81o8c0DfG5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81ZtJRHqDVL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81j4CNl3LnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81tprB3U-nL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81FTTI3YCRL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81CBZETvUJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81IZsPZ8FKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81Rkt0IuuGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81VoodKWy9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81JbEQfC7lL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81PXm8knpsL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81UL3YahkJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61S4e9LUraL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/617gZ72m12L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71hPIgFIAJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71y-qznJoeL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61d7ZkGHYsL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61hJs3s7HGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/817b6CVdvYL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/817Io+kWvSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81cnf26pqXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81OATzlfKLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81qA3v1QNML._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/81TTbT66ylL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/810KcVz6rhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81bz9MG-r1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81o8c0DfG5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81ZtJRHqDVL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81j4CNl3LnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81tprB3U-nL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81FTTI3YCRL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81CBZETvUJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81IZsPZ8FKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81Rkt0IuuGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81VoodKWy9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81JbEQfC7lL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81PXm8knpsL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81UL3YahkJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61S4e9LUraL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/617gZ72m12L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71hPIgFIAJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71y-qznJoeL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61d7ZkGHYsL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61hJs3s7HGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/817b6CVdvYL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/817Io+kWvSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81cnf26pqXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81OATzlfKLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81qA3v1QNML._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Package Dimensions ‏": "‎ 5 x 4 x 3 inches; 7.04 ounces",
    "Item model number ‏": "‎ CAA05A3J059JK",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ October 4, 2023",
    "ASIN ‏": "‎ B0DCNQFYSJ",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#97,077 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #1,180 in Women's Casual Dresses",
    "Customer Reviews": "3.8 3.8 out of 5 stars (243)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Khaki Plaid",
      "Red Plaid",
      "Green Plaid",
      "Black",
      "Black Plaid"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 3.8,
    "count": 243,
    "customers_say": "Customers appreciate the dress's soft synthetic wool material, nice quality, comfort, and lining. They find it versatile, with one customer noting it can be dressed up or down. The fit receives mixed feedback, with some finding it great while others say it runs tight, and customers disagree on whether it's flattering. The dress runs slightly small according to multiple reviews. Select to learn more Quality Fabric quality Comfort Lining Versatility Fit Flattering Size 31 customers mention \"Quality\" 26 positive 5 negative Customers like the dress's quality and appearance, with one mentioning they felt cute all day while wearing it. \"This dress is cute and comfortable. The fit is true to size I got a size up but if wasn’t necessary. I love it.\" Read more \"...I would order up a size. But it did fit my daughter and its very cute so kept it. Would give 5 stars but do not feel it runs true to the size chart\" Read more \"This dress was super cute but it was a little small for a medium dress it fit more like a small or extra small!\" Read more \"...Visually, it really is adorable — the plaid pattern is clean, the colors are rich, and the overall design looks just as pictured....\" Read more 14 customers mention \"Fabric quality\" 10 positive 4 negative Customers like the fabric of the dress, describing it as soft synthetic wool. \"...Definitely runs small so size up! Otherwise very cute!! Thick material and good quality.\" Read more \"125 pounds 5’3 size small. Boxy fitting. Good material but did not find it flattering. I prefer tighter.\" Read more \"What a terrible fabric , it feels like a heavy felt material. It will definitely pill and attract every single fuzz....\" Read more \"...Luckily it was on Amazon. It’s very cute. Nice fabric but a little short. I will wear with tights. I like the adjustable straps....\" Read more 7 customers mention \"Comfort\" 5 positive 2 negative Customers find the dress comfortable, with one mentioning it's flattering without being bulky. \"Very nice on. Fits perfect. Very comfy and can’t wait to wear it again\" Read more \"SO cute and got so many compliments at Thanksgiving! It was so comfortable and not too thick/hot on the inside and super flattering and not tight at...\" Read more \"Cute dress but was kinda scratchy \" Read more \"This dress is cute and comfortable . The fit is true to size I got a size up but if wasn’t necessary. I love it.\" Read more 7 customers mention \"Lining\" 6 positive 1 negative Customers like that the dress is lined. \"First, this pinafore (jumper?) arrived much sooner than estimated. It is lined , and the straps are adjustable....\" Read more \"...I've got hips, belly and boobs and it's truly flattering! It's lined and the material is a soft synthetic wool that hangs very nicely....\" Read more \"...I really like the length of the dress as well. The dress had a lining which is always super nice too.\" Read more \"...I like the pattern, pockets, the side zipper and extra liner inside . I will probably order more colors.\" Read more 7 customers mention \"Versatility\" 7 positive 0 negative Customers find the dress versatile, with one mentioning it can be dressed up or down, while another notes it's perfect for holiday parties. \"...Plus, the quality is top-notch. It's perfect for a casual but stylish outfit. I ordered a medium; it's true to size.\" Read more \"This dress fit exactly how I was hoping? It's very flattering and versatile ! You can dress it up or down, and great for holiday parties.\" Read more \"...However , I’m keeping it for fun fall wear . Know that the fit is a lot like it looks in the model photo—it’s looser. It does not cling to curves.\" Read more \"...It has that classic, preppy look that can be dressed up for the holidays or worn casually with a simple long-sleeve top underneath....\" Read more 32 customers mention \"Fit\" 22 positive 10 negative Customers have mixed opinions about the dress's fit, with some finding it great while others note that the bodice feels more snug than expected. \"Very impressed with this dress! It feels like soft felt and it fits well . I am 5’3” 140lbs and ordered a small....\" Read more \"125 pounds 5’3 size small. Boxy fitting . Good material but did not find it flattering. I prefer tighter.\" Read more \"I’m normally a medium in everything I buy. This dress was SO tight . Definitely runs small so size up! Otherwise very cute!!...\" Read more \" Fits perfectly !! Gives enough room to move around, could’ve gotten away with a small\" Read more 12 customers mention \"Flattering\" 8 positive 4 negative Customers have mixed opinions about how flattering the dress is, with some finding it very flattering while others disagree. \"Wearing this dress I get so many compliments! I felt like it was so flattering and hid a lot of things I wanted to hide....\" Read more \"...was weird extra room in the armpits- and the whole fit was boxy and unflattering ....\" Read more \"...It was so comfortable and not too thick/hot on the inside and super flattering and not tight at all....\" Read more \"This dress fit exactly how I was hoping? It's very flattering and versatile! You can dress it up or down, and great for holiday parties.\" Read more 11 customers mention \"Size\" 3 positive 8 negative Customers report that the dress runs slightly small. \"...This dress was SO tight. Definitely runs small so size up! Otherwise very cute!! Thick material and good quality.\" Read more \" ran small \" Read more \"... Very true to size \" Read more \"...The stess is lined though I found it to run slightly small . It also has no stretch....\" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars PERFECT for any occasion",
        "body": "SO cute and got so many compliments at Thanksgiving! It was so comfortable and not too thick/hot on the inside and super flattering and not tight at all. It does say to hand wash only but I accidentally threw it in the wash and hung it to dry and it held up great. Not only can you wear this for holidays but just out to dinner or a girls night! Read more",
        "author": "Lexi Hamilton",
        "rating": 5.0,
        "date": "December 16, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71R+70y-kmL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars True to size",
        "body": "This dress is ACTUALLY hellllllla cute!! I've got hips, belly and boobs and it's truly flattering! It's lined and the material is a soft synthetic wool that hangs very nicely. Not too short, but not \"mom\" long either. I just love it! Read more",
        "author": "Melissa T.",
        "rating": 5.0,
        "date": "December 9, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Cute/Runs Snug",
        "body": "I ordered the green and navy plaid jumper dress because the style instantly caught my eye. It has that classic, preppy look that can be dressed up for the holidays or worn casually with a simple long-sleeve top underneath. Visually, it really is adorable — the plaid pattern is clean, the colors are rich, and the overall design looks just as pictured. When it arrived, the fabric actually surprised me. It’s not luxury-level, but it feels like a decent, durable material with a little weight to it. It isn’t flimsy or papery like some budget dresses can be. The stitching around the seams looked secure, and the fabric drapes nicely when you hold it up. That being said, the fit is definitely on the tight side. The bodice especially feels more snug than expected, and there isn’t much stretch to help compensate. I would absolutely recommend sizing up, especially if you prefer a comfortable fit or want to layer underneath. Once on, it looks cute, but it’s not the kind of dress you forget you’re wearing — you feel it. The length and cut are flattering, but again, the tighter fit limits movement more than I’d like. For someone with broader shoulders or a larger chest, this could be a struggle to get into without the extra room. Read more",
        "author": "blondie6749",
        "rating": 3.0,
        "date": "November 29, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Nice quality, looser fit",
        "body": "Nice jumper. Fleece-like, thick material. Is more gray than I expected. The waist was also more boxy so I returned as my daughter was looking for a more fitted silhouette. *It does not come with the shirt to wear underneath. Read more",
        "author": "Customer",
        "rating": 4.0,
        "date": "November 8, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "1.0 out of 5 stars Easily broken adjustable straps",
        "body": "It was cute, until the strap broke. I’ve had it for two months and won’t it three times max, the fourth time I went to wear it the shoulder strap broke. Also the fabric on the inside of the dress would shift and move so you would see it along the collar. Not worth the money spent on it for how long it lasted and the quality, could probably find cheaper on Temu for the amount of wears o got out of it. Read more",
        "author": "Adrianna Collazo",
        "rating": 1.0,
        "date": "November 6, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars So flattering and cute!",
        "body": "Wearing this dress I get so many compliments! I felt like it was so flattering and hid a lot of things I wanted to hide. My shape looks exactly how I wanted it to look in this! I wore this in Paris and felt so cute all day! I really like the length of the dress as well. The dress had a lining which is always super nice too. Read more",
        "author": "Kristie Stout",
        "rating": 5.0,
        "date": "November 29, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71fy1HOBIBL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71tUNlhn2JL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/81Xr5ab5eGL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Good quality. True to size.",
        "body": "Good quality fabric. Fits true to size. I bought this for someone who is 5ft 5in & 175lbs. Wears a size 12(US). Read more",
        "author": "NinJa_mie",
        "rating": 5.0,
        "date": "December 7, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "2.0 out of 5 stars Size up",
        "body": "ran small Read more",
        "author": "JoAnn",
        "rating": 2.0,
        "date": "October 4, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Dress Sleeveless V Neck is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.",
  "about_this_item": "Womens Dress Sleeveless V Neck is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.",
  "long_description": "Womens Dress Sleeveless V Neck is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Khaki Plaid, Red Plaid, Green Plaid, Black, Black Plaid. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Dress Sleeveless V Neck is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Khaki Plaid, Red Plaid, Green Plaid, Black, Black Plaid. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "179faba9-c504-453c-8ec8-2f22e8f51136",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/179faba9-c504-453c-8ec8-2f22e8f51136/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/179faba9-c504-453c-8ec8-2f22e8f51136/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "9c87603d-ab73-4dcd-9bce-5c74d031bd8a",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9c87603d-ab73-4dcd-9bce-5c74d031bd8a/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9c87603d-ab73-4dcd-9bce-5c74d031bd8a/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "b7841dbc-e84b-400e-9c7f-3cb93df7ab00",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b7841dbc-e84b-400e-9c7f-3cb93df7ab00/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b7841dbc-e84b-400e-9c7f-3cb93df7ab00/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "2293c802-7d73-4045-a9c0-593cf78adb43",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2293c802-7d73-4045-a9c0-593cf78adb43/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2293c802-7d73-4045-a9c0-593cf78adb43/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "65716223-6f88-4613-abee-f45d86df5b04",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/65716223-6f88-4613-abee-f45d86df5b04/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/65716223-6f88-4613-abee-f45d86df5b04/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "5c7f8eed-0844-42e9-96d1-7e83209243af",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5c7f8eed-0844-42e9-96d1-7e83209243af/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5c7f8eed-0844-42e9-96d1-7e83209243af/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "817cf8ee-a9b4-4017-9c0d-d4340fd59e8f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/817cf8ee-a9b4-4017-9c0d-d4340fd59e8f/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/817cf8ee-a9b4-4017-9c0d-d4340fd59e8f/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "17c89a0c-f679-4dc7-91aa-bf972ebac23c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/17c89a0c-f679-4dc7-91aa-bf972ebac23c/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/17c89a0c-f679-4dc7-91aa-bf972ebac23c/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "8a0039d4-a315-4fa6-8097-bab2fbbc4006",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8a0039d4-a315-4fa6-8097-bab2fbbc4006/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8a0039d4-a315-4fa6-8097-bab2fbbc4006/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "937e21c2-f4a7-4525-a231-54b90f40e6ac",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/937e21c2-f4a7-4525-a231-54b90f40e6ac/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/937e21c2-f4a7-4525-a231-54b90f40e6ac/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "41fe698b-9a59-47c6-b49f-e4172d6b2602",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/41fe698b-9a59-47c6-b49f-e4172d6b2602/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/41fe698b-9a59-47c6-b49f-e4172d6b2602/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "1f2e34ea-79cf-4a21-a20d-71a12f53804c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1f2e34ea-79cf-4a21-a20d-71a12f53804c/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1f2e34ea-79cf-4a21-a20d-71a12f53804c/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Khaki Plaid": "https://m.media-amazon.com/images/I/41nTWlWbHxL._AC_SR38,50_.jpg",
    "Red Plaid": "https://m.media-amazon.com/images/I/41KybirIEML._AC_SR38,50_.jpg",
    "Green Plaid": "https://m.media-amazon.com/images/I/41nd4GV5fmL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31EF+7lJIsL._AC_SR38,50_.jpg",
    "Black Plaid": "https://m.media-amazon.com/images/I/41l8BgRLXHL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Khaki Plaid": "81TTbT66ylL",
    "Red Plaid": "81j4CNl3LnL",
    "Green Plaid": "81Rkt0IuuGL",
    "Black": "61S4e9LUraL",
    "Black Plaid": "817b6CVdvYL"
  },
  "color_images": {
    "Khaki Plaid": [
      "https://m.media-amazon.com/images/I/81TTbT66ylL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/810KcVz6rhL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81bz9MG-r1L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81o8c0DfG5L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81ZtJRHqDVL._SL1500_.jpg"
    ],
    "Red Plaid": [
      "https://m.media-amazon.com/images/I/81j4CNl3LnL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81tprB3U-nL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81FTTI3YCRL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81CBZETvUJL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81IZsPZ8FKL._SL1500_.jpg"
    ],
    "Green Plaid": [
      "https://m.media-amazon.com/images/I/81Rkt0IuuGL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81VoodKWy9L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81JbEQfC7lL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81PXm8knpsL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81UL3YahkJL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/61S4e9LUraL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/617gZ72m12L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71hPIgFIAJL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71y-qznJoeL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61d7ZkGHYsL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61hJs3s7HGL._SL1500_.jpg"
    ],
    "Black Plaid": [
      "https://m.media-amazon.com/images/I/817b6CVdvYL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/817Io+kWvSL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81cnf26pqXL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81OATzlfKLL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81qA3v1QNML._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 129.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/81xqcRe24OL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-long-sleeve",
      "title": "Womens Maxi Dress Bodycon Long Sleeve",
      "price": 27.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/419lpifTakL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon",
      "title": "Womens Maxi Dress Bodycon",
      "price": 42.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51zIrDRteoL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 36.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61zhcs54aWL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-long-sleeve",
      "title": "Womens Maxi Dress Maxi Long Sleeve",
      "price": 19.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61Xl9mi8+HL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-formal",
      "title": "Womens Maxi Dress Formal",
      "price": 94.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71ZICH4P4GL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-mermaid-evening",
      "title": "Womens Maxi Dress Mermaid Evening",
      "price": 69.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51UnCUA9Q3L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-v-neck-long-sleeve",
      "title": "Womens Maxi Dress Formal V Neck Long Sleeve",
      "price": 89.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61sfANi9ghL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail-v-neck",
      "title": "Womens Dress Cocktail V Neck",
      "price": 41.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61xFkD6rBnL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-formal-evening",
      "title": "Womens Dress Formal Evening",
      "price": 82.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51nyRVAgupL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-evening",
      "title": "Womens Dress Evening",
      "price": 79.89,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61oIMymYSQL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-ruched-sleeveless-cocktail-split-bodycon-maxi",
      "title": "Womens Maxi Dress Ruched Sleeveless Cocktail Split Bodycon Maxi",
      "price": 51.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61HFY2CIRkL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail",
      "title": "Womens Dress Cocktail",
      "price": 45.95,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61Eg0ngzG4L._SL1500_.jpg"
      ]
    }
  ]
}