{
  "id": "womens-maxi-dress-maxi-long-sleeve-bodycon",
  "handle": "womens-maxi-dress-maxi-long-sleeve-bodycon",
  "sku": "JC2393",
  "asin": "B0CL6Z3CS5",
  "title": "Womens Maxi Dress Maxi Long Sleeve Bodycon",
  "title_original": "REORIA Womens Basic Sexy Square Neck Long Sleeve Soft Lounge Long Dress Fall Casual Ribbed Bodycon Maxi Dresses",
  "brand": "Visit the REORIA Store",
  "price": 36.97,
  "social_proof": {
    "bought_past_month": 851,
    "text": "851+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/51QjnkJj9IL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/415hIs8T4bL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41Ja8zomGcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/513mftsegnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51WNSemt-3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51LIeUAKxiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/515iHlTii4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51O+DXOdqjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51M03MEumxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51FHib2V88L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51LaUcY-XqL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/51QjnkJj9IL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/415hIs8T4bL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41Ja8zomGcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/513mftsegnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51WNSemt-3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51LIeUAKxiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/515iHlTii4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51O+DXOdqjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51M03MEumxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51FHib2V88L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51LaUcY-XqL._SL1500_.jpg"
  ],
  "aplus_images": [
    "https://m.media-amazon.com/images/I/31OlUgGAMHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/315pcbmPJdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31VU7l8b4sL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31bw4X-sciL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/21p%2B9z-PlBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31ExkG20CeL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/21s4KX5FpmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31ekS8nztYL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31uzIzvrfSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/314Z5GYiMLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31Ii1tkXrhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31seX%2BlgmZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/21YB6WNDbUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31aVP0wMLVL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/21GuLFd62zL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31lx3FkcxAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31p4P75jchL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31cYT2u4pML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31OQSdYEHnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31OfLXdvXjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31NZFlTYhlL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31UUQ4SqomL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/21jtsHmDxvL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/21YrevCYE9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/21YEqc1OdaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/21nIcHBQhUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31rO4UdoWwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/21EHk0qpEiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31bUd1ZnwNL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/21ttmuBiLAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31GsH1o60tL._SL1500_.jpg"
  ],
  "description_images": [
    "https://m.media-amazon.com/images/I/31OlUgGAMHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/315pcbmPJdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31VU7l8b4sL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31bw4X-sciL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/21p%2B9z-PlBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31ExkG20CeL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/21s4KX5FpmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31ekS8nztYL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31uzIzvrfSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/314Z5GYiMLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31Ii1tkXrhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31seX%2BlgmZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/21YB6WNDbUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31aVP0wMLVL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/21GuLFd62zL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31lx3FkcxAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31p4P75jchL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31cYT2u4pML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31OQSdYEHnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31OfLXdvXjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31NZFlTYhlL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31UUQ4SqomL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/21jtsHmDxvL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/21YrevCYE9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/21YEqc1OdaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/21nIcHBQhUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31rO4UdoWwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/21EHk0qpEiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31bUd1ZnwNL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/21ttmuBiLAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31GsH1o60tL._SL1500_.jpg"
  ],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ October 17, 2023",
    "ASIN ‏": "‎ B0CL6L7KK5",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#37,402 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #113 in Women's Formal Dresses",
    "Customer Reviews": "4.5 4.5 out of 5 stars (479)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Red",
      "Rose Red",
      "Khaki",
      "Olive Green",
      "Black",
      "Coffee",
      "Light Grey"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.5,
    "count": 479,
    "customers_say": "Customers find the dress flattering, noting it hugs all the right places and shows off curves, while appreciating its comfortable fit and stretchy material. The dress receives positive feedback for its quality, with one customer highlighting its mermaid silhouette, and another mentioning it can be ruched at the tummy area. While some it's not see-through, others find it very sheer. Generated from the text of customer reviews Select to learn more Fit (50) Looks (44) Flattering (36) Quality (36) Comfort (32) Stretchiness (28) Material quality (21) See through (22) 50 customers mention fit, 45 positive, 5 negative 50 customers mention \"Fit\" 45 positive 5 negative Customers like how the dress fits, with one mentioning it accommodates a bump well. \" ... Fit like a glove , amazing quality and was perfect for a birthday celebration! I’m getting one in every color \" Read more \" Fits perfectly and nice, stretchy material. Looking at their other products they all look just as amazing. Definitely gonna buy more \" Read more \" very slimming and great fitting dress , shoulders dont slip of because it has a great neckline . size large fit a size 8/10/12 bust, size 6-12 skirt. \" Read more \" ...I wanted something buttery soft, yet form fitting , long, and vibrant. This dress checked every box and more. Absolutely a 10/10. \" Read more 44 customers mention looks, 43 positive, 1 negative 44 customers mention \"Looks\" 43 positive 1 negative Customers find the dress gorgeous and well-made, with one customer specifically mentioning its flattering mermaid silhouette. \" This dress was so cute and the fabric was thick, not see through, and comfortable. I am 5’6” and the dress goes all the way down to the floor.... \" Read more \" Very simple is sexy . Has a great stretch \" Read more \" This is a beautiful dress and not see through at all and it’s stretchy so it shows off your figure. It’s very comfortable and easy to wash.... \" Read more \" ...material that does show texture under it but it is so comfortable and cute ! Debating buying in an additional color \" Read more 36 customers mention flattering, 34 positive, 2 negative 36 customers mention \"Flattering\" 34 positive 2 negative Customers find the dress flattering, noting that it hugs the body in all the right places and has a super flattering neckline. \" ...is soft and comfy, with plenty of stretch (even as I grow) making it flattering yet comfortable.... \" Read more \" ...It’s tight fitting, but stretchy and very flattering . I am 5’5” 150lbs and got a Medium in black. \" Read more \" Hands down the most flattering dress I’ve ever worn. Definitely going to be getting it in more colors.... \" Read more \" Awesome material and super flattering ... \" Read more 36 customers mention quality, 36 positive, 0 negative 36 customers mention \"Quality\" 36 positive 0 negative Customers find the dress to be of great quality, with one mentioning it's perfect for both night and casual wear. \" Such great quality . So comfortable and soft. I am 150-160 lbs, 5,10”. It sat where I wanted it too. I got a size medium. \" Read more \" Soft and stretchy. Perfect skims dupe \" Read more \" Love the dress , looks exactly like description and photo. Fits true to size. The material has some weight too it, which isn’t a bad thing.... \" Read more \" OMG please Never stop restocking ! The best quality for a great price ! Amazing dresses ! I wish they had more colors ! \" Read more 32 customers mention comfort, 32 positive, 0 negative 32 customers mention \"Comfort\" 32 positive 0 negative Customers find the dress comfortable. \" ...Loved it. I was comfortable it’s super stretchy and allows you to move. Was easy for dance and sitting while eating. Great price for maxi dress.... \" Read more \" So comfortable but extremely see through and the sewn part at the chest unraveled after washing. So we had to sew it last minute. \" Read more \" This is really cute and so flattering! Material is stretchy and comfy . I bought it for a wedding and was not disappointed!! \" Read more \" ...It's so comfy and I received so many compliments on this dress. I ended up doing a maternity shoot in it and am just obsessed with this dress.... \" Read more 28 customers mention stretchiness, 27 positive, 1 negative 28 customers mention \"Stretchiness\" 27 positive 1 negative Customers like the dress's stretchiness. \" This is a beautiful dress and not see through at all and it’s stretchy so it shows off your figure. It’s very comfortable and easy to wash.... \" Read more \" ...It is so stretchy but beware it shows everything, and for a dress like this I would have gotten a darker color so it was more forgiving if it wasn’t... \" Read more \" This is really cute and so flattering! Material is stretchy and comfy. I bought it for a wedding and was not disappointed!! \" Read more \" Fits perfectly and nice, stretchy material . Looking at their other products they all look just as amazing. Definitely gonna buy more \" Read more 21 customers mention material quality, 17 positive, 4 negative 21 customers mention \"Material quality\" 17 positive 4 negative Customers like the dress's material, noting it is thick and of good quality, with one customer mentioning it hugs the body and another finding it breathable. \" Ribbed material , thicker than expected so it's not see through. Length is good (I'm 5'9\" 150lb) fit perfectly.... \" Read more \" This dress was so cute and the fabric was thick , not see through, and comfortable. I am 5’6” and the dress goes all the way down to the floor.... \" Read more \" ...The material hugs your body and almost acts as shapewear. Great material, perfect length....and can we talk about the neck line!!... \" Read more \" ...very stretchy and breathable material . not see through at all. \" Read more 22 customers mention see through, 13 positive, 9 negative 22 customers mention \"See through\" 13 positive 9 negative Customers have mixed opinions about the dress's transparency, with some finding it not see-through at all, while others describe it as very sheer. \" This dress was so cute and the fabric was thick, not see through , and comfortable. I am 5’6” and the dress goes all the way down to the floor.... \" Read more \" So comfortable but extremely see through and the sewn part at the chest unraveled after washing. So we had to sew it last minute. \" Read more \" This is a beautiful dress and not see through at all and it’s stretchy so it shows off your figure. It’s very comfortable and easy to wash.... \" Read more \" ...This was incredibly see through , I cannot wear this out so I will be returning. 2 stars for the fit but essentially I can’t wear it anywhere. \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars GET THIS DRESS!!",
        "body": "Absolutely stunning! I really wasn't sure it would be long enough because I'm 5'10\" 28 weeks pregnant, and 220 lbs., but it goes all the way down resting on the top of my feet. Doesn't drag, the arms are perfect length, and the fabric is stretchy! If youre taller and want the length, do not size down. Will definitely even fit after baby is here. It hugs all the right places and is very comfortable to move around in! It's not see through but you can see lines underneath so it definitely needs an undergarment of some sort! If you're second guessing about this dress, don't be! Get it! You won't regret it! Read more",
        "author": "Blair W.",
        "rating": 5.0,
        "date": "October 31, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Fits well, comfortable",
        "body": "Ribbed material, thicker than expected so it's not see through. Length is good (I'm 5'9\" 150lb) fit perfectly. Used for a costume, but I would actually wear to an event. Overall happy! Read more",
        "author": "Brandon Bourdeau",
        "rating": 5.0,
        "date": "December 10, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/715zpwwsocL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Stylish, Stretchy, and So Comfortable",
        "body": "I wore this REORIA square neck long dress while 4 months pregnant to a fall wedding and loved it! The fabric is soft and comfy, with plenty of stretch (even as I grow) making it flattering yet comfortable. It’s versatile, you can easily dress it up with heels and jewelry or keep it casual with flats. A great piece that works for different occasions and stages of life. Read more",
        "author": "Nic",
        "rating": 5.0,
        "date": "December 11, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71YAbbAxPML._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Perfect!",
        "body": "This is really cute and so flattering! Material is stretchy and comfy. I bought it for a wedding and was not disappointed!! Read more",
        "author": "Lacie Woodlee",
        "rating": 5.0,
        "date": "November 24, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Fit like a glove, and good length",
        "body": "For reference I am 5’8” and ~140lbs, I got a size Medium so I would say it was true to size. Also I always have issues with length being too short, but that was not an issue! Stretchy material and comfortable to wear Read more",
        "author": "Olivia",
        "rating": 5.0,
        "date": "October 24, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars So gorgeous",
        "body": "I got this dress for a last minute date party, it was sunset wedding themed. I got so many compliments and it is so soft and comfortable. I am usually between a XS and Small and get the extra small for a tighter fit. It is so stretchy but beware it shows everything, and for a dress like this I would have gotten a darker color so it was more forgiving if it wasn’t for the theme. Exactly like the picture, and the mermaid style of this dress makes it unique and beautiful. I’m 5’4 and wore 3’ inch heals but could of worn shorter and it would still be the perfect length Read more",
        "author": "Kacie",
        "rating": 4.0,
        "date": "February 18, 2024",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71OaslxD32L._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71CrXLnrZSL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars It brought sexy back. FR.",
        "body": "I love this dress. It fits beautifully and showed off curves I didn't realize I had.. for a middle aged woman who has the body shape of the Penguin from the 90's Batman movie, I got my sexy back wearing this bad boy. Seriously. Buy it. 10/10 would recommend. Read more",
        "author": "Nikki Pepper",
        "rating": 5.0,
        "date": "December 1, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Will be buying again!",
        "body": "Such great quality. So comfortable and soft. I am 150-160 lbs, 5,10”. It sat where I wanted it too. I got a size medium. Read more",
        "author": "Korbyn Gentry",
        "rating": 5.0,
        "date": "December 18, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Maxi Long Sleeve Bodycon is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.",
  "about_this_item": "Womens Maxi Dress Maxi Long Sleeve Bodycon is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.",
  "long_description": "Womens Maxi Dress Maxi Long Sleeve Bodycon is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Red, Rose Red, Khaki, Olive Green, Black, Coffee, Light Grey. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Maxi Long Sleeve Bodycon is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/31OlUgGAMHL._SL1500_.jpg",
      "alt": "Womens Maxi Dress Maxi Long Sleeve Bodycon details image 1"
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/315pcbmPJdL._SL1500_.jpg",
      "alt": "Womens Maxi Dress Maxi Long Sleeve Bodycon details image 2"
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/31VU7l8b4sL._SL1500_.jpg",
      "alt": "Womens Maxi Dress Maxi Long Sleeve Bodycon details image 3"
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/31bw4X-sciL._SL1500_.jpg",
      "alt": "Womens Maxi Dress Maxi Long Sleeve Bodycon details image 4"
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Red, Rose Red, Khaki, Olive Green, Black, Coffee, Light Grey. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/21p%2B9z-PlBL._SL1500_.jpg",
      "alt": "Womens Maxi Dress Maxi Long Sleeve Bodycon details image 5"
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "02c20d64-1cac-42e2-a92e-fd4314107d12",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/02c20d64-1cac-42e2-a92e-fd4314107d12/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/02c20d64-1cac-42e2-a92e-fd4314107d12/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/40366724-aae6-4ea0-ad14-012d8fa94876.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "21a4028a-ce35-4950-a257-9a77693850a4",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/21a4028a-ce35-4950-a257-9a77693850a4/embedded.cc.default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/21a4028a-ce35-4950-a257-9a77693850a4/embedded.cc.default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/40366724-aae6-4ea0-ad14-012d8fa94876.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "638fbb9e-95a0-4b59-ab45-9cc836fbfeec",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/638fbb9e-95a0-4b59-ab45-9cc836fbfeec/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/638fbb9e-95a0-4b59-ab45-9cc836fbfeec/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/40366724-aae6-4ea0-ad14-012d8fa94876.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "39410d2e-4577-4e44-b778-38006342120e",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/39410d2e-4577-4e44-b778-38006342120e/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/39410d2e-4577-4e44-b778-38006342120e/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/40366724-aae6-4ea0-ad14-012d8fa94876.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "4fd51093-9a16-47f7-b880-d873a755a009",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4fd51093-9a16-47f7-b880-d873a755a009/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4fd51093-9a16-47f7-b880-d873a755a009/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/40366724-aae6-4ea0-ad14-012d8fa94876.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "a7cc3a25-2b1f-4e04-8712-642a2b8629df",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a7cc3a25-2b1f-4e04-8712-642a2b8629df/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a7cc3a25-2b1f-4e04-8712-642a2b8629df/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/40366724-aae6-4ea0-ad14-012d8fa94876.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "ce4a19a2-be3b-43bd-be61-e346cca04133",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ce4a19a2-be3b-43bd-be61-e346cca04133/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ce4a19a2-be3b-43bd-be61-e346cca04133/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/40366724-aae6-4ea0-ad14-012d8fa94876.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "44a21c2e-0719-4736-a79e-689c00d23501",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/44a21c2e-0719-4736-a79e-689c00d23501/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/44a21c2e-0719-4736-a79e-689c00d23501/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/40366724-aae6-4ea0-ad14-012d8fa94876.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "8123e887-776b-440a-b295-a352f8846a73",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8123e887-776b-440a-b295-a352f8846a73/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8123e887-776b-440a-b295-a352f8846a73/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/40366724-aae6-4ea0-ad14-012d8fa94876.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "88283403-0b26-49e6-a7de-36577b6090fc",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/88283403-0b26-49e6-a7de-36577b6090fc/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/88283403-0b26-49e6-a7de-36577b6090fc/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/40366724-aae6-4ea0-ad14-012d8fa94876.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "b1b8751e-376f-4700-acab-57fcf143ed32",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b1b8751e-376f-4700-acab-57fcf143ed32/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b1b8751e-376f-4700-acab-57fcf143ed32/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/40366724-aae6-4ea0-ad14-012d8fa94876.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "ac4083e8-5b15-4c78-9bbc-19fe1a735005",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ac4083e8-5b15-4c78-9bbc-19fe1a735005/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ac4083e8-5b15-4c78-9bbc-19fe1a735005/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/40366724-aae6-4ea0-ad14-012d8fa94876.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Red": "https://m.media-amazon.com/images/I/314SKLeOJRL._AC_SR38,50_.jpg",
    "Rose Red": "https://m.media-amazon.com/images/I/31GsH1o60tL._AC_SR38,50_.jpg",
    "Khaki": "https://m.media-amazon.com/images/I/21EHk0qpEiL._AC_SR38,50_.jpg",
    "Olive Green": "https://m.media-amazon.com/images/I/21ttmuBiLAL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/21baOmjts1L._AC_SR38,50_.jpg",
    "Coffee": "https://m.media-amazon.com/images/I/21vYW8YKqYL._AC_SR38,50_.jpg",
    "Light Grey": "https://m.media-amazon.com/images/I/218ffeNzREL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Red": "51LIeUAKxiL",
    "Rose Red": "515iHlTii4L",
    "Khaki": "51O+DXOdqjL",
    "Olive Green": "51M03MEumxL",
    "Black": "51QjnkJj9IL",
    "Coffee": "51FHib2V88L",
    "Light Grey": "51LaUcY-XqL"
  },
  "color_images": {
    "Red": [
      "https://m.media-amazon.com/images/I/51LIeUAKxiL._SL1500_.jpg"
    ],
    "Rose Red": [
      "https://m.media-amazon.com/images/I/515iHlTii4L._SL1500_.jpg"
    ],
    "Khaki": [
      "https://m.media-amazon.com/images/I/51O+DXOdqjL._SL1500_.jpg"
    ],
    "Olive Green": [
      "https://m.media-amazon.com/images/I/51M03MEumxL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/51QjnkJj9IL._SL1500_.jpg"
    ],
    "Coffee": [
      "https://m.media-amazon.com/images/I/51FHib2V88L._SL1500_.jpg"
    ],
    "Light Grey": [
      "https://m.media-amazon.com/images/I/51LaUcY-XqL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 95.73,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51wBkntt7NL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening-mermaid-one-shoulder-bodycon",
      "title": "Womens Maxi Dress Formal Evening Mermaid One Shoulder Bodycon",
      "price": 72.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/618lP17KUCL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal",
      "title": "Womens Maxi Dress Formal",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/613+0mbtjjL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 45.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71MA5mprbPL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 36.89,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61m05RUmr+L._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress-sleeveless-ruched-bodycon",
      "title": "Womens Dress Sleeveless Ruched Bodycon",
      "price": 28.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61cVInQRZtL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-ruched",
      "title": "Womens Maxi Dress Long Sleeve Ruched",
      "price": 49.29,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61P6bkbQawL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-split-ruched",
      "title": "Womens Maxi Dress Long Sleeve Split Ruched",
      "price": 52.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61F+2INCNkL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening",
      "title": "Womens Maxi Dress Formal Evening",
      "price": 76.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/617cJEuOdgL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-long-sleeve",
      "title": "Womens Maxi Dress Maxi Long Sleeve",
      "price": 51.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/716+ABkyJTL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 360.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/618Fs0AOcUL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail",
      "title": "Womens Maxi Dress Cocktail",
      "price": 55.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/712cNKdSQ0L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-bodycon",
      "title": "Womens Dress Bodycon",
      "price": 32.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/5186m3-413L._SL1500_.jpg"
      ]
    }
  ]
}