{
  "id": "womens-maxi-dress-long-sleeve-bodycon-ruched",
  "handle": "womens-maxi-dress-long-sleeve-bodycon-ruched",
  "sku": "JC2995",
  "asin": "B0CMLDPR2P",
  "title": "Womens Maxi Dress Long Sleeve Bodycon Ruched",
  "title_original": "Women's Sheer Long Sleeve Sequin Bodycon Mini Dress Sexy Sparkly Ruched Mesh Party Going Out Dresses",
  "brand": "Visit the URYIAO Store",
  "price": 58.99,
  "social_proof": {
    "bought_past_month": 463,
    "text": "463+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/71qQ-zJaP8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/517axESOexL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51+iYWNKa7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51GRx89SgRL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/615q0v-2UpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/714lKu3JQnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61DPBmHUPJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61+XZeWKpkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71O8EfNkjjL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/71qQ-zJaP8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/517axESOexL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51+iYWNKa7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51GRx89SgRL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/615q0v-2UpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/714lKu3JQnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61DPBmHUPJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61+XZeWKpkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71O8EfNkjjL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ November 4, 2023",
    "ASIN ‏": "‎ B0CMLX4JXN",
    "Best Sellers Rank": "#8,687 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #22 in Women's Club & Night Out Dresses",
    "Customer Reviews": "4.0 4.0 out of 5 stars (428)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Wine",
      "Brown",
      "Navy",
      "Dg",
      "Purple",
      "Black"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.0,
    "count": 428,
    "customers_say": "Customers find the dress pretty and flattering, with good quality and comfort that's not itchy. The fit and sizing receive mixed feedback - while some say it's perfect, others mention it's tight around the armpits and too small. The length and color accuracy also get mixed reviews, with some saying it's just right while others find it too short, and some noting the color doesn't match the description. Generated from the text of customer reviews Select to learn more Beauty (67) Quality (25) Comfort (23) Flattering (22) Fit (33) Size (20) Length (17) Color accuracy (13) 67 customers mention beauty, 60 positive, 7 negative 67 customers mention \"Beauty\" 60 positive 7 negative Customers find the dress pretty, with one mentioning it looks like a night sky. \" This dress was super cute and I absolutely loved it. I wore it for halloween dressed as the fairy godmother from Shrek.... \" Read more \" this dress was so so cute , however as soon as I washed it all the sparkles fell off in the washer. DON’T WASH!!!! Cheap Cheap Cheap.... \" Read more \" ...it for her birthday dress for the dinner highly recommend it’s beautiful if you are tiny definitely get a small my daughter is 15 and we got the... \" Read more \" Very cute , decent quality but definitely not made for bigger chested people! Stretches well and seems very comfortable.... \" Read more 25 customers mention quality, 22 positive, 3 negative 25 customers mention \"Quality\" 22 positive 3 negative Customers find the dress to be of good quality, with one customer particularly praising the amazing sleeves. \" Love this dress ! Bought it for my high schooler for winter formal. True to size and looks chic \" Read more \" Loved the dress ! It’s a very vibrant red so keep on that mind, it’s not like the image on Amazon but I already knew that from the reviews.... \" Read more \" Loved this dress . Gets u snatched \" Read more \" This dress is so cute. It’s true to size and good quality and it’s identical to the product shown in the photos.... \" Read more 23 customers mention comfort, 17 positive, 6 negative 23 customers mention \"Comfort\" 17 positive 6 negative Customers find the dress comfortable and not itchy. \" ...The sparkles are not itchy at all and the material is soft and comfortable and still has great shape to it. \" Read more \" ...I love them. The dress is so shiny and it is not itchy .... \" Read more \" This thing is crap and itchy and trashy looking. \" Read more \" ...I went with medium and it fit flawlessly. I felt very comfortable in this dress and felt that it is flattering even if you don’t have a perfectly... \" Read more 22 customers mention flattering, 17 positive, 5 negative 22 customers mention \"Flattering\" 17 positive 5 negative Customers find the dress flattering, with one mentioning it's perfect for curvy girls and another noting it hugs all the right places. \" This dress is so flattering and fun! I ordered it for a girls night out and it was perfect! I was worried it was going to ride up, but it didnt!... \" Read more \" I was surprised when I tried this on. It is very flattering and supportive! True to size and perfect for curvy girls.... \" Read more \" Very nice and flattering dress . Got for my daughter's sweet sixteen birthday dinner and she looked very pretty.... \" Read more \" ...The main issue is the bust area .... \" Read more 33 customers mention fit, 22 positive, 11 negative 33 customers mention \"Fit\" 22 positive 11 negative Customers have mixed opinions about the dress's fit, with some finding it perfect while others report it being too tight by the armpits and not suitable for larger bust sizes. \" ...i just got it today and tried it on and it is soooooo cute and form fitting . it’s also super comfortable so i feel like i could wear this all night.... \" Read more \" Got the dress and did not fit as expected and the quality is terrible. Not flattering at all. \" Read more \" Good fit ... \" Read more \" This dress fits to size and is very flattering. My daughter was very happy with it. \" Read more 20 customers mention size, 11 positive, 9 negative 20 customers mention \"Size\" 11 positive 9 negative Customers have mixed experiences with the dress's sizing, with some finding it true to size while others report it runs small and is not suitable for larger bust sizes. \" ...It is very flattering and supportive! True to size and perfect for curvy girls. There is wire underneath the breast area, so keep that in mind.... \" Read more \" ...for my daughter's homecoming and was sadly disappointed that it runs extremely small and is SUPER see-through. \" Read more \" ...Fabric is super comfortable, and the dress is true to size , definitely recommend! \" Read more \" ...The only thing that was kind of annoying was that it is not Big chested , friendly.... \" Read more 17 customers mention length, 7 positive, 10 negative 17 customers mention \"Length\" 7 positive 10 negative Customers have mixed opinions about the dress's length, with some finding it great while others say it's way too short and the sleeves are too long. \" Way too short and not the right color:/ \" Read more \" ...places without being too tight, and the length was just right— not too short , which was perfect for a homecoming dance.... \" Read more \" I’m 5’10” normally a size 6 or 8. I ordered a medium and the dress was SOOOOO short ! It didn’t cover my whole butt!... \" Read more \" ...I thought it was the perfect length . The quality you get for the price is really good, and the red color is really pretty. 10/10 recommend. \" Read more 13 customers mention color accuracy, 6 positive, 7 negative 13 customers mention \"Color accuracy\" 6 positive 7 negative Customers have mixed opinions about the dress's color accuracy, with some finding it nice while others report it doesn't match the description. \" Way too short and not the right color :/ \" Read more \" Loved the dress! It’s a very vibrant red so keep on that mind, it’s not like the image on Amazon but I already knew that from the reviews.... \" Read more \" ...It is super cute once on but not the color I asked for . \" Read more \" ...compliments, I felt very confident and it was the perfect length and color . It sparkles just like it does in the photos. \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Beautiful Red Dress for Great Price",
        "body": "This dress was super cute and I absolutely loved it. I wore it for halloween dressed as the fairy godmother from Shrek. I loved the sleeves of the dress. They’re thin, but they cover your arms and just add an extra beautiful touch. Also, the glitter on the dress didn’t shed as much as I thought it would, which is a plus! The fabric was comfortable, but the dress does come with a built in underwire bra area and it adds extra security. The dress was stretchy, and is tall girl approved. I’m 5’8” and this dress wasn’t too short on me. I thought it was the perfect length. The quality you get for the price is really good, and the red color is really pretty. 10/10 recommend. Read more",
        "author": "Katie",
        "rating": 5.0,
        "date": "November 5, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Looks like it came from an expensive boutique! BEAUTIFUL I purchased for two different girls.",
        "body": "I purchased two sizes in this one for my daughter and one for her friend for two different dances. THEY WERE A HIT!. I was a little worried because air vac sealed and the package was SO small. Once I opened it it was ready to wear right out of the package. It is true to size, well made and hangs beautifully. It really looks like we purchased it at an expensive boutique Read more",
        "author": "coreybeth",
        "rating": 5.0,
        "date": "November 9, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Not for Bigger Chests",
        "body": "Very cute, decent quality but definitely not made for bigger chested people! Stretches well and seems very comfortable. There's a giant underwire in the top and it is clearly not big enough for quite a good number of people. Read more",
        "author": "Lily Ivey",
        "rating": 3.0,
        "date": "May 29, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Color does not match description",
        "body": "The dress is beautiful, but it is more of a brite red, instead of the wine color it appears to be. Its also longer than I first thought it would be! Very good considering this is my daughters homecoming dress. Read more",
        "author": "Barbie Hovermale",
        "rating": 4.0,
        "date": "October 3, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Perfect dress",
        "body": "Wore this for my bday and it fit perfectly super cute and it does sparkle Read more",
        "author": "Keri",
        "rating": 5.0,
        "date": "December 16, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "1.0 out of 5 stars Not a good purchase for bustier types",
        "body": "The sparkles on the dress are stickers, and it honestly is mesh on top of cheaper fabric. The main issue is the bust area. The person for whom it was purchased is well endowed, and as such, would have to wear a wireless bra with this dress. We knew we would have to tape the dress to her, and she was okay with this until we tried the dress on. The wire of her bra showed through the dress due to the flimsier material, and there was a built in wire for the bra area. The wire area was so rigid though. It was worse than an underwire bra. It just wasn't going to work for us, so I ended up asking for a refund on this dress. Read more",
        "author": "osugirl",
        "rating": 1.0,
        "date": "October 29, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Perfect for Homecoming",
        "body": "The Women’s Sheer Long Sleeve Sequin Dress fit absolutely amazing! It hugged all the right places without being too tight, and the length was just right—not too short, which was perfect for a homecoming dance. The sheer sleeves and sequins gave it an elegant yet fun vibe, and I received so many compliments throughout the night. It’s comfortable to wear and easy to move in, making it a great choice for dancing the night away. Highly recommend this dress for anyone looking for a stylish and flattering option for special occasions! Read more",
        "author": "Toya",
        "rating": 5.0,
        "date": "December 13, 2024",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Super cute",
        "body": "I was skeptical when I bought it, but it is very flattering on. The fabric has ruching so it hides some insecurities and it’s stretchy! The back ties so it keep the sleeves up well. Great for a night out! Read more",
        "author": "Sarah P.",
        "rating": 5.0,
        "date": "June 3, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Long Sleeve Bodycon Ruched is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.",
  "about_this_item": "Womens Maxi Dress Long Sleeve Bodycon Ruched is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.",
  "long_description": "Womens Maxi Dress Long Sleeve Bodycon Ruched is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Wine, Brown, Navy, Dg, Purple, Black. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Long Sleeve Bodycon Ruched is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Wine, Brown, Navy, Dg, Purple, Black. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "8a790c60-8ba3-462b-b058-d18a1f72dc5f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8a790c60-8ba3-462b-b058-d18a1f72dc5f/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8a790c60-8ba3-462b-b058-d18a1f72dc5f/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/18885bc4-dd1c-4091-a5f4-a7217633eb91.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "4fea25ed-41b8-44c6-a90d-8fc6a2dafce6",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4fea25ed-41b8-44c6-a90d-8fc6a2dafce6/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4fea25ed-41b8-44c6-a90d-8fc6a2dafce6/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/18885bc4-dd1c-4091-a5f4-a7217633eb91.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "6e42d39e-1566-4c19-a020-ee9f319cfdad",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6e42d39e-1566-4c19-a020-ee9f319cfdad/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6e42d39e-1566-4c19-a020-ee9f319cfdad/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/18885bc4-dd1c-4091-a5f4-a7217633eb91.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "51fd83f5-9d38-4ac9-bfcc-0dedd20c4081",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/51fd83f5-9d38-4ac9-bfcc-0dedd20c4081/embedded.cc.default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/51fd83f5-9d38-4ac9-bfcc-0dedd20c4081/embedded.cc.default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/18885bc4-dd1c-4091-a5f4-a7217633eb91.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "644d60f0-2edc-4ae8-b86d-74646aa0b4d1",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/644d60f0-2edc-4ae8-b86d-74646aa0b4d1/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/644d60f0-2edc-4ae8-b86d-74646aa0b4d1/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/18885bc4-dd1c-4091-a5f4-a7217633eb91.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "ec10fe90-3e6d-4fd2-b7c0-5619b5a8f791",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ec10fe90-3e6d-4fd2-b7c0-5619b5a8f791/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ec10fe90-3e6d-4fd2-b7c0-5619b5a8f791/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/18885bc4-dd1c-4091-a5f4-a7217633eb91.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "4094e977-96ec-4706-847e-9e53acf2a8e2",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4094e977-96ec-4706-847e-9e53acf2a8e2/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4094e977-96ec-4706-847e-9e53acf2a8e2/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/18885bc4-dd1c-4091-a5f4-a7217633eb91.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "9abefd4e-30d1-4a0f-9609-65bd004388a9",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9abefd4e-30d1-4a0f-9609-65bd004388a9/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9abefd4e-30d1-4a0f-9609-65bd004388a9/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/18885bc4-dd1c-4091-a5f4-a7217633eb91.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "1327f0d1-75fc-48ce-970e-99a90ad1f646",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1327f0d1-75fc-48ce-970e-99a90ad1f646/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1327f0d1-75fc-48ce-970e-99a90ad1f646/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/18885bc4-dd1c-4091-a5f4-a7217633eb91.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "51b840a1-3935-4b01-afae-7ded8f2c7eca",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/51b840a1-3935-4b01-afae-7ded8f2c7eca/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/51b840a1-3935-4b01-afae-7ded8f2c7eca/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/18885bc4-dd1c-4091-a5f4-a7217633eb91.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "6eafcc64-c762-4087-b414-3ee43084d3e1",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6eafcc64-c762-4087-b414-3ee43084d3e1/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6eafcc64-c762-4087-b414-3ee43084d3e1/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/18885bc4-dd1c-4091-a5f4-a7217633eb91.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "b9dbb19b-4728-4c42-a887-d0be3b9b91a7",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b9dbb19b-4728-4c42-a887-d0be3b9b91a7/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b9dbb19b-4728-4c42-a887-d0be3b9b91a7/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/18885bc4-dd1c-4091-a5f4-a7217633eb91.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Wine": "https://m.media-amazon.com/images/I/41cA3-Q-p5L._AC_SR38,50_.jpg",
    "Brown": "https://m.media-amazon.com/images/I/41hJ13eYjKL._AC_SR38,50_.jpg",
    "Navy": "https://m.media-amazon.com/images/I/419bMoWH9bL._AC_SR38,50_.jpg",
    "Dg": "https://m.media-amazon.com/images/I/412pwMBaB4L._AC_SR38,50_.jpg",
    "Purple": "https://m.media-amazon.com/images/I/412jtsW79dL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/41uYovUBA+L._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Wine": "615q0v-2UpL",
    "Brown": "714lKu3JQnL",
    "Navy": "61DPBmHUPJL",
    "Dg": "61+XZeWKpkL",
    "Purple": "71O8EfNkjjL",
    "Black": "71qQ-zJaP8L"
  },
  "color_images": {
    "Wine": [
      "https://m.media-amazon.com/images/I/615q0v-2UpL._SL1500_.jpg"
    ],
    "Brown": [
      "https://m.media-amazon.com/images/I/714lKu3JQnL._SL1500_.jpg"
    ],
    "Navy": [
      "https://m.media-amazon.com/images/I/61DPBmHUPJL._SL1500_.jpg"
    ],
    "Dg": [
      "https://m.media-amazon.com/images/I/61+XZeWKpkL._SL1500_.jpg"
    ],
    "Purple": [
      "https://m.media-amazon.com/images/I/71O8EfNkjjL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/71qQ-zJaP8L._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 34.95,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51IZ36yqNKL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 126.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/714Cs9MTO9L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 24.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/81-gVZjMLrL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-short-sleeve",
      "title": "Womens Maxi Dress Formal Short Sleeve",
      "price": 74.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61323sb10xL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-short-sleeve-evening",
      "title": "Womens Dress Short Sleeve Evening",
      "price": 79.94,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/618tJ3SXY2L._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress-cocktail",
      "title": "Womens Dress Cocktail",
      "price": 55.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71lQNHvgTIL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 38.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51nk0JfphPL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 29.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/81Tlw7mkr1L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 37.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/613fdSJqbAL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-bodycon",
      "title": "Womens Maxi Dress Long Sleeve Bodycon",
      "price": 36.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71ItDQZXFtL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening",
      "title": "Womens Maxi Dress Formal Evening",
      "price": 74.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61O2sLG0fEL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-long-sleeve-maxi-cocktail",
      "title": "Womens Maxi Dress Bodycon Long Sleeve Maxi Cocktail",
      "price": 47.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/81Qz5s7t1VL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 46.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61odTCaHAgL._SL1500_.jpg"
      ]
    }
  ]
}