{
  "id": "womens-maxi-dress-long-sleeve-evening-v-neck",
  "handle": "womens-maxi-dress-long-sleeve-evening-v-neck",
  "sku": "JC3262",
  "asin": "B0CMQLB2R6",
  "title": "Womens Maxi Dress Long Sleeve Evening V Neck",
  "title_original": "ZESICA Women's Velvet Midi Dress 2026 Casual V Neck Long Sleeve Solid Color Elastic High Waist Flowy Evening Party Dresses",
  "brand": "Visit the ZESICA Store",
  "price": 61.99,
  "social_proof": {
    "bought_past_month": 156,
    "text": "156+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/71rHlz3SSvL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81GQNOKtzcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/816lPlA5ewL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81H6A8tw22L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71095pTRCpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81PxlPyVERL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71RqosoGoTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71NUpv9AJ7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71qGlg8Au8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71MfVeIhr4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71bD9oEKDKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71fm9ZlVCiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71dbKmEK2EL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71pcfW3qDXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/719QVwwCAuL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/71rHlz3SSvL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81GQNOKtzcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/816lPlA5ewL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81H6A8tw22L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71095pTRCpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81PxlPyVERL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71RqosoGoTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71NUpv9AJ7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71qGlg8Au8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71MfVeIhr4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71bD9oEKDKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71fm9ZlVCiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71dbKmEK2EL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71pcfW3qDXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/719QVwwCAuL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Product Dimensions ‏": "‎ 1.97 x 0.79 x 0.39 inches; 3.53 ounces",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ November 6, 2023",
    "ASIN ‏": "‎ B0D4B661LQ",
    "Best Sellers Rank": "#17,120 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #25 in Women's Formal Dresses",
    "Customer Reviews": "4.3 4.3 out of 5 stars (488)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Plum",
      "Wine Red",
      "Olive Green",
      "Grey Blue",
      "Dusty Pink",
      "Orange Red",
      "Black",
      "Champagne",
      "Caramel",
      "Green"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.3,
    "count": 488,
    "customers_say": "Customers find the dress beautiful, with one noting its slightly shiny green finish, and appreciate its fit, with one mentioning it hits perfectly at the waist. Moreover, the dress receives positive feedback for its quality, comfort, and color, with one describing the Carmel shade as molten copper. Additionally, customers like the material, with one highlighting its soft velvet texture, and find it flattering, with one noting it hugs all the right places. The dress is true to size, making it suitable for various body types. Select to learn more Beauty Fit Quality Comfort Color Material quality Flattering Size 70 customers mention \"Beauty\" 63 positive 7 negative Customers find the dress very pretty, with one customer noting its slightly shiny appearance in green, while another mentions it looks nice on their body size and type. \"Needed a warm dress for a cold wedding! This was absolutely perfect! Beautiful and comfortable. I usually wear a 14 and the large fit beautifully!...\" Read more \"...I didnt Love the fit on this as much as the other one. It is a beautiful dress it’s just fits my hips weird.\" Read more \"...Such a gorgeous dress , with a heavy full skirt that swirls dreamily as you walk. Love it!...\" Read more \" Pretty dress but the weight of the fabric did nothing for my body. Seems like good quality just gives off renaissance fair vibes.\" Read more 58 customers mention \"Fit\" 51 positive 7 negative Customers like how the dress fits, with one mentioning it hangs nicely and another noting it doesn't cling to the body. \"It looks just like the photos, it fits perfectly , has a nice weight to the dress and was exactly what I was looking for in a bridesmaids dress\" Read more \"...I was wrong. This dress fit perfectly , color was rich and looked amazing on. Even got several comments on how lovely I looked. Definitely a keeper.\" Read more \"...It will make a lovely holiday dress. Great value for the money. Fits great , gently flowing material of good quality.\" Read more \"...I ordered a medium. I’m 156 and 5’3 so it was a perfect fit ....\" Read more 49 customers mention \"Quality\" 47 positive 2 negative Customers find the dress beautiful and well-made, with one mentioning it's perfect for a wedding guest outfit. \"This dress is really beautiful. Good quality , nice color and fits well (definitely true to size) down to the ankle length....\" Read more \" Great dress !!!...\" Read more \" Love this dress ! Gots so many compliments! It's also warm for winter ❄️\" Read more \"It’s nice dress \" Read more 47 customers mention \"Comfort\" 46 positive 1 negative Customers find the dress comfortable, particularly as a wedding guest outfit, with one customer mentioning it made them feel at ease during family photos. \"This dress is so flattering, warm, and comfortable . The caramel color is very rich and beautiful. For reference, I'm 5'5-1/2\" and weigh 132 lbs....\" Read more \"...I love the look and have received so MANY compliments! I felt very comfortable and pretty in this dress! The downside- it stained my body!...\" Read more \"Love this dress. It’s soft, comfy and flattering. It’s a little thinner than I expected but that’s not a deal breaker in any way for me....\" Read more \"This dress perfectly fit on my body and super comfortable ..\" Read more 38 customers mention \"Color\" 31 positive 7 negative Customers like the dress's color, describing it as beautiful, with one customer noting that the Carmel shade resembles molten copper. \" Beautiful color and dress ! Love it ! Got a size I’m 5’6 . Definitely worth it ! Got a lot of compliments .\" Read more \"I love the color and the texture of this dress. Great length, moves nicely and love the pockets!\" Read more \"This was a lovely dress. Beautiful material & color . It hangs really nice. Covers well. I enjoyed all the compliments people gave me....\" Read more \"This dress is really beautiful. Good quality, nice color and fits well (definitely true to size) down to the ankle length....\" Read more 37 customers mention \"Material quality\" 29 positive 8 negative Customers love the material of the dress, describing it as beautiful and nice, with one customer noting its soft velvet texture. \"the perfect fall/winter dress. medium weight nice material that’s not too thick. can be dressed up or down but easily looks classically elegant....\" Read more \"The fabric is beautiful with strong vertical stripes of shine. Very comfortable, but too much fabric and way too stretchy for a dress-up event....\" Read more \"I love the color and the texture of this dress . Great length, moves nicely and love the pockets!\" Read more \"...The fabric weight is so incredibly heavy. It’s itchy too! Fabric was thick (not see through whatsoever) and seemed to be of okay quality but felt...\" Read more 28 customers mention \"Flattering\" 23 positive 5 negative Customers find the dress flattering, with one mentioning it hugs all the right places and is forgiving in the hips and back. \"Love this dress. It’s soft, comfy and flattering . It’s a little thinner than I expected but that’s not a deal breaker in any way for me....\" Read more \"The grey blue color is gorgeous and the fit is perfect. Very flattering and comfortable. Buy it, you won't be disappointed!!\" Read more \"This dress is so flattering , warm, and comfortable. The caramel color is very rich and beautiful. For reference, I'm 5'5-1/2\" and weigh 132 lbs....\" Read more \" Flattering dress that fits true to size\" Read more 25 customers mention \"Size\" 19 positive 6 negative Customers find the dress runs true to size, with one mentioning it works well for larger bust sizes. \"I love this dress. It’s true to size , fits beautifully, nice quality and soft. I got so many compliments from wearing it....\" Read more \"This dress is beautiful and the color is so rich. It also ran true to size . Well worth the purchase!\" Read more \"This dress was beautiful and fit true to size . It worked perfect for holiday parties.\" Read more \"...Great for any event. You need to buy it. This is a size small .\" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Very cute and comfortable!",
        "body": "I really don't enjoy dressing up or wearing dresses, so when I was on the hunt to find something cute to wear for a girls night out I ordered a number of dresses to try on and this was the one I went with. I love it! It is sooo comfortable and love how it fits my body shape (wider at the hips). It hugs all the right places. The dress is super soft & stretchy and kept me warm as I wore this on a very cold winters night. It has pockets and is very well made. I felt really comfortable and cute in this dress that I'm thinking about ordering a few other colors. I usually am in between a L and XL but since this was stretchy I went with the L and it fit perfectly. Read more",
        "author": "nicolaherring",
        "rating": 5.0,
        "date": "February 1, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71YhE+h3iZL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Perfect for a fall wedding",
        "body": "Lovely and comfortable. I got so many compliments on the color! Needed for a fall wedding and it was perfect. I ordered a medium. I’m 156 and 5’3 so it was a perfect fit. I’d say it it’s definitely more of a heels vs flats dress but you will look beautiful in whatever your comfortable in. Read more",
        "author": "Essence Wimes",
        "rating": 5.0,
        "date": "October 26, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71Wd7PBMXKL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "4.0 out of 5 stars True to size, drapes well, fabric not breathable",
        "body": "as advertised, drapes, well and true to size. Fabric is not breathable. Read more",
        "author": "Tracey B",
        "rating": 4.0,
        "date": "August 28, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Beautiful",
        "body": "It is beautiful on my daughter. So flattering, perfect fit Read more",
        "author": "Ashley Evans",
        "rating": 5.0,
        "date": "December 19, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Not flattering!",
        "body": "The dress I received is not sewn like the listing photo. Instead of laying smooth across the bust, it bunches up awkwardly in the center which is not flattering. (See photos) When I move my arms, the wristbands creep up and get stuck on my forearms. I may have gotten a lemon but overall this dress was not worth the cost and having to go through the hassle to return it. No complaints about length, color, material thickness, or skirt flow. Read more",
        "author": "E Bingham",
        "rating": 3.0,
        "date": "December 15, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71V9gU5m5UL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71FnW1SNtQL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Love it!",
        "body": "Love this dress. Nice fit, beautiful color. Read more",
        "author": "Tammy Y",
        "rating": 5.0,
        "date": "December 21, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars I’m buying another one- different color",
        "body": "Loved this- comfy warm elegant AND POCKETS Read more",
        "author": "Shivani Grail",
        "rating": 5.0,
        "date": "December 22, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Great dress!!!",
        "body": "Beautiful dress; true to size! Read more",
        "author": "LeAnn Darst",
        "rating": 5.0,
        "date": "December 12, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Long Sleeve Evening V Neck is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.",
  "about_this_item": "Womens Maxi Dress Long Sleeve Evening V Neck is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.",
  "long_description": "Womens Maxi Dress Long Sleeve Evening V Neck is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Plum, Wine Red, Olive Green, Grey Blue, Dusty Pink, Orange Red, Black, Champagne, Caramel, Green. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Long Sleeve Evening V Neck is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Plum, Wine Red, Olive Green, Grey Blue, Dusty Pink, Orange Red, Black, Champagne, Caramel, Green. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "c1b1794e-32b7-42ea-9c92-028c31a09b90",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c1b1794e-32b7-42ea-9c92-028c31a09b90/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c1b1794e-32b7-42ea-9c92-028c31a09b90/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "d0a79cc1-2f71-416b-8498-1d126e7dfb04",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d0a79cc1-2f71-416b-8498-1d126e7dfb04/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d0a79cc1-2f71-416b-8498-1d126e7dfb04/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "a90ab3f6-4ef2-4280-bab3-61c4042beaaa",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a90ab3f6-4ef2-4280-bab3-61c4042beaaa/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a90ab3f6-4ef2-4280-bab3-61c4042beaaa/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "41744a7a-2fe4-486b-bb81-7da9e5c1f775",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/41744a7a-2fe4-486b-bb81-7da9e5c1f775/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/41744a7a-2fe4-486b-bb81-7da9e5c1f775/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "1ad6d809-7fc5-4a08-ae19-180cbce73c9f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1ad6d809-7fc5-4a08-ae19-180cbce73c9f/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1ad6d809-7fc5-4a08-ae19-180cbce73c9f/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "bc21d6e6-1e3d-4299-8e02-983dc2fd9fb6",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bc21d6e6-1e3d-4299-8e02-983dc2fd9fb6/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bc21d6e6-1e3d-4299-8e02-983dc2fd9fb6/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "24ef7f7d-f04c-4df5-a403-03fb2c665033",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/24ef7f7d-f04c-4df5-a403-03fb2c665033/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/24ef7f7d-f04c-4df5-a403-03fb2c665033/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "c433fc49-769f-47b0-899a-e0573d3a853b",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c433fc49-769f-47b0-899a-e0573d3a853b/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c433fc49-769f-47b0-899a-e0573d3a853b/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "d9654852-b716-43d2-8762-da320024c104",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d9654852-b716-43d2-8762-da320024c104/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d9654852-b716-43d2-8762-da320024c104/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "6213225a-e375-4976-876f-d5cf63e44e76",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6213225a-e375-4976-876f-d5cf63e44e76/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6213225a-e375-4976-876f-d5cf63e44e76/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "d51e33f1-db22-46cc-93a7-69670e9d386e",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d51e33f1-db22-46cc-93a7-69670e9d386e/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d51e33f1-db22-46cc-93a7-69670e9d386e/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "4b9d84d7-79ac-4927-9fa5-687a2cd691c0",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4b9d84d7-79ac-4927-9fa5-687a2cd691c0/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4b9d84d7-79ac-4927-9fa5-687a2cd691c0/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Plum": "https://m.media-amazon.com/images/I/41uvDW-+nwL._AC_SR38,50_.jpg",
    "Wine Red": "https://m.media-amazon.com/images/I/41hu3mJZKhL._AC_SR38,50_.jpg",
    "Olive Green": "https://m.media-amazon.com/images/I/41lFtAEn0bL._AC_SR38,50_.jpg",
    "Grey Blue": "https://m.media-amazon.com/images/I/41OYAqcAkVL._AC_SR38,50_.jpg",
    "Dusty Pink": "https://m.media-amazon.com/images/I/41NEdHWo+lL._AC_SR38,50_.jpg",
    "Orange Red": "https://m.media-amazon.com/images/I/41QUpl4C6HL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31x48aw+RML._AC_SR38,50_.jpg",
    "Champagne": "https://m.media-amazon.com/images/I/412JAzo+8UL._AC_SR38,50_.jpg",
    "Caramel": "https://m.media-amazon.com/images/I/41tAx0b7KEL._AC_SR38,50_.jpg",
    "Green": "https://m.media-amazon.com/images/I/31aWfAPvmSL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Plum": "71RqosoGoTL",
    "Wine Red": "71NUpv9AJ7L",
    "Olive Green": "71qGlg8Au8L",
    "Grey Blue": "71MfVeIhr4L",
    "Dusty Pink": "71bD9oEKDKL",
    "Orange Red": "71fm9ZlVCiL",
    "Black": "71dbKmEK2EL",
    "Champagne": "71pcfW3qDXL",
    "Caramel": "719QVwwCAuL",
    "Green": "71rHlz3SSvL"
  },
  "color_images": {
    "Plum": [
      "https://m.media-amazon.com/images/I/71RqosoGoTL._SL1500_.jpg"
    ],
    "Wine Red": [
      "https://m.media-amazon.com/images/I/71NUpv9AJ7L._SL1500_.jpg"
    ],
    "Olive Green": [
      "https://m.media-amazon.com/images/I/71qGlg8Au8L._SL1500_.jpg"
    ],
    "Grey Blue": [
      "https://m.media-amazon.com/images/I/71MfVeIhr4L._SL1500_.jpg"
    ],
    "Dusty Pink": [
      "https://m.media-amazon.com/images/I/71bD9oEKDKL._SL1500_.jpg"
    ],
    "Orange Red": [
      "https://m.media-amazon.com/images/I/71fm9ZlVCiL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/71dbKmEK2EL._SL1500_.jpg"
    ],
    "Champagne": [
      "https://m.media-amazon.com/images/I/71pcfW3qDXL._SL1500_.jpg"
    ],
    "Caramel": [
      "https://m.media-amazon.com/images/I/719QVwwCAuL._SL1500_.jpg"
    ],
    "Green": [
      "https://m.media-amazon.com/images/I/71rHlz3SSvL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-formal-ruched-bodycon-long-sleeve-maxi",
      "title": "Womens Maxi Dress Formal Ruched Bodycon Long Sleeve Maxi",
      "price": 62.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/512VaHXw7yL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-mermaid",
      "title": "Womens Maxi Dress Mermaid",
      "price": 135.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51oZ0y9bCkL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-boat-neck-long-sleeve",
      "title": "Womens Maxi Dress Maxi Boat Neck Long Sleeve",
      "price": 54.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51xp-qP1roL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 47.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61-lxeYStCL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-boat-neck-ruched-bodycon",
      "title": "Womens Maxi Dress Long Sleeve Boat Neck Ruched Bodycon",
      "price": 37.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61bFy4NJTbL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress-formal-evening",
      "title": "Womens Dress Formal Evening",
      "price": 80.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61J9CtslCAL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 21.8,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/61c5mGhNGcL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-sleeveless-off-shoulder",
      "title": "Womens Maxi Dress Sleeveless Off Shoulder",
      "price": 42.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51oz3E7J01L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-v-neck-evening-cocktail-sleeveless-ruched-formal",
      "title": "Womens Maxi Dress V Neck Evening Cocktail Sleeveless Ruched Formal",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/514pw0DEo8L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-long-sleeve-maxi-cocktail",
      "title": "Womens Maxi Dress Bodycon Long Sleeve Maxi Cocktail",
      "price": 47.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/81Qz5s7t1VL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-v-neck-long-sleeve",
      "title": "Womens Maxi Dress V Neck Long Sleeve",
      "price": 29.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/81La+qKnueL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-mermaid-formal",
      "title": "Womens Maxi Dress Mermaid Formal",
      "price": 85.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/612O0Y9cPuL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-v-neck-ruched-bodycon",
      "title": "Womens Maxi Dress Long Sleeve V Neck Ruched Bodycon",
      "price": 33.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Work",
      "images": [
        "https://m.media-amazon.com/images/I/61ZKdkKctnL._SL1500_.jpg"
      ]
    }
  ]
}