{
  "id": "womens-dress",
  "handle": "womens-dress",
  "sku": "JC1455",
  "asin": "B0CPS25243",
  "title": "Womens Dress",
  "title_original": "ellazhu Women's Printed Patchwork Mock Neck Flared Cuffs Dress GZ94 A",
  "brand": "Visit the ellazhu Store",
  "price": 53.95,
  "social_proof": {
    "bought_past_month": 1125,
    "text": "1125+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/71hI5AguolL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71za4pkPHSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71gvFBRAu5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/7128cCVYnLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ePUUQFYvL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61wozv5SMgL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/71hI5AguolL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71za4pkPHSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71gvFBRAu5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/7128cCVYnLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ePUUQFYvL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61wozv5SMgL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ December 8, 2023",
    "ASIN ‏": "‎ B0CPS7VWDW",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#338,099 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #4,076 in Women's Casual Dresses",
    "Customer Reviews": "4.6 4.6 out of 5 stars (48)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Black"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.6,
    "count": 48,
    "customers_say": "Customers find the dress to be a statement piece with beautiful details, high quality, and a great fit. The fabric receives positive feedback, with one customer noting its satiny texture, and they appreciate its good length and value for money. The color receives mixed reactions, with one customer highlighting the rich gold and black flower pattern, while comfort opinions are also mixed. Generated from the text of customer reviews Select to learn more Style (16) Quality (8) Fit (7) Fabric quality (6) Length (4) Value for money (4) Color (5) Comfort (5) 16 customers mention style, 15 positive, 1 negative 16 customers mention \"Style\" 15 positive 1 negative Customers find the dress beautiful, with one mentioning its elegant lines and another describing it as a statement piece. \" This dress is beautiful . The fabric is lovely and very well made. The dress is fully lined. The whole thing is really impressive in person.... \" Read more \" Gorgeous dress \" Read more \" This dress is THE most beautiful dress I own. It's so pretty, quality is top notch and it looks so rich and elegant. I got so many compliments.... \" Read more \" Extremely beautiful and elegant for the affordable price. \" Read more 8 customers mention quality, 8 positive, 0 negative 8 customers mention \"Quality\" 8 positive 0 negative Customers find the dress to be of high quality and describe it as the best dress ever. \" This dress is beautiful. The fabric is lovely and very well made . The dress is fully lined. The whole thing is really impressive in person.... \" Read more \" Very Nice Dress Nice Lenght for a Shorter Person Dress is about 39 \" Length Fits fine too and has a zipper in the back Fabric Print is Classic and... \" Read more \" I really love this brand and have bought many items . Beautiful and well made and very comfortable :) \" Read more \" This dress is so high quality !! The fabric is amazing and the details are beautiful. I will purchase from this designer more often. \" Read more 7 customers mention fit, 5 positive, 2 negative 7 customers mention \"Fit\" 5 positive 2 negative Customers like how the dress fits, with one mentioning it has plenty of room. \" The fit is perfect and love the styling of this dress. \" Read more \" ...I am 5'10\" and weigh 160. There is plenty of room . No constriction. Very comfortable! \" Read more \" This is a beautiful piece! The color is bright. Expensive. The fit is boxy . The sleeves are very tight.... \" Read more \" ...Designer style for great price Fit: Great fit for . E Flattering: very flattering design... \" Read more 6 customers mention fabric quality, 6 positive, 0 negative 6 customers mention \"Fabric quality\" 6 positive 0 negative Customers love the fabric of the dress, with one mentioning its satiny texture and another appreciating its length. \" This dress is so high quality!! The fabric is amazing and the details are beautiful. I will purchase from this designer more often. \" Read more \" This dress is beautiful. The fabric is lovely and very well made. The dress is fully lined. The whole thing is really impressive in person.... \" Read more \" This dress is such a statement piece. Quality fabric , lined, and elegant lines. You need this one. \" Read more \" ...The Urban style is right on point. Here's an added plus: The material is satiny with a heavier than expected weight, thanks to the lining.... \" Read more 4 customers mention length, 3 positive, 1 negative 4 customers mention \"Length\" 3 positive 1 negative Customers like the length of the dress. \" ...The lacy pockets look cheap IRL. Cut is good, length is good but I still returned. \" Read more \" Very well made with a perfect length . \" Read more \" ...All that being said, it’s not designed for tall people with a chest or shoulders. It did fit, but not comfortably.... \" Read more \" Very Nice Dress Nice Lenght for a Shorter Person Dress is about 39 \" Length Fits fine too and has a zipper in the back Fabric Print is Classic and... \" Read more 4 customers mention value for money, 3 positive, 1 negative 4 customers mention \"Value for money\" 3 positive 1 negative Customers find the dress offers good value for money. \" Extremely beautiful and elegant for the affordable price . \" Read more \" Value for money : Designer style for great price Fit: Great fit for. E Flattering: very flattering design... \" Read more \" This is a beautiful piece! The color is bright. Expensive . The fit is boxy. The sleeves are very tight.... \" Read more \" Great purchase !... \" Read more 5 customers mention color, 3 positive, 2 negative 5 customers mention \"Color\" 3 positive 2 negative Customers have mixed opinions about the dress's colors, with one customer appreciating the rich gold and black flowers, while another notes that the gold shade is more like orange. \" This is a beautiful piece! The color is bright . Expensive. The fit is boxy. The sleeves are very tight.... \" Read more \" Neck is constricting and Im a thin person. The gold is more like orange . The lacy pockets look cheap IRL.... \" Read more \" ...Wow and Wow! It's absolutely BEAUTIFUL! The rich gold and black colors of the flowers , the gorgeous lacey pockets, and the lace trimmed sleeves... \" Read more \" ...There is no stretch in the fabric. It zips up the back and the color is very high and stiff. Maybe on the right body type, but not mine. \" Read more 5 customers mention comfort, 3 positive, 2 negative 5 customers mention \"Comfort\" 3 positive 2 negative Customers have mixed opinions about the dress's comfort. \" ...There is plenty of room. No constriction. Very comfortable ! \" Read more \" ...It did fit, but not comfortably . I found it almost impossible to move my arms. \" Read more \" ...and fits exactly as I wanted, oversized AND soft, which makes it comfortable and non restricting. It is definitely a 'KEEPER'. \" Read more \" Neck is uncomfortable ... \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars This is a 'CAN'T GO WRONG WITH' dress",
        "body": "OMG ! ! ! This dress is far better than I expected. Wow and Wow! It's absolutely BEAUTIFUL! The rich gold and black colors of the flowers, the gorgeous lacey pockets, and the lace trimmed sleeves on the wrist, gives this dress such a sophisticated, feminine look. The Urban style is right on point. Here's an added plus: The material is satiny with a heavier than expected weight, thanks to the lining. It feels and fits exactly as I wanted, oversized AND soft, which makes it comfortable and non restricting. It is definitely a 'KEEPER'. Read more",
        "author": "Mrs. D. Lang",
        "rating": 5.0,
        "date": "July 19, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71NOV66xpdL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71NWN1Ij7BL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Very Stylish Comfortable Zipper In the Back Recommend Love the 39\" Length",
        "body": "Very Nice Dress Nice Lenght for a Shorter Person Dress is about 39 \" Length Fits fine too and has a zipper in the back Fabric Print is Classic and This Dress is good to go to Dressy Family Gatherings or Visit an Art Museum or Dressy Church Event Very Stylish Love the Length and Fabric 5 Stars Read more",
        "author": "D",
        "rating": 5.0,
        "date": "June 22, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Great purchase!",
        "body": "Really cute style and nice material. I am 5'10\" and weigh 160. There is plenty of room. No constriction. Very comfortable! Read more",
        "author": "Pepper",
        "rating": 5.0,
        "date": "September 25, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Best Dress EVER!!",
        "body": "This dress is THE most beautiful dress I own. It's so pretty, quality is top notch and it looks so rich and elegant. I got so many compliments. But most importantly I felt great in the dress. I'm a size 14-16. 5'2. Read more",
        "author": "Blessedbythebest1",
        "rating": 5.0,
        "date": "November 11, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/719zJd3FyAL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Good quality",
        "body": "I really love this brand and have bought many items . Beautiful and well made and very comfortable :) Read more",
        "author": "b huffman",
        "rating": 5.0,
        "date": "September 2, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Beautiful Dress",
        "body": "Absolutely Fabulous..DRESS.. ABSOLUTELY GORGEOUS.. I LOVE ANONTHER IN DIFFERENT COLOUR'S. SO MANY PEOPLE LOVE MY DRESS Read more",
        "author": "Mary c mc donagh",
        "rating": 5.0,
        "date": "October 3, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "1.0 out of 5 stars Very large",
        "body": "Tooo big Read more",
        "author": "janie shepherd harding",
        "rating": 1.0,
        "date": "August 25, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Gorgeous with some caveats.",
        "body": "This dress is beautiful. The fabric is lovely and very well made. The dress is fully lined. The whole thing is really impressive in person. All that being said, it’s not designed for tall people with a chest or shoulders. It did fit, but not comfortably. I found it almost impossible to move my arms. Read more",
        "author": "Stephanie Kirch",
        "rating": 5.0,
        "date": "February 6, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Dress is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.",
  "about_this_item": "Womens Dress is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.",
  "long_description": "Womens Dress is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Black. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Dress is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Black. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [],
  "color_swatches": {
    "Black": "https://m.media-amazon.com/images/I/41ayEM+z47L._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Black": "71hI5AguolL"
  },
  "color_images": {
    "Black": [
      "https://m.media-amazon.com/images/I/71hI5AguolL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71za4pkPHSL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71gvFBRAu5L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/7128cCVYnLL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71ePUUQFYvL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61wozv5SMgL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-sleeveless-maxi",
      "title": "Womens Maxi Dress Sleeveless Maxi",
      "price": 48.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71qwUjryGiL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 43.69,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61-pFN+nfgL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-bodycon",
      "title": "Womens Maxi Dress Maxi Bodycon",
      "price": 36.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61o6MKJoZLL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-one-shoulder-formal-mermaid-bodycon-evening-maxi",
      "title": "Womens Maxi Dress One Shoulder Formal Mermaid Bodycon Evening Maxi",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71mgUBuGwhL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-v-neck-short-sleeve",
      "title": "Womens Dress V Neck Short Sleeve",
      "price": 34.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71T+iJeFITL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress-cocktail-ruched-evening-split",
      "title": "Womens Dress Cocktail Ruched Evening Split",
      "price": 29.69,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/61003bnFhAS._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-maxi",
      "title": "Womens Maxi Dress Formal Maxi",
      "price": 64.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/61RWPo72AmL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-mermaid-one-shoulder",
      "title": "Womens Maxi Dress Mermaid One Shoulder",
      "price": 238.74,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51lR3NNtXCL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-maxi-formal-long-sleeve-v-neck",
      "title": "Womens Maxi Dress Cocktail Maxi Formal Long Sleeve V Neck",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61cfJoIR5bL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-bodycon-ruched",
      "title": "Womens Maxi Dress Cocktail Bodycon Ruched",
      "price": 49.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51+rVhgLHSL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-formal",
      "title": "Womens Dress Formal",
      "price": 75.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51TVxkZ3J2L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening",
      "title": "Womens Maxi Dress Formal Evening",
      "price": 64.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/516ScMrYzlL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-ruched-bodycon-v-neck",
      "title": "Womens Maxi Dress Long Sleeve Ruched Bodycon V Neck",
      "price": 33.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51AvldIvTmL._SL1500_.jpg"
      ]
    }
  ]
}