{
  "id": "womens-dress-cocktail-bodycon-ruched",
  "handle": "womens-dress-cocktail-bodycon-ruched",
  "sku": "JC1238",
  "asin": "B0CPF6DQZ7",
  "title": "Womens Dress Cocktail Bodycon Ruched",
  "title_original": "BTFBM Women Summer Elegant Strapless Midi Ruched Bodycon Dress Solid Color Stretch Mesh Slim Party Cocktail Dresses",
  "brand": "Visit the BTFBM Store",
  "price": 39.99,
  "social_proof": {
    "bought_past_month": 1721,
    "text": "1721+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/61cptP2xc5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61kRZdtCdRL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61TRo2TZ1BL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61uTzMiv1jL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71G5PxmJ23L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71QVS-uB4GL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/613R46ENlwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61tT8QC6KYL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61GQoRih4RL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61yYhTmi18L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61J5Xc+SUwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61kNr9VZX1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61VOciCtaEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61seUKJeTrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61v2YhU1UoL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61wX7OVjkXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61-tkZTezCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61T21BJsS0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61m-C+jQt4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61zj6mj1MyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61KnxW3sRuL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61pbQfZlu+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61MVBflyGBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61bQy-X++iL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/618E1qy-QbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ZZm9pa2cL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61DUAfFe4nL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ljOXKwRWL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/61cptP2xc5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61kRZdtCdRL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61TRo2TZ1BL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61uTzMiv1jL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71G5PxmJ23L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71QVS-uB4GL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/613R46ENlwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61tT8QC6KYL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61GQoRih4RL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61yYhTmi18L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61J5Xc+SUwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61kNr9VZX1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61VOciCtaEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61seUKJeTrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61v2YhU1UoL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61wX7OVjkXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61-tkZTezCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61T21BJsS0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61m-C+jQt4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61zj6mj1MyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61KnxW3sRuL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61pbQfZlu+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61MVBflyGBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61bQy-X++iL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/618E1qy-QbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ZZm9pa2cL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61DUAfFe4nL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ljOXKwRWL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Item model number ‏": "‎ CP035",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ January 30, 2024",
    "ASIN ‏": "‎ B0CPFK9S1V",
    "Best Sellers Rank": "#48,652 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #179 in Women's Formal Dresses #512 in Women's Club & Night Out Dresses",
    "Customer Reviews": "4.5 4.5 out of 5 stars (877)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Light Brown",
      "Brown",
      "Blue",
      "Apricot",
      "Army Green",
      "Black",
      "Orange",
      "Dark Green",
      "Light Blue",
      "Red",
      "Rose Red",
      "Bright Blue",
      "Lake Blue",
      "Navy",
      "Wine Red",
      "Khaki",
      "White",
      "Yellow",
      "Light Pink",
      "Caramel",
      "Grey Purple",
      "Rust Red",
      "Green"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.5,
    "count": 877,
    "customers_say": "Customers find this dress gorgeous and versatile, with one noting it looks fancier than its price point. The dress fits curves perfectly and is comfortable, with one customer mentioning it's easy to sit in. They appreciate its flattering design, with one noting how the ruffles distract from belly insecurities, and its stretchy, soft material that's lined with rubber. Generated from the text of customer reviews Select to learn more Style (147) Fit (128) Quality (96) Comfort (95) Flattering (88) Stretchiness (60) Material quality (46) Size (41) 147 customers mention style, 140 positive, 7 negative 147 customers mention \"Style\" 140 positive 7 negative Customers find the dress gorgeous and classic, with one mentioning it could be dressed up or down. \" It is cute , just not super flattering on me. I am 5’3 127 lbs & a 32dd. Just kinda looks frumpy on top and not super flattering for my figure.... \" Read more \" Such a beautiful dress ! It was a last-minute purchase for a wedding, but it ended up being perfect. I received so many compliments!... \" Read more \" One of the best Amazon dresses I have! Super cute , and stretchy. I also love the elastic band on the top so it doesn’t slide down.... \" Read more \" ...This was the perfect one. The color is so deep and beautiful . The quality is good, she can wear it again. \" Read more 128 customers mention fit, 115 positive, 13 negative 128 customers mention \"Fit\" 115 positive 13 negative Customers are satisfied with how the dress fits, noting that it accommodates various body types, with one customer mentioning it snatched their waist and tummy, while another appreciates the ample room in the chest area. \" Wore to a rehearsal dinner and it was perfect fit . Great value for the cost. Material as nice and as expected. Color was perfect pink.... \" Read more \" I absolutely loved this dress! It fit perfectly and I got so many compliments. True to size and stretchy material. \" Read more \" ...It’s cute, easy to move in, fits true to size , good quality, and worth the price.... \" Read more \" ...I hope I have another event I can wear it to. Fits great , size small for me. Did not slip down because of the grippies. \" Read more 96 customers mention quality, 94 positive, 2 negative 96 customers mention \"Quality\" 94 positive 2 negative Customers find the dress to be of good quality, describing it as perfect for both weddings and night out occasions. \" Great dress ! 5’6” 115 lbs. ordered a small, fit great! Stayed up, didn’t need to constantly pull it up or adjust it. Loads of stretch.... \" Read more \" This dress is amazing! So flattering and great quality . It is so comfortable and stretchy. Not see through at all. Fit true to size too!... \" Read more \" ...The color was vibrant not dull. The perfect dress . \" Read more \" good quality perfect for wedding, prom, party. i would size down, the color is exactly as picture and material is good \" Read more 95 customers mention comfort, 95 positive, 0 negative 95 customers mention \"Comfort\" 95 positive 0 negative Customers find the dress comfortable, describing it as very forgiving and suitable for wedding guest wear. \" The most comfortable , flattering dress I think I’ve ever worn. Doesn’t wrinkle, super stretchy, ruffles on the bias cut are so flattering.... \" Read more \" ...It fit true to size, if you size up it could be a little big. Very comfortable and stretchy. Nothing but compliments from friends about this dress. \" Read more \" ...I really liked the ruffles and how stretchy the dress is—it’s comfy and hugs your curves nicely, so sizing down was a good call.... \" Read more \" Fits like a glove and I like it! So comfortable and flattering in every way. My husband said “hubba hubba,” when I came down the stairs.... \" Read more 88 customers mention flattering, 83 positive, 5 negative 88 customers mention \"Flattering\" 83 positive 5 negative Customers find the dress flattering, particularly noting its curves and ruffles on the bias cut, with one customer specifically mentioning how it enhances the stomach area. \" Such a great purchase! Flattering and super cute and sturdy. I am 4’11 and 140 pounds. Small was a perfect fit!! \" Read more \" ... Very flattering ! It was slightly see through and I could see the bottom of my spanx, but it wasn’t enough to return.... \" Read more \" Prettiest dress ever. So flattering . Very comfortable. I didnt even have to wear shape wear it makes me look snatched and has alot of stretch.... \" Read more \" I LOVE this dress! Super flattering , the length is perfect, not too tight that it’s unforgiving, the ruffles really distract away from any belly... \" Read more 60 customers mention stretchiness, 58 positive, 2 negative 60 customers mention \"Stretchiness\" 58 positive 2 negative Customers appreciate the dress's stretchiness and flexibility. \" ...It’s very comfortable and true to size. It’s stretchy which I loved and breathable so sweating wasn’t a problem. I can dress it up or down.... \" Read more \" Love this dress! So stretchy and soft. Looks elegant and is very flattering shape. Bandeau actually stays up without needing to constantly adjust.... \" Read more \" Fit is soooo flattering! Super stretchy and comfortable, didn’t slide up or down at all! 5’4” 160 lbs and the medium fit perfect! \" Read more \" Such a cute dress. Very stretchy and comfortable. Got so many compliments on it \" Read more 46 customers mention material quality, 35 positive, 11 negative 46 customers mention \"Material quality\" 35 positive 11 negative Customers like the dress's material, describing it as nice and soft, with some noting that it is lined with rubber. \" Wore to a wedding party. Fit great. Color was spot on. Good material . True to size. 5’8 ~150 lbs with a size Medium.... \" Read more \" In the hot weather this dress was great!! It’s so stretchy and soft material . I was worried about it staying up but it worked great.... \" Read more \" ...The dress is lined with a rubber so it won’t fall down. Great material and didn’t have to iron or steam!... \" Read more \" This is pretty and fit true to size, but fabric felt cheap and was see through on the back where there are no ruffles and is not lined. Returned. \" Read more 41 customers mention size, 31 positive, 10 negative 41 customers mention \"Size\" 31 positive 10 negative Customers are satisfied with the dress's size, with some finding it perfect, and one mentioning that the sizing and color are accurate. \" ...I received many compliments. It’s very comfortable and true to size . It’s stretchy which I loved and breathable so sweating wasn’t a problem.... \" Read more \" Beautiful! Just like the picture and perfect size \" Read more \" size down and very comfy and cute... \" Read more \" This dress would be cute, it is just too big and the material is too clingy.... \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Perfect!",
        "body": "This dress is absolutely beautiful. I ordered a medium in black and the fit is perfect—comfortable, flattering, and effortless. I do wish the back had the same ruffle detail as the front for a more balanced look, but it’s still a stunning piece. I can’t wait to wear it on my Bahamas vacation for a romantic evening dinner. Read more",
        "author": "The Shopping Bee",
        "rating": 5.0,
        "date": "December 10, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Want to look hot? Must order!",
        "body": "I recently purchased this black strapless long flowing dress, and I’m absolutely in love with it! The fit is impeccable— I'm 5'7\" 129 lbs. and ordered a small - the top provides just the right amount of support while still being comfortable, and the flowing skirt moves so beautifully. It has a classic, timeless look that makes it perfect for any special occasion, whether it's a wedding, formal dinner, or a night out. The fabric is soft, lightweight, and breathable, which makes it a great option even for warmer weather or longer events. What really stands out about this dress is how effortlessly it combines elegance and comfort. It’s the kind of dress that makes you feel confident and graceful without feeling restricted or uncomfortable. The black color is versatile and flattering on any skin tone, and it’s easy to accessorize—whether you prefer statement jewelry or a simple clutch, this dress complements any style. If you’re looking for a stunning, yet comfortable dress that can take you from one event to the next, this is the one to buy. You won’t regret adding this beauty to your wardrobe! Read more",
        "author": "NB",
        "rating": 5.0,
        "date": "April 21, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Great dress for the price",
        "body": "I bought this for a wedding and the dress was beautiful. It was comfortable, stretchy, and the color matched the description. Read more",
        "author": "SJ",
        "rating": 5.0,
        "date": "December 8, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Fits to size",
        "body": "Fits perfectly, doesn't fall down like most strapless dresses. Comfortable, not see through, and very flattering Read more",
        "author": "Works great, doesn’t make hair greasy either.",
        "rating": 4.0,
        "date": "October 8, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Very pretty!",
        "body": "Very pretty and comfortable- can be dressed up or down- true to size! Navy was just pike pic! Read more",
        "author": "Elizabeth",
        "rating": 5.0,
        "date": "December 11, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Perfect dress !",
        "body": "This dress was so perfect for November wedding in Florida! I received tons of compliments and it was extremely flattering while also being very comfortable! 10/10 would recommend. The material is stretchy without be constricting. I am 5'7\" 165 lbs and the Large fit perfectly. Novy. Read more",
        "author": "PK",
        "rating": 5.0,
        "date": "November 17, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Wanting to purchase more colors.",
        "body": "Quilts was chefs kiss! Super soft! I am 4 months postpartum and it helped me hide that extra baby weight I still have. The color was a perfect choice for my olive complexion.i threw this on right quick for a wedding. I felt comfortable but classy. Read more",
        "author": "Kenzie",
        "rating": 5.0,
        "date": "November 5, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Perfect rehersal dinner dress",
        "body": "This dress is absolutely stunning! I ordered this dress last minute for a destination wedding. I am about 5'2-5'3 weigh about 170 lbs (athletic built),D and size 36d in bras. This dress was great it was very comfortable, lightweight, and easy to dress up or down! So glad it turned out like the picture and it fit like a glove. Read more",
        "author": "Customer",
        "rating": 5.0,
        "date": "September 14, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Dress Cocktail Bodycon Ruched is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.",
  "about_this_item": "Womens Dress Cocktail Bodycon Ruched is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.",
  "long_description": "Womens Dress Cocktail Bodycon Ruched is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Light Brown, Brown, Blue, Apricot, Army Green, Black, Orange, Dark Green, Light Blue, Red, Rose Red, Bright Blue, Lake Blue, Navy. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Dress Cocktail Bodycon Ruched is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Light Brown, Brown, Blue, Apricot, Army Green, Black, Orange, Dark Green, Light Blue, Red, Rose Red, Bright Blue, Lake Blue, Navy. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "d591c95b-413b-4e44-87fe-bb7f735b6129",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d591c95b-413b-4e44-87fe-bb7f735b6129/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d591c95b-413b-4e44-87fe-bb7f735b6129/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/2a09f5d6-d40e-4210-a6e6-e7aa598ddf16.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "92fcd353-d472-40ec-8213-97538c4aaf5f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/92fcd353-d472-40ec-8213-97538c4aaf5f/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/92fcd353-d472-40ec-8213-97538c4aaf5f/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/2a09f5d6-d40e-4210-a6e6-e7aa598ddf16.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "9989d34d-86cb-4baa-b5b4-a032a1753a45",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9989d34d-86cb-4baa-b5b4-a032a1753a45/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9989d34d-86cb-4baa-b5b4-a032a1753a45/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/2a09f5d6-d40e-4210-a6e6-e7aa598ddf16.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "19611723-4767-4d07-8a98-8b6c65aee7c0",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/19611723-4767-4d07-8a98-8b6c65aee7c0/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/19611723-4767-4d07-8a98-8b6c65aee7c0/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/2a09f5d6-d40e-4210-a6e6-e7aa598ddf16.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "24db8f47-7b9b-4629-b83e-9e47deb9324a",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/24db8f47-7b9b-4629-b83e-9e47deb9324a/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/24db8f47-7b9b-4629-b83e-9e47deb9324a/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/2a09f5d6-d40e-4210-a6e6-e7aa598ddf16.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "7b9afb51-9c20-453b-ae5e-16304ebd64cd",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7b9afb51-9c20-453b-ae5e-16304ebd64cd/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7b9afb51-9c20-453b-ae5e-16304ebd64cd/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/2a09f5d6-d40e-4210-a6e6-e7aa598ddf16.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "80bc9724-a8c7-4509-840f-c46740d964a7",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/80bc9724-a8c7-4509-840f-c46740d964a7/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/80bc9724-a8c7-4509-840f-c46740d964a7/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/2a09f5d6-d40e-4210-a6e6-e7aa598ddf16.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "8aecceb7-7499-49b0-b4ae-c41188c490b9",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8aecceb7-7499-49b0-b4ae-c41188c490b9/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8aecceb7-7499-49b0-b4ae-c41188c490b9/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/2a09f5d6-d40e-4210-a6e6-e7aa598ddf16.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "b682917b-c914-44f3-900c-5d9e25d84153",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b682917b-c914-44f3-900c-5d9e25d84153/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b682917b-c914-44f3-900c-5d9e25d84153/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/2a09f5d6-d40e-4210-a6e6-e7aa598ddf16.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "64e739f8-da5b-443e-b187-d8f5e9b0ff00",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/64e739f8-da5b-443e-b187-d8f5e9b0ff00/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/64e739f8-da5b-443e-b187-d8f5e9b0ff00/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/2a09f5d6-d40e-4210-a6e6-e7aa598ddf16.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "6a9d7fda-2ad9-4586-a7f4-6b2dc13b26b5",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6a9d7fda-2ad9-4586-a7f4-6b2dc13b26b5/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6a9d7fda-2ad9-4586-a7f4-6b2dc13b26b5/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/2a09f5d6-d40e-4210-a6e6-e7aa598ddf16.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "913250a4-7faa-4a7b-806a-d168ed244f72",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/913250a4-7faa-4a7b-806a-d168ed244f72/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/913250a4-7faa-4a7b-806a-d168ed244f72/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/2a09f5d6-d40e-4210-a6e6-e7aa598ddf16.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Light Brown": "https://m.media-amazon.com/images/I/31fiAjKdNnL._AC_SR38,50_.jpg",
    "Brown": "https://m.media-amazon.com/images/I/31bE5sgS7LL._AC_SR38,50_.jpg",
    "Blue": "https://m.media-amazon.com/images/I/31S-z0awV9L._AC_SR38,50_.jpg",
    "Apricot": "https://m.media-amazon.com/images/I/317SrzECmRL._AC_SR38,50_.jpg",
    "Army Green": "https://m.media-amazon.com/images/I/31PY+Owc2UL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31Onzu1FcTL._AC_SR38,50_.jpg",
    "Orange": "https://m.media-amazon.com/images/I/31xL3RoY0nL._AC_SR38,50_.jpg",
    "Dark Green": "https://m.media-amazon.com/images/I/31pvTyzO+6L._AC_SR38,50_.jpg",
    "Light Blue": "https://m.media-amazon.com/images/I/31UrX43P8aL._AC_SR38,50_.jpg",
    "Red": "https://m.media-amazon.com/images/I/31P7k4-rJ8L._AC_SR38,50_.jpg",
    "Rose Red": "https://m.media-amazon.com/images/I/31iRjpfPR-L._AC_SR38,50_.jpg",
    "Bright Blue": "https://m.media-amazon.com/images/I/31ug76q+S9L._AC_SR38,50_.jpg",
    "Lake Blue": "https://m.media-amazon.com/images/I/31alW1Ozq1L._AC_SR38,50_.jpg",
    "Navy": "https://m.media-amazon.com/images/I/31nEDFjZ7gL._AC_SR38,50_.jpg",
    "Wine Red": "https://m.media-amazon.com/images/I/31wEvWqv8GL._AC_SR38,50_.jpg",
    "Khaki": "https://m.media-amazon.com/images/I/31pOv1j2-iL._AC_SR38,50_.jpg",
    "White": "https://m.media-amazon.com/images/I/31O-yrpdhLL._AC_SR38,50_.jpg",
    "Yellow": "https://m.media-amazon.com/images/I/31j5BkJOVWL._AC_SR38,50_.jpg",
    "Light Pink": "https://m.media-amazon.com/images/I/31LbbXeD5rL._AC_SR38,50_.jpg",
    "Caramel": "https://m.media-amazon.com/images/I/313OlfjwVoL._AC_SR38,50_.jpg",
    "Grey Purple": "https://m.media-amazon.com/images/I/3184-lUWCKL._AC_SR38,50_.jpg",
    "Rust Red": "https://m.media-amazon.com/images/I/31j8cqSDB4L._AC_SR38,50_.jpg",
    "Green": "https://m.media-amazon.com/images/I/31VA5IJYI5L._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Light Brown": "613R46ENlwL",
    "Brown": "61tT8QC6KYL",
    "Blue": "61GQoRih4RL",
    "Apricot": "61yYhTmi18L",
    "Army Green": "61J5Xc+SUwL",
    "Black": "61cptP2xc5L",
    "Orange": "61kNr9VZX1L",
    "Dark Green": "61VOciCtaEL",
    "Light Blue": "61seUKJeTrL",
    "Red": "61v2YhU1UoL",
    "Rose Red": "61wX7OVjkXL",
    "Bright Blue": "61-tkZTezCL",
    "Lake Blue": "61T21BJsS0L",
    "Navy": "61m-C+jQt4L",
    "Wine Red": "61zj6mj1MyL",
    "Khaki": "61KnxW3sRuL",
    "White": "61pbQfZlu+L",
    "Yellow": "61MVBflyGBL",
    "Light Pink": "61bQy-X++iL",
    "Caramel": "618E1qy-QbL",
    "Grey Purple": "61ZZm9pa2cL",
    "Rust Red": "61DUAfFe4nL",
    "Green": "61ljOXKwRWL"
  },
  "color_images": {
    "Light Brown": [
      "https://m.media-amazon.com/images/I/613R46ENlwL._SL1500_.jpg"
    ],
    "Brown": [
      "https://m.media-amazon.com/images/I/61tT8QC6KYL._SL1500_.jpg"
    ],
    "Blue": [
      "https://m.media-amazon.com/images/I/61GQoRih4RL._SL1500_.jpg"
    ],
    "Apricot": [
      "https://m.media-amazon.com/images/I/61yYhTmi18L._SL1500_.jpg"
    ],
    "Army Green": [
      "https://m.media-amazon.com/images/I/61J5Xc+SUwL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/61cptP2xc5L._SL1500_.jpg"
    ],
    "Orange": [
      "https://m.media-amazon.com/images/I/61kNr9VZX1L._SL1500_.jpg"
    ],
    "Dark Green": [
      "https://m.media-amazon.com/images/I/61VOciCtaEL._SL1500_.jpg"
    ],
    "Light Blue": [
      "https://m.media-amazon.com/images/I/61seUKJeTrL._SL1500_.jpg"
    ],
    "Red": [
      "https://m.media-amazon.com/images/I/61v2YhU1UoL._SL1500_.jpg"
    ],
    "Rose Red": [
      "https://m.media-amazon.com/images/I/61wX7OVjkXL._SL1500_.jpg"
    ],
    "Bright Blue": [
      "https://m.media-amazon.com/images/I/61-tkZTezCL._SL1500_.jpg"
    ],
    "Lake Blue": [
      "https://m.media-amazon.com/images/I/61T21BJsS0L._SL1500_.jpg"
    ],
    "Navy": [
      "https://m.media-amazon.com/images/I/61m-C+jQt4L._SL1500_.jpg"
    ],
    "Wine Red": [
      "https://m.media-amazon.com/images/I/61zj6mj1MyL._SL1500_.jpg"
    ],
    "Khaki": [
      "https://m.media-amazon.com/images/I/61KnxW3sRuL._SL1500_.jpg"
    ],
    "White": [
      "https://m.media-amazon.com/images/I/61pbQfZlu+L._SL1500_.jpg"
    ],
    "Yellow": [
      "https://m.media-amazon.com/images/I/61MVBflyGBL._SL1500_.jpg"
    ],
    "Light Pink": [
      "https://m.media-amazon.com/images/I/61bQy-X++iL._SL1500_.jpg"
    ],
    "Caramel": [
      "https://m.media-amazon.com/images/I/618E1qy-QbL._SL1500_.jpg"
    ],
    "Grey Purple": [
      "https://m.media-amazon.com/images/I/61ZZm9pa2cL._SL1500_.jpg"
    ],
    "Rust Red": [
      "https://m.media-amazon.com/images/I/61DUAfFe4nL._SL1500_.jpg"
    ],
    "Green": [
      "https://m.media-amazon.com/images/I/61ljOXKwRWL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-bodycon-long-sleeve",
      "title": "Womens Maxi Dress Bodycon Long Sleeve",
      "price": 37.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61mEacM4-HL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-v-neck-short-sleeve",
      "title": "Womens Dress V Neck Short Sleeve",
      "price": 45.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71GF8D6aXML._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-one-shoulder-formal",
      "title": "Womens Maxi Dress Evening One Shoulder Formal",
      "price": 88.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51dteyRhDhL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-sleeveless-ruched",
      "title": "Womens Dress Sleeveless Ruched",
      "price": 33.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/61e+2lRRZ5L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 40.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71yVMc8pyyL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-off-shoulder",
      "title": "Womens Maxi Dress Off Shoulder",
      "price": 159.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/71gSdMwmvyL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-v-neck-short-sleeve-formal-maxi",
      "title": "Womens Maxi Dress V Neck Short Sleeve Formal Maxi",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71XBVAHbDGL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 51.29,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61PiBYMUlgL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-maxi",
      "title": "Womens Maxi Dress Formal Maxi",
      "price": 31.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51Jg8Q2xhpL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 19.47,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/81XrlLpfU-L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-split-formal-cocktail-bodycon",
      "title": "Womens Dress Split Formal Cocktail Bodycon",
      "price": 45.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/4151Mn-1bQL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-v-neck",
      "title": "Womens Maxi Dress Long Sleeve V Neck",
      "price": 54.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71LLeakgTML._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-bodycon",
      "title": "Womens Maxi Dress Maxi Bodycon",
      "price": 34.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61M7t3v6iUL._SL1500_.jpg"
      ]
    }
  ]
}