{
  "id": "womens-dress-sleeveless-ruched",
  "handle": "womens-dress-sleeveless-ruched",
  "sku": "JC1961",
  "asin": "B0CQLLZSB5",
  "title": "Womens Dress Sleeveless Ruched",
  "title_original": "Memoriesea Women's Sleeveless Spaghetti Strap Ruched Sexy Mini Club Party Dress",
  "brand": "Visit the Memoriesea Store",
  "price": 38.99,
  "social_proof": {
    "bought_past_month": 93,
    "text": "93+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/61VTadcBPsL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81g7izBKDcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81yFAGOY3GL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/712weZXuXvL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61xawks26wL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61FToyDGhmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71S0N5P2eJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71UtxlJxOHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71dqflANu5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71rNFTB5BjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Qmi-ljw9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/715I67riSKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/7139aZsq7cL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61txrqwI6zL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61I8l9rPUkL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/61VTadcBPsL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81g7izBKDcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81yFAGOY3GL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/712weZXuXvL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61xawks26wL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61FToyDGhmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71S0N5P2eJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71UtxlJxOHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71dqflANu5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71rNFTB5BjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Qmi-ljw9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/715I67riSKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/7139aZsq7cL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61txrqwI6zL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61I8l9rPUkL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Product Dimensions ‏": "‎ 6.3 x 4.72 x 0.39 inches",
    "Item model number ‏": "‎ ME054",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ December 19, 2023",
    "ASIN ‏": "‎ B0CQLJ6F8B",
    "Best Sellers Rank": "#74,884 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #415 in Women's Club & Night Out Dresses",
    "Customer Reviews": "4.1 4.1 out of 5 stars (470)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Red",
      "Rose Red",
      "Tender Green",
      "Deep Blue",
      "Purple",
      "Army Green",
      "Black",
      "Shallow Apricot"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.1,
    "count": 470,
    "customers_say": "Customers find the dress gorgeous and appreciate its thick, soft fabric that hugs the body well. The dress fits nicely and is comfortable, with one customer noting it compliments the waist and hips incredibly well. The length receives mixed feedback, with some saying it's perfect while others find it too short in the front. Generated from the text of customer reviews Select to learn more Appearance (83) Fit (63) Fabric quality (50) Quality (45) Flattering (30) Size (27) Comfort (22) Length (22) 83 customers mention appearance, 78 positive, 5 negative 83 customers mention \"Appearance\" 78 positive 5 negative Customers find the dress gorgeous and feel beautiful when wearing it. \" This red is so beautiful !! The fit was very nice. The dress is very high quality and the length was perfect. Not too long, not too short. \" Read more \" Beautiful dress . Silky and the fit was just right. Very classy but sexy as well \" Read more \" Cute but also oddly shaped. Color and length is true to picture. The side flaps are odd and doesn’t really fall right. Ended up retuning. \" Read more \" I think this dress is super cute , the back is a little simple compared to the front and a little bit loser too, the front is super cute though! \" Read more 63 customers mention fit, 51 positive, 12 negative 63 customers mention \"Fit\" 51 positive 12 negative Customers like how the dress fits, noting it's not too loose. \" Perfect fit ! A little loose in the bust area, but we took it in a bit. She loved this dress for homecoming! 10/10 !!!! \" Read more \" Bought for wife for anniversary dinner. Fit great , soft material. Good quality \" Read more \" Will have to be steamed but overall I loved the fit of this dress . Not to mention the color is BEAUTIFUL in person!... \" Read more \" ...The combination fabric is moderately stretchy but not too loose . Great idea for a cute, comfortable dress that won’t break the bank. \" Read more 50 customers mention fabric quality, 39 positive, 11 negative 50 customers mention \"Fabric quality\" 39 positive 11 negative Customers appreciate the fabric of the dress, describing it as silky and soft. \" The fabric on this dress is so soft and luxurious for the price! I got so many compliments on this dress, for the price it's a 10/10 \" Read more \" Beautiful dress. Silky and the fit was just right. Very classy but sexy as well \" Read more \" Doesn’t work well for larger chest size. Had to return. Swim suit material which is comfortable and nice, just didn’t work for my body type. \" Read more \" Swimsuit material , looked cheap despite the amazing fit and i ended up returning \" Read more 45 customers mention quality, 38 positive, 7 negative 45 customers mention \"Quality\" 38 positive 7 negative Customers find the dress to be of good quality. \" ...This dress is perfect. It fits really well. It looks classy. Good quality . It’s just beautiful. \" Read more \" Birthday Dinner dress. Perfect and comfortable \" Read more \" ...this product because it’s cheap and has no reviews, but omg this dress is perfect !... \" Read more \" most perfect dress ever \" Read more 30 customers mention flattering, 26 positive, 4 negative 30 customers mention \"Flattering\" 26 positive 4 negative Customers find the dress flattering, particularly noting how it hugs the body and smooths the tummy area, with one customer mentioning it compliments the waist and hips incredibly well. \" ...Not see-through. Great quality. Sketchy and flattering ! Color was vibrant. Received so many compliments, very comfortable and flattering on curves. \" Read more \" ...It is so flattering and makes my waste look so tiny. I showed my friend and she ran to buy the same one! Highly recommend! \" Read more \" ...It is VERY flattering . And comfortable! I cannot believe how perfectly it fits. You can't tell by looking at it, but the fabric is stretchy. \" Read more \" ...The dress fit her well and was figure flattering . We did need to purchase a strapless bra because the bodice wasn’t supportive enough for her. \" Read more 27 customers mention size, 19 positive, 8 negative 27 customers mention \"Size\" 19 positive 8 negative Customers find the dress fits well, with one mentioning it's perfect for larger bust sizes and another noting it makes the waist look smaller. \" ...Not too short, true to size . It also has adjustable straps. Good price nice homecoming dress. Would definitely recommend. \" Read more \" I bought the red dress in both medium and large, the medium was perfect . I’m 159 pounds and 5’6 with a c cup bra.... \" Read more \" Sassy little dress. Snatched at the waist. Not stretchy and not big boob (not DD) friendly. That's in a medium size. \" Read more \" I was worried that the material would be thin but it’s thick! Very plus size friendly , comfortable, flattering and worth it for the price. \" Read more 22 customers mention comfort, 22 positive, 0 negative 22 customers mention \"Comfort\" 22 positive 0 negative Customers find the dress comfortable, with one mentioning its stretchy material. \" I LOVED WEARING THIS DRESS FOR MY HALLOWEEN COSTUME. I was so comfortable fabric is soft even though it's satin smooth felt great against my body... \" Read more \" ...True to size and it’s so soft and comfy . For reference I’m 4’11 and 130lbs and I got a medium! \" Read more \" ...The fit was great true to size very comfortable was not see-through. Very good quality and a very, very pretty dress. \" Read more \" I actually really liked this dress. It was super comfortable and flattering. It’s double lined and the material is very soft.... \" Read more 22 customers mention length, 13 positive, 9 negative 22 customers mention \"Length\" 13 positive 9 negative Customers have mixed opinions about the dress's length, with some finding it perfect while others say it's way too short in the front. \" last min birthday dress that everyone loved. not too short and had great support in chest area. stretch is great. Ill be ordering in another color! \" Read more \" So buttery smooth and sexy, but just too short in the back if you have some junk in the trunk! Also one of my straps came broken. \" Read more \" ...I love that is silk, soft and just the perfect length for me and I am 5’8” not too short no too long. Totally recommend. \" Read more \" ...it’s a little short for me but i am 5’8 so that may be why.... \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Perfect satin dress for teenagers and young women!",
        "body": "The dress was beautiful on my daughter! She wore it to her Homecoming dance and felt comfortable and pretty. It was long enough for her 5 foot 4 inch frame and fit perfectly. Great value for the money and fast shipping. Read more",
        "author": "Dana T",
        "rating": 5.0,
        "date": "November 6, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/719KrOUsKzL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Black cocktail dress",
        "body": "I bought this dress for my daughter. The fit was great true to size very comfortable was not see-through. Very good quality and a very, very pretty dress. Read more",
        "author": "Nancy alphonse",
        "rating": 5.0,
        "date": "November 18, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Good quality, very pretty dress",
        "body": "Love it, beautiful, good fit and bold color? Read more",
        "author": "Jenny",
        "rating": 5.0,
        "date": "November 18, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars super cute and flattering dress!",
        "body": "this dress was very pretty! i loved the vibrant color and the way it fit my body. as a thicker girl it didn’t emphasize my curves too much. It did ship was some fabric strands but that’s all. i do recommend wearing sticky boobs. Read more",
        "author": "Megean Garrant",
        "rating": 4.0,
        "date": "November 4, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/818+EUdG8EL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/81nHQyxs90L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "3.0 out of 5 stars It's a cute dress.",
        "body": "Sassy little dress. Snatched at the waist. Not stretchy and not big boob(not DD) friendly. That's in a medium size. Read more",
        "author": "Ro Cruz",
        "rating": 3.0,
        "date": "November 27, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Way better than I thought it was gonna be",
        "body": "This dress was surprisingly perfect. The material was good. It has a little bit of padding in the chest area to hold you up. Not too short, true to size. It also has adjustable straps. Good price nice homecoming dress. Would definitely recommend. Read more",
        "author": "Amy H Frost",
        "rating": 5.0,
        "date": "October 8, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "1.0 out of 5 stars Way too short in the front",
        "body": "I was sooo disappointed in this dress. It feels like a swimsuit cover up and it’s SOOOO much shorter than it advertises. Like the back length was fine but the front was SO short. I had too much faith in the dress and now I’m scrambling for a new one in time for my event. Read more",
        "author": "Kellie",
        "rating": 1.0,
        "date": "October 10, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Cute and comfy",
        "body": "Very cute and comfy. My daughter loved it. True to size. Read more",
        "author": "Layla",
        "rating": 5.0,
        "date": "December 17, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Dress Sleeveless Ruched is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.",
  "about_this_item": "Womens Dress Sleeveless Ruched is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.",
  "long_description": "Womens Dress Sleeveless Ruched is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Red, Rose Red, Tender Green, Deep Blue, Purple, Army Green, Black, Shallow Apricot. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Dress Sleeveless Ruched is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Red, Rose Red, Tender Green, Deep Blue, Purple, Army Green, Black, Shallow Apricot. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "aeb3edb1-c0ee-4be5-ad45-ba87e65f47f8",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/aeb3edb1-c0ee-4be5-ad45-ba87e65f47f8/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/aeb3edb1-c0ee-4be5-ad45-ba87e65f47f8/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "da417a2b-92b0-4975-84af-79c4fc4515c3",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/da417a2b-92b0-4975-84af-79c4fc4515c3/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/da417a2b-92b0-4975-84af-79c4fc4515c3/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "18a0d981-e045-46dc-b61b-aedee1353c7d",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/18a0d981-e045-46dc-b61b-aedee1353c7d/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/18a0d981-e045-46dc-b61b-aedee1353c7d/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "f02b7d83-5112-4499-9380-6d41b9c11afe",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f02b7d83-5112-4499-9380-6d41b9c11afe/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f02b7d83-5112-4499-9380-6d41b9c11afe/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "6f9b5a34-388d-422e-ad7a-67a152b65319",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6f9b5a34-388d-422e-ad7a-67a152b65319/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6f9b5a34-388d-422e-ad7a-67a152b65319/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "a90cb6d5-8fb1-4440-a201-71d373480e97",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a90cb6d5-8fb1-4440-a201-71d373480e97/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a90cb6d5-8fb1-4440-a201-71d373480e97/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Red": "https://m.media-amazon.com/images/I/41GvaNc8sEL._AC_SR38,50_.jpg",
    "Rose Red": "https://m.media-amazon.com/images/I/41vxskxuoKL._AC_SR38,50_.jpg",
    "Tender Green": "https://m.media-amazon.com/images/I/41jHcMXzr+L._AC_SR38,50_.jpg",
    "Deep Blue": "https://m.media-amazon.com/images/I/41fZ9jMH-UL._AC_SR38,50_.jpg",
    "Purple": "https://m.media-amazon.com/images/I/41ndAUSUGaL._AC_SR38,50_.jpg",
    "Army Green": "https://m.media-amazon.com/images/I/41KZ3Z3Sr1L._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/41zEwIudBSL._AC_SR38,50_.jpg",
    "Shallow Apricot": "https://m.media-amazon.com/images/I/412CJ36Z+EL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Red": "61VTadcBPsL",
    "Rose Red": "71dqflANu5L",
    "Tender Green": "71rNFTB5BjL",
    "Deep Blue": "71Qmi-ljw9L",
    "Purple": "715I67riSKL",
    "Army Green": "7139aZsq7cL",
    "Black": "61txrqwI6zL",
    "Shallow Apricot": "61I8l9rPUkL"
  },
  "color_images": {
    "Red": [
      "https://m.media-amazon.com/images/I/61VTadcBPsL._SL1500_.jpg"
    ],
    "Rose Red": [
      "https://m.media-amazon.com/images/I/71dqflANu5L._SL1500_.jpg"
    ],
    "Tender Green": [
      "https://m.media-amazon.com/images/I/71rNFTB5BjL._SL1500_.jpg"
    ],
    "Deep Blue": [
      "https://m.media-amazon.com/images/I/71Qmi-ljw9L._SL1500_.jpg"
    ],
    "Purple": [
      "https://m.media-amazon.com/images/I/715I67riSKL._SL1500_.jpg"
    ],
    "Army Green": [
      "https://m.media-amazon.com/images/I/7139aZsq7cL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/61txrqwI6zL._SL1500_.jpg"
    ],
    "Shallow Apricot": [
      "https://m.media-amazon.com/images/I/61I8l9rPUkL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-split-bodycon",
      "title": "Womens Maxi Dress Split Bodycon",
      "price": 34.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61YklR8lsIL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 21.8,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/61c5mGhNGcL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-sleeveless",
      "title": "Womens Dress Sleeveless",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71quZoNcLYL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-sleeveless-bodycon-ruched",
      "title": "Womens Dress Sleeveless Bodycon Ruched",
      "price": 42.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/61h8nvJmO0L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi",
      "title": "Womens Maxi Dress Maxi",
      "price": 43.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/413UCdbFLJL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-ruched-long-sleeve",
      "title": "Womens Maxi Dress Ruched Long Sleeve",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/715yiy8W4iL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-ruched",
      "title": "Womens Dress Ruched",
      "price": 44.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Work",
      "images": [
        "https://m.media-amazon.com/images/I/61U6rUCl9DL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-formal-evening",
      "title": "Womens Maxi Dress Bodycon Formal Evening",
      "price": 84.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71U2eEXJmwL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 279.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51OU0vlXStL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening",
      "title": "Womens Maxi Dress Formal Evening",
      "price": 65.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51Dt7qcYrWL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-maxi-bodycon",
      "title": "Womens Maxi Dress Cocktail Maxi Bodycon",
      "price": 32.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51hVQ7CE67L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 36.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61Uh0mHFneL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-evening-mermaid",
      "title": "Womens Maxi Dress Long Sleeve Evening Mermaid",
      "price": 179.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/814SaE2FzTL._SL1500_.jpg"
      ]
    }
  ]
}