{
  "id": "womens-dress-bodycon",
  "handle": "womens-dress-bodycon",
  "sku": "JC2866",
  "asin": "B0CQ8K495D",
  "title": "Womens Dress Bodycon",
  "title_original": "Women's Bodycon Pencil Dress Church Teacher Office Modest Business Wear to Work Sheath Suiting Dresses",
  "brand": "Visit the PerZeal Store",
  "price": 39.99,
  "social_proof": {
    "bought_past_month": 236,
    "text": "236+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/51Z-Rrx3suL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51PhRAyZ5UL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51mxdga-bSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51LBpAUmk0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51+bqXTXdyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51+I9wXyl2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51r4ajWYUxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/519jg3jVj8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61lgrc-02EL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61O3GlahEXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ULuvGdhmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Cs+aqDfdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61EzvIJ2MKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51hQ+Ea2IDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51Fa78v-HLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51U462FadkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ehaI2mC9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61XjVEtgwoL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61nbIPoL-BL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51W3XZQvkVL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51IBjzws0XL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51y81ozkJ0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51UhptVUhdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61aAazmpEZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61JYCebP+7L._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/51Z-Rrx3suL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51PhRAyZ5UL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51mxdga-bSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51LBpAUmk0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51+bqXTXdyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51+I9wXyl2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51r4ajWYUxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/519jg3jVj8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61lgrc-02EL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61O3GlahEXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ULuvGdhmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Cs+aqDfdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61EzvIJ2MKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51hQ+Ea2IDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51Fa78v-HLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51U462FadkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ehaI2mC9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61XjVEtgwoL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61nbIPoL-BL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51W3XZQvkVL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51IBjzws0XL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51y81ozkJ0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51UhptVUhdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61aAazmpEZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61JYCebP+7L._SL1500_.jpg"
  ],
  "aplus_images": [
    "https://m.media-amazon.com/images/I/31QHPafFlnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31SNJqo5qmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31aWBr0DibL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31F5XOc2TFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31Dwzh1rnjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31SdfeHNDiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/319Iy3rXCDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41v7QuK9vaL._SL1500_.jpg"
  ],
  "description_images": [
    "https://m.media-amazon.com/images/I/31QHPafFlnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31SNJqo5qmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31aWBr0DibL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31F5XOc2TFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31Dwzh1rnjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31SdfeHNDiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/319Iy3rXCDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41v7QuK9vaL._SL1500_.jpg"
  ],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ December 14, 2023",
    "ASIN ‏": "‎ B0DCWWZCMT",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#17,834 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #4 in Women's Wear to Work Dresses",
    "Customer Reviews": "4.1 4.1 out of 5 stars (1,826)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Work",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Blue",
      "Burgundy",
      "Red( Dark )",
      "Pink( Dark )",
      "Grey( Dark )",
      "Orange",
      "Light Blue",
      "Rose Red",
      "1 Black",
      "Purple( Dark )",
      "Navy",
      "Lavender",
      "Brown( Light )",
      "Beige",
      "Grey( Light )",
      "2 White",
      "Mustard Yellow",
      "Red( Light )",
      "Turquoise",
      "Green"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.1,
    "count": 1826,
    "customers_say": "Customers find the dress stylish and perfect for curvy bodies, with one noting it flatters all body types. Moreover, the dress receives positive feedback for its comfort, vibrant color, and quality. However, the fit and material quality receive mixed reviews, with some finding it true to size while others say it's not true to size, and some praising the fabric while others find it thin. Additionally, the zipper quality is negative, with several customers reporting issues with the zipper. Generated from the text of customer reviews Select to learn more Style (132) Quality (113) Curves (57) Comfort (54) Color (53) Fit (282) Material quality (116) Zipper quality (40) 132 customers mention style, 119 positive, 13 negative 132 customers mention \"Style\" 119 positive 13 negative Customers find the dress stylish, describing it as a perfect little black dress, though some mention it looks cheap. \" This would be cute , the fit is nice, the material is a little see-through, but the darn zipper in the back is broken, it’s just hanging off the back... \" Read more \" Beautiful dress just runs extremely small! I ware a size. 14 this dress was a 2X would not pull over my shoulders. Very very small! \" Read more \" Beautiful , comfortable, classy, great price. Already bought 3 different dresses from them and love every single one and the price is pretty decent \" Read more \" Very true to size. Sleek, sexy, sophisticated, & classy . Wore this to a funeral with hat and gloves. Several compliments on the dress.... \" Read more 113 customers mention quality, 96 positive, 17 negative 113 customers mention \"Quality\" 96 positive 17 negative Customers find the dress to be of good quality, describing it as amazing and nice, with several mentioning it's perfect for their daughters. \" It was nice dress with slight stretchy fabric. I normally wear x-l in all items ordered from Amazon. This was tight!... \" Read more \" Great dress ! Dress was comfortable, I bought it for a summer funeral in Mississippi where it is HOT!... \" Read more \" This is a lovely dress ; however, thie zipper is terrible!... \" Read more \" Love the dress , to big in shoulder area, had to return it for a refund! \" Read more 57 customers mention curves, 54 positive, 3 negative 57 customers mention \"Curves\" 54 positive 3 negative Customers find the dress flattering and perfect for curvy bodies, with one customer noting how it accentuates the waistline. \" Really love this red dress and it’s flattering . Took a star off because the skirt is a bit see through. I’m a size 10 and got a large. \" Read more \" This dress is very flattering and the material is very soft. It even hides my little tummy pouch without looking odd! I love it. Great value. \" Read more \" ...I opted for the dry cleaner since dress should be dry. Cleaned. Flattering dress . \" Read more \" I ordered a 3x I usually wear 1x and it fit very nice. Very slimming look great no wrinkle fabric \" Read more 54 customers mention comfort, 53 positive, 1 negative 54 customers mention \"Comfort\" 53 positive 1 negative Customers find the dress comfortable, with one mentioning it's not hot and sweaty or itchy, and another noting it's very forgiving. \" Beautiful, comfortable , classy, great price. Already bought 3 different dresses from them and love every single one and the price is pretty decent \" Read more \" This dress is very comfortable , the material was not too thin and not too thick. It looks great on, but I would suggest going up 2 sizes.... \" Read more \" Comfortable dress and Great Color! Fit just Right with the perfect length for my height. \" Read more \" Beautiful dress and very flattering. The material is comfortable as well. Very happy with this purchase and the price was amazing!... \" Read more 53 customers mention color, 44 positive, 9 negative 53 customers mention \"Color\" 44 positive 9 negative Customers like the dress's color, describing it as a beautiful black dress with vibrant and true-to-life coloring. \" Comfortable dress and Great Color ! Fit just Right with the perfect length for my height. \" Read more \" ...I love the material. The size is true to size and I love the color . \" Read more \" ...this dress to wear to my grandmother's funeral, but I will say I loved the color , the material and the way it fit. \" Read more \" Very pretty. You will need a slip. Material is fine but nice color and comfortable. \" Read more 282 customers mention fit, 196 positive, 86 negative 282 customers mention \"Fit\" 196 positive 86 negative Customers have mixed opinions about the dress's fit, with some finding it nice and true to size, while others report that it's not true to size and runs large. \" ...Professional, yet classy. Wearing for a retirement party. Perfect fit and true to size at least for me. If you like this dress I’d say buy it.... \" Read more \" True to size , complementary to my body type. Will purchase similar in the future. \" Read more \" ...I love the style but mine is too small so I will be sending it back. I don't want to reorder because the material is too thin for me. \" Read more \" Was a great fit . Purchased it in several colors. Cool enough for summer and warm enough for fall. Wore in the office and to event after work. \" Read more 116 customers mention material quality, 71 positive, 45 negative 116 customers mention \"Material quality\" 71 positive 45 negative Customers have mixed opinions about the dress material, with some finding it nice and appreciating its perfect thickness, while others describe it as very thin and flimsy. \" Love the material and it fix me like it was made just for me. Color is awesome and the size is true. \" Read more \" Cheap material and the dress was not as white as it appeared on the website. \" Read more \" ...Perfect arm length and just below the knee. Great material . Love this dress. Ordered it in green as well \" Read more \" ...to my grandmother's funeral, but I will say I loved the color, the material and the way it fit. \" Read more 40 customers mention zipper quality, 9 positive, 31 negative 40 customers mention \"Zipper quality\" 9 positive 31 negative Customers have mixed experiences with the zipper quality of the dress, with some reporting that 3 out of 4 zippers work properly, while others mention issues with the zipper breaking or being difficult to operate. \" Zipper not working . I can’t wear this dress. I’m very disappointed. \" Read more \" When I put the dress on the zipper kept getting stuck . \" Read more \" This dress is cheaply made! The zipper got stuck and won’t move up or down. I couldn’t get it zipped and neither could anyone else. \" Read more \" ...I am giving it a three star because the zipper is cheap . The material is really year round. No smell, cute if the zipper holds up. Purple.. \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Perfect dress for my daughter and Christmas photos.",
        "body": "My daughter loved this dress and she looked amazing in it. The size was perfect if you follow the size chart (mom’s don’t listen to your child when they tell you what size they wear, pull out their jeans). She said it was comfortable and the quality was great for the price. Read more",
        "author": "M.D.",
        "rating": 5.0,
        "date": "December 2, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71WYHPa85ML._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars PERFECT FIT, PERFECT DRESS.",
        "body": "Unfortunately, I needed a dress for a celebration of life, traveling and unable to / no time to shop, and I took a chance on this dress. I had a not preferred back up, just in case, but I really needed a more appropriate dress. It fit perfectly, so I can say it's true to size. The thickness of the fabric was perfect for January in the cold, the spandex was just the right amount to shape the right amount of stretch, and I found the seams to be tightly sewn, more stitches per inch. The fabric is a bit see-through, but the color black doesn't compromise the look. A lighter color may. I would say that if you put an under-slip kind of garment you probably should use the spandex tight form fitting \"slip,\" not the old style from many years ago. I borrowed the loose kind of slip and had to end up removing it, the dress climbing up the slip! NO!! FASHION FAUX PAS don't work out well, not ever! Read more",
        "author": "ScamFighter",
        "rating": 5.0,
        "date": "May 17, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Affordable and Comfortable Dress in a Sophisticated Shade",
        "body": "This is a nice fitted white dress that's perfect for semi-formal events. The material is thick, comfortable, and feels high quality. It's also very affordable. The color is closer to egg white than a bright white, which gives it a softer, elegant look. Since it's a fitted style, I decided to size up, and the XL fits me perfectly (5'4\", 180 lbs). I'm really pleased with how it looks and feels! Read more",
        "author": "Tembila Covington",
        "rating": 4.0,
        "date": "April 28, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Love It!",
        "body": "I absolutely love this Bodycon Pencil Dress! It’s perfect for work—very professional and polished, and I always get so many compliments when I wear it. The material is incredibly comfortable and breathable, with just the right amount of stretch to move easily throughout the day. I’ve purchased this dress in multiple colors because it fits so well and looks amazing every time. Definitely a wardrobe staple! Read more",
        "author": "Kristi",
        "rating": 5.0,
        "date": "October 8, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Perfect little black dress !",
        "body": "This dress turned out Perfect. I wore it on my anniversary night. I have a tummy so I did wear light shape wear under the dress but it was a very comfortable nice fit. I am 180 and 5’6 it was long enough to wear with the kitten pumps I had on. Read more",
        "author": "Gaius",
        "rating": 5.0,
        "date": "October 20, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/715A7-XQ+vL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/714LYj6w7VL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Flattering dress for all",
        "body": "We ordered 10 of these dresses for a church conference uniform. The sizes ranged from S to 3X. Two of the small size dresses, color burgundy, was a little more red than the rest of the burgundy color in other sizes. The dress is flattering for all body types. Seems to run a little on the small, fitted size but we were happy with them. They are thin, stretchy polyester with zip up back. We have also ordered another color. Could also be dressed up or down depending on the occasion. Read more",
        "author": "Jazzy J",
        "rating": 5.0,
        "date": "September 1, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71h7tO0biDL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "3.0 out of 5 stars Cute but disappointed!",
        "body": "Material has a nice feel; not too thick, not too thin. Great for late summer/early fall. Length comes to the knees. Dress was clearly worn as it came with stains and odor under the arms. Read more",
        "author": "Kim",
        "rating": 3.0,
        "date": "October 5, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Love, love, love",
        "body": "Fit perfectly, not too thin or see through. Read more",
        "author": "Celecia Scott",
        "rating": 4.0,
        "date": "November 16, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61S317AOVPL._SY88._SL1500_.jpg"
        ]
      }
    ]
  },
  "short_description": "Womens Dress Bodycon is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.",
  "about_this_item": "Womens Dress Bodycon is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.",
  "long_description": "Womens Dress Bodycon is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Blue, Burgundy, Red( Dark ), Pink( Dark ), Grey( Dark ), Orange, Light Blue, Rose Red, 1 Black, Purple( Dark ), Navy, Lavender, Brown( Light ), Beige. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Dress Bodycon is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/31QHPafFlnL._SL1500_.jpg",
      "alt": "Womens Dress Bodycon details image 1"
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/31SNJqo5qmL._SL1500_.jpg",
      "alt": "Womens Dress Bodycon details image 2"
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/31aWBr0DibL._SL1500_.jpg",
      "alt": "Womens Dress Bodycon details image 3"
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/31F5XOc2TFL._SL1500_.jpg",
      "alt": "Womens Dress Bodycon details image 4"
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Blue, Burgundy, Red( Dark ), Pink( Dark ), Grey( Dark ), Orange, Light Blue, Rose Red, 1 Black, Purple( Dark ), Navy, Lavender, Brown( Light ), Beige. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/31Dwzh1rnjL._SL1500_.jpg",
      "alt": "Womens Dress Bodycon details image 5"
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "fff56f0f-8251-44db-a633-8cdf4be98b20",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/fff56f0f-8251-44db-a633-8cdf4be98b20/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/fff56f0f-8251-44db-a633-8cdf4be98b20/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/1c5496dd-375e-48b7-9a1b-3cb658e37387.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "e78a4318-fc03-46bd-baae-047cb0919e42",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e78a4318-fc03-46bd-baae-047cb0919e42/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e78a4318-fc03-46bd-baae-047cb0919e42/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/1c5496dd-375e-48b7-9a1b-3cb658e37387.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "bddd8590-7fc1-4d51-aa33-016be0ac8064",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bddd8590-7fc1-4d51-aa33-016be0ac8064/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bddd8590-7fc1-4d51-aa33-016be0ac8064/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/1c5496dd-375e-48b7-9a1b-3cb658e37387.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "b9b35d85-5b7d-4f02-b2a9-da488a8de5e1",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b9b35d85-5b7d-4f02-b2a9-da488a8de5e1/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b9b35d85-5b7d-4f02-b2a9-da488a8de5e1/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/1c5496dd-375e-48b7-9a1b-3cb658e37387.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Blue": "https://m.media-amazon.com/images/I/31NBuZUZtsL._AC_SR38,50_.jpg",
    "Burgundy": "https://m.media-amazon.com/images/I/31HER5vpkRL._AC_SR38,50_.jpg",
    "Red( Dark )": "https://m.media-amazon.com/images/I/31oY+GfGK1L._AC_SR38,50_.jpg",
    "Pink( Dark )": "https://m.media-amazon.com/images/I/31S4JMWh+qL._AC_SR38,50_.jpg",
    "Grey( Dark )": "https://m.media-amazon.com/images/I/31pPOSVH5KL._AC_SR38,50_.jpg",
    "Orange": "https://m.media-amazon.com/images/I/31nfEr1DOML._AC_SR38,50_.jpg",
    "Light Blue": "https://m.media-amazon.com/images/I/31mpJqdaicL._AC_SR38,50_.jpg",
    "Rose Red": "https://m.media-amazon.com/images/I/312ezBJiiRL._AC_SR38,50_.jpg",
    "1 Black": "https://m.media-amazon.com/images/I/31QHPafFlnL._AC_SR38,50_.jpg",
    "Purple( Dark )": "https://m.media-amazon.com/images/I/31hR9Y7sIJL._AC_SR38,50_.jpg",
    "Navy": "https://m.media-amazon.com/images/I/31+UTe+L4UL._AC_SR38,50_.jpg",
    "Lavender": "https://m.media-amazon.com/images/I/31o0wp0kuQL._AC_SR38,50_.jpg",
    "Brown( Light )": "https://m.media-amazon.com/images/I/31b4eqoRODL._AC_SR38,50_.jpg",
    "Beige": "https://m.media-amazon.com/images/I/31ND1VkDIIL._AC_SR38,50_.jpg",
    "Grey( Light )": "https://m.media-amazon.com/images/I/31-TSbQYx+L._AC_SR38,50_.jpg",
    "2 White": "https://m.media-amazon.com/images/I/31+icNDf2VL._AC_SR38,50_.jpg",
    "Mustard Yellow": "https://m.media-amazon.com/images/I/31YngLf44BL._AC_SR38,50_.jpg",
    "Red( Light )": "https://m.media-amazon.com/images/I/31RPvdGRujL._AC_SR38,50_.jpg",
    "Turquoise": "https://m.media-amazon.com/images/I/31zkHNgUhML._AC_SR38,50_.jpg",
    "Green": "https://m.media-amazon.com/images/I/31vTwnOyX8L._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Blue": "51r4ajWYUxL",
    "Burgundy": "519jg3jVj8L",
    "Red( Dark )": "61lgrc-02EL",
    "Pink( Dark )": "61O3GlahEXL",
    "Grey( Dark )": "61ULuvGdhmL",
    "Orange": "61Cs+aqDfdL",
    "Light Blue": "61EzvIJ2MKL",
    "Rose Red": "51hQ+Ea2IDL",
    "1 Black": "51Z-Rrx3suL",
    "Purple( Dark )": "51Fa78v-HLL",
    "Navy": "51U462FadkL",
    "Lavender": "61ehaI2mC9L",
    "Brown( Light )": "61XjVEtgwoL",
    "Beige": "61nbIPoL-BL",
    "Grey( Light )": "51W3XZQvkVL",
    "2 White": "51IBjzws0XL",
    "Mustard Yellow": "51y81ozkJ0L",
    "Red( Light )": "51UhptVUhdL",
    "Turquoise": "61aAazmpEZL",
    "Green": "61JYCebP+7L"
  },
  "color_images": {
    "Blue": [
      "https://m.media-amazon.com/images/I/51r4ajWYUxL._SL1500_.jpg"
    ],
    "Burgundy": [
      "https://m.media-amazon.com/images/I/519jg3jVj8L._SL1500_.jpg"
    ],
    "Red( Dark )": [
      "https://m.media-amazon.com/images/I/61lgrc-02EL._SL1500_.jpg"
    ],
    "Pink( Dark )": [
      "https://m.media-amazon.com/images/I/61O3GlahEXL._SL1500_.jpg"
    ],
    "Grey( Dark )": [
      "https://m.media-amazon.com/images/I/61ULuvGdhmL._SL1500_.jpg"
    ],
    "Orange": [
      "https://m.media-amazon.com/images/I/61Cs+aqDfdL._SL1500_.jpg"
    ],
    "Light Blue": [
      "https://m.media-amazon.com/images/I/61EzvIJ2MKL._SL1500_.jpg"
    ],
    "Rose Red": [
      "https://m.media-amazon.com/images/I/51hQ+Ea2IDL._SL1500_.jpg"
    ],
    "1 Black": [
      "https://m.media-amazon.com/images/I/51Z-Rrx3suL._SL1500_.jpg"
    ],
    "Purple( Dark )": [
      "https://m.media-amazon.com/images/I/51Fa78v-HLL._SL1500_.jpg"
    ],
    "Navy": [
      "https://m.media-amazon.com/images/I/51U462FadkL._SL1500_.jpg"
    ],
    "Lavender": [
      "https://m.media-amazon.com/images/I/61ehaI2mC9L._SL1500_.jpg"
    ],
    "Brown( Light )": [
      "https://m.media-amazon.com/images/I/61XjVEtgwoL._SL1500_.jpg"
    ],
    "Beige": [
      "https://m.media-amazon.com/images/I/61nbIPoL-BL._SL1500_.jpg"
    ],
    "Grey( Light )": [
      "https://m.media-amazon.com/images/I/51W3XZQvkVL._SL1500_.jpg"
    ],
    "2 White": [
      "https://m.media-amazon.com/images/I/51IBjzws0XL._SL1500_.jpg"
    ],
    "Mustard Yellow": [
      "https://m.media-amazon.com/images/I/51y81ozkJ0L._SL1500_.jpg"
    ],
    "Red( Light )": [
      "https://m.media-amazon.com/images/I/51UhptVUhdL._SL1500_.jpg"
    ],
    "Turquoise": [
      "https://m.media-amazon.com/images/I/61aAazmpEZL._SL1500_.jpg"
    ],
    "Green": [
      "https://m.media-amazon.com/images/I/61JYCebP+7L._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress-sleeveless-cocktail-bodycon",
      "title": "Womens Dress Sleeveless Cocktail Bodycon",
      "price": 36.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61NaDgRQ-DL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-maxi-formal-long-sleeve-v-neck",
      "title": "Womens Maxi Dress Cocktail Maxi Formal Long Sleeve V Neck",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61cfJoIR5bL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-sleeveless",
      "title": "Womens Dress Sleeveless",
      "price": 41.28,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61lY17e0IcL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 21.8,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/61c5mGhNGcL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-mermaid-ruched-evening-v-neck",
      "title": "Womens Maxi Dress Formal Mermaid Ruched Evening V Neck",
      "price": 69.88,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51MYR9Nc8RL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-bodycon-ruched-formal-cocktail-maxi",
      "title": "Womens Maxi Dress Bodycon Ruched Formal Cocktail Maxi",
      "price": 67.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61t+0j79QxL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-v-neck",
      "title": "Womens Dress V Neck",
      "price": 19.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/615dowAZsGL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-boat-neck-sleeveless",
      "title": "Womens Dress Boat Neck Sleeveless",
      "price": 19.79,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/518oJldZIfL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 345.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71+iIZQZYxL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-long-sleeve",
      "title": "Womens Maxi Dress Cocktail Long Sleeve",
      "price": 41.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/81saIlybqBL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening",
      "title": "Womens Maxi Dress Formal Evening",
      "price": 84.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51jvA+mhorL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-bodycon-ruched-maxi-cocktail",
      "title": "Womens Maxi Dress Long Sleeve Bodycon Ruched Maxi Cocktail",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/51YdcAHT9EL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-one-shoulder",
      "title": "Womens Maxi Dress Formal One Shoulder",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51lJ+bpf3JL._SL1500_.jpg"
      ]
    }
  ]
}