{
  "id": "womens-maxi-dress-sleeveless-maxi",
  "handle": "womens-maxi-dress-sleeveless-maxi",
  "sku": "JC2282",
  "asin": "B0CR6GMNP3",
  "title": "Womens Maxi Dress Sleeveless Maxi",
  "title_original": "PRETTYGARDEN Women Dresses 2025 Summer Floral Sleeveless Maxi Dress Casual Spaghetti Strap Tiered Flowy Beach Long Dress",
  "brand": "Visit the PRETTYGARDEN Store",
  "price": 32.99,
  "social_proof": {
    "bought_past_month": 1760,
    "text": "1760+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/71xxDeCIXFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91lO2S9kU3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91ZBmVD+5YL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81o+z4JlOWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81miBd-Pu+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91tZb8czJpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ypFihe0+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/712dc99ceaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81l-Sz76ftL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81NxYBYjQNL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81seJcA9+jL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81TystUFsuL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71M9+szciaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81AMCA9mb7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81F23NhpeZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/716gmGmXEUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/818xQ6Dg7FL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81l8oav-8qL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71daPfQitTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81IzAsJqxPL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81toN-aJ6dL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81YotF6YKrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81EnatYDvqL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/71xxDeCIXFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91lO2S9kU3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91ZBmVD+5YL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81o+z4JlOWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81miBd-Pu+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91tZb8czJpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ypFihe0+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/712dc99ceaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81l-Sz76ftL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81NxYBYjQNL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81seJcA9+jL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81TystUFsuL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71M9+szciaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81AMCA9mb7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81F23NhpeZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/716gmGmXEUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/818xQ6Dg7FL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81l8oav-8qL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71daPfQitTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81IzAsJqxPL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81toN-aJ6dL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81YotF6YKrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81EnatYDvqL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ December 29, 2023",
    "ASIN ‏": "‎ B0CR69S9XV",
    "Best Sellers Rank": "#31,952 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #317 in Women's Casual Dresses",
    "Customer Reviews": "4.1 4.1 out of 5 stars (933)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "S-blue White",
      "S-black",
      "S-brick Red Blue",
      "Orange Beige Floral",
      "F-blue Pink",
      "S-khaki",
      "F-purple Red",
      "Leaves Green",
      "F-red Yellow",
      "F-blue-02",
      "F-rust Red",
      "S-rose Red",
      "F-white Blue",
      "S-green",
      "F-blue",
      "F-red",
      "F-pink",
      "Leaves Brown"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.1,
    "count": 933,
    "customers_say": "Customers find the dress gorgeous, comfortable, and flattering, with a soft cotton/linen feel and very nice colors. Moreover, they appreciate its versatility as a summer dress option that works well for various occasions, and one customer mentions it's ideal for daytime to evening plans. However, the fit and fabric quality receive mixed feedback - while some say it runs true to size, others find it runs very big, and while some praise the material, others report poor quality. Generated from the text of customer reviews Select to learn more Style (153) Quality (93) Comfort (65) Color (49) Dress size (41) Flattering (39) Fit (151) Fabric quality (66) 153 customers mention style, 147 positive, 6 negative 153 customers mention \"Style\" 147 positive 6 negative Customers find the dress gorgeous, with one mentioning its nice print and another noting it received lots of compliments. \" Cute but I didn’t like the material. Returning due to material. I can tell it would wrinkle easily. Otherwise it is a good dress.... \" Read more \" The dress was beautiful and true to size, however after the second wash the fabric opened up in several places and the dress can no longer be worn. \" Read more \" This dress is super cute , however, it runs a little big. I'm 5'5 and 140 pounds. I usually wear a large due to being top heavy. The large was baggy.... \" Read more \" Perfect fit and so cute ! Comforatble, great quality, flattering, love the bright colors. Perfect for a spring or summer event \" Read more 93 customers mention quality, 75 positive, 18 negative 93 customers mention \"Quality\" 75 positive 18 negative Customers find the dress well-made, with one customer noting it doesn't feel cheap. \" Perfect fit and so cute! Comforatble, great quality , flattering, love the bright colors. Perfect for a spring or summer event \" Read more \" 5’5” 165 lbs. 38c. Great dress . Material is nice and silky and a bit on the heavier side. Not see thru. Has an under layer built in.... \" Read more \" Love this dress ! Needed help with the tie shoulder straps….but that was a me problem. Received SO many compliments!! Great material and perfect fit.... \" Read more \" very comfy, good quality ! \" Read more 65 customers mention comfort, 60 positive, 5 negative 65 customers mention \"Comfort\" 60 positive 5 negative Customers find the dress comfortable, describing it as beautiful and stress-free, with one customer noting it's not scratchy. \" Dress is super cute and comfortable , but after wearing one time and following the laundering instructions, the dye from the blue stripes ran into... \" Read more \" So cute and comfy , roomy pockets, washes well, easy to steam or iron! Great dress! i love the tie straps because you can adjust the neckline!... \" Read more \" ...Fully lined, very comfortable and flattering, I will be wearing this dress a lot this summer to all kinds of events.... \" Read more \" ...So many compliments. I jus love it and it was so comfortable would buy from this brand again \" Read more 49 customers mention color, 41 positive, 8 negative 49 customers mention \"Color\" 41 positive 8 negative Customers like the colors of the dress, with one specifically mentioning the pink stripes. \" Product is true to size, comfortable, and colors are vibrant . Just right for casual brunch, or patio dinner. I bought a small.... \" Read more \" ...The poor straps seems to gasp for air. Love the color and look of the design- was too hot to wear long in Mexico.... \" Read more \" I LOVE the fit and color of this dress ! This is the dress I wore when I got proposed to and I’m so glad it was because the pictures look so good!!... \" Read more \" I absolutely love this dress. The colors and fabric are beautiful . Already put another color/print in my cart. Tie straps can be tied to suit you.... \" Read more 41 customers mention dress size, 39 positive, 2 negative 41 customers mention \"Dress size\" 39 positive 2 negative Customers find this dress suitable for various occasions, including summer weddings, showers, and birthday parties, with one customer noting it works well for daytime to evening plans. \" This dress is perfect for summer . Loved it so much, I bought another color. I usually wear a medium, but small was a perfect fit.... \" Read more \" The perfect summer dress !... \" Read more \" Great summer dress ... \" Read more \" ...Highly recommend this if you're looking for a lovely, comfortable, summer dress . \" Read more 39 customers mention flattering, 34 positive, 5 negative 39 customers mention \"Flattering\" 34 positive 5 negative Customers find the dress flattering, particularly noting its flattering cut, and one customer mentions it works well for larger chested women. \" Perfect fit and so cute! Comforatble, great quality, flattering , love the bright colors. Perfect for a spring or summer event \" Read more \" Absolutely love this dress, very Flattering , great quality, double layered so its not see through! Also it has pockets!!... \" Read more \" The colors are very nice. The fit is good. True to size. Very flattering dress \" Read more \" Perfect spring / summer dress. Colors are vibrant and cut is very flattering . Lightweight dress and it has pockets! \" Read more 151 customers mention fit, 84 positive, 67 negative 151 customers mention \"Fit\" 84 positive 67 negative Customers have mixed experiences with how the dress fits, with some finding it true to size while others report it runs very big and is too tight in the chest. \" The dress was beautiful and true to size , however after the second wash the fabric opened up in several places and the dress can no longer be worn. \" Read more \" I really like this dress unfortunately it was too big and my bra showed other than that. The selections of colors are nice. It was made well \" Read more \" Great color and fit . I ordered a large based on other reviews about the fitting in the bust area. It worked out fine.... \" Read more \" ...I always buy S and order this dress in S as well. The dress is way too big and no smaller sizes available so I have to send it back. \" Read more 66 customers mention fabric quality, 45 positive, 21 negative 66 customers mention \"Fabric quality\" 45 positive 21 negative Customers have mixed opinions about the fabric of the dress, with some praising its soft cotton/linen feel while others find it not appealing. \" ...The dress was extremely large on me too. The fabric was nice but the dress print looks better in the picture than in person. \" Read more \" I loved the dress. Beautiful fabric , lined, pockets, accurate sizing but no give in the bust. No elastic in the .upper back.... \" Read more \" Very pretty- super heavy with lots of fabric . The poor straps seems to gasp for air.... \" Read more \" ...The color is as expected and beautiful. The fabric is nice and soft and breathable. The top is a little loose but the cut is very flattering. \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Adorable and Comfortable!",
        "body": "I’m obsessed with this PRETTYGARDEN blue and white striped dress! It’s super cute, with adorable ties on the shoulders that add a fun, feminine touch. The dress is lined, so it feels well-made, and it has pockets, which is always a win! I’ve gotten so many compliments every time I wear it. It is also very flattering and is the perfect piece. I love that you can dress it up or make it super casual! The only downside is that the white part of the dress is a little see-through, so in certain lighting, you can see the blue fabric frayed pieces underneath. It’s not a dealbreaker, but something to keep in mind if you're looking for full opacity. Overall, though, I love it and would definitely recommend it! Read more",
        "author": "Cayla",
        "rating": 5.0,
        "date": "June 10, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Very cute dress",
        "body": "Very cute dress. I’m 5ft tall and it goes to my ankles, which is perfect, because normally everything drags the ground. It’s very light and super comfortable and it’s not scratchy. Read more",
        "author": "Jenn's items",
        "rating": 5.0,
        "date": "December 5, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/51RWQ3dv-jL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "4.0 out of 5 stars Super cute",
        "body": "I got a ton of compliments on this dress. I love that the straps are adjustable and can be tied for tightness and length. The color is as expected and beautiful. The fabric is nice and soft and breathable. The top is a little loose but the cut is very flattering. Read more",
        "author": "Chris Ervin",
        "rating": 4.0,
        "date": "June 30, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Beautiful comfortable sun dress!!!",
        "body": "I absolutely LOVED this dress this summer! Its made great! I felt beautiful in it. I love my long dresses in the summer and I actually bought several online here and every single one fit perfectly. I was so happy. This dress is perfect for lunch or dinner or just shopping or a walk in the park. Read more",
        "author": "Jessica Ann Heyde",
        "rating": 5.0,
        "date": "October 23, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Runs big",
        "body": "It’s big through the bodice. Bought a medium, I’m 5’6” 135 36C and I can grab a ‘handful’ on either side of the bodice. Length is fine, it’s pretty and for a full long dress the fabric is light not heavy and washes well. (I was hoping it might shrink a bit-nope). Since I washed it I don’t think I can exchange it. Read more",
        "author": "sculptress",
        "rating": 3.0,
        "date": "June 27, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Gorgeous graduation dress",
        "body": "Love the dress Have bought more colors Fit great,nice flow when walking Just a great dress. Read more",
        "author": "QUEEN",
        "rating": 5.0,
        "date": "November 10, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Just get it!",
        "body": "I absolutely love this dress. The colors and fabric are beautiful. Already put another color/print in my cart. Tie straps can be tied to suit you. Has pockets that don't bulge out and my bra doesn't show under arms. I'm 5'5, 165-170ish lbs, 38DDD, usually size 14 and the large fits perfectly. Highly recommend this if you're looking for a lovely, comfortable, summer dress. Read more",
        "author": "\"Ro\"",
        "rating": 5.0,
        "date": "July 15, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71ubbllXLfL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71h0KAMVHvL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71idzSJZ9OL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Cute Dress!",
        "body": "This dress was a win for a recent vacation. I’m 5’1’ and it was the perfect maxi length. It’s double lined on the skirt and not see through. The straps are thick enough to provide support, especially for those with a larger bust (I'm a 34F). Read more",
        "author": "Sierra A",
        "rating": 5.0,
        "date": "November 11, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Sleeveless Maxi is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.",
  "about_this_item": "Womens Maxi Dress Sleeveless Maxi is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.",
  "long_description": "Womens Maxi Dress Sleeveless Maxi is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: S-blue White, S-black, S-brick Red Blue, Orange Beige Floral, F-blue Pink, S-khaki, F-purple Red, Leaves Green, F-red Yellow, F-blue-02, F-rust Red, S-rose Red, F-white Blue, S-green. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Sleeveless Maxi is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: S-blue White, S-black, S-brick Red Blue, Orange Beige Floral, F-blue Pink, S-khaki, F-purple Red, Leaves Green, F-red Yellow, F-blue-02, F-rust Red, S-rose Red, F-white Blue, S-green. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "3da5dd27-06c9-4b97-8fa0-f63e5a0d08fa",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3da5dd27-06c9-4b97-8fa0-f63e5a0d08fa/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3da5dd27-06c9-4b97-8fa0-f63e5a0d08fa/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/82c43e56-058b-4c06-b43b-c9d03525c489.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "42e7a88d-85da-490f-bead-4244160ad379",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/42e7a88d-85da-490f-bead-4244160ad379/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/42e7a88d-85da-490f-bead-4244160ad379/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/82c43e56-058b-4c06-b43b-c9d03525c489.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "fb62a64e-1b1f-48eb-8ef4-81abe13482bd",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/fb62a64e-1b1f-48eb-8ef4-81abe13482bd/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/fb62a64e-1b1f-48eb-8ef4-81abe13482bd/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/82c43e56-058b-4c06-b43b-c9d03525c489.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "258a9246-40f7-4267-a259-460605325d64",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/258a9246-40f7-4267-a259-460605325d64/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/258a9246-40f7-4267-a259-460605325d64/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/82c43e56-058b-4c06-b43b-c9d03525c489.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "d29f253a-b305-406a-86a5-9a1e5c7a6c60",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d29f253a-b305-406a-86a5-9a1e5c7a6c60/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d29f253a-b305-406a-86a5-9a1e5c7a6c60/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/82c43e56-058b-4c06-b43b-c9d03525c489.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "06664335-1ec5-4928-8f3c-6d7d6cb4556e",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/06664335-1ec5-4928-8f3c-6d7d6cb4556e/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/06664335-1ec5-4928-8f3c-6d7d6cb4556e/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/82c43e56-058b-4c06-b43b-c9d03525c489.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "3812cde9-73c7-4501-addf-584fd3001293",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3812cde9-73c7-4501-addf-584fd3001293/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3812cde9-73c7-4501-addf-584fd3001293/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/82c43e56-058b-4c06-b43b-c9d03525c489.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "9b4d1359-e71e-490f-aa40-12502ce742d3",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9b4d1359-e71e-490f-aa40-12502ce742d3/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9b4d1359-e71e-490f-aa40-12502ce742d3/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/82c43e56-058b-4c06-b43b-c9d03525c489.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "4b243a45-d236-4475-8e75-7cadadbcf4f6",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4b243a45-d236-4475-8e75-7cadadbcf4f6/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4b243a45-d236-4475-8e75-7cadadbcf4f6/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/82c43e56-058b-4c06-b43b-c9d03525c489.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "d040f56b-86b8-4716-8e55-3cf6c2c2a8d8",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d040f56b-86b8-4716-8e55-3cf6c2c2a8d8/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d040f56b-86b8-4716-8e55-3cf6c2c2a8d8/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/82c43e56-058b-4c06-b43b-c9d03525c489.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "2a2332b3-a710-4b46-a279-07edc35e287d",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2a2332b3-a710-4b46-a279-07edc35e287d/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2a2332b3-a710-4b46-a279-07edc35e287d/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/82c43e56-058b-4c06-b43b-c9d03525c489.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "ea6faa1b-4e47-4daa-8917-c011cb376184",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ea6faa1b-4e47-4daa-8917-c011cb376184/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ea6faa1b-4e47-4daa-8917-c011cb376184/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/82c43e56-058b-4c06-b43b-c9d03525c489.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "S-blue White": "https://m.media-amazon.com/images/I/41eBz7ufLTL._AC_SR38,50_.jpg",
    "S-black": "https://m.media-amazon.com/images/I/41yv7z8UvPL._AC_SR38,50_.jpg",
    "S-brick Red Blue": "https://m.media-amazon.com/images/I/41amat4XrnL._AC_SR38,50_.jpg",
    "Orange Beige Floral": "https://m.media-amazon.com/images/I/41iIZmln55L._AC_SR38,50_.jpg",
    "F-blue Pink": "https://m.media-amazon.com/images/I/51-k4MBSffL._AC_SR38,50_.jpg",
    "S-khaki": "https://m.media-amazon.com/images/I/41OeEpMvSvL._AC_SR38,50_.jpg",
    "F-purple Red": "https://m.media-amazon.com/images/I/41bDdaKWnHL._AC_SR38,50_.jpg",
    "Leaves Green": "https://m.media-amazon.com/images/I/41uQGE2s0SL._AC_SR38,50_.jpg",
    "F-red Yellow": "https://m.media-amazon.com/images/I/51yacwHbISL._AC_SR38,50_.jpg",
    "F-blue-02": "https://m.media-amazon.com/images/I/41YP-+TYA9L._AC_SR38,50_.jpg",
    "F-rust Red": "https://m.media-amazon.com/images/I/41oW6ZE89JL._AC_SR38,50_.jpg",
    "S-rose Red": "https://m.media-amazon.com/images/I/41RBoq+-9wL._AC_SR38,50_.jpg",
    "F-white Blue": "https://m.media-amazon.com/images/I/51dD4YI6snL._AC_SR38,50_.jpg",
    "S-green": "https://m.media-amazon.com/images/I/413mNzJkOBL._AC_SR38,50_.jpg",
    "F-blue": "https://m.media-amazon.com/images/I/41J1ZhZEpxL._AC_SR38,50_.jpg",
    "F-red": "https://m.media-amazon.com/images/I/41OcoMu8JDL._AC_SR38,50_.jpg",
    "F-pink": "https://m.media-amazon.com/images/I/41MDpYWBzyL._AC_SR38,50_.jpg",
    "Leaves Brown": "https://m.media-amazon.com/images/I/41EEjPCE-LL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "S-blue White": "71ypFihe0+L",
    "S-black": "712dc99ceaL",
    "S-brick Red Blue": "81l-Sz76ftL",
    "Orange Beige Floral": "81NxYBYjQNL",
    "F-blue Pink": "81seJcA9+jL",
    "S-khaki": "71xxDeCIXFL",
    "F-purple Red": "81TystUFsuL",
    "Leaves Green": "71M9+szciaL",
    "F-red Yellow": "81AMCA9mb7L",
    "F-blue-02": "81F23NhpeZL",
    "F-rust Red": "716gmGmXEUL",
    "S-rose Red": "818xQ6Dg7FL",
    "F-white Blue": "81l8oav-8qL",
    "S-green": "71daPfQitTL",
    "F-blue": "81IzAsJqxPL",
    "F-red": "81toN-aJ6dL",
    "F-pink": "81YotF6YKrL",
    "Leaves Brown": "81EnatYDvqL"
  },
  "color_images": {
    "S-blue White": [
      "https://m.media-amazon.com/images/I/71ypFihe0+L._SL1500_.jpg"
    ],
    "S-black": [
      "https://m.media-amazon.com/images/I/712dc99ceaL._SL1500_.jpg"
    ],
    "S-brick Red Blue": [
      "https://m.media-amazon.com/images/I/81l-Sz76ftL._SL1500_.jpg"
    ],
    "Orange Beige Floral": [
      "https://m.media-amazon.com/images/I/81NxYBYjQNL._SL1500_.jpg"
    ],
    "F-blue Pink": [
      "https://m.media-amazon.com/images/I/81seJcA9+jL._SL1500_.jpg"
    ],
    "S-khaki": [
      "https://m.media-amazon.com/images/I/71xxDeCIXFL._SL1500_.jpg"
    ],
    "F-purple Red": [
      "https://m.media-amazon.com/images/I/81TystUFsuL._SL1500_.jpg"
    ],
    "Leaves Green": [
      "https://m.media-amazon.com/images/I/71M9+szciaL._SL1500_.jpg"
    ],
    "F-red Yellow": [
      "https://m.media-amazon.com/images/I/81AMCA9mb7L._SL1500_.jpg"
    ],
    "F-blue-02": [
      "https://m.media-amazon.com/images/I/81F23NhpeZL._SL1500_.jpg"
    ],
    "F-rust Red": [
      "https://m.media-amazon.com/images/I/716gmGmXEUL._SL1500_.jpg"
    ],
    "S-rose Red": [
      "https://m.media-amazon.com/images/I/818xQ6Dg7FL._SL1500_.jpg"
    ],
    "F-white Blue": [
      "https://m.media-amazon.com/images/I/81l8oav-8qL._SL1500_.jpg"
    ],
    "S-green": [
      "https://m.media-amazon.com/images/I/71daPfQitTL._SL1500_.jpg"
    ],
    "F-blue": [
      "https://m.media-amazon.com/images/I/81IzAsJqxPL._SL1500_.jpg"
    ],
    "F-red": [
      "https://m.media-amazon.com/images/I/81toN-aJ6dL._SL1500_.jpg"
    ],
    "F-pink": [
      "https://m.media-amazon.com/images/I/81YotF6YKrL._SL1500_.jpg"
    ],
    "Leaves Brown": [
      "https://m.media-amazon.com/images/I/81EnatYDvqL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-evening-short-sleeve-maxi",
      "title": "Womens Maxi Dress Evening Short Sleeve Maxi",
      "price": 108.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61wOhOilEWL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening",
      "title": "Womens Maxi Dress Formal Evening",
      "price": 79.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51JPBI7aU5L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-ruched-bodycon-cocktail",
      "title": "Womens Dress Ruched Bodycon Cocktail",
      "price": 43.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51Fi7gsARJL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-bodycon-maxi-v-neck-long-sleeve",
      "title": "Womens Maxi Dress Evening Bodycon Maxi V Neck Long Sleeve",
      "price": 45.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/519n5+gVMAL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi",
      "title": "Womens Maxi Dress Maxi",
      "price": 8.76,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71St-N3EkkL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-maxi-bodycon-cocktail-sleeveless",
      "title": "Womens Maxi Dress Maxi Bodycon Cocktail Sleeveless",
      "price": 43.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/41Y-qNIH8+L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71q7jQuq5DL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-bodycon-ruched-long-sleeve",
      "title": "Womens Maxi Dress Maxi Bodycon Ruched Long Sleeve",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61Hb4bfDy4L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-short-sleeve-v-neck",
      "title": "Womens Dress Short Sleeve V Neck",
      "price": 37.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61XObVpc1uL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-mermaid",
      "title": "Womens Maxi Dress Evening Mermaid",
      "price": 69.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51m7zikskVL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-off-shoulder-bodycon-long-sleeve-maxi",
      "title": "Womens Maxi Dress Off Shoulder Bodycon Long Sleeve Maxi",
      "price": 53.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/611pJhxTuIL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 77.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61ENtjtNHZL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-v-neck-evening-maxi-formal",
      "title": "Womens Maxi Dress V Neck Evening Maxi Formal",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61DEsjvdnWL._SL1500_.jpg"
      ]
    }
  ]
}