{
  "id": "womens-dress-cocktail",
  "handle": "womens-dress-cocktail",
  "sku": "JC1634",
  "asin": "B0CR5TBWVK",
  "title": "Womens Dress Cocktail",
  "title_original": "Holipick Women's Cocktail Dresses Wedding Guest Party Crew Neck Short A Line Dress with Lace Sleeves",
  "brand": "Visit the Holipick Store",
  "price": 43.99,
  "social_proof": {
    "bought_past_month": 120,
    "text": "120+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/61Q4FMLiSxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81ZHyS0+VCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61sJsgzR9RL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61uhkwDxCnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61hBZrmVjIL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61tetePiy2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61uy-FW2E1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Ta3zr+1YL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Cj7UNc6iL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/611FpBXKZcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61nqG77tWDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61OEe83b-WL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/6167tA1VNuL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61n82NuT7IL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/611R2h+WbdL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/61Q4FMLiSxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81ZHyS0+VCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61sJsgzR9RL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61uhkwDxCnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61hBZrmVjIL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61tetePiy2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61uy-FW2E1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Ta3zr+1YL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Cj7UNc6iL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/611FpBXKZcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61nqG77tWDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61OEe83b-WL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/6167tA1VNuL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61n82NuT7IL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/611R2h+WbdL._SL1500_.jpg"
  ],
  "aplus_images": [
    "https://m.media-amazon.com/images/I/41bM9FWp74L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/418RwYbLtlL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41JDM44Yx2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/413dPzORZdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41TtQPWhHJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/417HFscWcDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41wnqbzsGvL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41XFnCPExrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31KViD%2B%2BJkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/518IIcBZ7UL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41DYOgYtZoL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51fuSwm%2BbLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31dyJ-0rWDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31ejZcL6ceL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/315F7r2obqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31qtEylGavL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41V7rTp9p%2BL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41949Tf%2BZEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41aYBEUYgDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51tsBZ3CopL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41roiQy2lZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51g9%2BzJZ31L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41jeJZOfgCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31vexoLuOOL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31es%2BUwS%2BtL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31EilCR7ZhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/310c7aTqHXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41PobW5UZBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41G9oAAIm8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41Vhcp6omEL._SL1500_.jpg"
  ],
  "description_images": [
    "https://m.media-amazon.com/images/I/41bM9FWp74L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/418RwYbLtlL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41JDM44Yx2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/413dPzORZdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41TtQPWhHJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/417HFscWcDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41wnqbzsGvL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41XFnCPExrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31KViD%2B%2BJkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/518IIcBZ7UL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41DYOgYtZoL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51fuSwm%2BbLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31dyJ-0rWDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31ejZcL6ceL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/315F7r2obqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31qtEylGavL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41V7rTp9p%2BL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41949Tf%2BZEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41aYBEUYgDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51tsBZ3CopL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41roiQy2lZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51g9%2BzJZ31L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41jeJZOfgCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31vexoLuOOL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31es%2BUwS%2BtL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31EilCR7ZhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/310c7aTqHXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41PobW5UZBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41G9oAAIm8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41Vhcp6omEL._SL1500_.jpg"
  ],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ January 28, 2024",
    "ASIN ‏": "‎ B0CT3BKBSJ",
    "Best Sellers Rank": "#18,113 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #19 in Women's Cocktail Dresses",
    "Customer Reviews": "4.0 4.0 out of 5 stars (394)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Red",
      "Black Short Sleeve",
      "Pink",
      "Black Long Sleeve",
      "Black Floral Long Sleeve",
      "Wine Long Sleeve",
      "Black",
      "Navy Blue",
      "White Long Sleeve",
      "Navy Blue Long Sleeve",
      "White Short Sleeve"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.0,
    "count": 394,
    "customers_say": "Customers find the dress classy for weddings and appreciate its well-made construction, comfortable fit, and flattering cut. Moreover, the fabric receives positive feedback for its quality, with one customer noting it's not thin. However, customers disagree on the dress's wrinkle resistance, with some reporting it wrinkles easily. Generated from the text of customer reviews Select to learn more Style (58) Fit (49) Quality (45) Comfort (24) Fabric quality (21) Flattering (15) Size (14) Wrinkle resistance (12) 58 customers mention style, 53 positive, 5 negative 58 customers mention \"Style\" 53 positive 5 negative Customers find the dress classy for weddings and sexy due to its lace details, with one customer noting it creates an hourglass silhouette. \" Beautiful dress . The navy blue is perfect navy blue where it is not too dark or too bright. The material look and feels very good quality.... \" Read more \" The dress is beautiful and true to size. However the lace ia very thin and before even trying it on i notice the lace was ripped at the arm \" Read more \" Cute and stylish. It was a good value for the cost. The material was nice and soft on my skin and the perfect black for evening!... \" Read more \" This dress is very cute and flattering for someone younger. Seems of good quality and fit but just a tad too short! \" Read more 49 customers mention fit, 40 positive, 9 negative 49 customers mention \"Fit\" 40 positive 9 negative Customers are satisfied with how the dress fits. \" ...and we were actually able to size down to the medium for a perfect fit . it’s beautiful in person. Middle school homecoming dance dress.... \" Read more \" Beautiful dress, I’m between a medium and large and I got a medium, fits great ! \" Read more \" I wore this cute dress to an all black wedding. Fit great . True to size. Received many compliments. However it came shrink wrapped in a small baggy.... \" Read more \" ...Not transparent but would use white or beige underwear. Fit is true to size . \" Read more 45 customers mention quality, 33 positive, 12 negative 45 customers mention \"Quality\" 33 positive 12 negative Customers find the dress well-made and perfect for weddings, though some note that the quality is lacking. \" Nice dress ! Perfect fit. I wore it to a semi formal wedding. \" Read more \" I bought this dress for an office holiday party. It was perfect. Well made and comfortable. I received a lot of compliments on it. \" Read more \" Poor quality . Never wore it \" Read more \" ...Tried to gently iron. The fit and length were perfect and good quality . I wish it was lined. Good value. \" Read more 24 customers mention comfort, 24 positive, 0 negative 24 customers mention \"Comfort\" 24 positive 0 negative Customers find the dress comfortable, with one mentioning it is non-irritating. \" ...I was extremely pleased with the fit. The dress was comfortable and flattering (hides that belly pouch) and super cute. I am 5’3 and 145 lbs.... \" Read more \" I wore this dress to a funeral it was very comfortable and it fit great I love the sheer lace across the top and sleeves but I wished this dress had... \" Read more \" Beautiful! I wore to my bridal shower and it was an adorable dress. Super comfy and not see through \" Read more \" I bought this dress for a cruise. It fit very well and was comfortable wearing it . I had lots of compliments on it.... \" Read more 21 customers mention fabric quality, 16 positive, 5 negative 21 customers mention \"Fabric quality\" 16 positive 5 negative Customers like the fabric of the dress, finding it nice and soft, with one customer noting it's not thin. \" The dress was very comfortable and nice material . I liked that it was long enough to where I didn’t feel I had to make sure nothing was showing. \" Read more \" Bought this dress to go to a ballet. The material is not thin and it stretches. I was comfortable and the perfect length (I'm 5'7\").... \" Read more \" ...It makes me look amazing. The fabric is not cheap . Gives you a hourglass look no complaints. \" Read more \" It’s a nice style, but I am not a fan of the fabric . It feels cheaply made.... \" Read more 15 customers mention flattering, 13 positive, 2 negative 15 customers mention \"Flattering\" 13 positive 2 negative Customers find the dress flattering, particularly noting its flattering cut. \" ...I was extremely pleased with the fit. The dress was comfortable and flattering (hides that belly pouch) and super cute. I am 5’3 and 145 lbs.... \" Read more \" Cute dress. Washed well. Good quality. Fit to normal size. Figure flattering . \" Read more \" This dress fits great! So flattering with the structured A-line design. I am in a medium and weigh 144lbs and am 5'4\"! The lace is gorgeous!... \" Read more \" Very flattering and comfortable. \" Read more 14 customers mention size, 11 positive, 3 negative 14 customers mention \"Size\" 11 positive 3 negative Customers are satisfied with the dress's sizing, noting it runs true to size. \" I wore this cute dress to an all black wedding. Fit great. True to size . Received many compliments. However it came shrink wrapped in a small baggy.... \" Read more \" Very pretty dress. Very comfortable. Seems true to size . I love the lacy arm sleeves. I’m 5’4” and it stops just above my knees.... \" Read more \" ...It is a jaw dropper! I am 5’7 and ordered an XL. It is very true to size ! I definitely am in love with this dress! \" Read more \" It ran small and looked cheap. \" Read more 12 customers mention wrinkle resistance, 4 positive, 8 negative 12 customers mention \"Wrinkle resistance\" 4 positive 8 negative Customers have mixed opinions about the dress's wrinkle resistance, with some noting it has no wrinkle material while others mention it shows wrinkles. \" ...The wrinkles were unbelievable. I let it hang for a few weeks. Still wrinkled . Sprayed lightly with water and Downey wrinkle release.... \" Read more \" ...Very comfortable- stretchy fabric. No wrinkles and very good quality. Can’t wait to wear it to my 50 year college reunion!! \" Read more \" ...Beautiful red color for Christmastime. Only problem is it wrinkles easily . Definitely not wrinkle resistant. Tried to gently iron.... \" Read more \" ...Dirty, wrinkled and as stated a huge hole/tear in the front of the dress. \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Love this navy blue dress. Classy and a bit of sexy because of the lace.",
        "body": "Beautiful dress. The navy blue is perfect navy blue where it is not too dark or too bright. The material look and feels very good quality. Best of all is the lace where usually some laces are stiff and scratchy but this lace material was SO soft, stretchy, and comfortable. Fabric weight feels like good quality, not too heavy or thin. Would recommend! Excellent quality and seems more expensive than how much it cost. Length is perfect where it appropriate for weddings, retirement parties, or maybe even church. Lace is a bit sexy. Overall it gives the conservative and a bit sexy vibe. Read more",
        "author": "Lblush",
        "rating": 5.0,
        "date": "December 12, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Beautiful for formal occasions.",
        "body": "Purchased for formal dinners. Beautiful red color for Christmastime. Only problem is it wrinkles easily. Definitely not wrinkle resistant. Tried to gently iron. The fit and length were perfect and good quality. I wish it was lined. Good value. Read more",
        "author": "MGreen",
        "rating": 5.0,
        "date": "December 5, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Pretty cocktail dress, comfortable and flattering.",
        "body": "Very pretty dress. Very comfortable. Seems true to size. I love the lacy arm sleeves. I’m 5’4” and it stops just above my knees. I bought a small and could have fit into an extra small for a tighter fit. It’s a polyester material so it won’t shrink. Read more",
        "author": "Meri Shopper",
        "rating": 4.0,
        "date": "August 21, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61W0lJjW7rL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "1.0 out of 5 stars Poor quality. Would not recommend!",
        "body": "If there were a zero that is what I would give it. This item came with a HUGE hole/tear and the item looked like it has been run over. Dirty, wrinkled and as stated a huge hole/tear in the front of the dress. Read more",
        "author": "Customer",
        "rating": 1.0,
        "date": "November 21, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/51x1OK9R22L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Beautiful dress",
        "body": "I can’t say enough good things about this dress. It was simple but elegant. It fit me perfectly for my wedding. It wasn’t see through at all. I loved the top part was soft lace. I tried many dresses and this was the last one I ordered and ended up wearing. I used a steamer on the dress and it came out perfectly. I bought it in several other colors. Read more",
        "author": "Beth L.",
        "rating": 5.0,
        "date": "October 27, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71T9A8VGHGL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/61EiwkD3uqL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "3.0 out of 5 stars The WRINKLES!",
        "body": "I wore this cute dress to an all black wedding. Fit great. True to size. Received many compliments. However it came shrink wrapped in a small baggy. The wrinkles were unbelievable. I let it hang for a few weeks. Still wrinkled. Sprayed lightly with water and Downey wrinkle release. Still wrinkled. Finally broke down and used an iron on a low setting. The wrinkles were less. Had to iron it two more times before it was wearable. Just keep this in mind. Especially if you don’t have an iron and ironing board. Read more",
        "author": "Connie Richardson",
        "rating": 3.0,
        "date": "May 22, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Just buy it!",
        "body": "Loved the dress!! Fits great and looks amazing!!! Read more",
        "author": "Lesa Bhola",
        "rating": 5.0,
        "date": "December 18, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Excellent purchase",
        "body": "It was true to size and fit great! It was very comfortable and looked great. Excellent dress for the price. Read more",
        "author": "Dan",
        "rating": 5.0,
        "date": "November 23, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Dress Cocktail is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.",
  "about_this_item": "Womens Dress Cocktail is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.",
  "long_description": "Womens Dress Cocktail is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Red, Black Short Sleeve, Pink, Black Long Sleeve, Black Floral Long Sleeve, Wine Long Sleeve, Black, Navy Blue, White Long Sleeve, Navy Blue Long Sleeve, White Short Sleeve. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Dress Cocktail is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/41bM9FWp74L._SL1500_.jpg",
      "alt": "Womens Dress Cocktail details image 1"
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/418RwYbLtlL._SL1500_.jpg",
      "alt": "Womens Dress Cocktail details image 2"
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/41JDM44Yx2L._SL1500_.jpg",
      "alt": "Womens Dress Cocktail details image 3"
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/413dPzORZdL._SL1500_.jpg",
      "alt": "Womens Dress Cocktail details image 4"
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Red, Black Short Sleeve, Pink, Black Long Sleeve, Black Floral Long Sleeve, Wine Long Sleeve, Black, Navy Blue, White Long Sleeve, Navy Blue Long Sleeve, White Short Sleeve. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/41TtQPWhHJL._SL1500_.jpg",
      "alt": "Womens Dress Cocktail details image 5"
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "220dfe8b-765e-408b-88e1-229b205b77fa",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/220dfe8b-765e-408b-88e1-229b205b77fa/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/220dfe8b-765e-408b-88e1-229b205b77fa/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "215f5dd0-909c-4ac9-bfb6-3c46f3ce1214",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/215f5dd0-909c-4ac9-bfb6-3c46f3ce1214/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/215f5dd0-909c-4ac9-bfb6-3c46f3ce1214/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "315dab87-7256-4069-b710-12fdb0b6a558",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/315dab87-7256-4069-b710-12fdb0b6a558/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/315dab87-7256-4069-b710-12fdb0b6a558/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "639d0f3b-1e3b-44d0-a54e-6d9bbc56fe20",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/639d0f3b-1e3b-44d0-a54e-6d9bbc56fe20/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/639d0f3b-1e3b-44d0-a54e-6d9bbc56fe20/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "55e4bb61-f213-4006-9c1f-cff1d6323816",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/55e4bb61-f213-4006-9c1f-cff1d6323816/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/55e4bb61-f213-4006-9c1f-cff1d6323816/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "804d4ce8-64e2-48e5-a9e8-6a7f540480c4",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/804d4ce8-64e2-48e5-a9e8-6a7f540480c4/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/804d4ce8-64e2-48e5-a9e8-6a7f540480c4/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "bec2de85-212b-4650-906b-53de54279eea",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bec2de85-212b-4650-906b-53de54279eea/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bec2de85-212b-4650-906b-53de54279eea/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "e1eb646a-df7a-4fa9-9f45-eb3e369d4545",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e1eb646a-df7a-4fa9-9f45-eb3e369d4545/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e1eb646a-df7a-4fa9-9f45-eb3e369d4545/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "5898179c-73ff-4e68-8971-e82b15eb35a5",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5898179c-73ff-4e68-8971-e82b15eb35a5/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5898179c-73ff-4e68-8971-e82b15eb35a5/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "5fc12a28-b245-4ffa-b3d0-f1b621066267",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5fc12a28-b245-4ffa-b3d0-f1b621066267/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5fc12a28-b245-4ffa-b3d0-f1b621066267/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "6ddbddef-6f1a-405d-8fad-c70b5c5a2f0e",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6ddbddef-6f1a-405d-8fad-c70b5c5a2f0e/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6ddbddef-6f1a-405d-8fad-c70b5c5a2f0e/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "11e00456-74c2-435c-8667-cdb381a704a2",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/11e00456-74c2-435c-8667-cdb381a704a2/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/11e00456-74c2-435c-8667-cdb381a704a2/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Red": "https://m.media-amazon.com/images/I/4198kn+GpML._AC_SR38,50_.jpg",
    "Black Short Sleeve": "https://m.media-amazon.com/images/I/413dPzORZdL._AC_SR38,50_.jpg",
    "Pink": "https://m.media-amazon.com/images/I/41-hcYrutdL._AC_SR38,50_.jpg",
    "Black Long Sleeve": "https://m.media-amazon.com/images/I/41bM9FWp74L._AC_SR38,50_.jpg",
    "Black Floral Long Sleeve": "https://m.media-amazon.com/images/I/41m5bpWQpXL._AC_SR38,50_.jpg",
    "Wine Long Sleeve": "https://m.media-amazon.com/images/I/41nn5W8wEJL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/418B7Iyi7gL._AC_SR38,50_.jpg",
    "Navy Blue": "https://m.media-amazon.com/images/I/418RwYbLtlL._AC_SR38,50_.jpg",
    "White Long Sleeve": "https://m.media-amazon.com/images/I/41JDM44Yx2L._AC_SR38,50_.jpg",
    "Navy Blue Long Sleeve": "https://m.media-amazon.com/images/I/415EURviRbL._AC_SR38,50_.jpg",
    "White Short Sleeve": "https://m.media-amazon.com/images/I/41UAgcK5vcL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Red": "61tetePiy2L",
    "Black Short Sleeve": "61uy-FW2E1L",
    "Pink": "61Ta3zr+1YL",
    "Black Long Sleeve": "61Q4FMLiSxL",
    "Black Floral Long Sleeve": "61Cj7UNc6iL",
    "Wine Long Sleeve": "611FpBXKZcL",
    "Black": "61nqG77tWDL",
    "Navy Blue": "61OEe83b-WL",
    "White Long Sleeve": "6167tA1VNuL",
    "Navy Blue Long Sleeve": "61n82NuT7IL",
    "White Short Sleeve": "611R2h+WbdL"
  },
  "color_images": {
    "Red": [
      "https://m.media-amazon.com/images/I/61tetePiy2L._SL1500_.jpg"
    ],
    "Black Short Sleeve": [
      "https://m.media-amazon.com/images/I/61uy-FW2E1L._SL1500_.jpg"
    ],
    "Pink": [
      "https://m.media-amazon.com/images/I/61Ta3zr+1YL._SL1500_.jpg"
    ],
    "Black Long Sleeve": [
      "https://m.media-amazon.com/images/I/61Q4FMLiSxL._SL1500_.jpg"
    ],
    "Black Floral Long Sleeve": [
      "https://m.media-amazon.com/images/I/61Cj7UNc6iL._SL1500_.jpg"
    ],
    "Wine Long Sleeve": [
      "https://m.media-amazon.com/images/I/611FpBXKZcL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/61nqG77tWDL._SL1500_.jpg"
    ],
    "Navy Blue": [
      "https://m.media-amazon.com/images/I/61OEe83b-WL._SL1500_.jpg"
    ],
    "White Long Sleeve": [
      "https://m.media-amazon.com/images/I/6167tA1VNuL._SL1500_.jpg"
    ],
    "Navy Blue Long Sleeve": [
      "https://m.media-amazon.com/images/I/61n82NuT7IL._SL1500_.jpg"
    ],
    "White Short Sleeve": [
      "https://m.media-amazon.com/images/I/611R2h+WbdL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-ruched-long-sleeve-off-shoulder",
      "title": "Womens Maxi Dress Ruched Long Sleeve Off Shoulder",
      "price": 65.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/610S-XUGzwL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-sleeveless-v-neck-cocktail-maxi-bodycon",
      "title": "Womens Maxi Dress Sleeveless V Neck Cocktail Maxi Bodycon",
      "price": 44.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51eoMzKwaqL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-formal-cocktail",
      "title": "Womens Maxi Dress Long Sleeve Formal Cocktail",
      "price": 45.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/610egGe2LwL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-v-neck-ruched",
      "title": "Womens Maxi Dress Long Sleeve V Neck Ruched",
      "price": 41.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/41nKZb3yrHL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 33.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61W5l+uioHL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-evening",
      "title": "Womens Maxi Dress Evening",
      "price": 72.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61ifQNM1WAL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening",
      "title": "Womens Maxi Dress Evening",
      "price": 66.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61jhboT-KdL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-bodycon-ruched-off-shoulder",
      "title": "Womens Maxi Dress Cocktail Bodycon Ruched Off Shoulder",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/51pNtXYlEDL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 70.57,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/512WgWMyYLL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-one-shoulder-formal-mermaid",
      "title": "Womens Maxi Dress Evening One Shoulder Formal Mermaid",
      "price": 69.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/613xHpbpN5L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-off-shoulder",
      "title": "Womens Dress Off Shoulder",
      "price": 93.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71+G9PIEq1L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-short-sleeve",
      "title": "Womens Dress Short Sleeve",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61Gm5oBtjDL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-bodycon-cocktail",
      "title": "Womens Dress Bodycon Cocktail",
      "price": 55.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61k-qoz2M6L._SL1500_.jpg"
      ]
    }
  ]
}