{
  "id": "womens-maxi-dress-maxi",
  "handle": "womens-maxi-dress-maxi",
  "sku": "JC2873",
  "asin": "B0CS9P5L58",
  "title": "Womens Maxi Dress Maxi",
  "title_original": "Women's Casual Halter Tiered Vacation Maxi Dress with Pockets",
  "brand": "Visit the AmySister Store",
  "price": 38.99,
  "social_proof": {
    "bought_past_month": 118,
    "text": "118+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/51K09DZrYRL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61SV-QQb-ML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/617ChO1B6RL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71crN6KbLKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/716x5Glni9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51ISof8+w4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51wwRmFEa1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51moHkg1MfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51IF3RYqUlL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/614miUHr6TL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51ITCp-ZI2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/515nc8nOZLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51uSDK2rgQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61G51tUGixL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/511tMnEDNRL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/51K09DZrYRL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61SV-QQb-ML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/617ChO1B6RL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71crN6KbLKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/716x5Glni9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51ISof8+w4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51wwRmFEa1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51moHkg1MfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51IF3RYqUlL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/614miUHr6TL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51ITCp-ZI2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/515nc8nOZLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51uSDK2rgQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61G51tUGixL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/511tMnEDNRL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ January 13, 2024",
    "ASIN ‏": "‎ B0CS9PGP7R",
    "Best Sellers Rank": "#25,169 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #127 in Women's Formal Dresses",
    "Customer Reviews": "4.1 4.1 out of 5 stars (228)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Hunter Green",
      "Red",
      "Azure",
      "Lavender",
      "Blush",
      "Coffee White",
      "Beige",
      "Sage Green",
      "Midnight",
      "Navy White",
      "Chocolate Brown"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.1,
    "count": 228,
    "customers_say": "Customers find the dress comfortable, flattering, and true to size, particularly noting it's perfect for small-chested women. They appreciate its vibrant color and style, with one customer describing it as having beachy vibes. The fabric quality receives mixed feedback - while some find the material nice, others say it feels like paper. The fit also gets mixed reviews, with some finding it perfect while others say it feels weird. Generated from the text of customer reviews Select to learn more Style (34) Quality (19) Size (15) Color (14) Comfort (14) Flattering (10) Fit (21) Fabric quality (17) 34 customers mention style, 31 positive, 3 negative 34 customers mention \"Style\" 31 positive 3 negative Customers find the dress cute, with one mentioning it has beachy vibes. \" I’m 5’7 145lbs 34DD, ordered M and unfortunately it doesn’t fit. It’s super cute and comfy fabric but the strap around the neck and tie back doesn’t... \" Read more \" Was cute but did not look great on my body shape… I have small breasts and I looked boxy on top \" Read more \" This is actually so cute and way more flattering than I expected. Perfect summer sun dress imo \" Read more \" Item arrived wrinkled and stained like it had been previously worn. Cute dress though, I am bummed. \" Read more 19 customers mention quality, 15 positive, 4 negative 19 customers mention \"Quality\" 15 positive 4 negative Customers find the dress to be of good quality and value for money. \" Might be the best dress I’ve ever purchased on Amazon and I’ve bought a LOT of dresses.... \" Read more \" Obsessed with this! Perfect dress \" Read more \" Nice dress but not for big breast. It does not hold up breast \" Read more \" The dress fit kind of weird tland the material was very thin and of poor quality . \" Read more 15 customers mention size, 11 positive, 4 negative 15 customers mention \"Size\" 11 positive 4 negative Customers find the dress true to size, with the halter portion being particularly suitable for small-chested women. \" ...The fit is flattering and true to size . I’m wearing my true size medium. It gets bonus point for having functional pockets!... \" Read more \" Large bust friendly (38DD).... \" Read more \" Why did you pick this product vs others?: Size runs a little small . As soon as I tied the back it gave me a pregnancy belly like.... \" Read more \" This dress is a 10/10! The fabric is SO soft! Very true to size and the straps are adjustable to your needs!... \" Read more 14 customers mention color, 13 positive, 1 negative 14 customers mention \"Color\" 13 positive 1 negative Customers like the dress's color, with one mentioning it's vibrant without being too bold. \" Beautiful color and fit perfect. Loved that it also had pockets - light weight material that was great for summer weather.... \" Read more \" beautiful blue , super comfy, a little heavier material than expected but it was still perfect for my birthday brunch on a hot summer day! \" Read more \" Pretty color but dress did not appear as picture shown. The top party of the dress was very tight and did not come up high enough \" Read more \" ...i genuinely love the way this dress fits and the color is so flattering ! \" Read more 14 customers mention comfort, 13 positive, 1 negative 14 customers mention \"Comfort\" 13 positive 1 negative Customers find the dress comfortable, with one mentioning it is very forgiving. \" ...yet high in quality and sturdy while being breathable and comfortable . The fit is flattering and true to size. I’m wearing my true size medium.... \" Read more \" Love this dress for a family beach photo shoot. Very forgiving and comfy , I was able to chase my toddler in this dress without fear my dress was... \" Read more \" ...I love that it has pockets. Material is light weight & very comfortable . The tie around the back allows for flexible fitting.... \" Read more \" Comfortable dress . True to size. Can dress up or down. Perfect for a beach vacation. \" Read more 10 customers mention flattering, 8 positive, 2 negative 10 customers mention \"Flattering\" 8 positive 2 negative Customers find the dress flattering in all the right places, with one customer noting it provides perfect coverage in the bust area. \" ...I got so many compliments. The design at the top is unique and so flattering . The material was easy to steam but I left a little texture to it.... \" Read more \" ...Its flowy and flattering . Just needs to be washed and ironed. \" Read more \" ...It’s flattering in all the right places and super comfortable to wear. I’ve already received so many compliments. Highly recommend! \" Read more \" ...Overall not flattering . The material doesn’t flow nicely on your body shape and faded quite a bit after the first wash making it look faded and old.... \" Read more 21 customers mention fit, 14 positive, 7 negative 21 customers mention \"Fit\" 14 positive 7 negative Customers have mixed opinions about the dress's fit, with some finding it perfect while others say it feels weird. \" This dress is so perfect. I absolutely love it. It fits perfectly . I am wearing small size and 5’2’’. It came on time for my event. \" Read more \" Very odd fit . Had to return \" Read more \" ...The fit is flattering and true to size. I’m wearing my true size medium. It gets bonus point for having functional pockets!... \" Read more \" ...It fits really cute and is perfect to throw on for dinner while on a beach vacation. \" Read more 17 customers mention fabric quality, 6 positive, 11 negative 17 customers mention \"Fabric quality\" 6 positive 11 negative Customers have mixed opinions about the dress's fabric, with some finding it nice and noting it has extra fabric, while others mention it feels like paper and wish it was softer. \" It fit well but the material was not soft and it wrinkled after wash and wrinkles would not even come out with ironing.... \" Read more \" This dress is a 10/10! The fabric is SO soft ! Very true to size and the straps are adjustable to your needs!... \" Read more \" Material wasn't as expected , feels a little cheaper than I thought. Wore to a wedding and it was a little less dressy than I thought.... \" Read more \" Style not as expected. Material seemed cheap /uncomfortable. I have a bigger chest 34C and I did not fit into the top of the dress. \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Love this dress!",
        "body": "The media could not be loaded. This dress is so cute! I find it comparable to cotton fabric dresses as it feels lightweight yet high in quality and sturdy while being breathable and comfortable. The fit is flattering and true to size. I’m wearing my true size medium. It gets bonus point for having functional pockets! I don’t need to wear a bra with it as the adjustable tie back allows me to adjust to my body’s needs (I am small chested so this may be diff for those with a larger bust). This dress fits and flatters great on me! 10/10 recommend! Read more",
        "author": "SidStyle_25",
        "rating": 5.0,
        "date": "September 6, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars The perfect dress!",
        "body": "Wore this for my birthday & loved it so much! I love how you can tie the top as tight/lose as you want so it’s a fit everybody dress! So flattering & I got so many compliments on it. I also LOVE that it has pockets. It was the perfect style, length, & quality for the price. Not see through at all & lightweight! Read more",
        "author": "Kylah Magarrell",
        "rating": 5.0,
        "date": "November 20, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/810MsdN-83L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "4.0 out of 5 stars Cute, decent quality maxi dress",
        "body": "Really cute maxi dress for the beach. It was the perfect length for me and fit me well. The quality of the dress was decent, the fabric was thick enough but also had a paper like feel to it. I would purchase again for the price. Read more",
        "author": "Jayna",
        "rating": 4.0,
        "date": "December 3, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/6150W3NbctL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "3.0 out of 5 stars Minimal bust coverage",
        "body": "Super cute. As pictured, good material, but couldn't fit \"my girls\" in it.. so minimal coverage. Ended up returning. Read more",
        "author": "Kindle Customer",
        "rating": 3.0,
        "date": "December 21, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Beautiful",
        "body": "I ordered this dress last minute for a brunch cruise. It was beautiful! Of course it will come wrinkled because of the material but I steam ironed it in 2 minutes. I love it and will order more in different colors! Read more",
        "author": "CK Rivera",
        "rating": 5.0,
        "date": "November 24, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "2.0 out of 5 stars Blue dress",
        "body": "Pretty color but dress did not appear as picture shown. The top party of the dress was very tight and did not come up high enough Read more",
        "author": "Gabby Hager",
        "rating": 2.0,
        "date": "May 20, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Stylish, flattering and comfortable",
        "body": "The media could not be loaded. I am 18 weeks pregnant and this dress could not have been more perfect. It did not make me feel huge. I got so many compliments. The design at the top is unique and so flattering. The material was easy to steam but I left a little texture to it. I am 5’ 2” and it was not dragging on the floor which was nice too. Read more",
        "author": "Alexis",
        "rating": 5.0,
        "date": "July 6, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71vqOgWpUEL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71OO11ooy7L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Perfect fit, gorgeous color!",
        "body": "I absolutely love this dress! The fit is spot on—it's like it was tailor-made for me. The length is just right, not too short or too long, and it falls beautifully. The color is stunning and exactly as pictured—vibrant without being too bold. It’s flattering in all the right places and super comfortable to wear. I’ve already received so many compliments. Highly recommend! Read more",
        "author": "Lisa",
        "rating": 5.0,
        "date": "May 29, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Maxi is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.",
  "about_this_item": "Womens Maxi Dress Maxi is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.",
  "long_description": "Womens Maxi Dress Maxi is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Hunter Green, Red, Azure, Lavender, Blush, Coffee White, Beige, Sage Green, Midnight, Navy White, Chocolate Brown. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Maxi is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Hunter Green, Red, Azure, Lavender, Blush, Coffee White, Beige, Sage Green, Midnight, Navy White, Chocolate Brown. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "d8a531eb-dc96-4ac8-a38e-b8e5c1353ea0",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d8a531eb-dc96-4ac8-a38e-b8e5c1353ea0/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d8a531eb-dc96-4ac8-a38e-b8e5c1353ea0/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/82c43e56-058b-4c06-b43b-c9d03525c489.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "ba6093a0-a372-42e5-abd5-eae240529139",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ba6093a0-a372-42e5-abd5-eae240529139/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ba6093a0-a372-42e5-abd5-eae240529139/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/82c43e56-058b-4c06-b43b-c9d03525c489.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "69137c8a-6e3c-49e1-87d2-0adc4c71ce48",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/69137c8a-6e3c-49e1-87d2-0adc4c71ce48/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/69137c8a-6e3c-49e1-87d2-0adc4c71ce48/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/82c43e56-058b-4c06-b43b-c9d03525c489.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "ea21f873-b3cd-40e7-a541-d9be0f9ca22e",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ea21f873-b3cd-40e7-a541-d9be0f9ca22e/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ea21f873-b3cd-40e7-a541-d9be0f9ca22e/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/82c43e56-058b-4c06-b43b-c9d03525c489.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "9241463f-71ce-44f7-9c28-49199f16479f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9241463f-71ce-44f7-9c28-49199f16479f/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9241463f-71ce-44f7-9c28-49199f16479f/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/82c43e56-058b-4c06-b43b-c9d03525c489.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "eeceeb9a-82cc-40c5-b40a-5a6f24385a29",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/eeceeb9a-82cc-40c5-b40a-5a6f24385a29/embedded.cc.default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/eeceeb9a-82cc-40c5-b40a-5a6f24385a29/embedded.cc.default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/82c43e56-058b-4c06-b43b-c9d03525c489.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "5794b4e2-20f2-498e-969a-6267753fc295",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5794b4e2-20f2-498e-969a-6267753fc295/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5794b4e2-20f2-498e-969a-6267753fc295/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/82c43e56-058b-4c06-b43b-c9d03525c489.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "36d21526-b743-4595-8120-eff54ab9cc24",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/36d21526-b743-4595-8120-eff54ab9cc24/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/36d21526-b743-4595-8120-eff54ab9cc24/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/82c43e56-058b-4c06-b43b-c9d03525c489.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "746e2fbd-68aa-4dce-a1c7-ab20adaff638",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/746e2fbd-68aa-4dce-a1c7-ab20adaff638/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/746e2fbd-68aa-4dce-a1c7-ab20adaff638/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/82c43e56-058b-4c06-b43b-c9d03525c489.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "a550c25e-4caa-48f6-972e-d101c3d1dde2",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a550c25e-4caa-48f6-972e-d101c3d1dde2/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a550c25e-4caa-48f6-972e-d101c3d1dde2/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/82c43e56-058b-4c06-b43b-c9d03525c489.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "43b9c733-4e84-45b9-8a34-66e0420864cf",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/43b9c733-4e84-45b9-8a34-66e0420864cf/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/43b9c733-4e84-45b9-8a34-66e0420864cf/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/82c43e56-058b-4c06-b43b-c9d03525c489.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "b37a2e94-b0b6-48d4-84f3-6437da94a455",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b37a2e94-b0b6-48d4-84f3-6437da94a455/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b37a2e94-b0b6-48d4-84f3-6437da94a455/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/82c43e56-058b-4c06-b43b-c9d03525c489.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Hunter Green": "https://m.media-amazon.com/images/I/31gXZPqmvNL._AC_SR38,50_.jpg",
    "Red": "https://m.media-amazon.com/images/I/3167hiPwAjL._AC_SR38,50_.jpg",
    "Azure": "https://m.media-amazon.com/images/I/31FKnIGq0tL._AC_SR38,50_.jpg",
    "Lavender": "https://m.media-amazon.com/images/I/31ZOPv5HEkL._AC_SR38,50_.jpg",
    "Blush": "https://m.media-amazon.com/images/I/31F1lg23MwL._AC_SR38,50_.jpg",
    "Coffee White": "https://m.media-amazon.com/images/I/41NdbmAGlML._AC_SR38,50_.jpg",
    "Beige": "https://m.media-amazon.com/images/I/31OzlNI2RnL._AC_SR38,50_.jpg",
    "Sage Green": "https://m.media-amazon.com/images/I/31uqlLGgX-L._AC_SR38,50_.jpg",
    "Midnight": "https://m.media-amazon.com/images/I/312jXGyloHL._AC_SR38,50_.jpg",
    "Navy White": "https://m.media-amazon.com/images/I/41Up6PFcK1L._AC_SR38,50_.jpg",
    "Chocolate Brown": "https://m.media-amazon.com/images/I/31TwgibODLL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Hunter Green": "51ISof8+w4L",
    "Red": "51wwRmFEa1L",
    "Azure": "51K09DZrYRL",
    "Lavender": "51moHkg1MfL",
    "Blush": "51IF3RYqUlL",
    "Coffee White": "614miUHr6TL",
    "Beige": "51ITCp-ZI2L",
    "Sage Green": "515nc8nOZLL",
    "Midnight": "51uSDK2rgQL",
    "Navy White": "61G51tUGixL",
    "Chocolate Brown": "511tMnEDNRL"
  },
  "color_images": {
    "Hunter Green": [
      "https://m.media-amazon.com/images/I/51ISof8+w4L._SL1500_.jpg"
    ],
    "Red": [
      "https://m.media-amazon.com/images/I/51wwRmFEa1L._SL1500_.jpg"
    ],
    "Azure": [
      "https://m.media-amazon.com/images/I/51K09DZrYRL._SL1500_.jpg"
    ],
    "Lavender": [
      "https://m.media-amazon.com/images/I/51moHkg1MfL._SL1500_.jpg"
    ],
    "Blush": [
      "https://m.media-amazon.com/images/I/51IF3RYqUlL._SL1500_.jpg"
    ],
    "Coffee White": [
      "https://m.media-amazon.com/images/I/614miUHr6TL._SL1500_.jpg"
    ],
    "Beige": [
      "https://m.media-amazon.com/images/I/51ITCp-ZI2L._SL1500_.jpg"
    ],
    "Sage Green": [
      "https://m.media-amazon.com/images/I/515nc8nOZLL._SL1500_.jpg"
    ],
    "Midnight": [
      "https://m.media-amazon.com/images/I/51uSDK2rgQL._SL1500_.jpg"
    ],
    "Navy White": [
      "https://m.media-amazon.com/images/I/61G51tUGixL._SL1500_.jpg"
    ],
    "Chocolate Brown": [
      "https://m.media-amazon.com/images/I/511tMnEDNRL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-bodycon-long-sleeve-ruched",
      "title": "Womens Maxi Dress Bodycon Long Sleeve Ruched",
      "price": 38.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/718YKBFbs3L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-off-shoulder-mermaid-evening",
      "title": "Womens Maxi Dress Formal Off Shoulder Mermaid Evening",
      "price": 86.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71C+AFY6HAL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-formal",
      "title": "Womens Maxi Dress Evening Formal",
      "price": 69.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71amdzuBfbL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-bodycon-sleeveless",
      "title": "Womens Dress Bodycon Sleeveless",
      "price": 29.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51UthcjfRfL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 38.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71l8OE0DiEL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress-sleeveless",
      "title": "Womens Dress Sleeveless",
      "price": 41.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71QMCW+8CcL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-ruched-v-neck-cocktail-bodycon",
      "title": "Womens Dress Ruched V Neck Cocktail Bodycon",
      "price": 45.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/51TCVhb-WzL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 298.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71Jq8YdpWeL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-split",
      "title": "Womens Dress Split",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61PPeTKsusL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-maxi-cocktail",
      "title": "Womens Maxi Dress Long Sleeve Maxi Cocktail",
      "price": 62.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71u2Xray0mL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-long-sleeve-ruched-cocktail-bodycon-formal",
      "title": "Womens Maxi Dress Maxi Long Sleeve Ruched Cocktail Bodycon Formal",
      "price": 28.3,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/81e1pG2+yqL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening-long-sleeve",
      "title": "Womens Maxi Dress Formal Evening Long Sleeve",
      "price": 75.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61e8WX2EcaL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-v-neck",
      "title": "Womens Dress V Neck",
      "price": 69.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/81MCqkA-7cL._SL1500_.jpg"
      ]
    }
  ]
}