{
  "id": "womens-dress",
  "handle": "womens-dress",
  "sku": "JC2247",
  "asin": "B0CT2BW9KS",
  "title": "Womens Dress",
  "title_original": "Popilush Party Dresses for Women - Faux Leather Midi Dresses Shapewear Body con Dress Women - Date Night Outfit Black",
  "brand": "Visit the Popilush Store",
  "price": 79.99,
  "social_proof": {
    "bought_past_month": 112,
    "text": "112+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/71A9J9Mc3aL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/810QTNVZUlL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71bljlg92fL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71aR3IhGaEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61sqv1-6ujL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/716UIeF7KrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71DcRxIutNL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61A16R7DB4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71pOSERh1wL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61RKFrEgbAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71tAV9uk5dL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/711nRSdAr5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ff9iOq7HL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/71A9J9Mc3aL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/810QTNVZUlL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71bljlg92fL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71aR3IhGaEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61sqv1-6ujL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/716UIeF7KrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71DcRxIutNL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61A16R7DB4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71pOSERh1wL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61RKFrEgbAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71tAV9uk5dL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/711nRSdAr5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ff9iOq7HL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ January 22, 2024",
    "ASIN ‏": "‎ B0CSYQ4YDY",
    "Best Sellers Rank": "#140,101 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #887 in Women's Club & Night Out Dresses",
    "Customer Reviews": "4.2 4.2 out of 5 stars (280)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Red",
      "Brown",
      "Pink",
      "Black"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.2,
    "count": 280,
    "customers_say": "Customers find the dress fits well, keeping everything tight, and appreciate its built-in shapewear that hugs curves in all the right places. The dress is comfortable and receives positive feedback for its appearance, with one customer noting it gives \"boss lady / baddie vibes.\" The sizing and zipper quality receive mixed reviews. Generated from the text of customer reviews Select to learn more Fit (55) Looks great (45) Quality (34) Flattering (21) Comfort (18) Shapewear (15) Zipper quality (13) Sizing (12) 55 customers mention fit, 45 positive, 10 negative 55 customers mention \"Fit\" 45 positive 10 negative Customers like how the dress fits, noting it's tight in all the right spots, with one customer mentioning it evened out their proportions. \" ...woman in my mid-50s and I hesitated to buy this dress - but it fits like a glove and makes me feel like a rockstar. Very comfortable.... \" Read more \" Great fit and the underlining is completely invisible and supportive. \" Read more \" 5'8.5, 38DD, size L. Fits perfectly . I'm pants size 12, dress size 10/12. Feels and looks amazing. Be careful putting on w long nails. \" Read more \" ...I ordered a size Medium and it fit like a glove . The material has a good stretch in it and I could move very easily.... \" Read more 45 customers mention looks great, 39 positive, 6 negative 45 customers mention \"Looks great\" 39 positive 6 negative Customers love the dress's appearance, describing it as gorgeous and sexy, with one customer noting it gives \"boss lady / baddie vibes.\" \" This dress was so flattering and sexy yet weirdly comfortable! Definitely try these dresses! 10/10!! \" Read more \" So the good: Gorgeous. Sucked everything in. Super sexy . Great quality. The bad: I have a few of popilish dresses and love them.... \" Read more \" looks amazing on my wife \" Read more \" Does not do what it’s intended to do! It’s cute but in my opinion if it’s shape wear it would make you feel good \" Read more 34 customers mention quality, 30 positive, 4 negative 34 customers mention \"Quality\" 30 positive 4 negative Customers find the dress to be of excellent quality, with one customer specifically praising the fantastic stitching. \" Love this dress . I bought black first and then the pink. And when I tell you show stopper... trust it is! Hugs in all the rug places.... \" Read more \" So the good: Gorgeous. Sucked everything in. Super sexy. Great quality . The bad: I have a few of popilish dresses and love them.... \" Read more \" Amazing dress . So sexy and a great fit! \" Read more \" Nice dress but I got it too small so I had to return it. It had me looking snatched which is a good thing \" Read more 21 customers mention flattering, 21 positive, 0 negative 21 customers mention \"Flattering\" 21 positive 0 negative Customers find the dress flattering, noting that it hugs curves in the right places, with one customer mentioning it holds everything in place. \" ...Very disappointing. This is one of the most flattering and comfortable sexy little black dresses I have ever owned.... \" Read more \" ...All were very flattering to say the least. She said that \"The Hole\" was a workable solution too. \" Read more \" Got it in the mail and love it !! Hugs in all the right places !! Gonna order in other colors \" Read more \" ...Comfortable, tummy control , ordered a medium, fits good I'm 155 pounds 5'4, good quality, exactly what I was looking for. \" Read more 18 customers mention comfort, 18 positive, 0 negative 18 customers mention \"Comfort\" 18 positive 0 negative Customers find the dress comfortable. \" I love it, nice dress for night on the town, coctail parties. Comfortable , tummy control, ordered a medium, fits good I'm 155 pounds 5'4, good... \" Read more \" This is so awesome! It keep everything in tight but was super comfortable ! Normally I need a bra but this was super supportive.... \" Read more \" ...The dress has some stretch to it and it is so comfortable \" Read more \" ...It's too long and covers my knees. Other than that. The dress feels very comfortable . \" Read more 15 customers mention shapewear, 15 positive, 0 negative 15 customers mention \"Shapewear\" 15 positive 0 negative Customers love the built-in shapewear feature of the dress, with one customer noting how it creates a perfect coke-bottle shape. \" I love this brand with the built in shape wear , and my wife does too, however she is not very curvy, has more of a fit build, and has yet to find a... \" Read more \" ...My bust is 36c and hips about 41. I love that it has the built in shapewear and that you can zip it low for some cleavage!... \" Read more \" Wow this dress is amazing, I love the way it shapes my body and it certainly got my husband's attention \" Read more \" It makes you look like you have the perfect body ! I bought one in black too. I wish there were more colors. \" Read more 13 customers mention zipper quality, 7 positive, 6 negative 13 customers mention \"Zipper quality\" 7 positive 6 negative Customers have mixed opinions about the zipper quality of the dress, with some praising its amazing construction while others report issues with poor sewing and malfunctioning closures. \" ...Value for the money was on point and the material was thick with a solid zipper . \" Read more \" ...You definitely can’t wear a bra with it because the zipper won’t close , but the dress itself gives a very flattering fit.... \" Read more \" ... Nice zipper to adjust for cleavage . Outer layer isnt laying completely smooth but I might just need to adjust the underlayer a bit. I'm a 12/14. \" Read more \" Not the best fit for bustier women. Only two options with the zipper . All the way up or down. No in between. It would just roll it self down.... \" Read more 12 customers mention sizing, 7 positive, 5 negative 12 customers mention \"Sizing\" 7 positive 5 negative Customers have mixed opinions about the sizing of the dress, with some finding it flattering, while others report issues with the fit, mentioning problems with the front pucker and breast compression. \" ...Great material not see through at all . Love the zipper as well! \" Read more \" ...It's too long and covers my knees . Other than that. The dress feels very comfortable. \" Read more \" ...I was impressed with how well it hid my tummy , even at my “worst weight” of a 35” waist.... \" Read more \" ...amazing except it has this weird line at bottom of zipper that is so unflattering . I constantly have to pull at the material to keep it smooth.... \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Sexy and comfy dress",
        "body": "I ordered this dress last minute to wear out to a dinner anniversary date with my husband. I’m 55 yo and wanted to wear something a little edgy and sexy to what I normally wear. For reference I am 160 lbs and 5’4”. This dress fit like a glove! I ordered the large while I normally wear a size 6 in dresses. My bust is 36c and hips about 41. I love that it has the built in shapewear and that you can zip it low for some cleavage! I wore a strapless bra with it and let me tell ya, my hubby couldn’t keep his eyes off me! If you’re on the fence get it! Now it did feel a bit warm since it’s pleather but being inside AC I had no issues with overheating. Now I want to order it in red and can see myself wearing this black number with tall boots and a denim jacket! My new favorite dress Read more",
        "author": "PA",
        "rating": 5.0,
        "date": "October 12, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71fOjg-NcGL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Say YES to this dress!",
        "body": "This is so awesome! It keep everything in tight but was super comfortable! Normally I need a bra but this was super supportive. Great material not see through at all. Love the zipper as well! Read more",
        "author": "Gia",
        "rating": 5.0,
        "date": "December 17, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/41eQwEvWSML._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/615nR-0qTxL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars EXTREMELY Well Made and VERY High Quality!",
        "body": "My wife is an amateur bodybuilder and was looking for a dress with shape control that she can wear now in the off season while she is bulking. She tends to put on extra weight in her tummy area and this dress looked like a great solution. Since she is muscular, her measurements are a bit unique. She is 5'7\", current weight about 175 lbs. Bra size is 38C but when flexing her chest is over 40\". Hips are around 38\". We bought a size Large. The quality of this dress is off the hook. Very well made and great material. Stitching is fantastic as well. Getting into the dress was a bit difficult. The bottom part of the dress as well as the first arm was no problem, but getting the last arm and shoulder in was a tight fit. This is not a fault of the dress; it's just because of the unique build my wife has (biceps are about 15\", and she has broad shoulders). Once on, it looked FANTASTIC on her and she said it is extremely comfortable. Her only complaint is that it will be a chore going to the bathroom. She will need to take the top half off and pull down the dress and that (for her anyway) will be difficult. We don't want to size up to an XL because it fits perfectly when it is on. In the end we are both very pleased with this dress and feel it is well worth the money spent. EDIT: We noticed later when she wore it out to a club that the dress has an open gusset. Going to the bathroom was VERY easy. So, for her anyway, the dress is absolutely perfect! ADDITIONAL EDIT: She loved the dress so much we got one in red too. Same great quality and fit. You need to try this dress; you will not be disappointed! Read more",
        "author": "Steve R.",
        "rating": 5.0,
        "date": "January 10, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71p8mzA3OHL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71VtuyceWcL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71w0nHQLAPL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71DK8nA0GhL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71Bhs+j1g0L._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71KcG076DXL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Worth the price tag!",
        "body": "I’m 5’5”, 150 lbs with a 36DD chest and ordered the medium. It fit like a glove! You definitely can’t wear a bra with it because the zipper won’t close, but the dress itself gives a very flattering fit. It’s a classy yet sexy piece—perfect for dinner or a night out since it’s form-fitting. I was impressed with how well it hid my tummy, even at my “worst weight” of a 35” waist. I’d say anyone around 130–150 lbs with medium to large bust (DD or similar) would look amazing in this dress. The fabric feels great, the quality is worth the price, and overall I absolutely love it! Read more",
        "author": "Anaya",
        "rating": 5.0,
        "date": "August 22, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "1.0 out of 5 stars Disintegrated after 1 wash",
        "body": "The media could not be loaded. I'm changing my 5 ⭐ review to a 1 ⭐ review because this dress completely disintegrated in the wash after I wore it one time. It left black pepper like flakes all over my laundry room. I followed the washing instructions to the letter. An $80 dress should not be destroyed after wearing it once and washing it once. Very disappointing. This is one of the most flattering and comfortable sexy little black dresses I have ever owned. The quality is excellent and it washes up beautifully on cold water in the gentle cycle! Every girl needs a couple of little black dresses that they can wear and feel confident and sexy in. But the bonus on this one is that it's so amazingly comfortable. I didn't even need to wear a bra with it and I'm a 36G. I highly recommend this dress! Take care when zipping it up over the breasts I did accidentally get my skin caught in the zipper. Trust me, you're going to love this dress and turn some heads when you wear it.❤️❤️❤️❤️ Read more",
        "author": "Ann Marie Rosenbecker",
        "rating": 1.0,
        "date": "July 13, 2024",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Great Fit, But Poor-Quality Material Again",
        "body": "I have a collection of dresses from Popilush, and it’s always the same outcome. The concept of having shapewear built into the dress is genius—it really makes you look snatched! This dress fits well, and I received a lot of compliments while wearing it. However, like the others, the material is flimsy and ripped easily. They really need to use better quality fabric. It’s a shame because the fit is great, but the durability just isn’t there Read more",
        "author": "chris nieves",
        "rating": 3.0,
        "date": "October 17, 2024",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars So close. Would look fabulous on many.",
        "body": "The dress is lovely, surprisingly stretchy and comfortable. The idea of the built in shape wear is brilliant imo. Unfortunately it didn’t fit me just right. Showed a too much side boob. I was able to get it zipped without significant issue but I think the problem overall is it was just a bit small for me. For reference I’m 5’8” and 215 lbs, carry a lot of weight in my middle. Read more",
        "author": "Supergirl",
        "rating": 4.0,
        "date": "April 8, 2024",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Wife loves this dress",
        "body": "Have purchased dozens of dresses from Amazon for my wife and this is one of her current favorites. She looks great in it and it fits like a glove. The dress is true to size and the material looks great. It's not too thick but not thin either and supports in all the right ways. It doesn't look exactly like leather but close enough and stretches when you need it. She didn't really need the shapewear support but ended up liking it. The zipper down the front gives this dress 2 different looks. The quality appears very good but time will tell. I love the way she looks in it. Highly recommended! Read more",
        "author": "BP",
        "rating": 5.0,
        "date": "December 17, 2024",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Dress is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.",
  "about_this_item": "Womens Dress is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.",
  "long_description": "Womens Dress is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Red, Brown, Pink, Black. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Dress is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Red, Brown, Pink, Black. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "4b06588c-20fc-4703-a177-4811300d6e85",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4b06588c-20fc-4703-a177-4811300d6e85/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4b06588c-20fc-4703-a177-4811300d6e85/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/c0f68350-dcc6-4ebf-b7bc-732ebe4c0b2f.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "07162d52-46ee-4e0b-a972-180b8d8191f4",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/07162d52-46ee-4e0b-a972-180b8d8191f4/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/07162d52-46ee-4e0b-a972-180b8d8191f4/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/c0f68350-dcc6-4ebf-b7bc-732ebe4c0b2f.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "0df8cd24-d9e3-4771-ac6e-96ef1aff4ff1",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0df8cd24-d9e3-4771-ac6e-96ef1aff4ff1/embedded.cc.default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0df8cd24-d9e3-4771-ac6e-96ef1aff4ff1/embedded.cc.default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/c0f68350-dcc6-4ebf-b7bc-732ebe4c0b2f.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "3c5412e5-8a6e-41a4-91ae-00664e66039c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3c5412e5-8a6e-41a4-91ae-00664e66039c/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3c5412e5-8a6e-41a4-91ae-00664e66039c/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/c0f68350-dcc6-4ebf-b7bc-732ebe4c0b2f.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "d5df3e63-86ae-4d3b-8453-92330c95ea6f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d5df3e63-86ae-4d3b-8453-92330c95ea6f/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d5df3e63-86ae-4d3b-8453-92330c95ea6f/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/c0f68350-dcc6-4ebf-b7bc-732ebe4c0b2f.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "29f5b490-66fb-45be-a0b2-e96bd7836439",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/29f5b490-66fb-45be-a0b2-e96bd7836439/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/29f5b490-66fb-45be-a0b2-e96bd7836439/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/c0f68350-dcc6-4ebf-b7bc-732ebe4c0b2f.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "985118d6-fa78-4612-ba87-96c91d4ad033",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/985118d6-fa78-4612-ba87-96c91d4ad033/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/985118d6-fa78-4612-ba87-96c91d4ad033/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/c0f68350-dcc6-4ebf-b7bc-732ebe4c0b2f.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "448acff9-3083-4d03-ad64-0e1871b43054",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/448acff9-3083-4d03-ad64-0e1871b43054/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/448acff9-3083-4d03-ad64-0e1871b43054/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/c0f68350-dcc6-4ebf-b7bc-732ebe4c0b2f.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "b0453c7d-1765-4103-8ef9-00f0d1295379",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b0453c7d-1765-4103-8ef9-00f0d1295379/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b0453c7d-1765-4103-8ef9-00f0d1295379/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/c0f68350-dcc6-4ebf-b7bc-732ebe4c0b2f.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "c8abf7a9-f7eb-4a02-9e62-1b04fb6d9a58",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c8abf7a9-f7eb-4a02-9e62-1b04fb6d9a58/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c8abf7a9-f7eb-4a02-9e62-1b04fb6d9a58/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/c0f68350-dcc6-4ebf-b7bc-732ebe4c0b2f.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "1a9b1c2a-d47e-4185-8b96-95bb71063d01",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1a9b1c2a-d47e-4185-8b96-95bb71063d01/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1a9b1c2a-d47e-4185-8b96-95bb71063d01/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/c0f68350-dcc6-4ebf-b7bc-732ebe4c0b2f.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "2d095e66-db75-4be8-8e0b-eaba0cdaaa64",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2d095e66-db75-4be8-8e0b-eaba0cdaaa64/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2d095e66-db75-4be8-8e0b-eaba0cdaaa64/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/c0f68350-dcc6-4ebf-b7bc-732ebe4c0b2f.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Red": "https://m.media-amazon.com/images/I/41CJphzPZeL._AC_SR38,50_.jpg",
    "Brown": "https://m.media-amazon.com/images/I/41xnsnY-+nL._AC_SR38,50_.jpg",
    "Pink": "https://m.media-amazon.com/images/I/41VhKLc8XaL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/41lzM4Nn27L._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Red": "61sqv1-6ujL",
    "Brown": "61A16R7DB4L",
    "Pink": "71tAV9uk5dL",
    "Black": "71A9J9Mc3aL"
  },
  "color_images": {
    "Red": [
      "https://m.media-amazon.com/images/I/61sqv1-6ujL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/810QTNVZUlL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/716UIeF7KrL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71DcRxIutNL._SL1500_.jpg"
    ],
    "Brown": [
      "https://m.media-amazon.com/images/I/61A16R7DB4L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/810QTNVZUlL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71pOSERh1wL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61RKFrEgbAL._SL1500_.jpg"
    ],
    "Pink": [
      "https://m.media-amazon.com/images/I/71tAV9uk5dL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/810QTNVZUlL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/711nRSdAr5L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61ff9iOq7HL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/71A9J9Mc3aL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/810QTNVZUlL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71bljlg92fL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71aR3IhGaEL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-sleeveless-maxi",
      "title": "Womens Maxi Dress Sleeveless Maxi",
      "price": 48.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71qwUjryGiL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 43.69,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61-pFN+nfgL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-bodycon",
      "title": "Womens Maxi Dress Maxi Bodycon",
      "price": 36.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61o6MKJoZLL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-one-shoulder-formal-mermaid-bodycon-evening-maxi",
      "title": "Womens Maxi Dress One Shoulder Formal Mermaid Bodycon Evening Maxi",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71mgUBuGwhL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-v-neck-short-sleeve",
      "title": "Womens Dress V Neck Short Sleeve",
      "price": 34.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71T+iJeFITL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress-cocktail-ruched-evening-split",
      "title": "Womens Dress Cocktail Ruched Evening Split",
      "price": 29.69,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/61003bnFhAS._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-maxi",
      "title": "Womens Maxi Dress Formal Maxi",
      "price": 64.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/61RWPo72AmL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-mermaid-one-shoulder",
      "title": "Womens Maxi Dress Mermaid One Shoulder",
      "price": 238.74,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51lR3NNtXCL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-maxi-formal-long-sleeve-v-neck",
      "title": "Womens Maxi Dress Cocktail Maxi Formal Long Sleeve V Neck",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61cfJoIR5bL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-bodycon-ruched",
      "title": "Womens Maxi Dress Cocktail Bodycon Ruched",
      "price": 49.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51+rVhgLHSL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-formal",
      "title": "Womens Dress Formal",
      "price": 75.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51TVxkZ3J2L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening",
      "title": "Womens Maxi Dress Formal Evening",
      "price": 64.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/516ScMrYzlL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-ruched-bodycon-v-neck",
      "title": "Womens Maxi Dress Long Sleeve Ruched Bodycon V Neck",
      "price": 33.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51AvldIvTmL._SL1500_.jpg"
      ]
    }
  ]
}