{
  "id": "womens-dress",
  "handle": "womens-dress",
  "sku": "JC2778",
  "asin": "B0CV3NR7LG",
  "title": "Womens Dress",
  "title_original": "Vintage Floral Printed Summer A-Line Elegant Dresses Womens Beach Sundress Ladies Casual Boho Tank Dress",
  "brand": "Visit the kipfall Store",
  "price": 23.99,
  "social_proof": {
    "bought_past_month": 50,
    "text": "50+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/61rRpe-4LZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61xErIO3TpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61b0ayrxcgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51lygOZ+H9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/519XBg0a6yL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61MtIgeU9DL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61rcEIPNw2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61gsh0Md8QL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51Jw+lzBCqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51B2ZZIY3-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61qtsa7+A1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51D6I6Q6Q2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51FcYo5AiaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61limn-bO9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51M3tKwIFxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61NsDzVuLLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61D9ImxvFtL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61cQO4FDSxL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/61rRpe-4LZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61xErIO3TpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61b0ayrxcgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51lygOZ+H9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/519XBg0a6yL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61MtIgeU9DL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61rcEIPNw2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61gsh0Md8QL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51Jw+lzBCqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51B2ZZIY3-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61qtsa7+A1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51D6I6Q6Q2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51FcYo5AiaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61limn-bO9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51M3tKwIFxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61NsDzVuLLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61D9ImxvFtL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61cQO4FDSxL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ February 6, 2024",
    "ASIN ‏": "‎ B0CXY8K4WJ",
    "Best Sellers Rank": "#85,544 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #908 in Women's Casual Dresses",
    "Customer Reviews": "4.2 4.2 out of 5 stars (1,052)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Royalblue",
      "Floral-2",
      "Flowerred",
      "Floral-1",
      "Floral-4",
      "Solidblue",
      "Floral-3",
      "Floral-6",
      "Floral-5",
      "Floral-8",
      "Flowerpurple",
      "Solidblack",
      "Flowerorange",
      "Pointwine",
      "Solidorange"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.2,
    "count": 1052,
    "customers_say": "Customers love the dress's style, particularly its grommet-style shoulders, and find it comfortable and well-fitting, with one noting it's not baggy or boxy. They appreciate its vibrant colors and lightweight fabric that works well as a swimsuit coverup. The material quality receives mixed feedback - while some find it nice, others say it's mostly polyester. The sizing is also mixed, with some saying it's true to size while others find it too big. Generated from the text of customer reviews Select to learn more Looks (105) Fit (83) Comfort (52) Quality (39) Color (37) Fabric weight (19) Material quality (49) Size (26) 105 customers mention looks, 96 positive, 9 negative 105 customers mention \"Looks\" 96 positive 9 negative Customers find the dress pretty, particularly appreciating its grommet-style shoulders. \" Cute , but way too big for a small; I had to return it. \" Read more \" Beautiful dress exactly as described \" Read more \" It is beautiful and fits perfectly! \" Read more \" Bought for summer soft comfortable and pretty \" Read more 83 customers mention fit, 68 positive, 15 negative 83 customers mention \"Fit\" 68 positive 15 negative Customers like how the dress fits, with one mentioning it's well-fitted and winkle-resistant, while another notes it's not baggy or boxy. \" ...for vacation, slips right on, roll up not wrinkled, easy, fits well , like that it has pockets also \" Read more \" So pretty! This is going to be perfect for my upcoming cruise! Great fit and material! \" Read more \" Very stylish. Fits true to size . Cool for summer and you could use a cute jacket if it cools down. \" Read more \" Nice summer dress. Fabric is light no see through. Fits great . Material seems to be good and fabrics is soft.... \" Read more 52 customers mention comfort, 52 positive, 0 negative 52 customers mention \"Comfort\" 52 positive 0 negative Customers find the dress comfortable, with one mentioning it's not scratchy. \" ...I love this dress. It is comfortable and flattering. I ordered the blue/white one in size medium and liked it so much I ordered the orange one.... \" Read more \" ...another dress that I bought because I love the colors and it's very comfortable and loose fitting. Definitely a hit and I will be looking for more. \" Read more \" ...I think this little summer dress is amazing..It's comfy and made really well...I'm 58ft and 219 pds \" Read more \" Very pretty dress and so comfortable . I really like way the material feels and the little decorative straps. They dress up the dress a little .... \" Read more 39 customers mention quality, 36 positive, 3 negative 39 customers mention \"Quality\" 36 positive 3 negative Customers find the dress to be of good quality, with one mentioning that the rings at the top are well-made. \" Great dress , especially for vacation, slips right on, roll up not wrinkled, easy, fits well, like that it has pockets also \" Read more \" Nice summer dress . Fabric is light no see through. Fits great. Material seems to be good and fabrics is soft.... \" Read more \" Bought for a swimsuit coverup for shore excursions. It’s nice and dressy enough for cafes and casual restaurants. Very comfortable and flattering. \" Read more \" Great summer dress ! I get compliments whiner I wear it. True to size! \" Read more 37 customers mention color, 33 positive, 4 negative 37 customers mention \"Color\" 33 positive 4 negative Customers love the dress's color, describing it as fabulous and perfectly vibrant. \" Beautiful colors , haven’t worn it yet \" Read more \" This was another dress that I bought because I love the colors and it's very comfortable and loose fitting.... \" Read more \" Flattering color , material fabric softness in this dress style and happy with this purchase \" Read more \" This is vibrant and it fits well. Covers under boob underarms well. I'd buy another color roo. \" Read more 19 customers mention fabric weight, 14 positive, 5 negative 19 customers mention \"Fabric weight\" 14 positive 5 negative Customers appreciate that the dress is lightweight, making it suitable as a swimsuit cover-up. \" Nice summer dress. Fabric is light no see through. Fits great. Material seems to be good and fabrics is soft.... \" Read more \" Love it, very comfortable and lightweight perfect for a hot summer day \" Read more \" I likes everything about this dress, except, for me, the material was a little heavy . Size was as they said.... \" Read more \" This dress is light weight fabric and true to size fit. Very comfortable material and I wash it then hang to dry no wrinkles!... \" Read more 49 customers mention material quality, 32 positive, 17 negative 49 customers mention \"Material quality\" 32 positive 17 negative Customers have mixed opinions about the dress's material quality, with some finding it nice and well-designed, while others describe it as cheap and mostly polyester. \" ...Wore it to a beach wedding and got lots of compliments. Well made .... \" Read more \" Nothing like the photo. Cheap , transparent and cut like 7th grader made it as their first sewing project.... \" Read more \" Nice dress material is hot \" Read more \" material is polyester \" Read more 26 customers mention size, 18 positive, 8 negative 26 customers mention \"Size\" 18 positive 8 negative Customers have mixed opinions about the dress's sizing, with some finding it true to size while others report that the suggested size is too big and the dress is enormous. \" ...accurate color to the photo, super comfy, nice and stretchy, and true to size ! The rings at the top are nice quality as well! \" Read more \" ...high neck and short waist, which didn’t affect it much, as it was enormous . Absolutely enormous.... \" Read more \" Really pretty but runs big . \" Read more \" True to size great material love the pockets \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Amazing dress, better price!!",
        "body": "This dress is fantastic, especially for the price!!! Beautiful design, accurate color to the photo, super comfy, nice and stretchy, and true to size! The rings at the top are nice quality as well! Read more",
        "author": "Renee",
        "rating": 5.0,
        "date": "August 29, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Great summer dress.",
        "body": "Nice summer dress. Fabric is light no see through. Fits great. Material seems to be good and fabrics is soft. And I bought this because of the pockets. Love that this dress has pockets. Looks good with a cardigan. Read more",
        "author": "Perry's Pump Repair",
        "rating": 5.0,
        "date": "June 17, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Swing dress great color",
        "body": "I bought an XL for 190 pound girl. ME:) interior is white but the print is great and so is the color. The straps are big to cover a large bra strap (44DDD) Pockets are in a perfect spot and functionable. Price was right. Arizona girl so the fabric needs to be thin. This is definitely thin. Flares on a 5 foot frame. Not scratchy so a pretty solid dress. Washed well and no need to iron. Read more",
        "author": "CooCoo",
        "rating": 4.0,
        "date": "May 22, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Comfort",
        "body": "So very comfortable and soft. You can lounge or go out in the dress. The quality is great. It fits a little big but I liked it. You can dress it up by adding a cute belt. Read more",
        "author": "chad jones",
        "rating": 5.0,
        "date": "October 7, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Ok dress",
        "body": "The dress fits. They are obviously knockoffs of the policies shown on the website. You can just tell. The material is not bright, it's in the detail. It is wearable. For awhile. Not surprised cause of price. Read more",
        "author": "U.C",
        "rating": 3.0,
        "date": "July 1, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Comfortable",
        "body": "Pretty and comfortable Read more",
        "author": "Ray Passaro",
        "rating": 5.0,
        "date": "November 23, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Beautiful dress",
        "body": "This dress is light weight fabric and true to size fit. Very comfortable material and I wash it then hang to dry no wrinkles! Great dress to slip on and go! Recommend Read more",
        "author": "sandi l",
        "rating": 5.0,
        "date": "August 24, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Super cute dress, flattering, soft",
        "body": "Really cute dress! 70% poly 25% rayon. I got the turquoise to black ombre. Very flattering (size L 5'7\" 165 lbs) looks similar to the model ha-ha. Nice fabric thickness that doesn't cling to every bump, wide straps mostly cover bra straps, cute metal rings at shoulders, comes right at knee length for me, color is beautiful. Bought it for a beach dress / swim cover up but it's actually nicer than that. Could be an evening summer dress until it pills which it probably will being mostly poly. Will wash with similar darks (even though it's white inside) and hope it holds up in the wash... Read more",
        "author": "dot2dott",
        "rating": 4.0,
        "date": "August 9, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Dress is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.",
  "about_this_item": "Womens Dress is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.",
  "long_description": "Womens Dress is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Royalblue, Floral-2, Flowerred, Floral-1, Floral-4, Solidblue, Floral-3, Floral-6, Floral-5, Floral-8, Flowerpurple, Solidblack, Flowerorange, Pointwine. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Dress is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Royalblue, Floral-2, Flowerred, Floral-1, Floral-4, Solidblue, Floral-3, Floral-6, Floral-5, Floral-8, Flowerpurple, Solidblack, Flowerorange, Pointwine. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "c84922d7-eb54-4f06-b65f-c504a99f2321",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c84922d7-eb54-4f06-b65f-c504a99f2321/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c84922d7-eb54-4f06-b65f-c504a99f2321/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/0d0a42ec-e94b-4e18-9bc7-ff4fbd1a5cde.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "d9fca848-9d0c-4bd5-af9a-770cc3cf8a3d",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d9fca848-9d0c-4bd5-af9a-770cc3cf8a3d/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d9fca848-9d0c-4bd5-af9a-770cc3cf8a3d/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/0d0a42ec-e94b-4e18-9bc7-ff4fbd1a5cde.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "4d519926-925a-4d0e-8a97-013953bde4a0",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4d519926-925a-4d0e-8a97-013953bde4a0/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4d519926-925a-4d0e-8a97-013953bde4a0/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/0d0a42ec-e94b-4e18-9bc7-ff4fbd1a5cde.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "17973930-c934-404c-8056-75691d60715a",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/17973930-c934-404c-8056-75691d60715a/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/17973930-c934-404c-8056-75691d60715a/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/0d0a42ec-e94b-4e18-9bc7-ff4fbd1a5cde.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "a725cf32-b291-4026-b5ca-4f5f9afc956f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a725cf32-b291-4026-b5ca-4f5f9afc956f/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a725cf32-b291-4026-b5ca-4f5f9afc956f/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/0d0a42ec-e94b-4e18-9bc7-ff4fbd1a5cde.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "900a6e19-e640-4822-822f-c7d8ab092e60",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/900a6e19-e640-4822-822f-c7d8ab092e60/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/900a6e19-e640-4822-822f-c7d8ab092e60/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/0d0a42ec-e94b-4e18-9bc7-ff4fbd1a5cde.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "842bf442-ddf9-485b-a492-163096a2fe51",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/842bf442-ddf9-485b-a492-163096a2fe51/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/842bf442-ddf9-485b-a492-163096a2fe51/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/0d0a42ec-e94b-4e18-9bc7-ff4fbd1a5cde.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Royalblue": "https://m.media-amazon.com/images/I/31FHa490hbL._AC_SR38,50_.jpg",
    "Floral-2": "https://m.media-amazon.com/images/I/41Z7gr6NCcL._AC_SR38,50_.jpg",
    "Flowerred": "https://m.media-amazon.com/images/I/41zmsJ4CmFL._AC_SR38,50_.jpg",
    "Floral-1": "https://m.media-amazon.com/images/I/41EHWqkwUwL._AC_SR38,50_.jpg",
    "Floral-4": "https://m.media-amazon.com/images/I/41CT7ryiZ-L._AC_SR38,50_.jpg",
    "Solidblue": "https://m.media-amazon.com/images/I/31PdTRodv8L._AC_SR38,50_.jpg",
    "Floral-3": "https://m.media-amazon.com/images/I/41LmcDGjF6L._AC_SR38,50_.jpg",
    "Floral-6": "https://m.media-amazon.com/images/I/31aQYVFeBeL._AC_SR38,50_.jpg",
    "Floral-5": "https://m.media-amazon.com/images/I/41wjZdkOlUL._AC_SR38,50_.jpg",
    "Floral-8": "https://m.media-amazon.com/images/I/410JA2D4IJL._AC_SR38,50_.jpg",
    "Flowerpurple": "https://m.media-amazon.com/images/I/41LocXNwp2L._AC_SR38,50_.jpg",
    "Solidblack": "https://m.media-amazon.com/images/I/31dg1JWFCtL._AC_SR38,50_.jpg",
    "Flowerorange": "https://m.media-amazon.com/images/I/4109oD5BW-L._AC_SR38,50_.jpg",
    "Pointwine": "https://m.media-amazon.com/images/I/41wc7JEwPsL._AC_SR38,50_.jpg",
    "Solidorange": "https://m.media-amazon.com/images/I/41U6aUJ7XWL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Royalblue": "519XBg0a6yL",
    "Floral-2": "61MtIgeU9DL",
    "Flowerred": "61rcEIPNw2L",
    "Floral-1": "61gsh0Md8QL",
    "Floral-4": "51Jw+lzBCqL",
    "Solidblue": "51B2ZZIY3-L",
    "Floral-3": "61qtsa7+A1L",
    "Floral-6": "51D6I6Q6Q2L",
    "Floral-5": "61rRpe-4LZL",
    "Floral-8": "51FcYo5AiaL",
    "Flowerpurple": "61limn-bO9L",
    "Solidblack": "51M3tKwIFxL",
    "Flowerorange": "61NsDzVuLLL",
    "Pointwine": "61D9ImxvFtL",
    "Solidorange": "61cQO4FDSxL"
  },
  "color_images": {
    "Royalblue": [
      "https://m.media-amazon.com/images/I/519XBg0a6yL._SL1500_.jpg"
    ],
    "Floral-2": [
      "https://m.media-amazon.com/images/I/61MtIgeU9DL._SL1500_.jpg"
    ],
    "Flowerred": [
      "https://m.media-amazon.com/images/I/61rcEIPNw2L._SL1500_.jpg"
    ],
    "Floral-1": [
      "https://m.media-amazon.com/images/I/61gsh0Md8QL._SL1500_.jpg"
    ],
    "Floral-4": [
      "https://m.media-amazon.com/images/I/51Jw+lzBCqL._SL1500_.jpg"
    ],
    "Solidblue": [
      "https://m.media-amazon.com/images/I/51B2ZZIY3-L._SL1500_.jpg"
    ],
    "Floral-3": [
      "https://m.media-amazon.com/images/I/61qtsa7+A1L._SL1500_.jpg"
    ],
    "Floral-6": [
      "https://m.media-amazon.com/images/I/51D6I6Q6Q2L._SL1500_.jpg"
    ],
    "Floral-5": [
      "https://m.media-amazon.com/images/I/61rRpe-4LZL._SL1500_.jpg"
    ],
    "Floral-8": [
      "https://m.media-amazon.com/images/I/51FcYo5AiaL._SL1500_.jpg"
    ],
    "Flowerpurple": [
      "https://m.media-amazon.com/images/I/61limn-bO9L._SL1500_.jpg"
    ],
    "Solidblack": [
      "https://m.media-amazon.com/images/I/51M3tKwIFxL._SL1500_.jpg"
    ],
    "Flowerorange": [
      "https://m.media-amazon.com/images/I/61NsDzVuLLL._SL1500_.jpg"
    ],
    "Pointwine": [
      "https://m.media-amazon.com/images/I/61D9ImxvFtL._SL1500_.jpg"
    ],
    "Solidorange": [
      "https://m.media-amazon.com/images/I/61cQO4FDSxL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-sleeveless-maxi",
      "title": "Womens Maxi Dress Sleeveless Maxi",
      "price": 48.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71qwUjryGiL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 43.69,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61-pFN+nfgL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-bodycon",
      "title": "Womens Maxi Dress Maxi Bodycon",
      "price": 36.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61o6MKJoZLL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-one-shoulder-formal-mermaid-bodycon-evening-maxi",
      "title": "Womens Maxi Dress One Shoulder Formal Mermaid Bodycon Evening Maxi",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71mgUBuGwhL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-v-neck-short-sleeve",
      "title": "Womens Dress V Neck Short Sleeve",
      "price": 34.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71T+iJeFITL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress-cocktail-ruched-evening-split",
      "title": "Womens Dress Cocktail Ruched Evening Split",
      "price": 29.69,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/61003bnFhAS._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-maxi",
      "title": "Womens Maxi Dress Formal Maxi",
      "price": 64.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/61RWPo72AmL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-mermaid-one-shoulder",
      "title": "Womens Maxi Dress Mermaid One Shoulder",
      "price": 238.74,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51lR3NNtXCL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-maxi-formal-long-sleeve-v-neck",
      "title": "Womens Maxi Dress Cocktail Maxi Formal Long Sleeve V Neck",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61cfJoIR5bL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-bodycon-ruched",
      "title": "Womens Maxi Dress Cocktail Bodycon Ruched",
      "price": 49.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51+rVhgLHSL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-formal",
      "title": "Womens Dress Formal",
      "price": 75.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51TVxkZ3J2L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening",
      "title": "Womens Maxi Dress Formal Evening",
      "price": 64.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/516ScMrYzlL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-ruched-bodycon-v-neck",
      "title": "Womens Maxi Dress Long Sleeve Ruched Bodycon V Neck",
      "price": 33.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51AvldIvTmL._SL1500_.jpg"
      ]
    }
  ]
}