{
  "id": "womens-dress-bodycon-sleeveless",
  "handle": "womens-dress-bodycon-sleeveless",
  "sku": "JC1887",
  "asin": "B0D1X1WVT4",
  "title": "Womens Dress Bodycon Sleeveless",
  "title_original": "LuFeng Women's Summer Sexy Sleeveless Zipper Mock Neck Slim Fit A-line Mini Dress Bodycon Party Club Dress for Women",
  "brand": "Visit the LuFeng Store",
  "price": 39.99,
  "social_proof": {
    "bought_past_month": 806,
    "text": "806+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/61FIJtXEdWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61CIyFLxERL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61xBzFCITbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61BLMEtVIRL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61q4gyhbQZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51nL03UEg3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61WYkYQITeL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61BBiA8tmiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/618HsI+kNqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/613a4bFs0PL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/612hexU7g8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61UMxH-8fGL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/61FIJtXEdWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61CIyFLxERL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61xBzFCITbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61BLMEtVIRL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61q4gyhbQZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51nL03UEg3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61WYkYQITeL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61BBiA8tmiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/618HsI+kNqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/613a4bFs0PL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/612hexU7g8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61UMxH-8fGL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ April 17, 2024",
    "ASIN ‏": "‎ B0D1YCHLWY",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#43,381 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #220 in Women's Club & Night Out Dresses",
    "Customer Reviews": "4.1 4.1 out of 5 stars (310)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Red",
      "Rose Red",
      "Pink",
      "White",
      "Light Green",
      "Black",
      "Orange"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.1,
    "count": 310,
    "customers_say": "Customers find this dress to be a perfect black dress with great material quality and thickness that isn't see-through. The dress fits well, with one customer noting it hits about 2 inches above the knee, and customers find it flattering, with one mentioning it hugs the body perfectly. While some customers appreciate the length, others find it too short. The dress receives mixed feedback about sizing, with several customers noting it's not true to the size chart. Select to learn more Beauty Quality Fit Material thickness Flattering Comfort Length Size 60 customers mention \"Beauty\" 57 positive 3 negative Customers find the dress visually appealing, describing it as a perfect black dress with a nice red option, and one customer notes its feminine flair in the skirt. \"It was cute !! It was a little loose around my waist which I didn’t like because it already has the umbrella look to it. It is cute and comfortable....\" Read more \"Loved this dress and color. Wore it to a concert. Super cute . Had to get it tailored because it was a little big on me....\" Read more \"This dress was so cute and could be styled many different ways. It fit well and was lined with a comfortable material....\" Read more \"This is the most flattering and beautiful dress to own in your closet ! The fabric is so soft and great QUALITY!!!!\" Read more 37 customers mention \"Quality\" 29 positive 8 negative Customers praise the dress's material quality, with one mentioning it offers great value for $30. \"...The material is luxurious and has such a great quality to it, holding its shape perfectly....\" Read more \"This dress is the perfect LBD . Fits as expected and very flattering.\" Read more \"... Dress is fabulous . I’m exchanging for a bigger size. I’m a 36 D and the top is beyond too tight\" Read more \" Poor quality ...\" Read more 34 customers mention \"Fit\" 24 positive 10 negative Customers are satisfied with how the dress fits, with one mentioning it hits about 2 inches above the knee. \"This dress was so cute and could be styled many different ways. It fit well and was lined with a comfortable material....\" Read more \"5'2\" 130 lbs 34DD purchased Medium Fits perfect & still room to breathe. Beautiful dress & fully lined....\" Read more \"It was cute!! It was a little loose around my waist which I didn’t like because it already has the umbrella look to it. It is cute and comfortable....\" Read more \"This dress fit perfectly and is such a classic look. For the price point it’s for sure worth it. Needs a backless bra.\" Read more 28 customers mention \"Material thickness\" 20 positive 8 negative Customers appreciate the dress's material thickness, noting it is surprisingly thick and not see-through, with one customer mentioning it effectively hides tummy and hips. \"...Fabric feels comfortable. Not see through , as I wore no bra Strap sit right near underarms. **...\" Read more \"The fabric is thick and looks close to what’s pictured, but it definitely doesn’t flare out as much....\" Read more \"The fabric was see through and it was long on the torso part and in general on me. 5’4” and ordered a large\" Read more \"...It fits well, the material is thick and sturdy. I will also wear this dress for my professional headshots so this dress is super versatile! &...\" Read more 19 customers mention \"Flattering\" 16 positive 3 negative Customers find the dress flattering, with one mentioning it hugs the body perfectly. \"I love this dress, the material is surprisingly thick and it’s so flattering . I ordered a medium and it fit perfectly, I’m 5’5” and 147 lb\" Read more \"...Beautiful dress & fully lined. Very flattering & hits about 2\" above my knee. Not short like the picture of the model. Highly recommend this dress....\" Read more \"...The quality of the material is great it’s thick and soft. It’s flattering , comfortable, and simple. I took my graduation photos in this dress.\" Read more \"...It’s figure flattering , not too short, and just overall a great dress!...\" Read more 12 customers mention \"Comfort\" 12 positive 0 negative Customers find the dress comfortable. \"Love this dress! The fit was great (true to size). It's so comfortable and chic. The hips flare out, just as pictured....\" Read more \"Dress is exactly like the picture. Very comfortable and flattering shape! Thick material.\" Read more \"this dress is so pretty on. It is a comfortable material and does have a stretch to it....\" Read more \"...Plus, it was so comfy that I danced the night away, receiving compliments from everyone!...\" Read more 13 customers mention \"Length\" 6 positive 7 negative Customers have mixed opinions about the dress's length, with some finding it great while others complain that the torso area is too long. \"...cute dress and it fits great everywhere else, but it was just a bit too short for me ....\" Read more \"...Super flattering and the length was perfect for me . I’m 5 foot five and have pretty short legs and I feel like it hit at my mid thigh perfect....\" Read more \"...It fit well but be warned the length is SHORT . I had to return unfortunately due to not covering my butt but would recommend\" Read more \"Cute dress, great length for me and im 4'11. The structure is a bit too stiff. Wore it for a theme bridal shower.\" Read more 14 customers mention \"Size\" 4 positive 10 negative Customers report sizing issues with the dress, noting it runs big and is not true to the size chart. \"...and this one was way too short, too small in the chest , the high neck seemed like it wasn’t measured on a real human for...\" Read more \"This dress is fabulous. The material is outstanding. But size up . Will order another one\" Read more \"...It's definitely true to size , and honestly, I wish I could snag it in every color imaginable!...\" Read more \"Great material but runs small , I ordered XL but did not fit into it considering the sizing chart it would have fit but it fix like a M.\" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Perfect little black dress for the holidays!",
        "body": "This is the perfect little black dress! Super flattering and the length was perfect for me. I’m 5 foot five and have pretty short legs and I feel like it hit at my mid thigh perfect. Extremely comfortable and I was still able to wear a strapless bra even with the low back, which I was worried about. I initially ordered an extra large however it was too big in the arm and chest area so returned for a large for a more snug fit, it was perfect! Read more",
        "author": "Chelsey",
        "rating": 5.0,
        "date": "December 18, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/81T197OhBLL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Little Black Dress",
        "body": "This dress is the perfect LBD. Fits as expected and very flattering. Read more",
        "author": "Mandi",
        "rating": 5.0,
        "date": "December 17, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Perfection!",
        "body": "Great value! Thick, somewhat stretchy material hugs and slims curves. Comfortable to wear. Shape is as expected, with the flair in the skirt. Color is as expected - a soft, baby pink. This dress impressed me! Super cute and flattering. Highly recommend! Read more",
        "author": "Customer",
        "rating": 5.0,
        "date": "August 18, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61xjqpTH6fL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/61clag6O5mL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "1.0 out of 5 stars Nah",
        "body": "Not worth it to me. Sent it back same day. Cheaply made Read more",
        "author": "Haus of Bulliez LLC",
        "rating": 1.0,
        "date": "November 2, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Cute dress!",
        "body": "this dress is so pretty on. It is a comfortable material and does have a stretch to it. Although I will say, if you are more busty than the line design on the dress, probably won’t be in the correct position that it should be. I kept having to pull the dress down to be able to get the line in the right spot because I wore it for engagement pictures. I loved the scoop back on this dress as well, it was so flattering. Read more",
        "author": "Brooke Detillier",
        "rating": 4.0,
        "date": "May 25, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71S0WXZPWSL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/811AMKhSZeL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Beautiful and Comfortable!",
        "body": "Love this dress! The quality of the material is great it’s thick and soft. It’s flattering, comfortable, and simple. I took my graduation photos in this dress. Read more",
        "author": "Marcela",
        "rating": 5.0,
        "date": "October 6, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71jmaZH82kL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "3.0 out of 5 stars Casual/business/dressed up",
        "body": "Dress is ok. I like that you can wear it casual, to a business event & dress it up to look youthful. Was I super impressed ? Na. I weigh 150, and had a baby. Might need to wear shapewear to smooth my lower tummy. Fabric feels comfortable. Not see through, as I wore no bra Strap sit right near underarms. **sorry pics are not ideal- just tried it on & had partner take the photos Read more",
        "author": "Yasmeen Solano",
        "rating": 3.0,
        "date": "August 22, 2024",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61CNvLj-GBL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71gr837e79L._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/612W1DRqI9L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars amazing!",
        "body": "absolutely gorgeous!! such a cute & classy look! Read more",
        "author": "Laura Peters",
        "rating": 5.0,
        "date": "December 19, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Dress Bodycon Sleeveless is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.",
  "about_this_item": "Womens Dress Bodycon Sleeveless is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.",
  "long_description": "Womens Dress Bodycon Sleeveless is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Red, Rose Red, Pink, White, Light Green, Black, Orange. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Dress Bodycon Sleeveless is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Red, Rose Red, Pink, White, Light Green, Black, Orange. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "0b8412c6-f42c-4cff-a479-111c9b277539",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0b8412c6-f42c-4cff-a479-111c9b277539/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0b8412c6-f42c-4cff-a479-111c9b277539/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "54dac3b3-0d2d-4270-b6bb-491c3880cbb1",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/54dac3b3-0d2d-4270-b6bb-491c3880cbb1/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/54dac3b3-0d2d-4270-b6bb-491c3880cbb1/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Red": "https://m.media-amazon.com/images/I/31mYFn-3qCL._AC_SR38,50_.jpg",
    "Rose Red": "https://m.media-amazon.com/images/I/31ZcmA8hPzL._AC_SR38,50_.jpg",
    "Pink": "https://m.media-amazon.com/images/I/31kCYOZDy3L._AC_SR38,50_.jpg",
    "White": "https://m.media-amazon.com/images/I/31xrpYCcvuL._AC_SR38,50_.jpg",
    "Light Green": "https://m.media-amazon.com/images/I/31QvfNf6jOL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31LMIyw4vqL._AC_SR38,50_.jpg",
    "Orange": "https://m.media-amazon.com/images/I/31rfeFEFQqL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Red": "61WYkYQITeL",
    "Rose Red": "61BBiA8tmiL",
    "Pink": "618HsI+kNqL",
    "White": "61FIJtXEdWL",
    "Light Green": "613a4bFs0PL",
    "Black": "612hexU7g8L",
    "Orange": "61UMxH-8fGL"
  },
  "color_images": {
    "Red": [
      "https://m.media-amazon.com/images/I/61WYkYQITeL._SL1500_.jpg"
    ],
    "Rose Red": [
      "https://m.media-amazon.com/images/I/61BBiA8tmiL._SL1500_.jpg"
    ],
    "Pink": [
      "https://m.media-amazon.com/images/I/618HsI+kNqL._SL1500_.jpg"
    ],
    "White": [
      "https://m.media-amazon.com/images/I/61FIJtXEdWL._SL1500_.jpg"
    ],
    "Light Green": [
      "https://m.media-amazon.com/images/I/613a4bFs0PL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/612hexU7g8L._SL1500_.jpg"
    ],
    "Orange": [
      "https://m.media-amazon.com/images/I/61UMxH-8fGL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress-cocktail-short-sleeve-ruched",
      "title": "Womens Dress Cocktail Short Sleeve Ruched",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/51EAoXP7IGL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/81VEy9ZQg3L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-short-sleeve",
      "title": "Womens Maxi Dress Short Sleeve",
      "price": 94.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61XfdV9K79L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-v-neck-evening-maxi",
      "title": "Womens Maxi Dress V Neck Evening Maxi",
      "price": 62.89,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71IFg+tu9yL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 74.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/51Mfqz0l6vL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-long-sleeve-maxi-bodycon-split-ruched",
      "title": "Womens Maxi Dress Long Sleeve Maxi Bodycon Split Ruched",
      "price": 36.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71Uts3n4FBL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-v-neck-formal",
      "title": "Womens Maxi Dress Evening V Neck Formal",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61F5f5cy98L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-v-neck",
      "title": "Womens Maxi Dress Maxi V Neck",
      "price": 45.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/718u-jSEcIL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-formal",
      "title": "Womens Maxi Dress Long Sleeve Formal",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/714zYpNDHwL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-maxi",
      "title": "Womens Maxi Dress Long Sleeve Maxi",
      "price": 19.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61PXdxFkVUL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-long-sleeve-cocktail-formal-maxi",
      "title": "Womens Maxi Dress Bodycon Long Sleeve Cocktail Formal Maxi",
      "price": 60.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51XkGz6gyzL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-sleeveless",
      "title": "Womens Maxi Dress Maxi Sleeveless",
      "price": 39.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51oAFf8LZHL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-v-neck",
      "title": "Womens Maxi Dress Long Sleeve V Neck",
      "price": 47.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71wrQhLd-8L._SL1500_.jpg"
      ]
    }
  ]
}