{
  "id": "womens-maxi-dress-bodycon-maxi",
  "handle": "womens-maxi-dress-bodycon-maxi",
  "sku": "JC2908",
  "asin": "B0D1G59S41",
  "title": "Womens Maxi Dress Bodycon Maxi",
  "title_original": "Women's Knit Maxi Dress Spaghetti Strap Floral Dresses Bodycon Knitted Beach Long Dress Backless Swim Cover up Dresses",
  "brand": "Visit the LOUSEA Store",
  "price": 40.17,
  "social_proof": {
    "bought_past_month": 699,
    "text": "699+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/41bSqtJhKaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51Yp+qGDouL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41Q18x4zYKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51oX7l8gUGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71LidC2gKNL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71L7S7Aj3cL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61TC07yZQ8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/5192-1bRAjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41neoIt53eL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51rzlz8HoLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41s0-K+TSVL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51UqittKS1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51jNFmMy0IL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41rddsFYndL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61PKL3oYJ4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61zapmAfQEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61cJfETMG9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61BUoD1L-hL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/611vBY7huTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41ZttXzNvuL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51SnMD5i3YL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41sqSwL+jgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/510BmdkPyHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51QaOKjrMuL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51rlAQTsoDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/515sI3F8bBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71FPMg4jaeL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61o39eG7FvL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61cHGfCDV4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/610ER2gGTyL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/41bSqtJhKaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51Yp+qGDouL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41Q18x4zYKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51oX7l8gUGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71LidC2gKNL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71L7S7Aj3cL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61TC07yZQ8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/5192-1bRAjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41neoIt53eL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51rzlz8HoLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41s0-K+TSVL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51UqittKS1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51jNFmMy0IL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41rddsFYndL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61PKL3oYJ4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61zapmAfQEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61cJfETMG9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61BUoD1L-hL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/611vBY7huTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41ZttXzNvuL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51SnMD5i3YL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41sqSwL+jgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/510BmdkPyHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51QaOKjrMuL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51rlAQTsoDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/515sI3F8bBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71FPMg4jaeL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61o39eG7FvL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61cHGfCDV4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/610ER2gGTyL._SL1500_.jpg"
  ],
  "aplus_images": [
    "https://m.media-amazon.com/images/I/21-d09hqi5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/21jmVegtvIL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/3195OYYzGmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/3197G-1PiUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31zKpjafv6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31Pskzaj5IL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41z62Al4B6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41Wdu%2BK2gPL._SL1500_.jpg"
  ],
  "description_images": [
    "https://m.media-amazon.com/images/I/21-d09hqi5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/21jmVegtvIL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/3195OYYzGmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/3197G-1PiUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31zKpjafv6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31Pskzaj5IL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41z62Al4B6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41Wdu%2BK2gPL._SL1500_.jpg"
  ],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ April 11, 2024",
    "Manufacturer ‏": "‎ LOUSEA",
    "ASIN ‏": "‎ B0D1G8Z195",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#131,524 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #1,658 in Women's Casual Dresses",
    "Customer Reviews": "4.1 4.1 out of 5 stars (77)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "3d Flower-pink",
      "3d Flower-white",
      "3d Flower-apricot",
      "Blue",
      "Black&white",
      "Green",
      "Light Khaki"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.1,
    "count": 77,
    "customers_say": "Customers find the dress gorgeous and flattering, with perfect fit and comfort. They appreciate its quality, with one customer noting it's amazing for the price. The see-through aspect receives mixed feedback - while some say it's not see-through, others mention it's a little see-through. The material quality and sizing also get mixed reviews, with some finding it true to size while others say it runs too small. Generated from the text of customer reviews Select to learn more Style (20) Fit (13) Flattering (7) Comfort (6) Quality (6) See through (16) Material quality (8) Size (5) 20 customers mention style, 18 positive, 2 negative 20 customers mention \"Style\" 18 positive 2 negative Customers find the dress gorgeous and perfect for a beach vibe, with one customer noting that the flowers add a nice feminine touch. \" Beautiful dress and the quality was good. I used it for my baby shower and it fit perfect on the bump \" Read more \" Love the fit, comfortable and style ! It’s a definite keeper. Wear it all the time and get many compliments \" Read more \" Cute dress but if you’re tall (5’8-6’0). Prepare for the end of the dress to look like highwaters \" Read more \" This dress is stunning . Absolutely obsessed. I plan to wear it to a boat party. The top part is a little see through, but the bottom half is not.... \" Read more 13 customers mention fit, 10 positive, 3 negative 13 customers mention \"Fit\" 10 positive 3 negative Customers are satisfied with how the dress fits, with several noting it is perfect, and one mentioning it works well with flats. \" ...I am 5’2 and the length was perfect with flats . \" Read more \" Gorgeous dress thick material not see through at all fits true to size great quality! \" Read more \" Loved this dress for my baby shower. It fit true to size , was comfortable, and was able to stretch for my growing belly.... \" Read more \" The dress is too short ; it fits above my ankles and is not floor-grazing as advertised or pictured on Amazon. I'm not too happy about this.... \" Read more 7 customers mention flattering, 6 positive, 1 negative 7 customers mention \"Flattering\" 6 positive 1 negative Customers find the dress flattering. \" Very flattering , lightweight dress. Slightly seethrough, but not entirely. Hard to describe. True to size. \" Read more \" This dress is so cute I love it, it is so flattering great dupe. Only down side is it is a little see through but it wasn’t too bad.... \" Read more \" ...soft, comfortable, and has a nice stretch that makes it very flattering on the body .... \" Read more \" Fabric, quality, and fit were excellent. Flattering , comfortable, and loved the price. The only flaw is that I consider this more petite friendly.... \" Read more 6 customers mention comfort, 6 positive, 0 negative 6 customers mention \"Comfort\" 6 positive 0 negative Customers find the dress comfortable. \" Fabric, quality, and fit were excellent. Flattering, comfortable , and loved the price. The only flaw is that I consider this more petite friendly.... \" Read more \" ...material was not what I expected from the picture but it still was so comfortable and very stretchy and great. \" Read more \" ...She said it was very comfortable and that the ability to tighten the straps was great. \" Read more \" I absolutely love this dress! The material feels soft, comfortable , and has a nice stretch that makes it very flattering on the body.... \" Read more 6 customers mention quality, 6 positive, 0 negative 6 customers mention \"Quality\" 6 positive 0 negative Customers find the dress to be of good quality, with one mentioning it offers great value for the price. \" Love this dress ! Wore it for my baby shower, but will definitely wear it again afterwards. \" Read more \" ...dress thick material not see through at all fits true to size great quality ! \" Read more \" ... Quality is amazing for the price and it fit perfectly and matched what was expected when comparing with the size chart... \" Read more \" Fabric, quality , and fit were excellent. Flattering, comfortable, and loved the price. The only flaw is that I consider this more petite friendly.... \" Read more 16 customers mention see through, 6 positive, 10 negative 16 customers mention \"See through\" 6 positive 10 negative Customers have mixed opinions about the dress's transparency, with some finding it not as see-through as expected and appreciating its high coverage, while others note it is slightly sheer. \" Cute but it’s definitely see-through \" Read more \" Gorgeous dress thick material not see through at all fits true to size great quality! \" Read more \" Really beautiful but definitely see through - not sure how to even wear it at this point. \" Read more \" ...I plan to wear it to a boat party. The top part is a little see through , but the bottom half is not.... \" Read more 8 customers mention material quality, 5 positive, 3 negative 8 customers mention \"Material quality\" 5 positive 3 negative Customers have mixed opinions about the dress's material quality, with some finding it great, while others describe it as cheap. \" ...The material was great and I got so many complaints. If only I would have steamed the dress a bit… but overall GREAT DRESS!!!!! \" Read more \" It was cheaper fabric than expected for the price \" Read more \" Fabric , quality, and fit were excellent. Flattering, comfortable, and loved the price. The only flaw is that I consider this more petite friendly.... \" Read more \" Gorgeous! Thick material and well sewn. Highly recommend \" Read more 5 customers mention size, 3 positive, 2 negative 5 customers mention \"Size\" 3 positive 2 negative Customers have mixed opinions about the dress's sizing, with some finding it true to size while others report that the small size runs larger than expected. \" ...It was very flattering. I did wear a slip under it. It is true to size and a great option for pregnant mommas wanting something cute and different... \" Read more \" ...small and have a small chest and the top of this dress was still way too small and oddly shaped, flowers and material were cheap, not worth it \" Read more \" ...Slightly seethrough, but not entirely. Hard to describe. True to size . \" Read more \" Sizing is massive , size small was closer to a larger. Unable to wear. \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Beautiful Fit and Gorgeous Details",
        "body": "I absolutely love this dress! The material feels soft, comfortable, and has a nice stretch that makes it very flattering on the body. The floral appliqués add a delicate, classy touch that makes the dress look much more expensive than it is Read more",
        "author": "Melanies Napoles",
        "rating": 5.0,
        "date": "December 2, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Perfect beach vibe dress",
        "body": "The media could not be loaded. I got this for my daughter to wear for her maternity pictures at the beach. The dress was stunning on her. It was just the perfect color and fit for her. She wore her typical dress size small and it fit over her belly just fine. It is a tiny bit see through but very easy to conceal with nude undergarments. She said it was very comfortable and that the ability to tighten the straps was great. Read more",
        "author": "Rifka Coleman",
        "rating": 5.0,
        "date": "August 9, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61bHOYt3fmL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/61E1N096S9L._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71eTtRGJk0L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "3.0 out of 5 stars See through",
        "body": "It’s really cute but completely see through. I want to wear this for some bridal events but I’m not sure how because you can see everything. So sad! Read more",
        "author": "Taylor Carr",
        "rating": 3.0,
        "date": "July 15, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71dKsmoIW-L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Amazing for price!",
        "body": "Soft! Got this for an upcoming beach vacation. It clings to the body so if you don’t like showing it off it might not be for you. The color is beautiful and flowers add a nice feminine touch. Quality is amazing for the price and it fit perfectly and matched what was expected when comparing with the size chart (I’m 5’6 and about 175 pounds and got an XL). Definitely worth it! Read more",
        "author": "Serena H.",
        "rating": 5.0,
        "date": "October 31, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61UqDcQ7gqL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71pEh-uomaL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "2.0 out of 5 stars A little too sheer for my body",
        "body": "I love the style and design of this little dress. Would be great for a vacation over a swimsuit. It was just a little to see through for me and I wish the length was a little bit longer. I gave it away to a friend. Looks great in her. Read more",
        "author": "DANIELLE CATAFFO",
        "rating": 2.0,
        "date": "July 16, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Buy it!!",
        "body": "The media could not be loaded. Gorgeous dress thick material not see through at all fits true to size great quality! Read more",
        "author": "Alyssa",
        "rating": 5.0,
        "date": "September 20, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71LpHJ+X2rL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71ZL0-60U5L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Beautiful dress",
        "body": "Beautiful dress and the quality was good. I used it for my baby shower and it fit perfect on the bump Read more",
        "author": "Carla Diaz",
        "rating": 5.0,
        "date": "November 24, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "1.0 out of 5 stars Stains / Wet",
        "body": "I had high hopes for this dress, but was sadly disappointed once it got delivered. When I first opened up the package, I noticed the whole dress was slightly wet. Then, as I’m attempting to try the dress on, I notice stains all over (outside the dress and inside). I think this is definitely gross and unsanitary. It’s hard to capture through photos since the color is beige, but I attached a few. Read more",
        "author": "Keri",
        "rating": 1.0,
        "date": "September 15, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/81DraGEauoL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/81Aisie0vWL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71eGWjNMVEL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/81vgZXjMBRL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/81nlqwX0wUL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/818qyH9ojnL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/81P0P88VW+L._SY88._SL1500_.jpg"
        ]
      }
    ]
  },
  "short_description": "Womens Maxi Dress Bodycon Maxi is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.",
  "about_this_item": "Womens Maxi Dress Bodycon Maxi is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.",
  "long_description": "Womens Maxi Dress Bodycon Maxi is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: 3d Flower-pink, 3d Flower-white, 3d Flower-apricot, Blue, Black&white, Green, Light Khaki. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Bodycon Maxi is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/21-d09hqi5L._SL1500_.jpg",
      "alt": "Womens Maxi Dress Bodycon Maxi details image 1"
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/21jmVegtvIL._SL1500_.jpg",
      "alt": "Womens Maxi Dress Bodycon Maxi details image 2"
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/3195OYYzGmL._SL1500_.jpg",
      "alt": "Womens Maxi Dress Bodycon Maxi details image 3"
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/3197G-1PiUL._SL1500_.jpg",
      "alt": "Womens Maxi Dress Bodycon Maxi details image 4"
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: 3d Flower-pink, 3d Flower-white, 3d Flower-apricot, Blue, Black&white, Green, Light Khaki. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/31zKpjafv6L._SL1500_.jpg",
      "alt": "Womens Maxi Dress Bodycon Maxi details image 5"
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "68cbeb10-f13f-47fc-9eda-f9165bb9d6d2",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/68cbeb10-f13f-47fc-9eda-f9165bb9d6d2/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/68cbeb10-f13f-47fc-9eda-f9165bb9d6d2/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "f44538ff-6e9c-437d-809e-70cc073c25e3",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f44538ff-6e9c-437d-809e-70cc073c25e3/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f44538ff-6e9c-437d-809e-70cc073c25e3/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "55652778-5c5d-4f44-b786-f3a71f05d055",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/55652778-5c5d-4f44-b786-f3a71f05d055/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/55652778-5c5d-4f44-b786-f3a71f05d055/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "b9c6719a-6362-4e4b-9ecf-ac7af60b15f0",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b9c6719a-6362-4e4b-9ecf-ac7af60b15f0/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b9c6719a-6362-4e4b-9ecf-ac7af60b15f0/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "46794e1d-3bba-4d52-911c-80a13c33a980",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/46794e1d-3bba-4d52-911c-80a13c33a980/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/46794e1d-3bba-4d52-911c-80a13c33a980/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "1242db68-20a1-416c-a199-3e15a1bf37ea",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1242db68-20a1-416c-a199-3e15a1bf37ea/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1242db68-20a1-416c-a199-3e15a1bf37ea/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "c57b7e09-c3de-4053-acf2-9ecc6977f223",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c57b7e09-c3de-4053-acf2-9ecc6977f223/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c57b7e09-c3de-4053-acf2-9ecc6977f223/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "a0bf2669-0645-495a-81b2-4652fdfaf0e1",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a0bf2669-0645-495a-81b2-4652fdfaf0e1/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a0bf2669-0645-495a-81b2-4652fdfaf0e1/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "c3488c5a-97bc-4467-a4a6-07055f9c617b",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c3488c5a-97bc-4467-a4a6-07055f9c617b/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c3488c5a-97bc-4467-a4a6-07055f9c617b/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "0368b08c-fd82-4b6f-b87e-3bc5531cd70a",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0368b08c-fd82-4b6f-b87e-3bc5531cd70a/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0368b08c-fd82-4b6f-b87e-3bc5531cd70a/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "38fe74e4-fd08-46b6-9a5a-797ecac85cf2",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/38fe74e4-fd08-46b6-9a5a-797ecac85cf2/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/38fe74e4-fd08-46b6-9a5a-797ecac85cf2/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "7eac4af0-e3b6-496f-ba3c-894c32e7ff3d",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7eac4af0-e3b6-496f-ba3c-894c32e7ff3d/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7eac4af0-e3b6-496f-ba3c-894c32e7ff3d/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "3d Flower-pink": "https://m.media-amazon.com/images/I/21kGNvmSKFL._AC_SR38,50_.jpg",
    "3d Flower-white": "https://m.media-amazon.com/images/I/21MJxB6BGYL._AC_SR38,50_.jpg",
    "3d Flower-apricot": "https://m.media-amazon.com/images/I/21Gd5yMi5LL._AC_SR38,50_.jpg",
    "Blue": "https://m.media-amazon.com/images/I/21mKXfGfZ4L._AC_SR38,50_.jpg",
    "Black&white": "https://m.media-amazon.com/images/I/31qkNKVsgpL._AC_SR38,50_.jpg",
    "Green": "https://m.media-amazon.com/images/I/31ZhVyZBeBL._AC_SR38,50_.jpg",
    "Light Khaki": "https://m.media-amazon.com/images/I/31fN-hd4TeL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "3d Flower-pink": "41neoIt53eL",
    "3d Flower-white": "41rddsFYndL",
    "3d Flower-apricot": "41bSqtJhKaL",
    "Blue": "41ZttXzNvuL",
    "Black&white": "51rlAQTsoDL",
    "Green": "61cHGfCDV4L",
    "Light Khaki": "610ER2gGTyL"
  },
  "color_images": {
    "3d Flower-pink": [
      "https://m.media-amazon.com/images/I/41neoIt53eL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/51rzlz8HoLL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/41s0-K+TSVL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/51UqittKS1L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71LidC2gKNL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61TC07yZQ8L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/51jNFmMy0IL._SL1500_.jpg"
    ],
    "3d Flower-white": [
      "https://m.media-amazon.com/images/I/41rddsFYndL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61PKL3oYJ4L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61zapmAfQEL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61cJfETMG9L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61TC07yZQ8L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71LidC2gKNL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61BUoD1L-hL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/611vBY7huTL._SL1500_.jpg"
    ],
    "3d Flower-apricot": [
      "https://m.media-amazon.com/images/I/41bSqtJhKaL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/51Yp+qGDouL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/41Q18x4zYKL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/51oX7l8gUGL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71LidC2gKNL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71L7S7Aj3cL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61TC07yZQ8L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/5192-1bRAjL._SL1500_.jpg"
    ],
    "Blue": [
      "https://m.media-amazon.com/images/I/41ZttXzNvuL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/51SnMD5i3YL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/41sqSwL+jgL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/510BmdkPyHL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71LidC2gKNL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61TC07yZQ8L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/51QaOKjrMuL._SL1500_.jpg"
    ],
    "Black&white": [
      "https://m.media-amazon.com/images/I/51rlAQTsoDL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/515sI3F8bBL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71FPMg4jaeL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61o39eG7FvL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61TC07yZQ8L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71LidC2gKNL._SL1500_.jpg"
    ],
    "Green": [
      "https://m.media-amazon.com/images/I/61cHGfCDV4L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71L7S7Aj3cL._SL1500_.jpg"
    ],
    "Light Khaki": [
      "https://m.media-amazon.com/images/I/610ER2gGTyL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-one-shoulder-formal-evening",
      "title": "Womens Maxi Dress One Shoulder Formal Evening",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61YE+wpDUzL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 43.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/6135E3haINL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/81IvK7RUpiL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening",
      "title": "Womens Maxi Dress Formal Evening",
      "price": 76.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/617cJEuOdgL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-ruched-bodycon-cocktail",
      "title": "Womens Dress Ruched Bodycon Cocktail",
      "price": 43.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51Fi7gsARJL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 37.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/613fdSJqbAL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail-evening-formal",
      "title": "Womens Dress Cocktail Evening Formal",
      "price": 53.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71O9kkR1wfL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/7134YJLsKGL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-long-sleeve",
      "title": "Womens Maxi Dress Bodycon Long Sleeve",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71eDrn5syuL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening",
      "title": "Womens Maxi Dress Formal Evening",
      "price": 96.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/514-EuRQtQL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 175.42,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/81pwjJgvUtL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 39.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71vtAwYcALL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-off-shoulder",
      "title": "Womens Maxi Dress Off Shoulder",
      "price": 176.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/81O+xvlECgL._SL1500_.jpg"
      ]
    }
  ]
}