{
  "id": "womens-maxi-dress-v-neck-long-sleeve-maxi",
  "handle": "womens-maxi-dress-v-neck-long-sleeve-maxi",
  "sku": "JC2284",
  "asin": "B0D22W78TD",
  "title": "Womens Maxi Dress V Neck Long Sleeve Maxi",
  "title_original": "PRETTYGARDEN Women's 2025 Maxi Dress Long Sleeve V Neck Flowy Swiss Dot High Waist Casual A Line Fall Wedding Guest Dresses",
  "brand": "Visit the PRETTYGARDEN Store",
  "price": 29.99,
  "social_proof": {
    "bought_past_month": 107,
    "text": "107+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/716Rhy3XMjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/711WTEaj78L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71k+jnwDsNL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71cw5jAyMBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71FQ20yrANL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71y-BGTRmaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/713maZDeqCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71p2Io8p96L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71H8vzIdaEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71gNpPGVV6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71LtmdA+BpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71I-fhoRVmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71a-UFyEjXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71fB6eEClcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71uRcbAZ+GL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61vY5E8cqKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71NDMfNyLJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71tGPsO-ltL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71hoVY0U9QL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71l7qbnilnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/718b1ajn7rL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71sboznyU4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71qVGNlzECL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71WQsjQTlTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Hj1doBr8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ucZ9A1KiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71n91jyI+gL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71vo5M2od5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71h7oslDC9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61YsqsAx7PL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/7158+TX2s-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61KT673UtZL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/716Rhy3XMjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/711WTEaj78L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71k+jnwDsNL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71cw5jAyMBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71FQ20yrANL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71y-BGTRmaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/713maZDeqCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71p2Io8p96L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71H8vzIdaEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71gNpPGVV6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71LtmdA+BpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71I-fhoRVmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71a-UFyEjXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71fB6eEClcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71uRcbAZ+GL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61vY5E8cqKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71NDMfNyLJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71tGPsO-ltL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71hoVY0U9QL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71l7qbnilnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/718b1ajn7rL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71sboznyU4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71qVGNlzECL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71WQsjQTlTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Hj1doBr8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ucZ9A1KiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71n91jyI+gL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71vo5M2od5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71h7oslDC9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61YsqsAx7PL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/7158+TX2s-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61KT673UtZL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ April 18, 2024",
    "ASIN ‏": "‎ B0D22YBJ6P",
    "Best Sellers Rank": "#93,260 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #1,014 in Women's Casual Dresses",
    "Customer Reviews": "4.2 4.2 out of 5 stars (173)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Dark Green",
      "Navy",
      "Blue",
      "Black"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.2,
    "count": 173,
    "customers_say": "Customers find the dress to be of high quality with a lovely navy color and light fabric weight. Moreover, they appreciate its design, comfort, and fabric quality. However, the fit receives mixed feedback, with several customers noting that the sleeves are too long. Additionally, customers disagree on whether the dress is flattering. Generated from the text of customer reviews Select to learn more Beauty (14) Quality (14) Comfort (7) Fabric quality (7) Color (6) Fabric weight (6) Fit (23) Flattering (6) 14 customers mention beauty, 12 positive, 2 negative 14 customers mention \"Beauty\" 12 positive 2 negative Customers find the dress very pretty, appreciating its design. \" Beautiful dress . Many compliments. Wore to granddaughters outdoor wedding. Perfect \" Read more \" This is a really cute dress . I bought 2 of them! Unfortunately the sleeves are way too big and long.... \" Read more \" Cute dress but very prairie girl. If you tuck the flared wrists in and modernize with shoes and accessories it's better. \" Read more \" Cute and boho \" Read more 14 customers mention quality, 12 positive, 2 negative 14 customers mention \"Quality\" 12 positive 2 negative Customers find the dress to be of high quality. \" This dress is nice , light and airy. It’s a little see through so I would highly recommend a slip. Easy pick for either a casual or dressy event.... \" Read more \" ...The material is not too heavy while still feeling high quality , the lining prevents transparency which means no slip is required and the way the... \" Read more \" Great dress ,... \" Read more \" Ok dress but feels cheap and fit is off \" Read more 7 customers mention comfort, 7 positive, 0 negative 7 customers mention \"Comfort\" 7 positive 0 negative Customers find the dress comfortable. \" ...Such a nice quality dress for the price! It was so comfortable —I felt it was the closest thing to loungewear while looking dressed up and elevated!... \" Read more \" This dress is great. Very comfortable . Dressed it up with long necklace and heels but will be able to also wear with sneakers. \" Read more \" ...that, I liked the light fabric weight, fabric quality, and the comfort of the dress . \" Read more \" ... Very comfy . \" Read more 7 customers mention fabric quality, 6 positive, 1 negative 7 customers mention \"Fabric quality\" 6 positive 1 negative Customers like the fabric quality of the dress, with one mentioning that its fall is very friendly. \" The fabric is wonderful and it fits like a dream. \" Read more \" Too much 'black' for me and too frumpy on me. Fabric is great with a diffuse stubby pattern.... \" Read more \" ...Other than that, I liked the light fabric weight, fabric quality , and the comfort of the dress. \" Read more \" ...I am 5'5\", 125 pounds and the small fits perfectly! Good material , good quality! I will buy more! \" Read more 6 customers mention color, 5 positive, 1 negative 6 customers mention \"Color\" 5 positive 1 negative Customers like the navy color of the dress, with one describing it as vibrant. \" I tried this dress in two sizes because I loved the color and material , but the elastic in the waist did not hit my long waist in the right place... \" Read more \" The blue is a beautiful bright color . The fit is perfect. I wish it were lined, but I am considering getting another in a different color.... \" Read more \" I really liked the dress, the color and the design of it. It’s very pretty!... \" Read more \" ...I paid for it so I’m not just blowing smoke. The color is bright and vibrant. The fabric is light and flowy.... \" Read more 6 customers mention fabric weight, 5 positive, 1 negative 6 customers mention \"Fabric weight\" 5 positive 1 negative Customers appreciate the dress's fabric weight, describing it as light. \" This dress is nice, light and airy. It’s a little see through so I would highly recommend a slip. Easy pick for either a casual or dressy event.... \" Read more \" ...The color is bright and vibrant. The fabric is light and flowy.... \" Read more \" ...The material is not too heavy while still feeling high quality, the lining prevents transparency which means no slip is required and the way the... \" Read more \" ...Other than that, I liked the light fabric weight , fabric quality, and the comfort of the dress. \" Read more 23 customers mention fit, 14 positive, 9 negative 23 customers mention \"Fit\" 14 positive 9 negative Customers have mixed opinions about the dress's fit, with some finding it good and noting the length is right at the ankles, while others report that the sleeves are too long. \" Thank you, fits perfectly . Love it \" Read more \" Ok dress but feels cheap and fit is off \" Read more \" Loved this dress for fall family photos. 5'8\", 130 lbs - small fit perfect . Not too tight and not overly big. Length was right at ankles. \" Read more \" ...I am 5'5\", 125 pounds and the small fits perfectly ! Good material, good quality! I will buy more! \" Read more 6 customers mention flattering, 3 positive, 3 negative 6 customers mention \"Flattering\" 3 positive 3 negative Customers have mixed opinions about how flattering the dress is. \" ...With a full bust, finding a dress that is both flattering and comfortable can be a challenge. This one fit the bill in both categories!... \" Read more \" ...It was frumpy and not flattering . \" Read more \" I love the fit. Very flattering . \" Read more \" Cute dress but very prairie girl . If you tuck the flared wrists in and modernize with shoes and accessories it's better. \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Beautiful Dress, Beautiful Fit!",
        "body": "This is one of my favorite dresses. I love everything about it!! I paid for it so I’m not just blowing smoke. The color is bright and vibrant. The fabric is light and flowy. I love that the sleeves are loose and go to my wrists and the dress goes to my ankles. I personally love that it’s modest and covers my chest. It has a beautiful silhouette and flows when you walk. I’m 5’6”, 120 lbs. and got a size small. It fits perfectly! I wish they had a bigger selection of colors. I want to buy 5 more. It’s versatile and I can wear it year round in all seasons. I feel incredibly beautiful and confident in it and received several compliments. If you’re on the fence, BUY IT!! I guarantee you’ll love it. If not, you can always return it. Read more",
        "author": "Chantell Violet Putnam",
        "rating": 5.0,
        "date": "September 14, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71OhCcOM-8L._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/717vah0qbVL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars So comfortable and flattering",
        "body": "I was pleased with this dress for several reasons. With a full bust, finding a dress that is both flattering and comfortable can be a challenge. This one fit the bill in both categories! It looks very pretty and flattering on and the color (navy) is lovely. The material is not too heavy while still feeling high quality, the lining prevents transparency which means no slip is required and the way the fabric falls is very friendly for hiding any wrinkles from a long ride in the car to a wedding. Such a nice quality dress for the price! It was so comfortable—I felt it was the closest thing to loungewear while looking dressed up and elevated! It was a win! Read more",
        "author": "RM Mowrey",
        "rating": 5.0,
        "date": "December 13, 2024",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Lovely dresses",
        "body": "Bought this dress in the green and the blue and I love them both! I have received many compliments when wearing them to my office. I am 5'5\", 125 pounds and the small fits perfectly! Good material, good quality! I will buy more! Read more",
        "author": "Paula",
        "rating": 5.0,
        "date": "April 22, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/714KZOjt-EL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "4.0 out of 5 stars Cute design, not for long-waisted gals",
        "body": "I tried this dress in two sizes because I loved the color and material, but the elastic in the waist did not hit my long waist in the right place despite the size. Other than that, I liked the light fabric weight, fabric quality, and the comfort of the dress. Read more",
        "author": "DrSciChick",
        "rating": 4.0,
        "date": "January 12, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "1.0 out of 5 stars The fit is off.",
        "body": "The fit is great in the waste but the top is too loose and the sleeves are way too long and loose. Read more",
        "author": "Amanda J",
        "rating": 1.0,
        "date": "August 30, 2024",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Really nice fall dress…",
        "body": "I really liked the dress, the color and the design of it. It’s very pretty! I do wish I gotten a XL instead of the L just because it was a bit tight on my chest area. Read more",
        "author": "Jessi5P",
        "rating": 5.0,
        "date": "September 12, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71f+JGzyRPL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Great Dress",
        "body": "I am 5'5\" weighing around 175lbs. The dress was super comfortable and I wore it to a wedding. Read more",
        "author": "Deb E",
        "rating": 5.0,
        "date": "October 13, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/81AaXb0vK5L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars They are what they say they are.made very well for the money.",
        "body": "I was very pleased with them I have ordered 4 2 for gifts and 2 for me. Read more",
        "author": "RB",
        "rating": 5.0,
        "date": "December 1, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress V Neck Long Sleeve Maxi is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.",
  "about_this_item": "Womens Maxi Dress V Neck Long Sleeve Maxi is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.",
  "long_description": "Womens Maxi Dress V Neck Long Sleeve Maxi is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Dark Green, Navy, Blue, Black. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress V Neck Long Sleeve Maxi is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Dark Green, Navy, Blue, Black. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "95fc470c-ba58-461d-8a0f-0ee5fcc6f490",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/95fc470c-ba58-461d-8a0f-0ee5fcc6f490/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/95fc470c-ba58-461d-8a0f-0ee5fcc6f490/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/89da5ace-4ec8-473c-b918-b738bffd4323.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "01206ef7-6d9b-4f63-a81b-b8256490d4f7",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/01206ef7-6d9b-4f63-a81b-b8256490d4f7/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/01206ef7-6d9b-4f63-a81b-b8256490d4f7/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/89da5ace-4ec8-473c-b918-b738bffd4323.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "c0e311b5-4639-4240-a926-53ebf94faa4e",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c0e311b5-4639-4240-a926-53ebf94faa4e/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c0e311b5-4639-4240-a926-53ebf94faa4e/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/89da5ace-4ec8-473c-b918-b738bffd4323.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "188fc245-ecd1-47c0-8cec-dba3a4318872",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/188fc245-ecd1-47c0-8cec-dba3a4318872/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/188fc245-ecd1-47c0-8cec-dba3a4318872/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/89da5ace-4ec8-473c-b918-b738bffd4323.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "feb28a58-9625-4822-9ea5-9682162f6b80",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/feb28a58-9625-4822-9ea5-9682162f6b80/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/feb28a58-9625-4822-9ea5-9682162f6b80/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/89da5ace-4ec8-473c-b918-b738bffd4323.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "75535302-f175-488c-9435-238b3ad5ee8f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/75535302-f175-488c-9435-238b3ad5ee8f/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/75535302-f175-488c-9435-238b3ad5ee8f/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/89da5ace-4ec8-473c-b918-b738bffd4323.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "49772538-da21-45e9-af77-2d410ba1d381",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/49772538-da21-45e9-af77-2d410ba1d381/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/49772538-da21-45e9-af77-2d410ba1d381/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/89da5ace-4ec8-473c-b918-b738bffd4323.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "90ecff68-8bb1-4e59-bf38-47750a88b43f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/90ecff68-8bb1-4e59-bf38-47750a88b43f/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/90ecff68-8bb1-4e59-bf38-47750a88b43f/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/89da5ace-4ec8-473c-b918-b738bffd4323.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "9e43ccd8-0b06-47d4-a6ad-80f8984e9ade",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9e43ccd8-0b06-47d4-a6ad-80f8984e9ade/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9e43ccd8-0b06-47d4-a6ad-80f8984e9ade/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/89da5ace-4ec8-473c-b918-b738bffd4323.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "23d5c17e-0144-45a7-b38d-391452f2c89f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/23d5c17e-0144-45a7-b38d-391452f2c89f/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/23d5c17e-0144-45a7-b38d-391452f2c89f/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/89da5ace-4ec8-473c-b918-b738bffd4323.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "3151af98-bb73-479e-812a-6663be40e994",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3151af98-bb73-479e-812a-6663be40e994/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3151af98-bb73-479e-812a-6663be40e994/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/89da5ace-4ec8-473c-b918-b738bffd4323.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "2e9015be-e2d7-434c-9c50-c5d398d0598c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2e9015be-e2d7-434c-9c50-c5d398d0598c/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2e9015be-e2d7-434c-9c50-c5d398d0598c/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/89da5ace-4ec8-473c-b918-b738bffd4323.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Dark Green": "https://m.media-amazon.com/images/I/31EiXXMpjGL._AC_SR38,50_.jpg",
    "Navy": "https://m.media-amazon.com/images/I/310hjepmVgL._AC_SR38,50_.jpg",
    "Blue": "https://m.media-amazon.com/images/I/41R9lFV7wBL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31r82PCVgoL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Dark Green": "71H8vzIdaEL",
    "Navy": "716Rhy3XMjL",
    "Blue": "71NDMfNyLJL",
    "Black": "61Hj1doBr8L"
  },
  "color_images": {
    "Dark Green": [
      "https://m.media-amazon.com/images/I/71H8vzIdaEL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71gNpPGVV6L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71LtmdA+BpL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71I-fhoRVmL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71a-UFyEjXL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71fB6eEClcL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71uRcbAZ+GL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61vY5E8cqKL._SL1500_.jpg"
    ],
    "Navy": [
      "https://m.media-amazon.com/images/I/716Rhy3XMjL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/711WTEaj78L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71k+jnwDsNL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71cw5jAyMBL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71FQ20yrANL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71y-BGTRmaL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/713maZDeqCL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71p2Io8p96L._SL1500_.jpg"
    ],
    "Blue": [
      "https://m.media-amazon.com/images/I/71NDMfNyLJL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71tGPsO-ltL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71hoVY0U9QL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71l7qbnilnL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/718b1ajn7rL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71sboznyU4L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71qVGNlzECL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71WQsjQTlTL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/61Hj1doBr8L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61ucZ9A1KiL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71n91jyI+gL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71vo5M2od5L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71h7oslDC9L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61YsqsAx7PL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/7158+TX2s-L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61KT673UtZL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-maxi-long-sleeve",
      "title": "Womens Maxi Dress Maxi Long Sleeve",
      "price": 40.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/517cIUHuJpL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 43.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/6135E3haINL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal",
      "title": "Womens Maxi Dress Formal",
      "price": 129.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/81FHR80ISVL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 35.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71xNIsc8O6L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 198.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61bUWCdsYeL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 29.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51tbPF+1NZL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 99.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51MWKDRcToL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-off-shoulder-mermaid",
      "title": "Womens Dress Off Shoulder Mermaid",
      "price": 139.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Wedding Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/61n04CfaRtL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61udjSNVNzL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-long-sleeve-maxi",
      "title": "Womens Maxi Dress Formal Long Sleeve Maxi",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61jN5vRzVjL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-sleeveless",
      "title": "Womens Maxi Dress Sleeveless",
      "price": 249.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61m7gCfhJ4L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-one-shoulder-evening-formal",
      "title": "Womens Maxi Dress One Shoulder Evening Formal",
      "price": 75.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61TUbIeObXL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-sleeveless",
      "title": "Womens Dress Sleeveless",
      "price": 37.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51UJzutsULL._SL1500_.jpg"
      ]
    }
  ]
}