{
  "id": "womens-dress-boat-neck-sleeveless",
  "handle": "womens-dress-boat-neck-sleeveless",
  "sku": "JC3178",
  "asin": "B0D2RDJ9Z4",
  "title": "Womens Dress Boat Neck Sleeveless",
  "title_original": "YOXUA Women's Summer Sleeveless Boat Neck Mini Dress Slim Fit Party Club Teacher Casual Office Dresses",
  "brand": "Visit the YOXUA Store",
  "price": 19.79,
  "social_proof": {
    "bought_past_month": 1408,
    "text": "1408+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/518oJldZIfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51coKFecdJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/512xCKWu75L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51H0eos8B5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41A5qkNzDpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71MtAJ0UYnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51iLryXzAXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51dCf8WDHJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/512IVfSxUKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51SPCS7ZV4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51DJMZtlnVL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51fj0PI56mL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51nuxBL21NL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/511fKycuYsL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51uNIKMnU1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51yI4YQaNnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51riNexuKbL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/518oJldZIfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51coKFecdJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/512xCKWu75L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51H0eos8B5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41A5qkNzDpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71MtAJ0UYnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51iLryXzAXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51dCf8WDHJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/512IVfSxUKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51SPCS7ZV4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51DJMZtlnVL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51fj0PI56mL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51nuxBL21NL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/511fKycuYsL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51uNIKMnU1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51yI4YQaNnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51riNexuKbL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Date First Available ‏": "‎ April 26, 2024",
    "Manufacturer ‏": "‎ YOXUA",
    "ASIN ‏": "‎ B0DG5P19T4",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#4,004 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #5 in Women's Club & Night Out Dresses",
    "Customer Reviews": "4.1 4.1 out of 5 stars (655)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Red",
      "Rose Red",
      "Brown",
      "Wine Red",
      "Pink",
      "Blue",
      "Purple",
      "Yellow",
      "Fuchsia",
      "Royal Blue",
      "Black",
      "Green"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.1,
    "count": 655,
    "customers_say": "Customers find the dress adorable for date night, with a flattering design that hugs the body in all the right places. The dress receives positive feedback for its soft material, comfortable fit, and good quality, with one customer noting the second layer of fabric around the bust area. The material thickness receives mixed reviews, with some finding it medium while others describe it as thin. Select to learn more Style Fit Quality Soft material Comfort Flattering Material quality Material thickness 71 customers mention \"Style\" 67 positive 4 negative Customers find the dress cute and adorable for date night, with one customer noting it looks like an expensive dress in person. \"Bought and wore this dress for a birthday dinner for my mom. It was cute , form fitting (in all the right places), and breathable....\" Read more \" Super cute but not for larger chests, doesn’t have much support and pulls down the neckline. Material is great and quality is good though.\" Read more \"...This dress is very cute , but, it runs SMALL!!! The material is soft, more of a cotton than a rayon which I didn't expect but not bad....\" Read more \" So cute and flattering! I ordered a size medium and it fits perfect! I’m 5’2 135 lbs!...\" Read more 66 customers mention \"Fit\" 54 positive 12 negative Customers are satisfied with how the dress fits. \"Good material. Perfect fit . I am 5’5 athletic build. 140-145 lbs. normally size small. Purchased small. Nice little black dress.\" Read more \" Great fit , very comfortable, fabric quality is good. This dress is perfect for casual, daytime, party and travels well....\" Read more \"really love this black dress! It fits true to size and feels so comfortable. The material is soft and good quality it doesn’t feel cheap at all....\" Read more \"...It was cute, form fitting (in all the right places), and breathable. The material was soft.\" Read more 43 customers mention \"Quality\" 35 positive 8 negative Customers have mixed opinions about the dress's quality, with some finding it great and good in theory, while others describe it as awful. \"...Overall, great dress , size down if you want a more bodycon look, also if you want a shorter dress looks great folded on the bottom without it...\" Read more \"...The material is soft and good quality it doesn’t feel cheap at all. It’s simple but flattering. Definitely worth it!\" Read more \"...Other than that, for the price it is great quality and has held up well after being washed. Definitely getting in other colors!\" Read more \"This is a nice dress - true to size, not see through, it arrived as described....\" Read more 38 customers mention \"Soft material\" 38 positive 0 negative Customers find the dress's material super soft. \"...It’s soft , flattering and VERY forgiving. I’m not skinny but I’m not fat either. This made me look SNATCHED. My husband’s reaction said it all....\" Read more \"...It’s a soft material with the right amount of stretch. The length is just right. It’s not see through, which is what I was worried about....\" Read more \"...I got the small in brown. The material is soft , but very thin. It was longer than I thought it was going to be. I will be keeping it.\" Read more \" So soft and stretchy I wish I had more places to wear it. It was thick material without being hot and totally worth the money....\" Read more 37 customers mention \"Comfort\" 36 positive 1 negative Customers find the dress comfortable, with one mentioning it is very forgiving. \"...I absolutely love it! It's comfortable and breathable. It is a mini dress, so if you have any curves to your hip or butt, it will feel short....\" Read more \"super cute and comfy , fits well, I bought the yellow and the color in the pics is a bit misleading....\" Read more \"... Very comfortable , soft material and light weight, not see through whatsoever, it’s casual but also perfect for any event....\" Read more \"...The material is thin; but great quality, super comfy & not see through! Not too short and doesn’t ride up which is a plus!...\" Read more 35 customers mention \"Flattering\" 31 positive 4 negative Customers find the dress flattering, noting that it hugs their curves and hits about mid-thigh. \"...It’s soft, flattering and VERY forgiving. I’m not skinny but I’m not fat either. This made me look SNATCHED. My husband’s reaction said it all....\" Read more \"wore it to a football game and it was so flattering . The material was thick, and has a built double layer on the bra....\" Read more \"I am 5'2 and 137lbs. I ordered a small, the fit is great and it's very flattering . The material is thick so it holds everything in....\" Read more \"Perfect fit and super flattering .\" Read more 35 customers mention \"Material quality\" 31 positive 4 negative Customers appreciate the dress's material quality, noting it is thicker and has a second layer, with one customer mentioning it's not see-through. \" Great material just ran smaller in length and with then I would like\" Read more \"Fits as expected. Really cute dress, nice material \" Read more \"... Material is great and quality is good though.\" Read more \"So good for the price not see through, flattering, very forgiving fabric would definitely recommend to anyone.\" Read more 43 customers mention \"Material thickness\" 23 positive 20 negative Customers have mixed opinions about the dress's material thickness, with some finding it medium while others describe it as thin. \"...I ordered a small, the fit is great and it's very flattering. The material is thick so it holds everything in. It would be easy to dress down or up.\" Read more \"...The only problem is that it’s thin so very very see through. The bra area is the only area that has a double layer and not see through....\" Read more \"Really soft super flattering, thin material but has extra material around the bust. I got black so it didn’t like see through at all....\" Read more \"Very nice, but will show every little line and fold. Very thin . But fit nice.\" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Beautiful dress!",
        "body": "really love this black dress! It fits true to size and feels so comfortable. The material is soft and good quality it doesn’t feel cheap at all. It’s simple but flattering. Definitely worth it! Read more",
        "author": "Yessi",
        "rating": 5.0,
        "date": "November 10, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Elegant and Flattering",
        "body": "This dress is beautiful! I was very surprised by the quality—the material is thick and does not feel cheap at all. There’s also a second layer of fabric in the chest section that I appreciate. Very happy with it! Read more",
        "author": "Amy M",
        "rating": 5.0,
        "date": "November 22, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Stretchy and Comfortable",
        "body": "I ordered a medium and it fit pretty well. Definitely showed off the curves It is a stretchy material which is nice. Very comfortable. Not see through. There is extra lining in the bust area. The one thing I didnt like was the breast cleavage on the side. Too much side cleavage for my liking. And I'm a B cup. Couldn't wear a bra so I used breast pads. Over all its a fun classy dress. Read more",
        "author": "ChaylaT.",
        "rating": 4.0,
        "date": "July 26, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61xUjSo4dsL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Great!",
        "body": "It’s a cotton like soft material. It isn’t too dressy due to the material but it’s cute. Fits snug but is comfortable. Read more",
        "author": "Colette",
        "rating": 5.0,
        "date": "November 26, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars SHORT.",
        "body": "Cute but VERY SHORT. I am 5'7. Read more",
        "author": "Chelsey",
        "rating": 3.0,
        "date": "November 29, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Standard little black dress! Can’t go wrong",
        "body": "Wore this with some lacy tights and some solid closed toe black shoes and I added a belt! Was absolutely perfect for the occasion. Thick material, fits very well, not sheer and it has a lot of stretch. It didn’t ride up which I also really appreciated. I’m 150lbs, 5’1 and I got a medium. Read more",
        "author": "Tonianne quillen",
        "rating": 5.0,
        "date": "November 19, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/51u8BhMB3GL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Perfect and simple, comfortable dress for any event",
        "body": "I love this dress. I bought a pink one for a special event and originally got a medium as Amazon recommended that for me. I’m usually in between a small and a medium depending on brand sizing. I’m 121 lbs and 5’3. I bought the brown dress in a size small for another event and this one was way better in my opinion. It fit better and was perfect. The medium was a tad too big especially in the neck area. It hung a bit so I’d have to pull it back (still wasn’t a bad looking though) But the small was literally perfect and hugged me in all the right places! Very comfortable, soft material and light weight, not see through whatsoever, it’s casual but also perfect for any event. I wore the pink for a piano recital and will be wearing the brown for a western themed Father’s Day lol! Worth the price. Read more",
        "author": "Ava Coronado",
        "rating": 5.0,
        "date": "June 14, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Nice but thin",
        "body": "Very nice, but will show every little line and fold. Very thin. But fit nice. Read more",
        "author": "Tia",
        "rating": 4.0,
        "date": "December 6, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/81ErLC59J-L._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/61uPFwGA6EL._SY88._SL1500_.jpg"
        ]
      }
    ]
  },
  "short_description": "Womens Dress Boat Neck Sleeveless is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.",
  "about_this_item": "Womens Dress Boat Neck Sleeveless is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.",
  "long_description": "Womens Dress Boat Neck Sleeveless is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Red, Rose Red, Brown, Wine Red, Pink, Blue, Purple, Yellow, Fuchsia, Royal Blue, Black, Green. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Dress Boat Neck Sleeveless is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Red, Rose Red, Brown, Wine Red, Pink, Blue, Purple, Yellow, Fuchsia, Royal Blue, Black, Green. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "3c5f769d-48aa-4574-bb1e-4e15991a1c1b",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3c5f769d-48aa-4574-bb1e-4e15991a1c1b/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3c5f769d-48aa-4574-bb1e-4e15991a1c1b/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/71122b54-3e2d-4401-aee3-6f673837db20.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "b3da3510-bb6a-48ed-b994-a1be85a7ccd5",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b3da3510-bb6a-48ed-b994-a1be85a7ccd5/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b3da3510-bb6a-48ed-b994-a1be85a7ccd5/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/71122b54-3e2d-4401-aee3-6f673837db20.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "1465992f-063f-488d-92e3-70b77ca586be",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1465992f-063f-488d-92e3-70b77ca586be/embedded.cc.default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1465992f-063f-488d-92e3-70b77ca586be/embedded.cc.default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/71122b54-3e2d-4401-aee3-6f673837db20.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "cd8ee0f6-5d56-4bfb-a56a-6a11c112f042",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/cd8ee0f6-5d56-4bfb-a56a-6a11c112f042/embedded.cc.default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/cd8ee0f6-5d56-4bfb-a56a-6a11c112f042/embedded.cc.default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/71122b54-3e2d-4401-aee3-6f673837db20.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "9b29397e-466a-4a66-a2ac-df6ae1fc6b2f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9b29397e-466a-4a66-a2ac-df6ae1fc6b2f/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9b29397e-466a-4a66-a2ac-df6ae1fc6b2f/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/71122b54-3e2d-4401-aee3-6f673837db20.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "c61a5e31-7e6a-447e-90b1-a43b76155b2c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c61a5e31-7e6a-447e-90b1-a43b76155b2c/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c61a5e31-7e6a-447e-90b1-a43b76155b2c/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/71122b54-3e2d-4401-aee3-6f673837db20.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "18354954-34f3-47d7-9cf4-895cfe5ebeae",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/18354954-34f3-47d7-9cf4-895cfe5ebeae/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/18354954-34f3-47d7-9cf4-895cfe5ebeae/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/71122b54-3e2d-4401-aee3-6f673837db20.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "354daaf3-7952-4e8f-866b-c2db41b87995",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/354daaf3-7952-4e8f-866b-c2db41b87995/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/354daaf3-7952-4e8f-866b-c2db41b87995/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/71122b54-3e2d-4401-aee3-6f673837db20.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Red": "https://m.media-amazon.com/images/I/31B8BSPcLZL._AC_SR38,50_.jpg",
    "Rose Red": "https://m.media-amazon.com/images/I/31LFz4VRNfL._AC_SR38,50_.jpg",
    "Brown": "https://m.media-amazon.com/images/I/31ReKe28SgL._AC_SR38,50_.jpg",
    "Wine Red": "https://m.media-amazon.com/images/I/31I7ulItSZL._AC_SR38,50_.jpg",
    "Pink": "https://m.media-amazon.com/images/I/31WBwxjThlL._AC_SR38,50_.jpg",
    "Blue": "https://m.media-amazon.com/images/I/31xylFUCk8L._AC_SR38,50_.jpg",
    "Purple": "https://m.media-amazon.com/images/I/31DfU4jbCcL._AC_SR38,50_.jpg",
    "Yellow": "https://m.media-amazon.com/images/I/31AS3ZyMmxL._AC_SR38,50_.jpg",
    "Fuchsia": "https://m.media-amazon.com/images/I/317jadIZFrL._AC_SR38,50_.jpg",
    "Royal Blue": "https://m.media-amazon.com/images/I/31hZMFkc1BL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31pu1i025gL._AC_SR38,50_.jpg",
    "Green": "https://m.media-amazon.com/images/I/31dOP3YJWZL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Red": "51iLryXzAXL",
    "Rose Red": "51dCf8WDHJL",
    "Brown": "512IVfSxUKL",
    "Wine Red": "51SPCS7ZV4L",
    "Pink": "51DJMZtlnVL",
    "Blue": "51fj0PI56mL",
    "Purple": "51nuxBL21NL",
    "Yellow": "511fKycuYsL",
    "Fuchsia": "51uNIKMnU1L",
    "Royal Blue": "51yI4YQaNnL",
    "Black": "518oJldZIfL",
    "Green": "51riNexuKbL"
  },
  "color_images": {
    "Red": [
      "https://m.media-amazon.com/images/I/51iLryXzAXL._SL1500_.jpg"
    ],
    "Rose Red": [
      "https://m.media-amazon.com/images/I/51dCf8WDHJL._SL1500_.jpg"
    ],
    "Brown": [
      "https://m.media-amazon.com/images/I/512IVfSxUKL._SL1500_.jpg"
    ],
    "Wine Red": [
      "https://m.media-amazon.com/images/I/51SPCS7ZV4L._SL1500_.jpg"
    ],
    "Pink": [
      "https://m.media-amazon.com/images/I/51DJMZtlnVL._SL1500_.jpg"
    ],
    "Blue": [
      "https://m.media-amazon.com/images/I/51fj0PI56mL._SL1500_.jpg"
    ],
    "Purple": [
      "https://m.media-amazon.com/images/I/51nuxBL21NL._SL1500_.jpg"
    ],
    "Yellow": [
      "https://m.media-amazon.com/images/I/511fKycuYsL._SL1500_.jpg"
    ],
    "Fuchsia": [
      "https://m.media-amazon.com/images/I/51uNIKMnU1L._SL1500_.jpg"
    ],
    "Royal Blue": [
      "https://m.media-amazon.com/images/I/51yI4YQaNnL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/518oJldZIfL._SL1500_.jpg"
    ],
    "Green": [
      "https://m.media-amazon.com/images/I/51riNexuKbL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-maxi",
      "title": "Womens Maxi Dress Maxi",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51UHxm81Z1L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-maxi-evening-short-sleeve",
      "title": "Womens Maxi Dress Formal Maxi Evening Short Sleeve",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/510UzQ4LvcL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-maxi-long-sleeve",
      "title": "Womens Maxi Dress Bodycon Maxi Long Sleeve",
      "price": 44.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51HPiBldymL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 43.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Work",
      "images": [
        "https://m.media-amazon.com/images/I/81JXmyg5QfL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-bodycon-long-sleeve",
      "title": "Womens Maxi Dress Maxi Bodycon Long Sleeve",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51xY-nVpN9L._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-evening-bodycon-sleeveless-off-shoulder-formal",
      "title": "Womens Maxi Dress Evening Bodycon Sleeveless Off Shoulder Formal",
      "price": 53.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/511YfTNHu2L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-v-neck-formal-maxi",
      "title": "Womens Maxi Dress V Neck Formal Maxi",
      "price": 69.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61BV9sj9nfL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-formal-v-neck",
      "title": "Womens Maxi Dress Evening Formal V Neck",
      "price": 75.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61Um2dDx+TL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-formal",
      "title": "Womens Maxi Dress Evening Formal",
      "price": 75.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51eYbQ+APcL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi",
      "title": "Womens Maxi Dress Maxi",
      "price": 62.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71zVhaS89ZL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-long-sleeve-bodycon",
      "title": "Womens Maxi Dress Maxi Long Sleeve Bodycon",
      "price": 56.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/516d0Hmj+YL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 429.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/618XXIGqBXL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 76.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/519NIxJvOuL._SL1500_.jpg"
      ]
    }
  ]
}