{
  "id": "womens-dress",
  "handle": "womens-dress",
  "sku": "JC1320",
  "asin": "B0D39TGZBP",
  "title": "Womens Dress",
  "title_original": "chouyatou Women Summer Ruffle Hem Floral Lace Eyelet Dress Casual Notch Neck Midi Tunic Dress with Pocket",
  "brand": "Visit the chouyatou Store",
  "price": 36.99,
  "social_proof": {
    "bought_past_month": 67,
    "text": "67+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/610h42KQ0kL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71BQl5Ch0LL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61iqJD4os3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61didgpF-uL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61iN5DNHtzL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/610QoMKYwtL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61TsylCrlqL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/610h42KQ0kL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71BQl5Ch0LL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61iqJD4os3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61didgpF-uL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61iN5DNHtzL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/610QoMKYwtL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61TsylCrlqL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Product Dimensions ‏": "‎ 5 x 5 x 1 inches; 1 Pounds",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ May 4, 2024",
    "ASIN ‏": "‎ B0D3B6L84F",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#58,742 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #679 in Women's Casual Dresses",
    "Customer Reviews": "4.3 4.3 out of 5 stars (1,085)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Pink",
      "White",
      "Blue",
      "Apricot",
      "Navy Blue"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.3,
    "count": 1085,
    "customers_say": "Customers love this dress's style, with one noting its feminine eyelet design, and appreciate its true-to-size fit and excellent quality. The fabric receives positive feedback for its wonderful eyelet material and cotton composition, while the full lining provides modest coverage. Customers find it comfortable, with one mentioning there's no itching or tugging, and appreciate its versatility for both casual and dressy occasions. Generated from the text of customer reviews Select to learn more Style (152) Fit (139) Quality (122) Comfort (62) Fabric quality (59) Lining (45) Summer dress (40) Pockets (25) 152 customers mention style, 138 positive, 14 negative 152 customers mention \"Style\" 138 positive 14 negative Customers appreciate the dress's style, describing it as pretty, charming, and feminine, with one customer noting its modern design. \" Beautiful dress ! 130/ 5’3” Medium. Perfect fit. Well made. Drip dry and ready to wear! I wish it came in more colors….I’d buy them all!!!! \" Read more \" Love this dress.simple, beautiful and can pair with any casual slider or shoes.perfect with belt regardless of the pocket .length could have been... \" Read more \" Cute but a little tight around the bust and upper arms. I didn't want to size up becuase I would be to much material on the lower end of the dress \" Read more \" This dress is very pretty —the lace eyelet detail and ruffle hem give it a nice, feminine look, and it’s comfortable to wear.... \" Read more 139 customers mention fit, 103 positive, 36 negative 139 customers mention \"Fit\" 103 positive 36 negative Customers find that the dress fits true to size and looks as described, though some mention it is very loose. \" ...But it was worth it! Nicely made ( it’s even lined!), nice fabric, true to size , good rich dark blue color.—I’m very leased with the dress and ca... \" Read more \" Beautiful dress! 130/ 5’3” Medium. Perfect fit . Well made. Drip dry and ready to wear! I wish it came in more colors….I’d buy them all!!!! \" Read more \" Runs large … recommend ordering a size possibly two smaller depending on your chest dimensions if your chesty go down one size if you’re not go down... \" Read more \" ... Fits true to size . Nice light weight lining so it is not see thru but still remain cool while wearing. I would buy it again \" Read more 122 customers mention quality, 117 positive, 5 negative 122 customers mention \"Quality\" 117 positive 5 negative Customers find the dress well-made and of excellent quality, with one customer specifically noting the good stitching. \" Beautiful dress! 130/ 5’3” Medium. Perfect fit. Well made . Drip dry and ready to wear! I wish it came in more colors….I’d buy them all!!!! \" Read more \" Great dress . Fit great. Summer must have. \" Read more \" Beautiful dress and great quality . Had so many compliments. I ordered a medium and fits very well.... \" Read more \" Love this dress . It took a while to receive it, but so worth the wait.... \" Read more 62 customers mention comfort, 61 positive, 1 negative 62 customers mention \"Comfort\" 61 positive 1 negative Customers find the dress comfortable, with one mentioning there is no itching or tugging. \" ...The eyelet material is gorgeous and comfortable . It is lined so no need for a slip. It's very flattering. It looks just like the picture. \" Read more \" ...The style is Very flattering and it’s very comfortable . The size is perfect. I will order from this company again. Thanku \" Read more \" ...i do wish it was just a little lower cut at the neck but flattering, comfy ! Perfect summer dress! \" Read more \" ...It's comfortable to wear , dress it up or just be casual. Either way it's a great go to dress. \" Read more 59 customers mention fabric quality, 52 positive, 7 negative 59 customers mention \"Fabric quality\" 52 positive 7 negative Customers appreciate the fabric of the dress, describing it as high-quality cotton that is very soft and suitable for summer wear. \" ...But it was worth it! Nicely made ( it’s even lined!), nice fabric , true to size, good rich dark blue color.—I’m very leased with the dress and ca... \" Read more \" ...I'm 5'2\" and it's the perfect length between Tea and Maxi dress. Soft and has nice pockets!! And fabric doesn't look cheap.... \" Read more \" This dress was a perfect fit. The fabric is cotton and does not need ironing. I plan to wear it to many events this summer. \" Read more \" Love this dress! Forgiving and flattering, comfortable, and 100% cotton . True to size. \" Read more 45 customers mention lining, 40 positive, 5 negative 45 customers mention \"Lining\" 40 positive 5 negative Customers appreciate the dress's lining, which is not see-through and provides good modesty. \" Surprisingly great quality fabric. Lined . Very stylish. I ordered white. My friend ordered apricot, which was more cream/tan. Gorgeous color \" Read more \" I love this dress. I have had a ton of compliments. It is fully lined , flows delicately and the M fit perfect. I normally wear a size 8.... \" Read more \" The fabric was very nice. Not see thru and had body to it…but it was HUGE on me. I’m 5’7” 133lbs and it literally was so wide with no shape at all.... \" Read more \" Lovely - excellent quality, with a soft sheer interior. Not see-through . Nice pockets. It fit bigger than expected.... \" Read more 40 customers mention summer dress, 40 positive, 0 negative 40 customers mention \"Summer dress\" 40 positive 0 negative Customers find this dress suitable for summer, appreciating that it can be dressed up or worn casually. One customer mentions it was perfect for a 50th anniversary party, while another notes it's great for various occasions. \" ...It's a perfect summer dress great for pretty much any occasion. The eyelet material is gorgeous and comfortable. It is lined so no need for a slip.... \" Read more \" ...Bought this in a large and it fits perfectly. Such a great summer dress . I fly a lot and it’s perfect for traveling. \" Read more \" Nice summer dress ... \" Read more \" Great dress for summer . Very flattering A line style. Fabric is cotton and it's lined size M \" Read more 25 customers mention pockets, 24 positive, 1 negative 25 customers mention \"Pockets\" 24 positive 1 negative Customers like the dress's pockets, with one mentioning they work well with a belt. \" ...another one to keep for when I travel; has a flattering drape, love the pockets ; I could go down a size, as it’s quite ample.... \" Read more \" Full length. Lined, no loose threads on eyelett, POCKETS ! Becoming neckline, will hand wash to avoid damage to eyelett embrodery. \" Read more \" ...It’s lightweight, loose and flowy, but still so flattering on. And it has pockets - I love it!! \" Read more \" ...Soft and has nice pockets !! And fabric doesn't look cheap. One I got, stitching is good. \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Very pretty!",
        "body": "Well worth the wait for this dress. Navy is a deep, true color, and the fit is flattering. The dress is lined to the top of the bottom flounce. Nicely made, comfortable to wear. Read more",
        "author": "GranmaC",
        "rating": 5.0,
        "date": "October 23, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Winner winner for a summer dress. Must have",
        "body": "Love love this summer dress. Fits so beautifully. I am 5.4” and weigh 140 lbs. it fits loose but so charming on. Love the lining and the pockets Wore it first to a Fourth of July party with red and navy jewlery and beaded shoes. I had three ladies I did not know compliment me in the dress and ask where I got it Wore it a second time at luncheon in a tea room used tourquiose jewelry this time. Had total strangers compliment me on this dress. This never happens !!!! Love the fabric weight covers the top part of the upper arms Great fabric does not wrinkle. Plus I was cool in it outside by a pool. Read more",
        "author": "Sherry",
        "rating": 5.0,
        "date": "July 19, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Just okay",
        "body": "This dress is very pretty—the lace eyelet detail and ruffle hem give it a nice, feminine look, and it’s comfortable to wear. The fit is flattering, but the quality doesn’t quite match the higher price tag. After the first wash, it came out completely wrinkled and very hard to smooth out, which makes it less practical for everyday wear. Overall, nice design but too expensive for what it is and disappointing in durability. Read more",
        "author": "Customer",
        "rating": 4.0,
        "date": "October 2, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Love this dress!",
        "body": "The only way it could be any better is if the sleeves were fully lined too and if it had a round neckline with no \"V\" cutout. Otherwise, everything is great—quality, look, fit, feel, weight, comfort, color, and design! Love that the dress lining extends to the top of the bottom ruffle and that it has two hidden pockets! Read more",
        "author": "JN",
        "rating": 5.0,
        "date": "August 26, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Summer classic with compliments wherever I go!",
        "body": "What can I say about this cute dress you can put it on to go to the grocery store you can put it on to go to church. You can put it on to go visit a friend in the hospital. It is the absolutely most perfect summer dress if I wore it once I wore it 25 times this summer I washed it dried it in the dryer many times and I have to tell you it comes out looking brand new each time. Eyelet is one of those fabrics that never go out of date and always look fresh as a daisy. I love this dress and I bought it in black as well. They are my go to when I just have to pull one out quick and go where I need to go. I would give this a 20 if I could I’m 73 years old and it makes me look young, but it looks appropriate for me. I get compliments everywhere I go. I match it with gladiator sandals. I match it with cute flats. I match it with these really fun Amazon shoes that have flower pattern all over them. They come in all colors. I wear the black and I wear the white with these things sometimes I wear yellow shoes and I match it with a yellow cardigan. These dresses are amazing. Read more",
        "author": "Susan",
        "rating": 5.0,
        "date": "September 19, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Great Dress",
        "body": "I ordered the tan dress, size M. I'm 5'2'' and 130 lbs, 34C. This dress was well made, nice cotton material, and lined. I did cut the lining off to my knees for a cooler feel. The fit is very flattering. Machine washed and let the dress hanged to dry. Read more",
        "author": "Lenna",
        "rating": 5.0,
        "date": "October 17, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars So light and airy! Hides all figure flaws",
        "body": "I love this dress! IT's so light and airy. The underslip is perfect for full coverage except on the shoulders and upper arms. But I usually wear a full slip under it anyway. I wear it to work. The eyelet work is beautiful and it washes well...no shrinkage. which surprised me! as it's cotton. I love the drape of the fabric and the way it hides all my figure imperfections... I'm 5'7\" 220 lbs and I bought an XL as the XXL was too large on top and I returned it to get the XL. My bra size is 42C. Read more",
        "author": "TM",
        "rating": 5.0,
        "date": "October 17, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Must have professional dress",
        "body": "Beautiful so comfortable true to size. The color is the same as pictured. It has a built in slip so you cannot see through it. Therefore it will be an awesome spring and fall dress. Read more",
        "author": "Star",
        "rating": 5.0,
        "date": "October 24, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Dress is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.",
  "about_this_item": "Womens Dress is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.",
  "long_description": "Womens Dress is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Pink, White, Blue, Apricot, Navy Blue. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Dress is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Pink, White, Blue, Apricot, Navy Blue. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "90767fe4-8549-482c-ae38-809399fb3c62",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/90767fe4-8549-482c-ae38-809399fb3c62/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/90767fe4-8549-482c-ae38-809399fb3c62/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "e103cee8-55bd-42c2-a416-72d6046945b5",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e103cee8-55bd-42c2-a416-72d6046945b5/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e103cee8-55bd-42c2-a416-72d6046945b5/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "da0bd8e8-28cc-49e2-af40-c64320dddad7",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/da0bd8e8-28cc-49e2-af40-c64320dddad7/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/da0bd8e8-28cc-49e2-af40-c64320dddad7/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "2af6049a-dcd6-47c9-be75-1e5724862f6b",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2af6049a-dcd6-47c9-be75-1e5724862f6b/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2af6049a-dcd6-47c9-be75-1e5724862f6b/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "c1911b74-acd5-4f18-b05a-9a08a6a4a1b8",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c1911b74-acd5-4f18-b05a-9a08a6a4a1b8/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c1911b74-acd5-4f18-b05a-9a08a6a4a1b8/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "5566c948-311d-476a-9261-9b1a5e221ee8",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5566c948-311d-476a-9261-9b1a5e221ee8/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5566c948-311d-476a-9261-9b1a5e221ee8/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Pink": "https://m.media-amazon.com/images/I/412FwBxAQSL._AC_SR38,50_.jpg",
    "White": "https://m.media-amazon.com/images/I/413XFlMibFL._AC_SR38,50_.jpg",
    "Blue": "https://m.media-amazon.com/images/I/41b154bJqCL._AC_SR38,50_.jpg",
    "Apricot": "https://m.media-amazon.com/images/I/411BJf8ZnvL._AC_SR38,50_.jpg",
    "Navy Blue": "https://m.media-amazon.com/images/I/41OiH6U+UCL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Pink": "61didgpF-uL",
    "White": "610h42KQ0kL",
    "Blue": "61iN5DNHtzL",
    "Apricot": "610QoMKYwtL",
    "Navy Blue": "61TsylCrlqL"
  },
  "color_images": {
    "Pink": [
      "https://m.media-amazon.com/images/I/61didgpF-uL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61iqJD4os3L._SL1500_.jpg"
    ],
    "White": [
      "https://m.media-amazon.com/images/I/610h42KQ0kL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71BQl5Ch0LL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61iqJD4os3L._SL1500_.jpg"
    ],
    "Blue": [
      "https://m.media-amazon.com/images/I/61iN5DNHtzL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61iqJD4os3L._SL1500_.jpg"
    ],
    "Apricot": [
      "https://m.media-amazon.com/images/I/610QoMKYwtL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61iqJD4os3L._SL1500_.jpg"
    ],
    "Navy Blue": [
      "https://m.media-amazon.com/images/I/61TsylCrlqL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61iqJD4os3L._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-sleeveless-maxi",
      "title": "Womens Maxi Dress Sleeveless Maxi",
      "price": 48.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71qwUjryGiL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 43.69,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61-pFN+nfgL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-bodycon",
      "title": "Womens Maxi Dress Maxi Bodycon",
      "price": 36.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61o6MKJoZLL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-one-shoulder-formal-mermaid-bodycon-evening-maxi",
      "title": "Womens Maxi Dress One Shoulder Formal Mermaid Bodycon Evening Maxi",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71mgUBuGwhL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-v-neck-short-sleeve",
      "title": "Womens Dress V Neck Short Sleeve",
      "price": 34.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71T+iJeFITL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress-cocktail-ruched-evening-split",
      "title": "Womens Dress Cocktail Ruched Evening Split",
      "price": 29.69,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/61003bnFhAS._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-maxi",
      "title": "Womens Maxi Dress Formal Maxi",
      "price": 64.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/61RWPo72AmL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-mermaid-one-shoulder",
      "title": "Womens Maxi Dress Mermaid One Shoulder",
      "price": 238.74,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51lR3NNtXCL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-maxi-formal-long-sleeve-v-neck",
      "title": "Womens Maxi Dress Cocktail Maxi Formal Long Sleeve V Neck",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61cfJoIR5bL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-bodycon-ruched",
      "title": "Womens Maxi Dress Cocktail Bodycon Ruched",
      "price": 49.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51+rVhgLHSL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-formal",
      "title": "Womens Dress Formal",
      "price": 75.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51TVxkZ3J2L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening",
      "title": "Womens Maxi Dress Formal Evening",
      "price": 64.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/516ScMrYzlL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-ruched-bodycon-v-neck",
      "title": "Womens Maxi Dress Long Sleeve Ruched Bodycon V Neck",
      "price": 33.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51AvldIvTmL._SL1500_.jpg"
      ]
    }
  ]
}