{
  "id": "womens-maxi-dress-long-sleeve",
  "handle": "womens-maxi-dress-long-sleeve",
  "sku": "JC2307",
  "asin": "B0D315FFXZ",
  "title": "Womens Maxi Dress Long Sleeve",
  "title_original": "PRETTYGARDEN Women's Fall Spring Midi Dress Long Sleeve Floral Smocked Elegant Wedding Guest Long Flowy Dresses with Pockets",
  "brand": "Visit the PRETTYGARDEN Store",
  "price": 62.49,
  "social_proof": {
    "bought_past_month": 534,
    "text": "534+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/71Qz-wZTPSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81uV7Y6G9VL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81NcTCrixRL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81QNXF62pHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81yjbPdZdWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/818d9UkJBFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81fTvHV7RmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81k4IC-Az+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71qYWRvu-zL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71SHGO2-64L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71v7b6kKJzL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71HLQyQ8lyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71pBMurAEjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ZNBz5MROL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71T7fTPjjwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71KOc8sbFeL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ycCet6PML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71vxrGshIDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71J0hGm4qxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71URPhNNhJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71x88rtCZfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71HmtLxwe6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71qconCV2rL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/71Qz-wZTPSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81uV7Y6G9VL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81NcTCrixRL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81QNXF62pHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81yjbPdZdWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/818d9UkJBFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81fTvHV7RmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81k4IC-Az+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71qYWRvu-zL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71SHGO2-64L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71v7b6kKJzL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71HLQyQ8lyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71pBMurAEjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ZNBz5MROL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71T7fTPjjwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71KOc8sbFeL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ycCet6PML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71vxrGshIDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71J0hGm4qxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71URPhNNhJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71x88rtCZfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71HmtLxwe6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71qconCV2rL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Package Dimensions ‏": "‎ 8 x 5 x 2 inches; 4.8 ounces",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ July 13, 2024",
    "ASIN ‏": "‎ B0D31BZWLJ",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#36,936 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #259 in Women's Formal Dresses #322 in Women's Casual Dresses",
    "Customer Reviews": "4.3 4.3 out of 5 stars (804)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Bean Paste Red",
      "Malachite Green",
      "Blue",
      "Grey Blue",
      "Army Green",
      "Black",
      "Dark Green",
      "Light Blue",
      "Red",
      "Wine Red",
      "Pink",
      "Beige",
      "Purple",
      "Royal Blue",
      "Dark Blue",
      "Dark Purple"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.3,
    "count": 804,
    "customers_say": "Customers find the dress visually appealing, with one noting its slight shimmer, and appreciate its fit, with one mentioning it hits right around the ankles. The fabric receives positive feedback for being light and beautiful with flower accents, and customers like its color, comfort, and versatility for both weddings and church events. The length receives mixed reviews - while some find the hem and sleeves perfect, others report the sleeves being 2 inches too short. Generated from the text of customer reviews Select to learn more Looks (99) Fit (66) Quality (46) Fabric material (42) Color (37) Comfort (36) Versatility (20) Length (23) 99 customers mention looks, 93 positive, 6 negative 99 customers mention \"Looks\" 93 positive 6 negative Customers find the dress very pretty, with one mentioning it has a slight shimmer and is suitable for evening events. \" I received many compliments wearing this beautiful dress to my workplace annual Christmas party. The fit, style and price were a win win for me. \" Read more \" I thought this dress was beautiful . I loved the color, style, and fabric. Great price. But unfortunately, it’s so high waisted I can’t wear it.... \" Read more \" So pretty and flattering. Love the rich color and fit. The smocking up top was perfect for my larger chest. It washes well. \" Read more \" ...This dial is very cute and it's a perfect length and it's very pretty .... \" Read more 66 customers mention fit, 53 positive, 13 negative 66 customers mention \"Fit\" 53 positive 13 negative Customers like how the dress fits, with one mentioning it hits right around the ankles. \" ...I bought my regular size, and it fits well . In contrast to another reviewer, I believe that this dress would look good on women of all sizes.... \" Read more \" Simply love this dress it fits true to size with out hugging my body for a good classy look. Would buy in other colors \" Read more \" Inexpensive but looks great. Fits perfectly and is comfortable. Color was as shown and it will travel well. \" Read more \" ...I’m wearing it to a couple of holiday events, plus church. XL fit perfectly . I’m 5’5” and 180-185 lbs \" Read more 46 customers mention quality, 44 positive, 2 negative 46 customers mention \"Quality\" 44 positive 2 negative Customers find the dress to be well-made and nice, with one customer specifically noting that the quality and pockets make it perfect for a wedding guest dress. \" ...A nice dress , but if you're buying it, opt for a larger size than you normally wear. I will not wear it again. Such a waste. \" Read more \" The dress is beautiful, well made and I feel dressed up in it. I’m wearing it to a couple of holiday events, plus church. XL fit perfectly.... \" Read more \" This dress came in fast and was great quality considering the price point! I’m very happy and will probably order more in different colors! \" Read more \" Great dress …loved everything about it! \" Read more 42 customers mention fabric material, 32 positive, 10 negative 42 customers mention \"Fabric material\" 32 positive 10 negative Customers like the fabric of the dress, describing it as nice, light, and beautiful with flower accents, with one customer noting it's particularly suitable for fall and winter. \" Absolutely love this dress! The fabric is gorgeous and it has pockets! Looks more expensive than it was. Very comfy.... \" Read more \" Nice colors r, pretty material but the Sean down the very center of the front of the dress is distracting.... \" Read more \" I thought this dress was beautiful. I loved the color, style, and fabric . Great price. But unfortunately, it’s so high waisted I can’t wear it.... \" Read more \" Great pattern but 100% polyester (or feels and acts like it). Static issue, non wearable. Had to return it. \" Read more 37 customers mention color, 35 positive, 2 negative 37 customers mention \"Color\" 35 positive 2 negative Customers like the dress's color, describing it as lovely, with individual reviews mentioning wine red, deep green, and silver shades. \" ...Wore this for our Christmas card photoshoot. Great material and color . Stretchy top (Not nursing friendly). Beautiful for the price!... \" Read more \" Beautiful color and fit. So comfortable. I had many compliments on my new dress Loved the pockets. It future to size \" Read more \" First off, I love the color . Second, I am always happy when the size on a garment is what you expected.... \" Read more \" Inexpensive but looks great. Fits perfectly and is comfortable. Color was as shown and it will travel well. \" Read more 36 customers mention comfort, 32 positive, 4 negative 36 customers mention \"Comfort\" 32 positive 4 negative Customers find the dress comfortable, with one mentioning that the neck line isn't tight or itchy. \" This dress is so pretty! It fits well, is comfortable , and is thick enough to not be cold, but breathable enough that it’s not hot. \" Read more \" ... Very comfortable and \"easy\" to wear all day long. Very satisfied in the purchase and the price. \" Read more \" ... Very comfy . True to size, I used this dress for my niece’s baptism , felt comfortable wearing this dress in church. \" Read more \" Beautiful color and fit. So comfortable . I had many compliments on my new dress Loved the pockets. It future to size \" Read more 20 customers mention versatility, 19 positive, 1 negative 20 customers mention \"Versatility\" 19 positive 1 negative Customers find the dress versatile, noting it's perfect for weddings and church events, with one customer mentioning it can be worn for various occasions. \" It's definitely a good fall dress . I am planning to wear it to church, and it does that well.... \" Read more \" The dress was perfect for a cocktail party , especially when paired with a silk scarf. The material is of good quality and is a nice weight.... \" Read more \" ...the red color and imprint is beautiful. It hands very well. Perfect for church . \" Read more \" Lovely! It was perfect for the wedding I was attending. \" Read more 23 customers mention length, 13 positive, 10 negative 23 customers mention \"Length\" 13 positive 10 negative Customers have mixed opinions about the dress's length, with some finding the hem and sleeves perfect while others report the sleeves being 2 inches too short. \" ...Fits great. This dress is the perfect length , the slip underneath goes all the way down. Has pockets which are cute.... \" Read more \" ...Unfortunately it is short waisted . The waist on the dress was halfway between an empire waist and a normal waist, and I am Not large up top.... \" Read more \" Super cute dress love the long sleeves . Very comfortable color is the same as pictured \" Read more \" This dress looked super cute online, but when I got it, the neckline was way too high and just didn’t look right.... \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Beautiful dress perfect choice",
        "body": "Beautiful color and fit. So comfortable. I had many compliments on my new dress Loved the pockets. It future to size Read more",
        "author": "Jane Ann Johnson",
        "rating": 5.0,
        "date": "November 10, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Great style. Well made. Fits well.",
        "body": "This is exactly what I needed for an Oct wedding with Western theme. Dressy textured fabric. Silver jewelry, black boots. Perfect. Well made. Even has a built-in slip which makes it hang well. Good choice. I can also wear it for normal occasions. Read more",
        "author": "Diane G",
        "rating": 5.0,
        "date": "September 6, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Beautiful, but short wasted!",
        "body": "I thought this dress was beautiful. I loved the color, style, and fabric. Great price. But unfortunately, it’s so high waisted I can’t wear it. I am taking it to a seamstress hoping she can find a way to drop the waist. Otherwise, I would help getting it five stars. Definitely a pretty dress for a party. Read more",
        "author": "Judy Williamson",
        "rating": 4.0,
        "date": "October 28, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Good buy",
        "body": "Inexpensive but looks great. Fits perfectly and is comfortable. Color was as shown and it will travel well. Read more",
        "author": "mary",
        "rating": 5.0,
        "date": "November 11, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars IMPORTANT! Order a larger size. But this is a beautiful dress.",
        "body": "This is a very nice. The color is absolutely perfect for Christmas. Fortunately, I read the reviews before I ordered it saying that it runs small. I’m very glad I ordered a large instead of my usual medium. The large fits perfectly. I am going to order this same dress in another color. Very feminine. Very pretty. Read more",
        "author": "C. Beck",
        "rating": 5.0,
        "date": "November 24, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61vE5IRu0HL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "3.0 out of 5 stars Not for me",
        "body": "Fabric was thinner than I expected Read more",
        "author": "lucwebshef",
        "rating": 3.0,
        "date": "December 12, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Dress is lovely and is as advertised! Very pleased!",
        "body": "It is a lovely dress I bought for my granddaughter’s wedding! I’m sure it’s going to work just fine! I like that it is hand washable and the material is very pretty! The size recommended is fine, length is perfect, I think it will work just fine! Read more",
        "author": "Betty Weimer",
        "rating": 5.0,
        "date": "October 14, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars A delightful modest treasure of a dress",
        "body": "WOW - I have been trying to find a Pretty Garden dress that actually works for me for years and I finally found one, and it has exceeded my expectations! I am 5 ft 7 inches and I carry my weight evenly - I am at a high of 190 lbs right now after 4 babies, which is frustrating, but this dress is so beautiful, flowy and flattering despite that. The bodice is very stretchy making this dress also super comfortable. I did not expect that! It does not seem to be sheer where it matters, and trust me when I say I check these things over carefully because I purchased this dress for the modesty and beauty factor. The only issue I see, easily remedied, is that the fabric arrived wrinkled and even after 1 washing and a light drying the wrinkles were still there. An iron on a very low setting got a lot of those wrinkles out. I might finally invest in a handheld steamer for this dress if the problem persists.... because rest assured I will be acquiring this dress in as many colors as possible! Read more",
        "author": "MrsDarcy",
        "rating": 5.0,
        "date": "September 19, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.",
  "about_this_item": "Womens Maxi Dress Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.",
  "long_description": "Womens Maxi Dress Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Bean Paste Red, Malachite Green, Blue, Grey Blue, Army Green, Black, Dark Green, Light Blue, Red, Wine Red, Pink, Beige, Purple, Royal Blue. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Bean Paste Red, Malachite Green, Blue, Grey Blue, Army Green, Black, Dark Green, Light Blue, Red, Wine Red, Pink, Beige, Purple, Royal Blue. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "082de48d-4c10-43a0-b9a6-041b4b22d444",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/082de48d-4c10-43a0-b9a6-041b4b22d444/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/082de48d-4c10-43a0-b9a6-041b4b22d444/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "ccb5f152-dcb3-42b9-adff-015da31877d4",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ccb5f152-dcb3-42b9-adff-015da31877d4/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ccb5f152-dcb3-42b9-adff-015da31877d4/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "cb00917c-e4f6-4f96-b7da-d525d283d59a",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/cb00917c-e4f6-4f96-b7da-d525d283d59a/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/cb00917c-e4f6-4f96-b7da-d525d283d59a/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "56b504c5-2e39-42ce-bfd5-a4d5a89a2296",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/56b504c5-2e39-42ce-bfd5-a4d5a89a2296/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/56b504c5-2e39-42ce-bfd5-a4d5a89a2296/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "90397410-e21b-4047-bcb8-61db5b8386cd",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/90397410-e21b-4047-bcb8-61db5b8386cd/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/90397410-e21b-4047-bcb8-61db5b8386cd/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "01a433c2-39fc-4a90-b11a-99bd8778502d",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/01a433c2-39fc-4a90-b11a-99bd8778502d/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/01a433c2-39fc-4a90-b11a-99bd8778502d/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "49a5289d-07a2-402d-9720-df535422aa08",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/49a5289d-07a2-402d-9720-df535422aa08/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/49a5289d-07a2-402d-9720-df535422aa08/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "61316657-42ad-4ce0-bf5e-6577fec7a844",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/61316657-42ad-4ce0-bf5e-6577fec7a844/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/61316657-42ad-4ce0-bf5e-6577fec7a844/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "aa984655-edeb-49a2-9b1a-66ddd3cccf62",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/aa984655-edeb-49a2-9b1a-66ddd3cccf62/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/aa984655-edeb-49a2-9b1a-66ddd3cccf62/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "28e08596-f79f-4c4e-839a-cc735deb6db2",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/28e08596-f79f-4c4e-839a-cc735deb6db2/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/28e08596-f79f-4c4e-839a-cc735deb6db2/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "0118a21b-b5ea-484c-a44b-d436d18d5928",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0118a21b-b5ea-484c-a44b-d436d18d5928/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0118a21b-b5ea-484c-a44b-d436d18d5928/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "2b9eda03-f68e-4b21-968b-f90a4cd3b61a",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2b9eda03-f68e-4b21-968b-f90a4cd3b61a/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2b9eda03-f68e-4b21-968b-f90a4cd3b61a/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Bean Paste Red": "https://m.media-amazon.com/images/I/317GXTqhDkL._AC_SR38,50_.jpg",
    "Malachite Green": "https://m.media-amazon.com/images/I/31n3Hq6x+9L._AC_SR38,50_.jpg",
    "Blue": "https://m.media-amazon.com/images/I/31ebT-IULHL._AC_SR38,50_.jpg",
    "Grey Blue": "https://m.media-amazon.com/images/I/31Ne62TtaNL._AC_SR38,50_.jpg",
    "Army Green": "https://m.media-amazon.com/images/I/31jECwMN36L._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31ie0NKGMYL._AC_SR38,50_.jpg",
    "Dark Green": "https://m.media-amazon.com/images/I/31YSQZW9kuL._AC_SR38,50_.jpg",
    "Light Blue": "https://m.media-amazon.com/images/I/31ZTdSDzCfL._AC_SR38,50_.jpg",
    "Red": "https://m.media-amazon.com/images/I/31TMyeU9loL._AC_SR38,50_.jpg",
    "Wine Red": "https://m.media-amazon.com/images/I/319pddMXa2L._AC_SR38,50_.jpg",
    "Pink": "https://m.media-amazon.com/images/I/31tSU4DcL6L._AC_SR38,50_.jpg",
    "Beige": "https://m.media-amazon.com/images/I/31bRvz0E4EL._AC_SR38,50_.jpg",
    "Purple": "https://m.media-amazon.com/images/I/31JXufndilL._AC_SR38,50_.jpg",
    "Royal Blue": "https://m.media-amazon.com/images/I/31wOVyUZJaL._AC_SR38,50_.jpg",
    "Dark Blue": "https://m.media-amazon.com/images/I/31C-aSlotmL._AC_SR38,50_.jpg",
    "Dark Purple": "https://m.media-amazon.com/images/I/31S90k9xixL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Bean Paste Red": "71qYWRvu-zL",
    "Malachite Green": "71SHGO2-64L",
    "Blue": "71v7b6kKJzL",
    "Grey Blue": "71HLQyQ8lyL",
    "Army Green": "71pBMurAEjL",
    "Black": "71ZNBz5MROL",
    "Dark Green": "71Qz-wZTPSL",
    "Light Blue": "71T7fTPjjwL",
    "Red": "71KOc8sbFeL",
    "Wine Red": "71ycCet6PML",
    "Pink": "71vxrGshIDL",
    "Beige": "71J0hGm4qxL",
    "Purple": "71URPhNNhJL",
    "Royal Blue": "71x88rtCZfL",
    "Dark Blue": "71HmtLxwe6L",
    "Dark Purple": "71qconCV2rL"
  },
  "color_images": {
    "Bean Paste Red": [
      "https://m.media-amazon.com/images/I/71qYWRvu-zL._SL1500_.jpg"
    ],
    "Malachite Green": [
      "https://m.media-amazon.com/images/I/71SHGO2-64L._SL1500_.jpg"
    ],
    "Blue": [
      "https://m.media-amazon.com/images/I/71v7b6kKJzL._SL1500_.jpg"
    ],
    "Grey Blue": [
      "https://m.media-amazon.com/images/I/71HLQyQ8lyL._SL1500_.jpg"
    ],
    "Army Green": [
      "https://m.media-amazon.com/images/I/71pBMurAEjL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/71ZNBz5MROL._SL1500_.jpg"
    ],
    "Dark Green": [
      "https://m.media-amazon.com/images/I/71Qz-wZTPSL._SL1500_.jpg"
    ],
    "Light Blue": [
      "https://m.media-amazon.com/images/I/71T7fTPjjwL._SL1500_.jpg"
    ],
    "Red": [
      "https://m.media-amazon.com/images/I/71KOc8sbFeL._SL1500_.jpg"
    ],
    "Wine Red": [
      "https://m.media-amazon.com/images/I/71ycCet6PML._SL1500_.jpg"
    ],
    "Pink": [
      "https://m.media-amazon.com/images/I/71vxrGshIDL._SL1500_.jpg"
    ],
    "Beige": [
      "https://m.media-amazon.com/images/I/71J0hGm4qxL._SL1500_.jpg"
    ],
    "Purple": [
      "https://m.media-amazon.com/images/I/71URPhNNhJL._SL1500_.jpg"
    ],
    "Royal Blue": [
      "https://m.media-amazon.com/images/I/71x88rtCZfL._SL1500_.jpg"
    ],
    "Dark Blue": [
      "https://m.media-amazon.com/images/I/71HmtLxwe6L._SL1500_.jpg"
    ],
    "Dark Purple": [
      "https://m.media-amazon.com/images/I/71qconCV2rL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress-cocktail-bodycon",
      "title": "Womens Dress Cocktail Bodycon",
      "price": 47.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61NfEwzl3xL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-one-shoulder-maxi-formal",
      "title": "Womens Maxi Dress Evening One Shoulder Maxi Formal",
      "price": 69.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/5150AIQL4eL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail",
      "title": "Womens Dress Cocktail",
      "price": 103.54,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61JApwce25L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-formal-bodycon-evening-sleeveless",
      "title": "Womens Maxi Dress Maxi Formal Bodycon Evening Sleeveless",
      "price": 61.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61s8qg6u1VL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 158.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71PmRANW40L._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress-bodycon-split-ruched-off-shoulder",
      "title": "Womens Dress Bodycon Split Ruched Off Shoulder",
      "price": 38.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/41JjYcPgcpL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 95.61,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Work",
      "images": [
        "https://m.media-amazon.com/images/I/71hVgSIB1jL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 138.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51PZNrlyY9L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-split-evening-formal",
      "title": "Womens Maxi Dress Split Evening Formal",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51BZ1BqPx8L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 65.97,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/81wr8PDg55L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-v-neck",
      "title": "Womens Dress V Neck",
      "price": 82.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/710bSTpZ9hL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 278.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/91YXeyW506L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening-long-sleeve",
      "title": "Womens Maxi Dress Formal Evening Long Sleeve",
      "price": 87.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61nnk+flvaL._SL1500_.jpg"
      ]
    }
  ]
}