{
  "id": "womens-maxi-dress-v-neck-short-sleeve",
  "handle": "womens-maxi-dress-v-neck-short-sleeve",
  "sku": "JC2835",
  "asin": "B0D39Z58V4",
  "title": "Womens Maxi Dress V Neck Short Sleeve",
  "title_original": "Women Denim Shirt Dress V Neck Short Sleeve Long Bottom Down A-Line Jeans Dresses with Pockets",
  "brand": "Visit the AprPith Store",
  "price": 49.99,
  "social_proof": {
    "bought_past_month": 1537,
    "text": "1537+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/61dSbld8ohL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71mO9VfnD6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/712k94G5oGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91vsQE2sT7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91CMOQXUNqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81CgpMbbqbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81URXVbJHHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61UyylwKuYL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/711yv9tWvIL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71+c048tedL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71AjvFZMl6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71DkSd+ixeL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71oTyjxjDTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/711uz8r833L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61CWyMvkToL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71x-ZSyy3JL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ti9dI3dUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/711tOAOWVDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71g1CDbdMnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71f-PfBsCPL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71AF9EsH0OL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/61dSbld8ohL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71mO9VfnD6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/712k94G5oGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91vsQE2sT7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91CMOQXUNqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81CgpMbbqbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81URXVbJHHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61UyylwKuYL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/711yv9tWvIL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71+c048tedL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71AjvFZMl6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71DkSd+ixeL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71oTyjxjDTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/711uz8r833L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61CWyMvkToL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71x-ZSyy3JL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ti9dI3dUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/711tOAOWVDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71g1CDbdMnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71f-PfBsCPL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71AF9EsH0OL._SL1500_.jpg"
  ],
  "aplus_images": [
    "https://m.media-amazon.com/images/I/41hU3EtWz6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41oBcf-Pv1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41bMhG7CswL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/418yoXXEbrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41znEZZ5fmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41YKDjAP3WL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31T6m7FBjGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41SPw5dTbcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/414HbPZadTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31w-gv2idaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31ujtUrP8jL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41Kzojf-m0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41m0TCxNYlL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41nCsfsBS%2BL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51o6tVsAQQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41i0d0dDkZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41rhf0Fb-RL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31wOsQK3MgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41AIzTdQH3L._SL1500_.jpg"
  ],
  "description_images": [
    "https://m.media-amazon.com/images/I/41hU3EtWz6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41oBcf-Pv1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41bMhG7CswL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/418yoXXEbrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41znEZZ5fmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41YKDjAP3WL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31T6m7FBjGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41SPw5dTbcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/414HbPZadTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31w-gv2idaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31ujtUrP8jL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41Kzojf-m0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41m0TCxNYlL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41nCsfsBS%2BL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51o6tVsAQQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41i0d0dDkZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41rhf0Fb-RL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31wOsQK3MgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41AIzTdQH3L._SL1500_.jpg"
  ],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ May 4, 2024",
    "ASIN ‏": "‎ B0D3B96RSJ",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#139,707 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #1,585 in Women's Casual Dresses",
    "Customer Reviews": "3.7 3.7 out of 5 stars (275)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Light Blue",
      "Medium Blue",
      "Deep Blue"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 3.7,
    "count": 275,
    "customers_say": "Customers find the denim dress cute and well-made, with thick fabric that's comfortable to wear. However, the sizing receives mixed feedback - while some say it fits perfectly, others mention it's too big and the waistline isn't as shown in pictures. Moreover, customers disagree on whether it's good value for money. Additionally, several customers report issues with the dress having a weird smell. Generated from the text of customer reviews Select to learn more Style (54) Quality (39) Material quality (21) Comfort (13) Fit (34) Value for money (14) Sizing (59) Smell (11) 54 customers mention style, 43 positive, 11 negative 54 customers mention \"Style\" 43 positive 11 negative Customers find the dress chic and appreciate its simple design, with one customer noting its feminine V-neck style and another mentioning the cute waist cinching western belt. \" This dress is super cute ! Unfortunately, I need to return it. I ordered a M and I no longer have a tiny waist and couldn't button it up there.... \" Read more \" ...The dress has the potential for being cute , but only for smaller ladies …if they order a larger size. \" Read more \" Very cute and stylist dress. I removed one star because it’s tight in the thigh area so the belly area looked a little baggy \" Read more \" Worst dress ever . Stay away from it because it smells of chemicals really bad. I’m still coughing after 15 minutes.... \" Read more 39 customers mention quality, 35 positive, 4 negative 39 customers mention \"Quality\" 35 positive 4 negative Customers praise the denim dress's construction, describing it as adorable and well-made, with one customer specifically noting the excellent stitching quality. \" This is a great dress ! I haven't washed it yet, but the wrinkles from shipping ironed out very easily.... \" Read more \" Dress is cute and well made . It runs small; I had to send it back. One other thing--it has a very strong chemical odor. \" Read more \" It looks great. Good quality and value. Perfect length for my height. I topped with soft suede jacket and matching boots.... \" Read more \" Nice dress , color is good. Not a thick denim. It’s very long, I had it hemmed.... \" Read more 21 customers mention material quality, 15 positive, 6 negative 21 customers mention \"Material quality\" 15 positive 6 negative Customers have mixed opinions about the dress's material quality, with some finding it nice and thick, while others describe it as cheap. One customer notes that it's thin enough for summer wear. \" Fabric is thick . Would be good for fall. Bigger than expected. But looks good overall \" Read more \" I am obsessed with this denim dress! It’s versatile, the material is thick enough not to be see-through but thin enough to wear in the dead of summer... \" Read more \" ... Material horrible \" Read more \" ...I'm 5'3\" and 137 so this is midi style on me but LOVE it! Nice denim and not too heavy, very cute! \" Read more 13 customers mention comfort, 12 positive, 1 negative 13 customers mention \"Comfort\" 12 positive 1 negative Customers find the dress comfortable, with one mentioning it fits true to size. \" The dress fit perfectly and the color was a great match. It was comfortable , a little stretchy near the mid-section, and the pockets were the icing... \" Read more \" ...Its made from a nice medium weight denim and is very comfortable .... \" Read more \" Love it! Soft and comfy ! \" Read more \" ... Comfortable Fabric : The denim material is soft, lightweight, and breathable—great for warm weather but easy to layer in cooler months.... \" Read more 34 customers mention fit, 20 positive, 14 negative 34 customers mention \"Fit\" 20 positive 14 negative Customers have mixed opinions about the dress's fit, with some finding it nice and perfect in length, while others report it being too small in the bust area and 10 inches too long. \" ... Great Fit : The sizing is spot-on, and the relaxed fit is comfortable while still looking tailored. It doesn’t feel too tight or too loose.... \" Read more \" ...The dress I received looked like a huge sack and came down almost to my ankles . I tried cinching it with a belt but it still looked horrible. \" Read more \" OMG... So glad I took a chance and ordered this jeans dress.... fits perfect , looks and feels great on; I can dress it up with sexy sandals or down... \" Read more \" dress sits mid thigh , not like the picture, the color of the dress is also darker than what is pictured \" Read more 14 customers mention value for money, 9 positive, 5 negative 14 customers mention \"Value for money\" 9 positive 5 negative Customers have mixed opinions about the dress's value for money, with some finding it good value while others consider it very cheap for the price. \" It looks great. Good quality and value . Perfect length for my height. I topped with soft suede jacket and matching boots.... \" Read more \" Made very cheap for the price it has charge ! I order size small it fit very loose. \" Read more \" This is a pretty decent dress for the price . Although I used the size guide, the first dress had to be returned because it was too small.... \" Read more \" ...Thick good quality material. Great price . I just wish it fit all around for the event I needed. \" Read more 59 customers mention sizing, 16 positive, 43 negative 59 customers mention \"Sizing\" 16 positive 43 negative Customers report significant sizing issues with the dress, noting it runs too big, is 10 inches too long, and is too tight in the chest. \" Super cute but size up I am between a med/lg so got a lg and it's too small . \" Read more \" Dress is cute and well made. It runs small ; I had to send it back. One other thing--it has a very strong chemical odor. \" Read more \" Nice dress, color is good. Not a thick denim. It’s very long , I had it hemmed.... \" Read more \" ...Sadly had to return it as it was too long for me (5.2) \" Read more 11 customers mention smell, 0 positive, 11 negative 11 customers mention \"Smell\" 0 positive 11 negative Customers report issues with the dress having a weird smell. \" It was obviously worn before I got it, smelled like perfume . \" Read more \" Runs small, material felt very uncomfortable, & dress had an odd odor . \" Read more \" ...It did also have a weird smell which is a common thing for pretty much any jeans or Jean material I try from Amazon.... \" Read more \" ...Also solid blue, not faded denim. Smells like mothballs . I’m regretting my purchases. Size is a generous medium. \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Stylish addition to my wardrobe",
        "body": "The dress stylish and versatile addition to my wardrobe! It’s perfect for a casual yet polished look, and I’ve already received so many compliments. Why I love this dress: Flattering V-Neck: The V-neck design is both feminine and flattering, giving the dress a chic and effortless vibe. Comfortable Fabric: The denim material is soft, lightweight, and breathable—great for warm weather but easy to layer in cooler months. Versatile Style: The short sleeves and simple design make it easy to dress up or down. I’ve worn it with sneakers for errands and with wedges for brunch. Great Fit: The sizing is spot-on, and the relaxed fit is comfortable while still looking tailored. It doesn’t feel too tight or too loose. Durable and Easy to Care For: It holds up well after washing, with no fading or shrinking. The quality of the stitching is excellent. This denim dress is perfect for casual outings, summer picnics, or even a relaxed office setting. If you’re looking for a stylish, comfortable piece that’s easy to style, this one is a winner! Read more",
        "author": "HSKRCHIC",
        "rating": 5.0,
        "date": "January 5, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Nice dress",
        "body": "This is a well made, stylish dress, comfortable length. It ran small, tighter than I like, and I returned it. Read more",
        "author": "Patty in NY",
        "rating": 4.0,
        "date": "October 24, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Perfect color and style.",
        "body": "Love this! Adorable. I have so many options with a different belts and shoes. It was 10 inches too long. If you take the hem bottom line and pull it to where you want it showing the back side and then sew it following the sewn hem line, and then cut all the back side off, and flip the top sewn hem, you have a perfect hem with little effort. There are videos that show how to do this. It fits perfect. If the buttons keep coming out, sew the button hole a few times and it will hold your button from coming out. I will hand wash and hang it up so that it doesn't shrink on me. Read more",
        "author": "Julies",
        "rating": 5.0,
        "date": "August 27, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "1.0 out of 5 stars Sizing is SMALL!!Color is different from photos!",
        "body": "I first noticed that the dark blue dress I received did not have the same faded/slightly distressed color as the photo. Not great, but something I could deal with til it did fade. Then I put it on, or tried to put it on… I am 5’5”, 175-180, 36 H bust, usually a size 12-14. I can usually wear a L- XL, but order an XL to accommodate for my bustline. I bought the XL in the denim dress and can’t even button around the waist. It is actually 3-5” from being able to button at the waist!!! This XL is equivalent to a 6-8 size!!! The dress has the potential for being cute, but only for smaller ladies …if they order a larger size. Read more",
        "author": "Kimber E",
        "rating": 1.0,
        "date": "October 16, 2024",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Runs small.",
        "body": "Dress is cute and well made. It runs small; I had to send it back. One other thing--it has a very strong chemical odor. Read more",
        "author": "Orin",
        "rating": 3.0,
        "date": "June 22, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "2.0 out of 5 stars Buy a Different Dress, Probably",
        "body": "This dress is confusing and was made for a stick person with a beer belly. It will likely only fit someone with a C cup size or less and has no room in the butt/hips. And then it pouts out at the waist. The arms are also tight. The kind of tight where you can’t raise your arms. The buttons make an annoying clacking sound. The material also has that gross smell that denim sometimes has. You all know what I’m talking about. The smell that doesn’t come out no matter how many times you wash it and you still have jeans from 2007 with that same smell. Yeah, that smell. Anyway, the material was soft and it’s of a medium thickness. Not worth your money if you are above a C cup or if you have a booty and if you don’t like to smell bad. I’m 5’8 and weigh 175 lbs, 33” waist 43” hips, 36DDD. I bought the XL. Read more",
        "author": "LN",
        "rating": 2.0,
        "date": "May 21, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Garment is true to size and well constructed.",
        "body": "I loved the dress which was a perfect fit. It is well consructed and easy to press out wrinkles. Perfect for work, church, or leisure wear. Read more",
        "author": "CJJ",
        "rating": 5.0,
        "date": "September 19, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Comfy and nice quality",
        "body": "Very nice dress with pockets. Read more",
        "author": "Carol",
        "rating": 5.0,
        "date": "November 16, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress V Neck Short Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.",
  "about_this_item": "Womens Maxi Dress V Neck Short Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.",
  "long_description": "Womens Maxi Dress V Neck Short Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Light Blue, Medium Blue, Deep Blue. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress V Neck Short Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/41hU3EtWz6L._SL1500_.jpg",
      "alt": "Womens Maxi Dress V Neck Short Sleeve details image 1"
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/41oBcf-Pv1L._SL1500_.jpg",
      "alt": "Womens Maxi Dress V Neck Short Sleeve details image 2"
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/41bMhG7CswL._SL1500_.jpg",
      "alt": "Womens Maxi Dress V Neck Short Sleeve details image 3"
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/418yoXXEbrL._SL1500_.jpg",
      "alt": "Womens Maxi Dress V Neck Short Sleeve details image 4"
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Light Blue, Medium Blue, Deep Blue. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/41znEZZ5fmL._SL1500_.jpg",
      "alt": "Womens Maxi Dress V Neck Short Sleeve details image 5"
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [],
  "color_swatches": {
    "Light Blue": "https://m.media-amazon.com/images/I/31doj+r7x3L._AC_SR38,50_.jpg",
    "Medium Blue": "https://m.media-amazon.com/images/I/41IxPiMVgFL._AC_SR38,50_.jpg",
    "Deep Blue": "https://m.media-amazon.com/images/I/41i0d0dDkZL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Light Blue": "61UyylwKuYL",
    "Medium Blue": "61CWyMvkToL",
    "Deep Blue": "61dSbld8ohL"
  },
  "color_images": {
    "Light Blue": [
      "https://m.media-amazon.com/images/I/61UyylwKuYL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/711yv9tWvIL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71+c048tedL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71AjvFZMl6L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71DkSd+ixeL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71oTyjxjDTL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/711uz8r833L._SL1500_.jpg"
    ],
    "Medium Blue": [
      "https://m.media-amazon.com/images/I/61CWyMvkToL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71x-ZSyy3JL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71ti9dI3dUL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/711tOAOWVDL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71g1CDbdMnL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71f-PfBsCPL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71AF9EsH0OL._SL1500_.jpg"
    ],
    "Deep Blue": [
      "https://m.media-amazon.com/images/I/61dSbld8ohL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71mO9VfnD6L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/712k94G5oGL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/91vsQE2sT7L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/91CMOQXUNqL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81CgpMbbqbL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81URXVbJHHL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-long-sleeve-ruched-bodycon-v-neck",
      "title": "Womens Maxi Dress Long Sleeve Ruched Bodycon V Neck",
      "price": 33.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51AvldIvTmL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-formal",
      "title": "Womens Maxi Dress Long Sleeve Formal",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/714zYpNDHwL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 36.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61eoqNurcrL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-bodycon-long-sleeve-ruched",
      "title": "Womens Maxi Dress Cocktail Bodycon Long Sleeve Ruched",
      "price": 24.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61xmkRAfuFL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 24.97,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/61UHOv7ojzL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-maxi-v-neck-long-sleeve",
      "title": "Womens Maxi Dress Maxi V Neck Long Sleeve",
      "price": 47.89,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71RP0nW-z6L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-v-neck-long-sleeve",
      "title": "Womens Maxi Dress V Neck Long Sleeve",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/81352cAhoXL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-split-cocktail-v-neck",
      "title": "Womens Maxi Dress Formal Split Cocktail V Neck",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51usYen8xPL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-off-shoulder-mermaid-evening",
      "title": "Womens Maxi Dress Off Shoulder Mermaid Evening",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61JewuqdLBL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-ruched",
      "title": "Womens Dress Ruched",
      "price": 45.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/819T+NSIXLL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-split-sleeveless-cocktail-bodycon",
      "title": "Womens Dress Split Sleeveless Cocktail Bodycon",
      "price": 27.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51OoLUBGjtL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-off-shoulder",
      "title": "Womens Maxi Dress Off Shoulder",
      "price": 109.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/81rA4Ceha4L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-formal",
      "title": "Womens Maxi Dress Evening Formal",
      "price": 76.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/715Wh+FGZSL._SL1500_.jpg"
      ]
    }
  ]
}