{
  "id": "womens-dress-cocktail",
  "handle": "womens-dress-cocktail",
  "sku": "JC1591",
  "asin": "B0D31R5CB6",
  "title": "Womens Dress Cocktail",
  "title_original": "GRACE KARIN Women's Sparkly Sequin Dress Cap Sleeve Party Cocktail Holiday Dress Elegant Glitter Sparkly Dresses for Women",
  "brand": "Visit the GRACE KARIN Store",
  "price": 59.99,
  "social_proof": {
    "bought_past_month": 1768,
    "text": "1768+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/81co+IQozgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81KQhdEElYL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71RprIKRY8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71x5n9NA8aL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91ujhXQCMeL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81mvGrgT4rL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/819SF4djYFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81zwwP0qz8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81776GmByYL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71gYwlgj73L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81PdKB0R78L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81mz0Nq8K6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81QWt7eyqcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81rWyo2O5xL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81suGjYC43L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81VLgGZExPL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81zueyZSe-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/813nXNkO9zL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81m95D5FizL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/81co+IQozgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81KQhdEElYL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71RprIKRY8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71x5n9NA8aL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91ujhXQCMeL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81mvGrgT4rL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/819SF4djYFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81zwwP0qz8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81776GmByYL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71gYwlgj73L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81PdKB0R78L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81mz0Nq8K6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81QWt7eyqcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81rWyo2O5xL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81suGjYC43L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81VLgGZExPL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81zueyZSe-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/813nXNkO9zL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81m95D5FizL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Item model number ‏": "‎ CL3069S24-LYF",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ June 13, 2024",
    "ASIN ‏": "‎ B0D31QVSDR",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#10,965 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #78 in Women's Club & Night Out Dresses",
    "Customer Reviews": "4.2 4.2 out of 5 stars (455)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Black Gold",
      "Blue",
      "Rose Gold",
      "Black",
      "Champagne",
      "Colorful White",
      "Navy Blue",
      "Multicolored",
      "Colorful Black",
      "Wine Red",
      "Pink",
      "Colorful Purple",
      "Lake Green",
      "Purple",
      "Dark Blue",
      "Green"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.2,
    "count": 455,
    "customers_say": "Customers find the dress fits well, with one noting it's just above the knee, and appreciate its perfect length. They describe it as well-made, comfortable, and not itchy, while also praising its color accuracy and sparkle that lasts all night long. The dress receives mixed feedback about its flattering nature, with some finding it flattering for all body types while others disagree. Generated from the text of customer reviews Select to learn more Fit (66) Look (62) Comfort (31) Quality (30) Color accuracy (15) Size (15) Sparkle (15) Flattering (17) 66 customers mention fit, 54 positive, 12 negative 66 customers mention \"Fit\" 54 positive 12 negative Customers are satisfied with how the dress fits, noting it's perfect and has the right length, with one customer mentioning it sits just above the knee. \" This dress is so elegant. I wore it to a party. It fits well and didn’t lose not one sequin. Material is nice and sturdy.... \" Read more \" ...High quality, sparkly sequins, and fits true to size . There’s a little bit of stretch in this dress as well! Highly recommend!... \" Read more \" Great quality material. Great fit . True to size. \" Read more \" ...It fits nicely and is comfortable. But unfortunately, I can not wear this dress as it is with this major flaw. \" Read more 62 customers mention look, 60 positive, 2 negative 62 customers mention \"Look\" 60 positive 2 negative the dress looks great and feel beautiful wearing it. \" This is a beautiful dress I purchased for a formal event. Unfortunately, I can not wear this because I was sent an flawed dress.... \" Read more \" This dress was beautiful and perfect fit. The best part I washed it nothing fell off. I buy this brand off Amazon often.... \" Read more \" I really wanted to love this because it's cute and sparkly, and it fits really well.... \" Read more \" Super cute ! The sequins held up well. Packed in my suitcase and came out ready to wear. The color was as expected. Fit great.... \" Read more 31 customers mention comfort, 23 positive, 8 negative 31 customers mention \"Comfort\" 23 positive 8 negative Customers find the dress comfortable, with one mentioning they can eat a full meal in it and another noting it's not itchy. \" ...It had the perfect stretchiness without losing its hold, it was comfortable , the material was the perfect thickness without weighing you down and... \" Read more \" ...It’s surprisingly very comfortable and the sequins don’t touch the skin at all so it’s not itchy, like other sequined clothing that I have. \" Read more \" Sequins uncomfortable \" Read more \" ...The color was as expected. Fit great. The material was comfortable , not itchy. The length was perfect. \" Read more 30 customers mention quality, 26 positive, 4 negative 30 customers mention \"Quality\" 26 positive 4 negative Customers find the dress to be of great quality. \" Great dress ! I'm a true 14/16 and it fit perfect. The dress does have a little stretch but definitely order your true size. \" Read more \" Fits perfectly, well made . \" Read more \" Love Grace Karin clothes, no disappointment here, great quality and fit is exact. \" Read more \" ... High quality , sparkly sequins, and fits true to size. There’s a little bit of stretch in this dress as well! Highly recommend!... \" Read more 15 customers mention color accuracy, 13 positive, 2 negative 15 customers mention \"Color accuracy\" 13 positive 2 negative Customers love the color of the dress. \" I love the color but it bunches up in the stomach area for the wrap. It makes you look like you have a pouch. \" Read more \" ...was the perfect thickness without weighing you down and the green color was beautiful ! I felt beautiful in it.... \" Read more \" ...Packed in my suitcase and came out ready to wear. The color was as expected . Fit great. The material was comfortable, not itchy.... \" Read more \" ...The emerald color is gorgeous , and the sequins make it the perfect dress for an upscale event.... \" Read more 15 customers mention size, 11 positive, 4 negative 15 customers mention \"Size\" 11 positive 4 negative Customers are satisfied with how the dress fits. \" ...The design is very pleasing to my curvy body type. I think it’s true to size , I wear a size 12 sometimes 10, and typically Large.... \" Read more \" Size is right on - nice material. Looking forward to wearing it next weekend. \" Read more \" This dress is nice looking, but you definitely need to size up . It was a little to snug for me but for a comfortable dressy looking dress it was nice. \" Read more \" Versatile, great dress! Size small was a loose , comfortable fit on me (5’5” 105 lbs). Great length and fun fit.... \" Read more 15 customers mention sparkle, 14 positive, 1 negative 15 customers mention \"Sparkle\" 14 positive 1 negative Customers like the dress's sparkle, with one mentioning that it shines well under lights. \" I really wanted to love this because it's cute and sparkly , and it fits really well.... \" Read more \" ...Good for style and sparkle , just be sure to double-check sizing before buying. \" Read more \" ...High quality, sparkly sequins , and fits true to size. There’s a little bit of stretch in this dress as well! Highly recommend!... \" Read more \" ...It has the perfect amount of sparkle . Great quality and true to size. \" Read more 17 customers mention flattering, 11 positive, 6 negative 17 customers mention \"Flattering\" 11 positive 6 negative Customers have mixed opinions about the dress's appearance, with some finding it flattering and suitable for all body shapes, while others disagree. \" Great dress for formal event. I love the look of this dress! It’s very flattering and comfortable for most body types. I am 5” and 140 lbs.... \" Read more \" Not flattering . This dress is bunchy right below the waist and made me look pregnant. The top has no shape and looks boxy.... \" Read more \" Bought this dress for a wedding, flattering and comfortable, made me feel pretty.... \" Read more \" Beautiful lightweight dress. Very flattering shape . Would buy another in a different color also. \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Cute and fun versatile dress!",
        "body": "Versatile, great dress! Size small was a loose, comfortable fit on me (5’5” 105 lbs). Great length and fun fit. Wore it to a fancy Christmas party and think I’ll get a lot of use out of this cute dress! I did have to trim a few loose threads off the bottom, but for the price, that’s no big deal at all! Read more",
        "author": "Salzone",
        "rating": 5.0,
        "date": "December 7, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71xQks6R9zL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Very cute dress and comfy!",
        "body": "I got this dress for a concert in Vegas. The sequins do not scratch! It’s fully lined so, no see through! The design is very pleasing to my curvy body type. I think it’s true to size, I wear a size 12 sometimes 10, and typically Large. I ordered the Large and thought it fit perfectly. Read more",
        "author": "Beverly S",
        "rating": 5.0,
        "date": "December 4, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71sjAbIzvAL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "4.0 out of 5 stars Almost perfect evening dress",
        "body": "I was very impressed by this dress, i usually have to order a bunch of dresses from Amazon to find the right one and on the first try (thanks to some of the other reviews) I went with this one. It had the perfect stretchiness without losing its hold, it was comfortable, the material was the perfect thickness without weighing you down and the green color was beautiful! I felt beautiful in it. Overall a perfect fit, the site recommended a L but I went with XL only because I am top heavy but the hip area still worked out. The only reason I didn’t give this 5 stars is because the sleeves were a little chafing under my arms, not too much but just enough to have me adjusting a couple of times throughout the evening, but for the price I paid I’m ok with a little discomfort. Read more",
        "author": "Verito",
        "rating": 4.0,
        "date": "November 29, 2024",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Comfy and pretty",
        "body": "It’s perfect, I just wish it wasn’t as tapered on the bottom so that I can dance more easily because I plan to wear it to a concert. It’s surprisingly very comfortable and the sequins don’t touch the skin at all so it’s not itchy, like other sequined clothing that I have. Read more",
        "author": "S",
        "rating": 5.0,
        "date": "November 29, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Sparkle all night long",
        "body": "As an event planner, I needed a dress that was pretty and functional. This was perfect. Super comfy and sparkly. Didn’t have to worry about any wardrobe malfunctions and was able to focus on taking care of my guests all night long. I’m 5’8” and really liked the dress hitting just above the knee. Flutter sleeves helped me not feel so self conscious about my flabby white arms. I got a large and it fit perfectly with enough room to move without it looking big. Read more",
        "author": "ohsoblessed",
        "rating": 5.0,
        "date": "November 25, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/811QqUpKJkL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "1.0 out of 5 stars Imperfection ruined a beautiful dress",
        "body": "This is a beautiful dress I purchased for a formal event. Unfortunately, I can not wear this because I was sent an flawed dress. There are beautiful single strands of sequins all over the dress. However, my dress has two rows of sequins sewn on top of each other right in the front, rather than the single stand pattern. This created a dark line going down the front of the dress on one side. It draws attention from the dress and in the light you see a long dark line because of the double row, which looks very unflattering and cheap. I can not wear this to my event. Had they sent me a dress without this issue, it would have been stunning. It fits nicely and is comfortable. But unfortunately, I can not wear this dress as it is with this major flaw. Read more",
        "author": "C R",
        "rating": 1.0,
        "date": "September 21, 2024",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/81ocykFwgvL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/91YFUzMZAaL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/814p4l2Xh9L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "3.0 out of 5 stars Cute, but...",
        "body": "I really liked the blouson top with flutter sleeves and tulip skirt. I'm 5'9 (200 lbs) and found the length to be adequate. The sequins were pretty, but painful. I saw some reviews that the dress had satin (or other soft material) sewn in at the arm area so the sequins didn't bother their arms - the dress I received had no such panel. They scratched & rubbed my arms and quickly became too uncomfortable to wear. I had also planned on wearing my hair down, but found that was impossible as the sequins were catching in my hair and ripping it out with even the slightest head movement. I would love this exact style of dress without the sequins. Read more",
        "author": "Customer",
        "rating": 3.0,
        "date": "December 16, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61W1v-oqqJL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Perfect Dress",
        "body": "This dress is such a flattering fit! Great to dress up or keep low key. It’s long enough to feel comfortable but short enough to be flattering. I will be ordering in other sizes Read more",
        "author": "andre burns",
        "rating": 5.0,
        "date": "November 12, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Dress Cocktail is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.",
  "about_this_item": "Womens Dress Cocktail is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.",
  "long_description": "Womens Dress Cocktail is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Black Gold, Blue, Rose Gold, Black, Champagne, Colorful White, Navy Blue, Multicolored, Colorful Black, Wine Red, Pink, Colorful Purple, Lake Green, Purple. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Dress Cocktail is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Black Gold, Blue, Rose Gold, Black, Champagne, Colorful White, Navy Blue, Multicolored, Colorful Black, Wine Red, Pink, Colorful Purple, Lake Green, Purple. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "45b83aae-085c-403c-932d-74ceb298965c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/45b83aae-085c-403c-932d-74ceb298965c/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/45b83aae-085c-403c-932d-74ceb298965c/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "7580b68f-9bed-4781-a977-f35b5b127643",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7580b68f-9bed-4781-a977-f35b5b127643/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7580b68f-9bed-4781-a977-f35b5b127643/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "d978527f-be11-4a73-a459-91d763e97b39",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d978527f-be11-4a73-a459-91d763e97b39/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d978527f-be11-4a73-a459-91d763e97b39/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "683960b1-7c01-4d58-a56d-19469fe83608",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/683960b1-7c01-4d58-a56d-19469fe83608/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/683960b1-7c01-4d58-a56d-19469fe83608/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "b03df2c4-4f2c-4738-9f0e-f2aec7db11f9",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b03df2c4-4f2c-4738-9f0e-f2aec7db11f9/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b03df2c4-4f2c-4738-9f0e-f2aec7db11f9/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "0bd5d36c-7235-4965-80bd-c3241e4acae0",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0bd5d36c-7235-4965-80bd-c3241e4acae0/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0bd5d36c-7235-4965-80bd-c3241e4acae0/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "89f9691a-b3cd-43c3-82ad-4aa5ae210b73",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/89f9691a-b3cd-43c3-82ad-4aa5ae210b73/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/89f9691a-b3cd-43c3-82ad-4aa5ae210b73/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "00e34b53-2afb-4a36-8b0e-92f065f0436e",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/00e34b53-2afb-4a36-8b0e-92f065f0436e/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/00e34b53-2afb-4a36-8b0e-92f065f0436e/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "e341ed7e-45dd-4c7d-85ee-4afaeb13fa62",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e341ed7e-45dd-4c7d-85ee-4afaeb13fa62/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e341ed7e-45dd-4c7d-85ee-4afaeb13fa62/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "4e1578ee-d54f-4899-8aff-41d1c1741c7a",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4e1578ee-d54f-4899-8aff-41d1c1741c7a/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4e1578ee-d54f-4899-8aff-41d1c1741c7a/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "4ea6512e-bf47-4d91-b885-1b003924b7f0",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4ea6512e-bf47-4d91-b885-1b003924b7f0/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4ea6512e-bf47-4d91-b885-1b003924b7f0/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "17fa8cda-e246-4485-a6bd-cb461c1f23da",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/17fa8cda-e246-4485-a6bd-cb461c1f23da/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/17fa8cda-e246-4485-a6bd-cb461c1f23da/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Black Gold": "https://m.media-amazon.com/images/I/510PKxbbKIL._AC_SR38,50_.jpg",
    "Blue": "https://m.media-amazon.com/images/I/41r-P9MLLYL._AC_SR38,50_.jpg",
    "Rose Gold": "https://m.media-amazon.com/images/I/41ihNRfaI6L._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/41NcOjsMTTL._AC_SR38,50_.jpg",
    "Champagne": "https://m.media-amazon.com/images/I/417kWUSFc3L._AC_SR38,50_.jpg",
    "Colorful White": "https://m.media-amazon.com/images/I/41JfrmJSHEL._AC_SR38,50_.jpg",
    "Navy Blue": "https://m.media-amazon.com/images/I/41YHM+SYQDL._AC_SR38,50_.jpg",
    "Multicolored": "https://m.media-amazon.com/images/I/41VIZ8AOMeL._AC_SR38,50_.jpg",
    "Colorful Black": "https://m.media-amazon.com/images/I/510c+hZTeLL._AC_SR38,50_.jpg",
    "Wine Red": "https://m.media-amazon.com/images/I/41sNhYCVLDL._AC_SR38,50_.jpg",
    "Pink": "https://m.media-amazon.com/images/I/41QnvRWHf2L._AC_SR38,50_.jpg",
    "Colorful Purple": "https://m.media-amazon.com/images/I/51UOWf+TC6L._AC_SR38,50_.jpg",
    "Lake Green": "https://m.media-amazon.com/images/I/41vWnZga+UL._AC_SR38,50_.jpg",
    "Purple": "https://m.media-amazon.com/images/I/41mQVVSHrlL._AC_SR38,50_.jpg",
    "Dark Blue": "https://m.media-amazon.com/images/I/41cfRaFxQ7L._AC_SR38,50_.jpg",
    "Green": "https://m.media-amazon.com/images/I/41OFv-5wVgL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Black Gold": "91ujhXQCMeL",
    "Blue": "81mvGrgT4rL",
    "Rose Gold": "819SF4djYFL",
    "Black": "81co+IQozgL",
    "Champagne": "81zwwP0qz8L",
    "Colorful White": "81776GmByYL",
    "Navy Blue": "71gYwlgj73L",
    "Multicolored": "81PdKB0R78L",
    "Colorful Black": "81mz0Nq8K6L",
    "Wine Red": "81QWt7eyqcL",
    "Pink": "81rWyo2O5xL",
    "Colorful Purple": "81suGjYC43L",
    "Lake Green": "81VLgGZExPL",
    "Purple": "81zueyZSe-L",
    "Dark Blue": "813nXNkO9zL",
    "Green": "81m95D5FizL"
  },
  "color_images": {
    "Black Gold": [
      "https://m.media-amazon.com/images/I/91ujhXQCMeL._SL1500_.jpg"
    ],
    "Blue": [
      "https://m.media-amazon.com/images/I/81mvGrgT4rL._SL1500_.jpg"
    ],
    "Rose Gold": [
      "https://m.media-amazon.com/images/I/819SF4djYFL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/81co+IQozgL._SL1500_.jpg"
    ],
    "Champagne": [
      "https://m.media-amazon.com/images/I/81zwwP0qz8L._SL1500_.jpg"
    ],
    "Colorful White": [
      "https://m.media-amazon.com/images/I/81776GmByYL._SL1500_.jpg"
    ],
    "Navy Blue": [
      "https://m.media-amazon.com/images/I/71gYwlgj73L._SL1500_.jpg"
    ],
    "Multicolored": [
      "https://m.media-amazon.com/images/I/81PdKB0R78L._SL1500_.jpg"
    ],
    "Colorful Black": [
      "https://m.media-amazon.com/images/I/81mz0Nq8K6L._SL1500_.jpg"
    ],
    "Wine Red": [
      "https://m.media-amazon.com/images/I/81QWt7eyqcL._SL1500_.jpg"
    ],
    "Pink": [
      "https://m.media-amazon.com/images/I/81rWyo2O5xL._SL1500_.jpg"
    ],
    "Colorful Purple": [
      "https://m.media-amazon.com/images/I/81suGjYC43L._SL1500_.jpg"
    ],
    "Lake Green": [
      "https://m.media-amazon.com/images/I/81VLgGZExPL._SL1500_.jpg"
    ],
    "Purple": [
      "https://m.media-amazon.com/images/I/81zueyZSe-L._SL1500_.jpg"
    ],
    "Dark Blue": [
      "https://m.media-amazon.com/images/I/813nXNkO9zL._SL1500_.jpg"
    ],
    "Green": [
      "https://m.media-amazon.com/images/I/81m95D5FizL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-ruched-long-sleeve-off-shoulder",
      "title": "Womens Maxi Dress Ruched Long Sleeve Off Shoulder",
      "price": 65.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/610S-XUGzwL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-sleeveless-v-neck-cocktail-maxi-bodycon",
      "title": "Womens Maxi Dress Sleeveless V Neck Cocktail Maxi Bodycon",
      "price": 44.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51eoMzKwaqL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-formal-cocktail",
      "title": "Womens Maxi Dress Long Sleeve Formal Cocktail",
      "price": 45.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/610egGe2LwL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-v-neck-ruched",
      "title": "Womens Maxi Dress Long Sleeve V Neck Ruched",
      "price": 41.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/41nKZb3yrHL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 33.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61W5l+uioHL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-evening",
      "title": "Womens Maxi Dress Evening",
      "price": 72.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61ifQNM1WAL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening",
      "title": "Womens Maxi Dress Evening",
      "price": 66.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61jhboT-KdL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-bodycon-ruched-off-shoulder",
      "title": "Womens Maxi Dress Cocktail Bodycon Ruched Off Shoulder",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/51pNtXYlEDL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 70.57,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/512WgWMyYLL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-one-shoulder-formal-mermaid",
      "title": "Womens Maxi Dress Evening One Shoulder Formal Mermaid",
      "price": 69.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/613xHpbpN5L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-off-shoulder",
      "title": "Womens Dress Off Shoulder",
      "price": 93.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71+G9PIEq1L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-short-sleeve",
      "title": "Womens Dress Short Sleeve",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61Gm5oBtjDL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-bodycon-cocktail",
      "title": "Womens Dress Bodycon Cocktail",
      "price": 55.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61k-qoz2M6L._SL1500_.jpg"
      ]
    }
  ]
}