{
  "id": "womens-dress-v-neck-cocktail-short-sleeve",
  "handle": "womens-dress-v-neck-cocktail-short-sleeve",
  "sku": "JC2556",
  "asin": "B0D4QVCYMY",
  "title": "Womens Dress V Neck Cocktail Short Sleeve",
  "title_original": "Simplee Women's 2025 Velvet Short Sleeve Cocktail Dress Fall Winter Casual V Neck Empire Waist Mini Dresses with Pockets",
  "brand": "Visit the Simplee Apparel Store",
  "price": 39.99,
  "social_proof": {
    "bought_past_month": 429,
    "text": "429+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/711HWxZc3XL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71BeS7i7B9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71LiCIeEaIL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Oa0Uc9v4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/716hbD0rNoL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71vhMORQrZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71l8zbpuT-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71CnA7Ql4DL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71be3sxdiiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81e268rUIsL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81R2utDv+XL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71KTP8PvEZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81zkV4ouATL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81785DgJz+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71gIlsbxO2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ClNbeaFKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/7182SJYisFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81p6ZIN0nlL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81jAhczNIgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71aLu2uKnBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71J0W6QbToL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/711HWxZc3XL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71BeS7i7B9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71LiCIeEaIL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Oa0Uc9v4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/716hbD0rNoL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71vhMORQrZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71l8zbpuT-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71CnA7Ql4DL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71be3sxdiiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81e268rUIsL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81R2utDv+XL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71KTP8PvEZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81zkV4ouATL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81785DgJz+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71gIlsbxO2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ClNbeaFKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/7182SJYisFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81p6ZIN0nlL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81jAhczNIgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71aLu2uKnBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71J0W6QbToL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ July 31, 2024",
    "ASIN ‏": "‎ B0DBPD185B",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#22,133 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #233 in Women's Casual Dresses",
    "Customer Reviews": "4.6 4.6 out of 5 stars (234)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "2-burnout Dark Blue",
      "#Burnt Orange",
      "2-burnout Dark Green",
      "3-burnout Dark Green",
      "3-burnout Dusty Blue",
      "2-burnout Dusty Blue",
      "3-burnout Black",
      "3-burnout Red",
      "#Black",
      "#Dusty Blue",
      "#Burgundy",
      "#Coffee",
      "#Green",
      "3-burnout Grayish Blue",
      "#Teal Blue",
      "2-burnout Tangerine"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.6,
    "count": 234,
    "customers_say": "Customers find the dress stylish, with one noting it looks more expensive than its price. The dress receives positive feedback for its fit, with one mentioning it's great for hiding a mommy pouch, and its quality, color, and softness are appreciated. Customers describe it as comfortable, flattering, and true-to-size, with one highlighting how it accentuates the waist. Generated from the text of customer reviews Select to learn more Style (66) Fit (44) Quality (33) Color (28) Comfort (28) Flattering (20) Size (18) Softness (18) 66 customers mention style, 62 positive, 4 negative 66 customers mention \"Style\" 62 positive 4 negative Customers find the dress pretty and cute for Halloween costumes, with one mentioning it's easy to stand out at holiday gatherings and another noting it looks more expensive than its price. \" I wore the dress to a wedding and it was adorable . I loved the cut in the front. I absolutely love the pockets! I got the dress in black. \" Read more \" It was cute . I didn’t like the puffs on the shoulders. Made me look weird. But the dress color and texture was awesome.... \" Read more \" Beautiful and comfortable dress for the holidays! It is true to size, as well. \" Read more \" So cute and comfy... \" Read more 44 customers mention fit, 39 positive, 5 negative 44 customers mention \"Fit\" 39 positive 5 negative Customers like how the dress fits, with one mentioning it's great for hiding the mommy pouch, while another notes it hits above the knee. \" I really loved the softness of this dress. The fit is flattering and the dress is light but not too light to where it wouldn’t be somewhat warm for... \" Read more \" ...The quality is great, and the fit is true to size . I’m pushing 50, and I thought it was age appropriate in both length and style.... \" Read more \" ...It fits great , with just the right amount of stretch to make it comfy and flattering.... \" Read more \" Fits perfect , love the color , looked amazing for the Christmas party last night . Better than I expected... \" Read more 33 customers mention quality, 33 positive, 0 negative 33 customers mention \"Quality\" 33 positive 0 negative Customers find the dress to be of excellent quality. \" This is a great dress !!! Good material not see through but not hot. Fits very nicely on someone with a larger bust and small waist.... \" Read more \" This dress is 10/10. Adorable. Great quality and fits perfectly. I had so many compliments on it. \" Read more \" Good quality . I haven’t washed or worn it yet, but it looks nice on. I did have to return the first one I bought and get the next size up.... \" Read more \" This dress is so comfortable and nice . I wore it for a wedding welcome dinner in Ireland and it was perfect with sheer black tights.... \" Read more 28 customers mention color, 27 positive, 1 negative 28 customers mention \"Color\" 27 positive 1 negative Customers like the dress's color, with one mentioning it pairs well with sheer black tights. \" The fit is very flattering! The color is gorgeous ! I want this dress in every color! Lightweight fabric and very soft. \" Read more \" This was a beautiful color and very comfortable fit and fabric, however I returned it as it looked too much like a costume due to the color and style... \" Read more \" ...It’s a good length and provides good coverage. The color is beautiful and it feels like great quality. Bonus that it’s super comfortable and soft \" Read more \" Love it! Feels so good and the fit is great. The color is perfect for fall ! \" Read more 28 customers mention comfort, 27 positive, 1 negative 28 customers mention \"Comfort\" 27 positive 1 negative Customers find the dress comfortable, with one mentioning it has the right weight and another noting it's cozy for family time. \" ...It was comfortable and easy to wear and looked great with no fuss! Perfect dress and I’ll definitely wear it many times dressed up and down! \" Read more \" This dress was exactly what I was looking for! Very comfortable ! \" Read more \" ...Not lowcut, super comfortable & the blue color is gorgeous. I definitely need more crush velvet in my life. \" Read more \" I absolutely love this dress! It is so comfortable and fits in a very flattering way. I love the velvet material. I highly recommend it.... \" Read more 20 customers mention flattering, 17 positive, 3 negative 20 customers mention \"Flattering\" 17 positive 3 negative Customers find the dress flattering, particularly noting its flattering cut and how it accentuates the waist. \" ...great, with just the right amount of stretch to make it comfy and flattering . The rich color adds a bit of extra sparkle for the holiday season.... \" Read more \" ...I am 5’4” and 195 and breastfeeding. This was very flattering and good quality for the price. I ordered several dresses and this was the winner. \" Read more \" ...The cut of the dress is very flattering and the length is just right. I ordered an extra large and am 5’7” and 155 lbs.... \" Read more \" I was skeptical but this is super flattering and really cute. It’s a good length and provides good coverage.... \" Read more 18 customers mention size, 14 positive, 4 negative 18 customers mention \"Size\" 14 positive 4 negative Customers find the dress true-to-size, with one mentioning it is surprisingly spacious. \" This dress is wonderful. True to size . I got one for me and my daughter. So pretty on. Perfect to dress up with fur coat for special occasion.... \" Read more \" Dress was very true to size and color was beautiful. Well made, but light weight. A bit long on a 5 foot frame, otherwise fit. \" Read more \" ...This dress is comfortable, flattering, true-to-size , and looks great for the office or a date night. And it has pockets! \" Read more \" I wear a 36A bra, and this dress was huge and baggy in the chest area.... \" Read more 18 customers mention softness, 18 positive, 0 negative 18 customers mention \"Softness\" 18 positive 0 negative Customers find the dress super soft and appreciate its great feel, with one customer noting its awesome color and texture. \" ...The fit is great for hiding my mommy pouch too. It’s soft , and the color is beautiful. I got a Medium- 5’1”, 130 pounds, A bra.... \" Read more \" This velvet dress is absolutely perfect for Christmas! The fabric is so soft and luxe, giving it a really festive feel without being over-the-top.... \" Read more \" ...The material was soft and it had a good thickness for winter. \" Read more \" Love how it fits. The color is pretty and the material soft and stretchy \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars I LOVE This Dress!",
        "body": "The media could not be loaded. This dress is absolutely stunning in person. It is a beautiful green color. It is a short sleeve dress that hits above the knee. I am 5‘2“, weigh 100 pounds, and I’m typically a size small. I ordered a size small and it fit perfectly. It has pockets and is very flowy. It is a pull on dress, there are no buttons or zippers. It is very roomy and has some stretch to it. The dress is wrinkle resistant, when I pulled it out of the bag it did not need to be ironed. The dress is not very heavy at all for being a velour dress. The material is not very thick, so it may not offer a lot of warmth in the colder months. The dress is not see-through at all. The quality of this dress is excellent. It is a great value for the money and I highly recommend it! Read more",
        "author": "Tracy Rainey",
        "rating": 5.0,
        "date": "November 3, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/710d9iGYdEL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Elegance Meets Comfort",
        "body": "I recently wore the Simplee Women's 2024 Velvet Short Sleeve Cocktail Dress for our Christmas pictures , and I was absolutely thrilled with my choice! This dress is the perfect blend of elegance and comfort, making it an ideal option for festive special occasions. The velvet fabric is incredibly soft and luxurious, providing a beautiful drape that flatters the figure. The V-neck design and empire waist create a lovely silhouette that accentuates the waist while allowing for easy movement. I felt both stylish and comfortable throughout! One of my favorite features has to be the pockets! They are surprisingly spacious and perfect for stashing away small essentials like my phone and lipstick without needing to carry a clutch. It’s a small detail that made a big difference in my overall experience. The short sleeves are perfect for the winter season, providing just the right amount of coverage while still looking chic. The rich color options available add a festive touch, making it easy to stand out at any holiday gathering. Overall, I highly recommend the Simplee Velvet Cocktail Dress to anyone looking for a stylish and practical outfit for winter celebrations. It’s a beautiful dress that I know I’ll be wearing for years to come! Read more",
        "author": "elbell78636",
        "rating": 5.0,
        "date": "December 19, 2024",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Great value and style",
        "body": "I was skeptical but this is super flattering and really cute. It’s a good length and provides good coverage. The color is beautiful and it feels like great quality. Bonus that it’s super comfortable and soft Read more",
        "author": "LFM",
        "rating": 5.0,
        "date": "September 26, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Good dress!",
        "body": "I really loved the softness of this dress. The fit is flattering and the dress is light but not too light to where it wouldn’t be somewhat warm for fall. It’s breathable and a great length. I returned this dress personally because I’m very chest heavy and I did not like how it sat on me. This is not a knock to the dress, but for what I’m looking for in a dress this was not the best choice for my taste. I do what I can for my chest to appear smaller and this dress wasn’t for me for that reason but it was still a very pretty dress! Worth buying and honestly if I got it in another color that was more complementary to my skin tone (also my bad, not the company’s fault) then I may have been more willing to overlook my chest in it. Read more",
        "author": "Kate M",
        "rating": 4.0,
        "date": "November 1, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Quality & Stylish",
        "body": "Majestic! Do not hesitate, worth every penny!!!!! I'm 5'4 / 180 and got the XL, flatters everywhere it should! Not lowcut, super comfortable & the blue color is gorgeous. I definitely need more crush velvet in my life. Read more",
        "author": "Alicia",
        "rating": 5.0,
        "date": "October 2, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Cute dress",
        "body": "I absolutely love this dress! It is so comfortable and fits in a very flattering way. I love the velvet material. I highly recommend it. It is great for the fall and winter! Read more",
        "author": "Jillian",
        "rating": 5.0,
        "date": "October 21, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Great dress",
        "body": "True to fit and looks and feels amazing Read more",
        "author": "Johanna NY",
        "rating": 5.0,
        "date": "December 14, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Cute",
        "body": "I thought it was very cute . The neck was perfect not to deep.. The dress was very comfy . Im 5'1 and about 150 bigger then I've been in years so i wasn't expectedto get dressed up . This dress was the right fit for me . I wear it with a black belt and black boots . Read more",
        "author": "kskkd",
        "rating": 5.0,
        "date": "December 14, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Dress V Neck Cocktail Short Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.",
  "about_this_item": "Womens Dress V Neck Cocktail Short Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.",
  "long_description": "Womens Dress V Neck Cocktail Short Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: 2-burnout Dark Blue, #Burnt Orange, 2-burnout Dark Green, 3-burnout Dark Green, 3-burnout Dusty Blue, 2-burnout Dusty Blue, 3-burnout Black, 3-burnout Red, #Black, #Dusty Blue, #Burgundy, #Coffee, #Green, 3-burnout Grayish Blue. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Dress V Neck Cocktail Short Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: 2-burnout Dark Blue, #Burnt Orange, 2-burnout Dark Green, 3-burnout Dark Green, 3-burnout Dusty Blue, 2-burnout Dusty Blue, 3-burnout Black, 3-burnout Red, #Black, #Dusty Blue, #Burgundy, #Coffee, #Green, 3-burnout Grayish Blue. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "823b54ae-8fd2-47a1-849a-478befa267a1",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/823b54ae-8fd2-47a1-849a-478befa267a1/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/823b54ae-8fd2-47a1-849a-478befa267a1/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "38f3ee86-f1a6-4813-b886-87f7010a1045",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/38f3ee86-f1a6-4813-b886-87f7010a1045/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/38f3ee86-f1a6-4813-b886-87f7010a1045/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "7fe25fdb-ef54-4aba-9e84-c1a2190f9ca5",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7fe25fdb-ef54-4aba-9e84-c1a2190f9ca5/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7fe25fdb-ef54-4aba-9e84-c1a2190f9ca5/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "f0853c5c-3e9d-4af0-b0fb-b61071e5d31c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f0853c5c-3e9d-4af0-b0fb-b61071e5d31c/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f0853c5c-3e9d-4af0-b0fb-b61071e5d31c/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "37b0245e-2cfb-4974-9e2f-9f24ca8c5ce3",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/37b0245e-2cfb-4974-9e2f-9f24ca8c5ce3/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/37b0245e-2cfb-4974-9e2f-9f24ca8c5ce3/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "3f799371-58f7-48bc-b531-1d4feb8cc703",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3f799371-58f7-48bc-b531-1d4feb8cc703/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3f799371-58f7-48bc-b531-1d4feb8cc703/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "f321d520-0939-47cf-ad18-97f415e0154e",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f321d520-0939-47cf-ad18-97f415e0154e/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f321d520-0939-47cf-ad18-97f415e0154e/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "27fc4dc8-4f66-4a8b-ac61-150f428cfb51",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/27fc4dc8-4f66-4a8b-ac61-150f428cfb51/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/27fc4dc8-4f66-4a8b-ac61-150f428cfb51/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "e7626dff-e69e-452e-88ad-f2e414e1b4b9",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e7626dff-e69e-452e-88ad-f2e414e1b4b9/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e7626dff-e69e-452e-88ad-f2e414e1b4b9/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "2a3011f8-c7ba-4e8a-8825-effb0dcae631",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2a3011f8-c7ba-4e8a-8825-effb0dcae631/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2a3011f8-c7ba-4e8a-8825-effb0dcae631/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "4b6f3829-c0c9-4b91-89e9-ac967d44d6ba",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4b6f3829-c0c9-4b91-89e9-ac967d44d6ba/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4b6f3829-c0c9-4b91-89e9-ac967d44d6ba/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "ab28b147-6b1b-4270-999e-2e623b0436f9",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ab28b147-6b1b-4270-999e-2e623b0436f9/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ab28b147-6b1b-4270-999e-2e623b0436f9/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "2-burnout Dark Blue": "https://m.media-amazon.com/images/I/41V-Qx58R6L._AC_SR38,50_.jpg",
    "#Burnt Orange": "https://m.media-amazon.com/images/I/41bzeyP1kVL._AC_SR38,50_.jpg",
    "2-burnout Dark Green": "https://m.media-amazon.com/images/I/41iEeKk6QRL._AC_SR38,50_.jpg",
    "3-burnout Dark Green": "https://m.media-amazon.com/images/I/41kATrV3uBL._AC_SR38,50_.jpg",
    "3-burnout Dusty Blue": "https://m.media-amazon.com/images/I/51tJePuKGZL._AC_SR38,50_.jpg",
    "2-burnout Dusty Blue": "https://m.media-amazon.com/images/I/41NnG6J-l8L._AC_SR38,50_.jpg",
    "3-burnout Black": "https://m.media-amazon.com/images/I/41JMJ6kgwpL._AC_SR38,50_.jpg",
    "3-burnout Red": "https://m.media-amazon.com/images/I/41cAlWNSjDL._AC_SR38,50_.jpg",
    "#Black": "https://m.media-amazon.com/images/I/41wbaWPPpdL._AC_SR38,50_.jpg",
    "#Dusty Blue": "https://m.media-amazon.com/images/I/411+JGHPRkL._AC_SR38,50_.jpg",
    "#Burgundy": "https://m.media-amazon.com/images/I/41Cg4XpX5JL._AC_SR38,50_.jpg",
    "#Coffee": "https://m.media-amazon.com/images/I/41OIsyIRcQL._AC_SR38,50_.jpg",
    "#Green": "https://m.media-amazon.com/images/I/41SLbkdCjTL._AC_SR38,50_.jpg",
    "3-burnout Grayish Blue": "https://m.media-amazon.com/images/I/51BIgAOc2tL._AC_SR38,50_.jpg",
    "#Teal Blue": "https://m.media-amazon.com/images/I/41zs9eWQZ0L._AC_SR38,50_.jpg",
    "2-burnout Tangerine": "https://m.media-amazon.com/images/I/41+wB8y97SL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "2-burnout Dark Blue": "71l8zbpuT-L",
    "#Burnt Orange": "71CnA7Ql4DL",
    "2-burnout Dark Green": "71be3sxdiiL",
    "3-burnout Dark Green": "81e268rUIsL",
    "3-burnout Dusty Blue": "81R2utDv+XL",
    "2-burnout Dusty Blue": "71KTP8PvEZL",
    "3-burnout Black": "81zkV4ouATL",
    "3-burnout Red": "81785DgJz+L",
    "#Black": "71gIlsbxO2L",
    "#Dusty Blue": "71ClNbeaFKL",
    "#Burgundy": "7182SJYisFL",
    "#Coffee": "81p6ZIN0nlL",
    "#Green": "711HWxZc3XL",
    "3-burnout Grayish Blue": "81jAhczNIgL",
    "#Teal Blue": "71aLu2uKnBL",
    "2-burnout Tangerine": "71J0W6QbToL"
  },
  "color_images": {
    "2-burnout Dark Blue": [
      "https://m.media-amazon.com/images/I/71l8zbpuT-L._SL1500_.jpg"
    ],
    "#Burnt Orange": [
      "https://m.media-amazon.com/images/I/71CnA7Ql4DL._SL1500_.jpg"
    ],
    "2-burnout Dark Green": [
      "https://m.media-amazon.com/images/I/71be3sxdiiL._SL1500_.jpg"
    ],
    "3-burnout Dark Green": [
      "https://m.media-amazon.com/images/I/81e268rUIsL._SL1500_.jpg"
    ],
    "3-burnout Dusty Blue": [
      "https://m.media-amazon.com/images/I/81R2utDv+XL._SL1500_.jpg"
    ],
    "2-burnout Dusty Blue": [
      "https://m.media-amazon.com/images/I/71KTP8PvEZL._SL1500_.jpg"
    ],
    "3-burnout Black": [
      "https://m.media-amazon.com/images/I/81zkV4ouATL._SL1500_.jpg"
    ],
    "3-burnout Red": [
      "https://m.media-amazon.com/images/I/81785DgJz+L._SL1500_.jpg"
    ],
    "#Black": [
      "https://m.media-amazon.com/images/I/71gIlsbxO2L._SL1500_.jpg"
    ],
    "#Dusty Blue": [
      "https://m.media-amazon.com/images/I/71ClNbeaFKL._SL1500_.jpg"
    ],
    "#Burgundy": [
      "https://m.media-amazon.com/images/I/7182SJYisFL._SL1500_.jpg"
    ],
    "#Coffee": [
      "https://m.media-amazon.com/images/I/81p6ZIN0nlL._SL1500_.jpg"
    ],
    "#Green": [
      "https://m.media-amazon.com/images/I/711HWxZc3XL._SL1500_.jpg"
    ],
    "3-burnout Grayish Blue": [
      "https://m.media-amazon.com/images/I/81jAhczNIgL._SL1500_.jpg"
    ],
    "#Teal Blue": [
      "https://m.media-amazon.com/images/I/71aLu2uKnBL._SL1500_.jpg"
    ],
    "2-burnout Tangerine": [
      "https://m.media-amazon.com/images/I/71J0W6QbToL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress-formal",
      "title": "Womens Dress Formal",
      "price": 85.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51hE6Omu-IL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-ruched-cocktail",
      "title": "Womens Dress Ruched Cocktail",
      "price": 47.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/81-Vk1vn3WL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-v-neck-long-sleeve",
      "title": "Womens Maxi Dress V Neck Long Sleeve",
      "price": 38.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/611UO7G9J8L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-v-neck-long-sleeve",
      "title": "Womens Maxi Dress V Neck Long Sleeve",
      "price": 28.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71K7SViYxIL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-long-sleeve-bodycon-maxi-ruched",
      "title": "Womens Maxi Dress Formal Long Sleeve Bodycon Maxi Ruched",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61bpONagFML._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-ruched-bodycon-long-sleeve-boat-neck",
      "title": "Womens Maxi Dress Ruched Bodycon Long Sleeve Boat Neck",
      "price": 36.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/61ZjslcbrfL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 36.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/610h42KQ0kL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 174.91,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71SN6Oih0hL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-sleeveless-maxi",
      "title": "Womens Maxi Dress Sleeveless Maxi",
      "price": 31.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51Ku04XAvEL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon",
      "title": "Womens Maxi Dress Bodycon",
      "price": 35.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/61JixFiTaIL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-sleeveless-formal",
      "title": "Womens Dress Sleeveless Formal",
      "price": 29.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51oEKzUKkcL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-long-sleeve-mermaid-evening-maxi",
      "title": "Womens Maxi Dress Formal Long Sleeve Mermaid Evening Maxi",
      "price": 72.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51BTOKJlAdL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-one-shoulder-evening-mermaid-bodycon-formal-long-sleeve",
      "title": "Womens Maxi Dress One Shoulder Evening Mermaid Bodycon Formal Long Sleeve",
      "price": 69.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61RJU+0VaaL._SL1500_.jpg"
      ]
    }
  ]
}