{
  "id": "womens-dress",
  "handle": "womens-dress",
  "sku": "JC3198",
  "asin": "B0D4583HL1",
  "title": "Womens Dress",
  "title_original": "Zeagoo Women's Knit Dress with Puff Sleeves for Fall & Winter - Round Neck Casual Tunic Dress",
  "brand": "Visit the Zeagoo Store",
  "price": 36.99,
  "social_proof": {
    "bought_past_month": 353,
    "text": "353+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/81jQpE2tOrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/719aDMlqZHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71yie2kqzDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71fiEqTu-EL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/8186tTDr1XL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81kRkKqY0ML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81ji5KAQNbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81730Xom5DL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81sbtfj2jQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81BfsEHMvqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81c29FusrkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91uUVihnRFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/817PqPUddLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/816t0QxltKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81yogm3szbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81DiUB1BlqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81G8qRD2gzL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81HjTJYTifL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/8137b0dafgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81VYwqGkB3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81eKOeGlqoL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81pY+RFca5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/817mPCcIYmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81KXyqwc6AL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/81jQpE2tOrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/719aDMlqZHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71yie2kqzDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71fiEqTu-EL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/8186tTDr1XL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81kRkKqY0ML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81ji5KAQNbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81730Xom5DL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81sbtfj2jQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81BfsEHMvqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81c29FusrkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91uUVihnRFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/817PqPUddLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/816t0QxltKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81yogm3szbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81DiUB1BlqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81G8qRD2gzL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81HjTJYTifL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/8137b0dafgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81VYwqGkB3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81eKOeGlqoL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81pY+RFca5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/817mPCcIYmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81KXyqwc6AL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ May 14, 2024",
    "ASIN ‏": "‎ B0D4598G87",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#14,280 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #102 in Women's Casual Dresses",
    "Customer Reviews": "4.1 4.1 out of 5 stars (740)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Light Brown",
      "Brown",
      "Deep Green",
      "A-black",
      "Blue",
      "Deep Red",
      "Mid Grey",
      "Burgundy",
      "Burnt Orange",
      "Dark Grey",
      "Army Green",
      "Coffee",
      "Navy Blue",
      "Khaki",
      "Pale Pink",
      "Blue Green",
      "Mauve",
      "Light Pink",
      "Rose Pink",
      "Caramel"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.1,
    "count": 740,
    "customers_say": "Customers find the dress cute for cooler weather, with a perfect knee-length fit and well-made construction. The dress is soft and comfortable, with one customer noting it's great for wearing with boots. The material quality receives positive feedback, with customers describing it as solid and smooth. While some it's true to size, others find it too short, and the material thickness receives mixed reviews with several noting it's thin. Select to learn more Style Fit Quality Comfort Fabric softness Material quality Size Material thickness 91 customers mention \"Style\" 87 positive 4 negative Customers find the dress adorable and cute for cooler weather, with one customer noting that it maintains its appearance after washing. \"This dress is so cute and stylish. I am 5’4 and ordered a medium. It falls about knee length and flows nicely without feeling clingy....\" Read more \" Beautiful dress . Fit perfectly Great for church and work.\" Read more \" Super cute but not very flattering. Good quality overall. Would not buy again if I’m being honest.\" Read more \" Cute dress , but it hugs your stomach and is not flattering, it looks loose online but it is actually very form fitting....\" Read more 80 customers mention \"Fit\" 63 positive 17 negative Customers are satisfied with how the dress fits, particularly noting its perfect length and longer style, with one customer mentioning it hits just above the knees. \" Great fit , not clingy! Very flattering! Can't wait for the weather to get cool so I can wear it!\" Read more \"Warm and attractive. I wore it to church. Fits well . Fabric is not too heavy and will last. Comfortable with pockets!\" Read more \"I liked this dress so much I ordered a second one. Perfect fit and I’m a petite. Soft, flowing fabric....\" Read more \"The dress looked OK but the material was very thin. It did not fit well as it ran smaller than most things I have ordered. I did send it back....\" Read more 70 customers mention \"Quality\" 66 positive 4 negative Customers praise the dress's quality, noting its well-made construction and suitable fabric for fall wear. \"...My husband didn’t like the puffy sleeves but I thought it was a great dress . Add some tall boots and a hat and it’s a great fall pic outfit.\" Read more \" Love this dress . Exactly as shown. Very comfortable. Several compliment.s. Thinking u need another commit\" Read more \" Love the dress . I am a larger gal and felt pretty dressed up for a princess party for my niece....\" Read more \"It’s a nice dress , wife likes it very much.\" Read more 64 customers mention \"Comfort\" 59 positive 5 negative Customers find the dress comfortable, with one mentioning it has pockets. \"This dress is so perfect! It’s so soft and comfortable , the length is mid thigh, and I have worn it a few times with leggings and boots to work....\" Read more \"...I added a thick belt to it and got so many compliments on it. Very comfortable . Soft and warm. Easy to wash. Color was what you see in the picture.\" Read more \"Great fitting and comfy . Hood value. It has pockets. Will go nicely with tights and knee high boots! Fits well according to size.\" Read more \" So comfortable will look great with a pair of boots. Not heavy at all size is a true size\" Read more 33 customers mention \"Fabric softness\" 27 positive 6 negative Customers find the dress soft and comfortable. \"This dress is so perfect! It’s so soft and comfortable, the length is mid thigh, and I have worn it a few times with leggings and boots to work....\" Read more \"This dress is super cute and very comfortable. The fabric is soft . Love that it has pockets!...\" Read more \"This dress is very cute with boots. The sizing was true. The fabric is buttery soft and the color was great. it is a great dress over all....\" Read more \"...Fits like expected and fabric is super soft .\" Read more 33 customers mention \"Material quality\" 25 positive 8 negative Customers love the material of the dress, finding it solid and smooth, with one customer noting its breathable properties. \"...It is good material , it's the right length (with knee high boots of course) and its gives classy with a dash of sexy!\" Read more \"So cute. Very plain which is what I like. Love the material . Put a necklace with it an it is classy. Love the sleeves too\" Read more \"...Fits as expected Good length, just below my knees Nice material Price is right for such quality...\" Read more \"Very thin, flimsy material . Not as expected.\" Read more 69 customers mention \"Size\" 43 positive 26 negative Customers have mixed opinions about the dress size, with some finding it true to size and perfect length, while others report it being too short, particularly noting that the sleeves are insufficient. \"...I would say the sizing was also perfect for me and true to size . I wore it to church with boots and leggings and got so many compliments....\" Read more \"This dress is awful! Itchy cheap thin clingy material ! The sleeves are too short , it’s too tight all over and I ordered my regular size....\" Read more \" Size down !!\" Read more \"Nice quality. Runs big .\" Read more 35 customers mention \"Material thickness\" 14 positive 21 negative Customers have mixed opinions about the dress's material thickness, with several noting it is thin, while one customer mentions it is thick enough to not be see-through. \" Thin material so it will need a slip or something underneath. Very cute dress. True to size.\" Read more \"Ran large also very thin material See through\" Read more \"I was disappointed that it isn’t a flattering look for me. The material is thin but soft and comfortable. Leggings are a must....\" Read more \" Very thin . Fits great! I will be getting a top to go under or a long vest to go over.\" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Very pretty",
        "body": "I just love this knit dress. The chocolate color is so rich looking. True to size. I am 5’4” and it hits just above the knee. I ordered the medium which I usually wear. I got so many complements on it at our photo shoot. It is well made. Read more",
        "author": "Paul T Currie",
        "rating": 5.0,
        "date": "October 23, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Great value!",
        "body": "I am 5’6” wear a size medium weigh 140 lbs and it fits perfectly. It comes just to my knee. This dress is comfortable, soft and warm. It is not very thick material but looks good with my boots. Great price and quality. Fabric is thick enough to not see through and I LOVE that it has pockets!great little knock around dress! Read more",
        "author": "Angie C",
        "rating": 5.0,
        "date": "January 23, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Nice dress",
        "body": "Super cute dress. Comfortable, thin material. Good for the south as it gets chilly. Read more",
        "author": "Michelle C Rivera",
        "rating": 4.0,
        "date": "December 13, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Love this dress!",
        "body": "This dress is so cute and stylish. I am 5’4 and ordered a medium. It falls about knee length and flows nicely without feeling clingy. I wore this with tall boots and it looked really cute. I received several compliments regarding the style and elegance of the sleeves. Read more",
        "author": "Melissa Tobin",
        "rating": 5.0,
        "date": "November 28, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Sleeves are too short",
        "body": "It is cute, but the sleeves are too short and make it awkward and uncomfortable to wear. The dress fits overall, so it’s not that I ordered the wrong size. Read more",
        "author": "Tiffany",
        "rating": 3.0,
        "date": "June 6, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Holiday Cheers!",
        "body": "This was a great dress for my company holiday lunch. Soft, comfortable, breathable material that is flattering with pockets. Read more",
        "author": "Misty Emey",
        "rating": 5.0,
        "date": "December 11, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71bdfxyxj9L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Nic winter dress.",
        "body": "Fit is as expected; Fabric on the thin side, but otherwise fine. Color true to picture. Read more",
        "author": "Rebecca Doran",
        "rating": 5.0,
        "date": "December 14, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Pretty dress for Fall",
        "body": "I love the shade of green! Perfect for Fall. The fabric isn’t as soft as I like, but it’s very comfortable. True to size. Even the sleeves are long enough. Read more",
        "author": "Customer",
        "rating": 5.0,
        "date": "November 5, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Dress is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.",
  "about_this_item": "Womens Dress is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.",
  "long_description": "Womens Dress is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Light Brown, Brown, Deep Green, A-black, Blue, Deep Red, Mid Grey, Burgundy, Burnt Orange, Dark Grey, Army Green, Coffee, Navy Blue, Khaki. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Dress is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Light Brown, Brown, Deep Green, A-black, Blue, Deep Red, Mid Grey, Burgundy, Burnt Orange, Dark Grey, Army Green, Coffee, Navy Blue, Khaki. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "0f176cd7-a8ac-4ffb-b83a-dab265967647",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0f176cd7-a8ac-4ffb-b83a-dab265967647/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0f176cd7-a8ac-4ffb-b83a-dab265967647/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/8e7ff294-5e15-4935-a81c-b720ffb8c3ae.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "e5c1aaab-32e2-4375-813f-e6f8acb11300",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e5c1aaab-32e2-4375-813f-e6f8acb11300/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e5c1aaab-32e2-4375-813f-e6f8acb11300/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/8e7ff294-5e15-4935-a81c-b720ffb8c3ae.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "7cb60491-9d6f-436e-8702-73e4af8b6d17",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7cb60491-9d6f-436e-8702-73e4af8b6d17/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7cb60491-9d6f-436e-8702-73e4af8b6d17/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/8e7ff294-5e15-4935-a81c-b720ffb8c3ae.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "e1a6cc3c-2f3b-4ef0-90ba-9d663d497e2c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e1a6cc3c-2f3b-4ef0-90ba-9d663d497e2c/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e1a6cc3c-2f3b-4ef0-90ba-9d663d497e2c/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/8e7ff294-5e15-4935-a81c-b720ffb8c3ae.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "863615d9-aea1-49cf-a8e1-d887ec2253f5",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/863615d9-aea1-49cf-a8e1-d887ec2253f5/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/863615d9-aea1-49cf-a8e1-d887ec2253f5/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/8e7ff294-5e15-4935-a81c-b720ffb8c3ae.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "7fc04c93-8679-4534-b37e-c49813bd89e6",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7fc04c93-8679-4534-b37e-c49813bd89e6/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7fc04c93-8679-4534-b37e-c49813bd89e6/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/8e7ff294-5e15-4935-a81c-b720ffb8c3ae.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "471bd608-e9ef-45f0-af17-24c59c9dcc0f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/471bd608-e9ef-45f0-af17-24c59c9dcc0f/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/471bd608-e9ef-45f0-af17-24c59c9dcc0f/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/8e7ff294-5e15-4935-a81c-b720ffb8c3ae.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "88636fab-6d60-4594-ac6c-a8e0d57f2080",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/88636fab-6d60-4594-ac6c-a8e0d57f2080/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/88636fab-6d60-4594-ac6c-a8e0d57f2080/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/8e7ff294-5e15-4935-a81c-b720ffb8c3ae.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "a5b7230d-d9a9-42c3-a934-26f94e0c1633",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a5b7230d-d9a9-42c3-a934-26f94e0c1633/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a5b7230d-d9a9-42c3-a934-26f94e0c1633/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/8e7ff294-5e15-4935-a81c-b720ffb8c3ae.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "7457fa2d-f66f-482c-a7db-daa03c3435c1",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7457fa2d-f66f-482c-a7db-daa03c3435c1/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7457fa2d-f66f-482c-a7db-daa03c3435c1/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/8e7ff294-5e15-4935-a81c-b720ffb8c3ae.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "9cfdc2bd-508d-4bf6-8cff-a09e1f3732fb",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9cfdc2bd-508d-4bf6-8cff-a09e1f3732fb/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9cfdc2bd-508d-4bf6-8cff-a09e1f3732fb/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/8e7ff294-5e15-4935-a81c-b720ffb8c3ae.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "548e9c79-f6bd-412f-aae1-91b4d6290e9a",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/548e9c79-f6bd-412f-aae1-91b4d6290e9a/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/548e9c79-f6bd-412f-aae1-91b4d6290e9a/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/8e7ff294-5e15-4935-a81c-b720ffb8c3ae.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Light Brown": "https://m.media-amazon.com/images/I/41ipHsSsYtL._AC_SR38,50_.jpg",
    "Brown": "https://m.media-amazon.com/images/I/41ADUy8vNtL._AC_SR38,50_.jpg",
    "Deep Green": "https://m.media-amazon.com/images/I/412qaJUXW4L._AC_SR38,50_.jpg",
    "A-black": "https://m.media-amazon.com/images/I/41CCf+6h3lL._AC_SR38,50_.jpg",
    "Blue": "https://m.media-amazon.com/images/I/51eNuyhBqkL._AC_SR38,50_.jpg",
    "Deep Red": "https://m.media-amazon.com/images/I/41hAD1seyLL._AC_SR38,50_.jpg",
    "Mid Grey": "https://m.media-amazon.com/images/I/51t9egEWB6L._AC_SR38,50_.jpg",
    "Burgundy": "https://m.media-amazon.com/images/I/41BmPldB4qL._AC_SR38,50_.jpg",
    "Burnt Orange": "https://m.media-amazon.com/images/I/41ggiLqR1sL._AC_SR38,50_.jpg",
    "Dark Grey": "https://m.media-amazon.com/images/I/41lgq65ZfkL._AC_SR38,50_.jpg",
    "Army Green": "https://m.media-amazon.com/images/I/41wUcRu5XaL._AC_SR38,50_.jpg",
    "Coffee": "https://m.media-amazon.com/images/I/41adUkZpJ4L._AC_SR38,50_.jpg",
    "Navy Blue": "https://m.media-amazon.com/images/I/41Cu1lXc4WL._AC_SR38,50_.jpg",
    "Khaki": "https://m.media-amazon.com/images/I/41u3Jl--oUL._AC_SR38,50_.jpg",
    "Pale Pink": "https://m.media-amazon.com/images/I/411HiPKm2SL._AC_SR38,50_.jpg",
    "Blue Green": "https://m.media-amazon.com/images/I/41rp803-2LL._AC_SR38,50_.jpg",
    "Mauve": "https://m.media-amazon.com/images/I/41+WIeSVerL._AC_SR38,50_.jpg",
    "Light Pink": "https://m.media-amazon.com/images/I/418qsFuereL._AC_SR38,50_.jpg",
    "Rose Pink": "https://m.media-amazon.com/images/I/41lcqLSsC+L._AC_SR38,50_.jpg",
    "Caramel": "https://m.media-amazon.com/images/I/41GIIxAdx8L._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Light Brown": "81kRkKqY0ML",
    "Brown": "81ji5KAQNbL",
    "Deep Green": "81730Xom5DL",
    "A-black": "81sbtfj2jQL",
    "Blue": "81BfsEHMvqL",
    "Deep Red": "81c29FusrkL",
    "Mid Grey": "91uUVihnRFL",
    "Burgundy": "81jQpE2tOrL",
    "Burnt Orange": "817PqPUddLL",
    "Dark Grey": "816t0QxltKL",
    "Army Green": "81yogm3szbL",
    "Coffee": "81DiUB1BlqL",
    "Navy Blue": "81G8qRD2gzL",
    "Khaki": "81HjTJYTifL",
    "Pale Pink": "8137b0dafgL",
    "Blue Green": "81VYwqGkB3L",
    "Mauve": "81eKOeGlqoL",
    "Light Pink": "81pY+RFca5L",
    "Rose Pink": "817mPCcIYmL",
    "Caramel": "81KXyqwc6AL"
  },
  "color_images": {
    "Light Brown": [
      "https://m.media-amazon.com/images/I/81kRkKqY0ML._SL1500_.jpg"
    ],
    "Brown": [
      "https://m.media-amazon.com/images/I/81ji5KAQNbL._SL1500_.jpg"
    ],
    "Deep Green": [
      "https://m.media-amazon.com/images/I/81730Xom5DL._SL1500_.jpg"
    ],
    "A-black": [
      "https://m.media-amazon.com/images/I/81sbtfj2jQL._SL1500_.jpg"
    ],
    "Blue": [
      "https://m.media-amazon.com/images/I/81BfsEHMvqL._SL1500_.jpg"
    ],
    "Deep Red": [
      "https://m.media-amazon.com/images/I/81c29FusrkL._SL1500_.jpg"
    ],
    "Mid Grey": [
      "https://m.media-amazon.com/images/I/91uUVihnRFL._SL1500_.jpg"
    ],
    "Burgundy": [
      "https://m.media-amazon.com/images/I/81jQpE2tOrL._SL1500_.jpg"
    ],
    "Burnt Orange": [
      "https://m.media-amazon.com/images/I/817PqPUddLL._SL1500_.jpg"
    ],
    "Dark Grey": [
      "https://m.media-amazon.com/images/I/816t0QxltKL._SL1500_.jpg"
    ],
    "Army Green": [
      "https://m.media-amazon.com/images/I/81yogm3szbL._SL1500_.jpg"
    ],
    "Coffee": [
      "https://m.media-amazon.com/images/I/81DiUB1BlqL._SL1500_.jpg"
    ],
    "Navy Blue": [
      "https://m.media-amazon.com/images/I/81G8qRD2gzL._SL1500_.jpg"
    ],
    "Khaki": [
      "https://m.media-amazon.com/images/I/81HjTJYTifL._SL1500_.jpg"
    ],
    "Pale Pink": [
      "https://m.media-amazon.com/images/I/8137b0dafgL._SL1500_.jpg"
    ],
    "Blue Green": [
      "https://m.media-amazon.com/images/I/81VYwqGkB3L._SL1500_.jpg"
    ],
    "Mauve": [
      "https://m.media-amazon.com/images/I/81eKOeGlqoL._SL1500_.jpg"
    ],
    "Light Pink": [
      "https://m.media-amazon.com/images/I/81pY+RFca5L._SL1500_.jpg"
    ],
    "Rose Pink": [
      "https://m.media-amazon.com/images/I/817mPCcIYmL._SL1500_.jpg"
    ],
    "Caramel": [
      "https://m.media-amazon.com/images/I/81KXyqwc6AL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-sleeveless-maxi",
      "title": "Womens Maxi Dress Sleeveless Maxi",
      "price": 48.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71qwUjryGiL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 43.69,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61-pFN+nfgL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-bodycon",
      "title": "Womens Maxi Dress Maxi Bodycon",
      "price": 36.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61o6MKJoZLL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-one-shoulder-formal-mermaid-bodycon-evening-maxi",
      "title": "Womens Maxi Dress One Shoulder Formal Mermaid Bodycon Evening Maxi",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71mgUBuGwhL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-v-neck-short-sleeve",
      "title": "Womens Dress V Neck Short Sleeve",
      "price": 34.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71T+iJeFITL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress-cocktail-ruched-evening-split",
      "title": "Womens Dress Cocktail Ruched Evening Split",
      "price": 29.69,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/61003bnFhAS._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-maxi",
      "title": "Womens Maxi Dress Formal Maxi",
      "price": 64.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/61RWPo72AmL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-mermaid-one-shoulder",
      "title": "Womens Maxi Dress Mermaid One Shoulder",
      "price": 238.74,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51lR3NNtXCL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-maxi-formal-long-sleeve-v-neck",
      "title": "Womens Maxi Dress Cocktail Maxi Formal Long Sleeve V Neck",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61cfJoIR5bL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-bodycon-ruched",
      "title": "Womens Maxi Dress Cocktail Bodycon Ruched",
      "price": 49.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51+rVhgLHSL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-formal",
      "title": "Womens Dress Formal",
      "price": 75.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51TVxkZ3J2L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening",
      "title": "Womens Maxi Dress Formal Evening",
      "price": 64.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/516ScMrYzlL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-ruched-bodycon-v-neck",
      "title": "Womens Maxi Dress Long Sleeve Ruched Bodycon V Neck",
      "price": 33.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51AvldIvTmL._SL1500_.jpg"
      ]
    }
  ]
}