{
  "id": "womens-maxi-dress-v-neck-bodycon-long-sleeve-formal",
  "handle": "womens-maxi-dress-v-neck-bodycon-long-sleeve-formal",
  "sku": "JC2250",
  "asin": "B0D5D6T1ZT",
  "title": "Womens Maxi Dress V Neck Bodycon Long Sleeve Formal",
  "title_original": "Popilush Shapewear Dress V Neck Formal Wedding Midi Dress Built in Shapewear for Women Long Sleeve Bodycon Dress",
  "brand": "Visit the Popilush Store",
  "price": 88.99,
  "social_proof": {
    "bought_past_month": 412,
    "text": "412+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/71TElwJ4rQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/713i-X4xyyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71oWmEJqqnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81ajd5tks+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71a4Tk+LgYL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71i5SkwZTzL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/713iRwDUWrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81xbTIjcvzL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/71TElwJ4rQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/713i-X4xyyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71oWmEJqqnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81ajd5tks+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71a4Tk+LgYL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71i5SkwZTzL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/713iRwDUWrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81xbTIjcvzL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ March 17, 2024",
    "ASIN ‏": "‎ B0CY9MVBK6",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#289,145 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #2,408 in Women's Club & Night Out Dresses",
    "Customer Reviews": "4.2 4.2 out of 5 stars (58)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Red",
      "Black"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.2,
    "count": 58,
    "customers_say": "Customers find the dress fits beautifully and is comfortable, with one mentioning it sucks everything in without being too tight. They appreciate its style, with one noting it can be dressed up for dinner out, and they like the shapewear feature, with one describing it as a genius addition. The dress receives positive feedback for its quality, with one mentioning it's perfect for a night out in Vegas, and customers like its size, with one noting it makes them look at least a size smaller. The material quality receives mixed reviews, and several customers find it difficult to get on. Generated from the text of customer reviews Select to learn more Quality (10) Fit (8) Comfort (7) Style (7) Shape wear (5) Size (3) Material quality (3) Ease of putting on (6) 10 customers mention quality, 10 positive, 0 negative 10 customers mention \"Quality\" 10 positive 0 negative Customers find the dress to be of good quality, with one mentioning it's perfect for a night out in Vegas. \" Great dress with built in support... \" Read more \" LOVE THIS DRESS . Made my shape look amazing! Also pretty comfy \" Read more \" This dress is amazing . Beautiful!!! Material is great. True to size. Very comfy!!! \" Read more \" Got it today.. this is the best dress I’ve ever had, buy it❤️ \" Read more 8 customers mention fit, 6 positive, 2 negative 8 customers mention \"Fit\" 6 positive 2 negative Customers find that the dress fits beautifully and is flattering, with one customer noting that the shapewear works well without being too tight. \" I love this brand & this dress. It’s extremely flattering , sucks you in without being too tight, and looks very high quality, also makes your chest... \" Read more \" ...My boyfriend really liked the dress on me. It was comfortable and flattering . \" Read more \" The material looked shiny and felt cheap. The body shape wear was super tight I could barely breathe probably should have gotten a size up but... \" Read more \" ...I sized up, from an xl to 1xl. It fit beautifully . \" Read more 7 customers mention comfort, 6 positive, 1 negative 7 customers mention \"Comfort\" 6 positive 1 negative Customers find the dress comfortable. \" ...Very good smoothing. I felt amazing wearing it . It was hard to get on, but once I was in it I was good to go! \" Read more \" This dress is amazing. Beautiful!!! Material is great. True to size. Very comfy !!! \" Read more \" LOVE THIS DRESS. Made my shape look amazing! Also pretty comfy \" Read more \" ...My boyfriend really liked the dress on me. It was comfortable and flattering. \" Read more 7 customers mention style, 7 positive, 0 negative 7 customers mention \"Style\" 7 positive 0 negative Customers find the dress nice looking, with one mentioning it can be dressed up for dinner out, and another noting its high-quality appearance. \" This dress is amazing. Beautiful !!! Material is great. True to size. Very comfy!!! \" Read more \" ...It sucked me in all he right places. I love the fit, the color and the style . I made this dress look good. Haha. \" Read more \" I feel really cute in this dress. It holds everything in and makes me look at least a size smaller. Worth the money. \" Read more \" ...flattering, sucks you in without being too tight, and looks very high quality , also makes your chest look amazing.... \" Read more 5 customers mention shape wear, 5 positive, 0 negative 5 customers mention \"Shape wear\" 5 positive 0 negative Customers like the shapewear feature of the dress, with one mentioning how it enhances their appearance. \" This dress is gorgeous and gives your body a great shape . Definitely size up. It’s beautiful. \" Read more \" Love this dress. It's truly genius to incorporate the shapewear into the dress . Holds in what needs to be and holds up what needs so be.... \" Read more \" It is great quality, the shape wear was such a good addition . I wish I would have gotten a size bigger, it was a chore to get it on.... \" Read more \" ...Fabric is nice and thick and I love that there's shape wear built in . \" Read more 3 customers mention size, 3 positive, 0 negative 3 customers mention \"Size\" 3 positive 0 negative Customers like how the dress fits, with one mentioning it makes them look at least a size smaller. \" This dress is amazing. Beautiful!!! Material is great. True to size . Very comfy!!! \" Read more \" ...It holds everything in and makes me look at least a size smaller . Worth the money. \" Read more \" ...because the dress is actually very well made, and the size charts provided are very accurate .... \" Read more 3 customers mention material quality, 2 positive, 1 negative 3 customers mention \"Material quality\" 2 positive 1 negative Customers have mixed opinions about the dress's material quality. \" ... Fabric is nice and thick and I love that there's shape wear built in. \" Read more \" The material is like stretchy spandex , a little cheap for the price point.... \" Read more \" This dress is amazing. Beautiful!!! Material is great . True to size. Very comfy!!! \" Read more 6 customers mention ease of putting on, 1 positive, 5 negative 6 customers mention \"Ease of putting on\" 1 positive 5 negative Customers find the dress difficult to put on. \" ...It is kind of difficult to get into . But once you do you look great. It’s a fantastic staple piece and could be layered with jackets, etc.... \" Read more \" ...Very good smoothing. I felt amazing wearing it. It was hard to get on , but once I was in it I was good to go! \" Read more \" Love this dress. It is a bit of a challenge to put on but once it’s on, it fits like a glove.... \" Read more \" ...on these, compared to my other Popilush dresses, and it makes the shorts roll up nonstop (very annoying.) \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Beautiful!!!",
        "body": "This dress is amazing. Beautiful!!! Material is great. True to size. Very comfy!!! Read more",
        "author": "MJ Colon",
        "rating": 5.0,
        "date": "May 4, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Cute and sexy",
        "body": "Perfect dress. Hold on perfect in all the right places. Nice looking Read more",
        "author": "Nicole",
        "rating": 5.0,
        "date": "July 31, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Perfect dress for night out in Vegas",
        "body": "Love this dress. It is a bit of a challenge to put on but once it’s on, it fits like a glove. The shapewear sucks everything in and the dress is still very comfortable. For someone that has had two kids via c-section, this dress works miracles (IYKYK). I highly recommend this dress. Read more",
        "author": "Melissa I",
        "rating": 5.0,
        "date": "February 11, 2024",
        "verified": false,
        "images": []
      },
      {
        "title": "1.0 out of 5 stars Dirty Dress",
        "body": "The dress I received was used and had multiple stains on the outside of the dress, and also had deodorant stains on the inside of dress. I’m confused as to why I was shipped a used item? I paid 90 dollars for a stained used dress.. Read more",
        "author": "Alyssa J.",
        "rating": 1.0,
        "date": "August 3, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Made in China",
        "body": "Item description lists that dress was made in America Samoa. But when the dress arrived, the tag on the actual Garment says made in China. I don't know why there's dishonesty in the listing, because the dress is actually very well made, and the size charts provided are very accurate. For reference, I'm usually a US Adult Large, and I had to size up to 2XL. If you know your measurements, follow the size chart and make sure you order the size that will most likely fit you the best. Fabric is nice and thick and I love that there's shape wear built in. Read more",
        "author": "Incognito",
        "rating": 4.0,
        "date": "December 16, 2024",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Gorgeous but size up",
        "body": "This dress is gorgeous and gives your body a great shape. Definitely size up. It’s beautiful. Read more",
        "author": "Kerri H.",
        "rating": 5.0,
        "date": "December 8, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars A must staple piece",
        "body": "This brand dress comes in several different styles. It is kind of difficult to get into. But once you do you look great. It’s a fantastic staple piece and could be layered with jackets, etc. looks very professional or you can dress it up for dinner out. Read more",
        "author": "Angela Matlock",
        "rating": 5.0,
        "date": "December 14, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Worth every penny",
        "body": "I feel really cute in this dress. It holds everything in and makes me look at least a size smaller. Worth the money. Read more",
        "author": "Rachel L Nicholson",
        "rating": 5.0,
        "date": "November 7, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61Lj69oSuKL._SY88._SL1500_.jpg"
        ]
      }
    ]
  },
  "short_description": "Womens Maxi Dress V Neck Bodycon Long Sleeve Formal is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.",
  "about_this_item": "Womens Maxi Dress V Neck Bodycon Long Sleeve Formal is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.",
  "long_description": "Womens Maxi Dress V Neck Bodycon Long Sleeve Formal is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Red, Black. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress V Neck Bodycon Long Sleeve Formal is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Red, Black. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "c43cace5-c5a5-4709-b1e4-d21a951765c3",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c43cace5-c5a5-4709-b1e4-d21a951765c3/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c43cace5-c5a5-4709-b1e4-d21a951765c3/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "62d0592d-6a9d-4643-8ad5-93dae59f7b91",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/62d0592d-6a9d-4643-8ad5-93dae59f7b91/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/62d0592d-6a9d-4643-8ad5-93dae59f7b91/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "704ec1e9-cde1-4d35-9d6e-c83664c517b4",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/704ec1e9-cde1-4d35-9d6e-c83664c517b4/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/704ec1e9-cde1-4d35-9d6e-c83664c517b4/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "24be08ca-b847-4c7e-9bee-8ee639316a26",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/24be08ca-b847-4c7e-9bee-8ee639316a26/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/24be08ca-b847-4c7e-9bee-8ee639316a26/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "96b97f4d-daf6-4a66-97c2-c9570795da39",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/96b97f4d-daf6-4a66-97c2-c9570795da39/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/96b97f4d-daf6-4a66-97c2-c9570795da39/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "7a96b5c4-390d-4ba3-a017-711f0a04bc09",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7a96b5c4-390d-4ba3-a017-711f0a04bc09/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7a96b5c4-390d-4ba3-a017-711f0a04bc09/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "6ec3602d-c44c-4099-abe3-d240e54ac2a9",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6ec3602d-c44c-4099-abe3-d240e54ac2a9/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6ec3602d-c44c-4099-abe3-d240e54ac2a9/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "ae4c0fa5-9fd6-4437-91d8-d63fc70e2a39",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ae4c0fa5-9fd6-4437-91d8-d63fc70e2a39/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ae4c0fa5-9fd6-4437-91d8-d63fc70e2a39/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "d3f85bdd-c741-47bb-a9b9-8e5b5543af39",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d3f85bdd-c741-47bb-a9b9-8e5b5543af39/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d3f85bdd-c741-47bb-a9b9-8e5b5543af39/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "d26a434e-b987-4334-96bf-bc7eca397acc",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d26a434e-b987-4334-96bf-bc7eca397acc/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d26a434e-b987-4334-96bf-bc7eca397acc/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Red": "https://m.media-amazon.com/images/I/413-CLdJQBL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/41JY9r661nL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Red": "71a4Tk+LgYL",
    "Black": "71TElwJ4rQL"
  },
  "color_images": {
    "Red": [
      "https://m.media-amazon.com/images/I/71a4Tk+LgYL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71i5SkwZTzL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/713iRwDUWrL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81xbTIjcvzL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/71TElwJ4rQL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/713i-X4xyyL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71oWmEJqqnL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81ajd5tks+L._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress-cocktail",
      "title": "Womens Dress Cocktail",
      "price": 53.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/714nH89uD8L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-bodycon-ruched",
      "title": "Womens Maxi Dress Cocktail Bodycon Ruched",
      "price": 49.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51+rVhgLHSL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 46.29,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51bhkSWYLbL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-short-sleeve-cocktail-off-shoulder",
      "title": "Womens Dress Short Sleeve Cocktail Off Shoulder",
      "price": 54.96,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/51su2B1tubL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 26.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61RmKCKVLLL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-sleeveless-maxi",
      "title": "Womens Maxi Dress Sleeveless Maxi",
      "price": 45.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61ZBGFlcDaL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail",
      "title": "Womens Dress Cocktail",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71qK1FMWZnL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-formal",
      "title": "Womens Dress Formal",
      "price": 89.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/615KFis5FsL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-long-sleeve",
      "title": "Womens Maxi Dress Bodycon Long Sleeve",
      "price": 36.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/715ViFUJneL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 174.91,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71SN6Oih0hL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-formal",
      "title": "Womens Dress Formal",
      "price": 57.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/6125TmkGLOL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 995.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71tpwBA0Z2L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-short-sleeve-v-neck",
      "title": "Womens Maxi Dress Short Sleeve V Neck",
      "price": 189.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Wedding Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/713CVG8snAL._SL1500_.jpg"
      ]
    }
  ]
}