{
  "id": "womens-dress",
  "handle": "womens-dress",
  "sku": "JC1118",
  "asin": "B0D5HKRD9F",
  "title": "Womens Dress",
  "title_original": "Arach&Cloz Women's Wool Blend Tie Waist Pleated Fall Sweater Dress 2025",
  "brand": "Visit the Arach&Cloz Store",
  "price": 45.99,
  "social_proof": {
    "bought_past_month": 1388,
    "text": "1388+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/71MrNs3GPkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81O6TijIEaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/811N+5i7roL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/812HKUbwJ1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71o0mAETqQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ZxHgFhp+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71eA0o1HM3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51hoaZbUYzL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ac23ASf+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/616fErvODgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61-i0mhYTRL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71T1BV3FXhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/617P+DPUpkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71F6IUkbKwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51k03uvrT6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71aeFgRnN8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/710fFOf7lGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71HHUfia7aL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61-ms5jJBgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71PzoVLGDdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61471q1-XKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ZZCfNNJzL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/71MrNs3GPkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81O6TijIEaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/811N+5i7roL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/812HKUbwJ1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71o0mAETqQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ZxHgFhp+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71eA0o1HM3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51hoaZbUYzL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ac23ASf+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/616fErvODgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61-i0mhYTRL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71T1BV3FXhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/617P+DPUpkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71F6IUkbKwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51k03uvrT6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71aeFgRnN8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/710fFOf7lGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71HHUfia7aL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61-ms5jJBgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71PzoVLGDdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61471q1-XKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ZZCfNNJzL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ May 27, 2024",
    "ASIN ‏": "‎ B0D5BDJ58F",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#6,257 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #219 in Women's Casual Dresses",
    "Customer Reviews": "4.4 4.4 out of 5 stars (693)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Navy Blue-white Stripe",
      "Rust",
      "Black-white Stripe",
      "Blue",
      "Dark Camel",
      "Apricot",
      "Black",
      "Brown Red",
      "Camel",
      "Coffee",
      "Coffee-white Stripe",
      "Dark Green",
      "Coral Purple",
      "Lake Blue",
      "Navy",
      "Wine Red",
      "Pink",
      "Beige",
      "Khaki-white Stripe"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.4,
    "count": 693,
    "customers_say": "Customers find this sweater dress fits beautifully and appreciate its high-end feel, with one noting it's stretchy enough to accommodate different body types. The dress receives positive feedback for its soft, comfortable fabric that feels good next to the skin, and its flattering design, with one customer highlighting how it accentuates hips and rear while hiding stomach fat. Customers love the color and find it suitable for fall and winter occasions, with one mentioning it works well with heels. Select to learn more Fit Style Quality Fabric feel Fabric comfort Flattering Color accuracy Dress for fall 79 customers mention \"Fit\" 69 positive 10 negative Customers like how the dress fits, with one mentioning it's stretchy enough to accommodate different body types. \"...This dress is very nice and fits well . The fabric feels like quality. I wanted to love it but the v-neck is just a little too high for me....\" Read more \"...this dress in three colors, and they all have been fantastic: great fit , wash well, feel soft, etc. Will probably purchase other colors as well!\" Read more \"This dress looks just like the picture and fit perfectly . Very classy and nice. I am 5'2 and 119 lbs and ordered a small....\" Read more \"...I usually need medium sizes, but I purchased this in large, and it fits nicely . It looks great and I am very pleased.\" Read more 79 customers mention \"Style\" 76 positive 3 negative Customers find the dress gorgeous, with one mentioning it makes them feel feminine. \" Beautiful dress . At 5.8, it’s long enough, I’d say it’s true to size maybe on the smaller end. I’m a comfortable medium and it fits like a glove....\" Read more \"...But beautiful ! The coffee is not very muted, definitely dark brown. Very nice dress, plan to wear with boots and maybe a scarf....\" Read more \" Pretty but not a good fit for me. Waist line is a bit high.\" Read more \"It’s cute I guess, I like the neckline. The brown color is way darker in person which I don’t love....\" Read more 76 customers mention \"Quality\" 73 positive 3 negative Customers find the dress to be well-made and exceeding expectations for quality, with one customer noting it feels very high-end. \"I absolutely love it! Great quality , very cozy and warm. Great for winter. I must get more colors. Great fit too!\" Read more \"This is a nice dress . It's a bit long-waisted, and the knit is soft, but might be a little itchy for some....\" Read more \"This is an elegant and lovely dress . I like the feel of the wool, it is extremely figure flattering and very dressy yet professional....\" Read more \"...I’ve ordered other sweater dresses from Amazon and none come close. Great dress , high quality....\" Read more 66 customers mention \"Fabric feel\" 58 positive 8 negative Customers appreciate the dress's fabric, describing it as soft and comfortable against the skin, with one customer noting it's a wool blend. \"Love this dress, it’s soft , feels good next to my skin. The fabric is a well done flows knit, wore it in February, ion the Midwest, and I was warm....\" Read more \"...The fabric is soft . I ordered the small (I am just shy of 5’5” and weigh 116), and the cut is fitted and flattering....\" Read more \"Dress is much longer than expected but nice material and fit.\" Read more \"...I wore it to work and got so many compliments! The fabric was soft but not flimsy. The fit was true to size.\" Read more 51 customers mention \"Fabric comfort\" 44 positive 7 negative Customers find the dress comfortable, describing it as cozy and not itchy at all. \" Comfortable . Stylish. Bust 36, Waist 33, height 5’5 purchased recommended size L and the fit is perfect! The color is vibrant and dress is elegant....\" Read more \"This dress is very comfortable and flattering. True to size. I love the deep red color. No 5 stars because there are some wrinkling issues.\" Read more \" Very comfy and true fit\" Read more \"Fits nicely. Flattering. Not super warm. It’s not wool but it is comfy \" Read more 33 customers mention \"Flattering\" 28 positive 5 negative Customers find the dress flattering, with one mentioning that the belt highlights the waist nicely and another noting that it hides stomach fat well. \"This dress is very comfortable and flattering . True to size. I love the deep red color. No 5 stars because there are some wrinkling issues.\" Read more \"This dress is so comfortable, feels like I'm wearing pj's! Very flattering and material is a nice weight, not too thin or heavy....\" Read more \"This is a very classy dress that is very flattering on . Very good price for such a beautiful and well made dress! Would definitely recommend!\" Read more \"...hugged me in places and skimmed over my tummy, creating a flattering silhouette ....\" Read more 28 customers mention \"Color accuracy\" 25 positive 3 negative Customers love the color of this sweater dress, describing it as a beautiful brown piece. \"This dress is amazing! I love the color , the fit, & the warmth this sweater type dress will give for the colder months.\" Read more \" Nice color . I wish the material was a bit thicker but the price was right and it worked for the occassion....\" Read more \"...It’s so cozy and comfortable! Feels very high end and the color is perfect for fall .\" Read more \"Comfortable and warm, Color was true to picture . Received many compliments.\" Read more 26 customers mention \"Dress for fall\" 26 positive 0 negative Customers find this dress suitable for fall and winter, with one mentioning it's perfect for Thanksgiving at home, while another notes it's ideal for church or evening events. \" Perfect fall dress !!...\" Read more \"...I am 5'2 and 119 lbs and ordered a small. It was perfect for a fall wedding .\" Read more \"Comfortable and perfect for church .\" Read more \"I purchased this dress for an awards ceremony. It was perfect for the occasion . It’s a light but warm sweater weight with a fair amount of stretch....\" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Great sweater dress!",
        "body": "Perfect for work or for a casual evening out. Can dress up or down. Cozy and cute. Fit true to size. Read more",
        "author": "ReBeCcA",
        "rating": 5.0,
        "date": "November 26, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Nice Dress, Fits Well, Soft & Comfortable",
        "body": "Comfortable, nice fit, breathable. Color was accurate, good value for the price. I was very happy with my purchase. Read more",
        "author": "Kimberly Cooper",
        "rating": 5.0,
        "date": "December 18, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Comfy cozy, but not flawless.",
        "body": "Soft, flattering, classy, comfortable. The downside is that I am fighting to get wrinkles out of the pleated skirting. You can see the wrinkles in the third pic of me with the bear. Read more",
        "author": "Andrea",
        "rating": 4.0,
        "date": "December 7, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/7131x71VhaL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/61UgtalqP9L._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71GXuGdgIyL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Elegant, affordable sweater dress",
        "body": "This is a fantastic looking sweater dress. I've now bought it for my wife in multiple colors; I just wish some of the striped skirt colors were available in her size. It's warm and soft, but definitely a lighter weight sweater material. She looks very elegant and pulled together in these. It's stretchy enough to fit well, but not at all clingy. Read more",
        "author": "Cyan M.",
        "rating": 5.0,
        "date": "November 20, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Fall/winter winner!",
        "body": "Fit is amazing, feels very nice on the skin. Belt is removable so you can add your own. 5’4, length is good, not a maxi, more midi. Large fit me better than the xl. 180 lbs. the navy is not true navy, a little lighter and brighter, maybe more lapis color. But beautiful! The coffee is not very muted, definitely dark brown. Very nice dress, plan to wear with boots and maybe a scarf. Great bargain! Read more",
        "author": "BP Mcpherson",
        "rating": 5.0,
        "date": "October 2, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Great silhouette, itchy material",
        "body": "I love the color, and the fit & flare silhouette is very flattering. It has a nice weight, that's not see-through, and warm without being too heavy. The stitching and construction seem good, but the fabric is too itchy for me. Lacks the smoothness of a higher quality blend. I expect the dry indoor heat of our winters will only make that itchiness worse. I'm going to try wearing a full-body slip-thin layer underneath in hopes of salvaging the dress, because otherwise it would definitely be a keeper. Read more",
        "author": "Shopperton",
        "rating": 3.0,
        "date": "November 29, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Ideal Winter Dress",
        "body": "Warm, flattering, and elegantly designed. Even more importantly, it’s comfortable and can be washed with the rest of your darks. Just make sure it lays flat to dry. Read more",
        "author": "Soleil",
        "rating": 5.0,
        "date": "December 16, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars good choice",
        "body": "I am 5ft 1in. tall, weigh 138lbs. I am normally a medium size 8-10. The medium fit me perfectly. Shoulder seams perfect and sleeve length as well. The length came to my mid shins. The material is soft, good weight for spring, fall and winter. The pleats hang well. The v neck is just right no plunge. Great buy. Read more",
        "author": "Phyllis",
        "rating": 5.0,
        "date": "December 13, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Dress is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.",
  "about_this_item": "Womens Dress is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.",
  "long_description": "Womens Dress is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Navy Blue-white Stripe, Rust, Black-white Stripe, Blue, Dark Camel, Apricot, Black, Brown Red, Camel, Coffee, Coffee-white Stripe, Dark Green, Coral Purple, Lake Blue. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Dress is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Navy Blue-white Stripe, Rust, Black-white Stripe, Blue, Dark Camel, Apricot, Black, Brown Red, Camel, Coffee, Coffee-white Stripe, Dark Green, Coral Purple, Lake Blue. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "dae5ffd9-3243-4a17-b8d8-e953a17bbc7f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/dae5ffd9-3243-4a17-b8d8-e953a17bbc7f/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/dae5ffd9-3243-4a17-b8d8-e953a17bbc7f/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "bdb1f302-0d21-4e09-8853-1b11923114b7",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bdb1f302-0d21-4e09-8853-1b11923114b7/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bdb1f302-0d21-4e09-8853-1b11923114b7/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "eaf42b58-4114-4916-9226-3f0f8576f2e2",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/eaf42b58-4114-4916-9226-3f0f8576f2e2/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/eaf42b58-4114-4916-9226-3f0f8576f2e2/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "839d30e4-a4d8-4166-a649-8c8443e1b3bf",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/839d30e4-a4d8-4166-a649-8c8443e1b3bf/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/839d30e4-a4d8-4166-a649-8c8443e1b3bf/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "b3446590-795d-4b86-8b79-9c453d03f404",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b3446590-795d-4b86-8b79-9c453d03f404/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b3446590-795d-4b86-8b79-9c453d03f404/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "70841085-06bb-4f85-8f8a-e2c32bdcb6fc",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/70841085-06bb-4f85-8f8a-e2c32bdcb6fc/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/70841085-06bb-4f85-8f8a-e2c32bdcb6fc/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "f865ff3a-d022-477d-8ccb-f20243cbe36c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f865ff3a-d022-477d-8ccb-f20243cbe36c/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f865ff3a-d022-477d-8ccb-f20243cbe36c/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "289fdcbf-60cb-4a84-a016-59d067f844f6",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/289fdcbf-60cb-4a84-a016-59d067f844f6/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/289fdcbf-60cb-4a84-a016-59d067f844f6/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "20b02aed-f888-4732-960e-47bbbc77a739",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/20b02aed-f888-4732-960e-47bbbc77a739/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/20b02aed-f888-4732-960e-47bbbc77a739/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "fe0fc063-f171-410d-b313-f62dc674e0af",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/fe0fc063-f171-410d-b313-f62dc674e0af/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/fe0fc063-f171-410d-b313-f62dc674e0af/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "0361917c-acaa-410e-bac6-a149de901d57",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0361917c-acaa-410e-bac6-a149de901d57/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0361917c-acaa-410e-bac6-a149de901d57/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "710f5706-09ac-4161-9d48-6f9ce900b441",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/710f5706-09ac-4161-9d48-6f9ce900b441/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/710f5706-09ac-4161-9d48-6f9ce900b441/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Navy Blue-white Stripe": "https://m.media-amazon.com/images/I/41XxxqB6OiL._AC_SR38,50_.jpg",
    "Rust": "https://m.media-amazon.com/images/I/31CawL0I56L._AC_SR38,50_.jpg",
    "Black-white Stripe": "https://m.media-amazon.com/images/I/41j85Y4zGfL._AC_SR38,50_.jpg",
    "Blue": "https://m.media-amazon.com/images/I/31kp7BrRzAL._AC_SR38,50_.jpg",
    "Dark Camel": "https://m.media-amazon.com/images/I/31Br1qZu8RL._AC_SR38,50_.jpg",
    "Apricot": "https://m.media-amazon.com/images/I/31JgS3HeF0L._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31cZXY3td2L._AC_SR38,50_.jpg",
    "Brown Red": "https://m.media-amazon.com/images/I/316bD3BFChL._AC_SR38,50_.jpg",
    "Camel": "https://m.media-amazon.com/images/I/31+kmR6Is-L._AC_SR38,50_.jpg",
    "Coffee": "https://m.media-amazon.com/images/I/31r8+eBPtwL._AC_SR38,50_.jpg",
    "Coffee-white Stripe": "https://m.media-amazon.com/images/I/41qOwUD-ACL._AC_SR38,50_.jpg",
    "Dark Green": "https://m.media-amazon.com/images/I/31JRN7TX4XL._AC_SR38,50_.jpg",
    "Coral Purple": "https://m.media-amazon.com/images/I/31tpbCSvbCL._AC_SR38,50_.jpg",
    "Lake Blue": "https://m.media-amazon.com/images/I/313myzJdeLL._AC_SR38,50_.jpg",
    "Navy": "https://m.media-amazon.com/images/I/311T45bcIZL._AC_SR38,50_.jpg",
    "Wine Red": "https://m.media-amazon.com/images/I/31YL3P9jeuL._AC_SR38,50_.jpg",
    "Pink": "https://m.media-amazon.com/images/I/31NrbuxP05L._AC_SR38,50_.jpg",
    "Beige": "https://m.media-amazon.com/images/I/31ICL63MNVL._AC_SR38,50_.jpg",
    "Khaki-white Stripe": "https://m.media-amazon.com/images/I/31R+Kspf+eL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Navy Blue-white Stripe": "71o0mAETqQL",
    "Rust": "71ZxHgFhp+L",
    "Black-white Stripe": "71eA0o1HM3L",
    "Blue": "51hoaZbUYzL",
    "Dark Camel": "71ac23ASf+L",
    "Apricot": "616fErvODgL",
    "Black": "61-i0mhYTRL",
    "Brown Red": "71T1BV3FXhL",
    "Camel": "617P+DPUpkL",
    "Coffee": "71MrNs3GPkL",
    "Coffee-white Stripe": "71F6IUkbKwL",
    "Dark Green": "51k03uvrT6L",
    "Coral Purple": "71aeFgRnN8L",
    "Lake Blue": "710fFOf7lGL",
    "Navy": "71HHUfia7aL",
    "Wine Red": "61-ms5jJBgL",
    "Pink": "71PzoVLGDdL",
    "Beige": "61471q1-XKL",
    "Khaki-white Stripe": "71ZZCfNNJzL"
  },
  "color_images": {
    "Navy Blue-white Stripe": [
      "https://m.media-amazon.com/images/I/71o0mAETqQL._SL1500_.jpg"
    ],
    "Rust": [
      "https://m.media-amazon.com/images/I/71ZxHgFhp+L._SL1500_.jpg"
    ],
    "Black-white Stripe": [
      "https://m.media-amazon.com/images/I/71eA0o1HM3L._SL1500_.jpg"
    ],
    "Blue": [
      "https://m.media-amazon.com/images/I/51hoaZbUYzL._SL1500_.jpg"
    ],
    "Dark Camel": [
      "https://m.media-amazon.com/images/I/71ac23ASf+L._SL1500_.jpg"
    ],
    "Apricot": [
      "https://m.media-amazon.com/images/I/616fErvODgL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/61-i0mhYTRL._SL1500_.jpg"
    ],
    "Brown Red": [
      "https://m.media-amazon.com/images/I/71T1BV3FXhL._SL1500_.jpg"
    ],
    "Camel": [
      "https://m.media-amazon.com/images/I/617P+DPUpkL._SL1500_.jpg"
    ],
    "Coffee": [
      "https://m.media-amazon.com/images/I/71MrNs3GPkL._SL1500_.jpg"
    ],
    "Coffee-white Stripe": [
      "https://m.media-amazon.com/images/I/71F6IUkbKwL._SL1500_.jpg"
    ],
    "Dark Green": [
      "https://m.media-amazon.com/images/I/51k03uvrT6L._SL1500_.jpg"
    ],
    "Coral Purple": [
      "https://m.media-amazon.com/images/I/71aeFgRnN8L._SL1500_.jpg"
    ],
    "Lake Blue": [
      "https://m.media-amazon.com/images/I/710fFOf7lGL._SL1500_.jpg"
    ],
    "Navy": [
      "https://m.media-amazon.com/images/I/71HHUfia7aL._SL1500_.jpg"
    ],
    "Wine Red": [
      "https://m.media-amazon.com/images/I/61-ms5jJBgL._SL1500_.jpg"
    ],
    "Pink": [
      "https://m.media-amazon.com/images/I/71PzoVLGDdL._SL1500_.jpg"
    ],
    "Beige": [
      "https://m.media-amazon.com/images/I/61471q1-XKL._SL1500_.jpg"
    ],
    "Khaki-white Stripe": [
      "https://m.media-amazon.com/images/I/71ZZCfNNJzL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-sleeveless-maxi",
      "title": "Womens Maxi Dress Sleeveless Maxi",
      "price": 48.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71qwUjryGiL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 43.69,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61-pFN+nfgL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-bodycon",
      "title": "Womens Maxi Dress Maxi Bodycon",
      "price": 36.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61o6MKJoZLL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-one-shoulder-formal-mermaid-bodycon-evening-maxi",
      "title": "Womens Maxi Dress One Shoulder Formal Mermaid Bodycon Evening Maxi",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71mgUBuGwhL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-v-neck-short-sleeve",
      "title": "Womens Dress V Neck Short Sleeve",
      "price": 34.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71T+iJeFITL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress-cocktail-ruched-evening-split",
      "title": "Womens Dress Cocktail Ruched Evening Split",
      "price": 29.69,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/61003bnFhAS._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-maxi",
      "title": "Womens Maxi Dress Formal Maxi",
      "price": 64.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/61RWPo72AmL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-mermaid-one-shoulder",
      "title": "Womens Maxi Dress Mermaid One Shoulder",
      "price": 238.74,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51lR3NNtXCL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-maxi-formal-long-sleeve-v-neck",
      "title": "Womens Maxi Dress Cocktail Maxi Formal Long Sleeve V Neck",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61cfJoIR5bL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-bodycon-ruched",
      "title": "Womens Maxi Dress Cocktail Bodycon Ruched",
      "price": 49.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51+rVhgLHSL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-formal",
      "title": "Womens Dress Formal",
      "price": 75.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51TVxkZ3J2L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening",
      "title": "Womens Maxi Dress Formal Evening",
      "price": 64.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/516ScMrYzlL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-ruched-bodycon-v-neck",
      "title": "Womens Maxi Dress Long Sleeve Ruched Bodycon V Neck",
      "price": 33.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51AvldIvTmL._SL1500_.jpg"
      ]
    }
  ]
}