{
  "id": "womens-maxi-dress-cocktail-sleeveless-bodycon-maxi",
  "handle": "womens-maxi-dress-cocktail-sleeveless-bodycon-maxi",
  "sku": "JC2582",
  "asin": "B0D6QR1DKB",
  "title": "Womens Maxi Dress Cocktail Sleeveless Bodycon Maxi",
  "title_original": "SOLY HUX Women's Floral Mesh Bodycon Cami Dress Cowl Neck Sleeveless Cocktail Party Wedding Guest Long Maxi Dresses",
  "brand": "Visit the SOLY HUX Store",
  "price": 37.99,
  "social_proof": {
    "bought_past_month": 131,
    "text": "131+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/51FUujLrYsL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61COQmY5HIL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61t4u-p+yKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81CdI766SaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71nbMRb1DaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/614XbamldQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51UyJ5JkH1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61hPnr7fKtL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51dZOwuflqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61P50Q6y9-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51ED1z+5fqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61+JsRh14EL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61sub5B4D1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61zoRu+tkAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61etl2uS61L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61d8cJ+qqTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71I6nFiyIuL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61iBwqy0kRL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61R0DvqzQiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61oVE7kVnQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61NVvMoAEmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61cVMhufEDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61WvFE+dZOL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/51FUujLrYsL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61COQmY5HIL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61t4u-p+yKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81CdI766SaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71nbMRb1DaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/614XbamldQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51UyJ5JkH1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61hPnr7fKtL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51dZOwuflqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61P50Q6y9-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51ED1z+5fqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61+JsRh14EL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61sub5B4D1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61zoRu+tkAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61etl2uS61L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61d8cJ+qqTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71I6nFiyIuL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61iBwqy0kRL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61R0DvqzQiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61oVE7kVnQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61NVvMoAEmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61cVMhufEDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61WvFE+dZOL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ March 5, 2024",
    "ASIN ‏": "‎ B0CX4XRG7L",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#33,516 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #217 in Women's Club & Night Out Dresses",
    "Customer Reviews": "4.5 4.5 out of 5 stars (281)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Multicolor Floral Print",
      "Pink Flower Print",
      "Pink Floral",
      "Black Floral",
      "Green Floral",
      "Red Floral Print",
      "Multicolor",
      "Black Flower Print",
      "Black Floral Printed",
      "Blue Flower",
      "Multicolor Floral",
      "Apricot Floral",
      "Blue Floral",
      "Multi Floral",
      "Purple Floral Printed",
      "Dusty Pink Floral Print",
      "Army Green Floral"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.5,
    "count": 281,
    "customers_say": "Customers find this dress beautiful, comfortable, and well-fitting, with one noting how it wraps around the body beautifully. The dress is flattering, hugging curves in all the right places, and customers appreciate its nice material and stretchiness. They consider it good value for money, describing it as decent for the price. Generated from the text of customer reviews Select to learn more Beauty (43) Fit (36) Comfort (22) Flattering (21) Quality (21) Material quality (13) Stretchiness (13) Value for money (13) 43 customers mention beauty, 41 positive, 2 negative 43 customers mention \"Beauty\" 41 positive 2 negative Customers find the dress very pretty, with one mentioning it looks good while dressing up on a budget. \" Beautiful dress , very form fitting. Wore it to a wedding and received tons of compliments. Happy with my purchase. \" Read more \" It’s cute and fits pretty well, but the strap broke on it within minutes. Just came completely unstitched at the slightest tug \" Read more \" This dress was for my sibling, it looked like a very pretty dress from the photos and upon receiving it was like the photos aside from one thing,... \" Read more \" Super cute ! Straps are not adjustable and will have to take out some slack off the straps. So worth it though. True to size. \" Read more 36 customers mention fit, 32 positive, 4 negative 36 customers mention \"Fit\" 32 positive 4 negative Customers like how the dress fits, with one mentioning it wraps beautifully around the body, while another notes it drops below the ankles. \" ...This also isn’t tight when sitting down either! Great fit and flowy! \" Read more \" Very flattering and comfortable fit . I received many compliments. Had to make a minor alteration because the top was too big for me. Would buy again \" Read more \" Pretty dress, fits well , love it.... \" Read more \" The dress fit SO well ! Hugs your curves in all the right places!... \" Read more 22 customers mention comfort, 21 positive, 1 negative 22 customers mention \"Comfort\" 21 positive 1 negative Customers find the dress comfortable. \" Fit is flattering. It’s soft and comfortable . I’m 5’7” about 165, I got a large, would probably size down for a snugger fit in the chest.... \" Read more \" ... Very comfortable . Only think I guess I didn’t love was the yellowish straps but I wore a crop sweater over it occasionally.... \" Read more \" 5’5 and about 170lbs, I ordered a large. Super comfortable and flattering! JUST GET IT, no regrets! \" Read more \" Loved this dress! So comfy ! I would gave sized down. I usually wear large but a medium would have felt better on my top section. \" Read more 21 customers mention flattering, 20 positive, 1 negative 21 customers mention \"Flattering\" 20 positive 1 negative Customers find the dress flattering, noting that it hugs the curves well and helps cinch the waist. \" Very flattering and comfortable fit. I received many compliments. Had to make a minor alteration because the top was too big for me. Would buy again \" Read more \" 5’5 and about 170lbs, I ordered a large. Super comfortable and flattering ! JUST GET IT, no regrets! \" Read more \" Very flattering dress but the scoop neck in the front falls in a funky way and it makes the dress look messy.... \" Read more \" Buy it!! Very comfortable and one of the most flattering dresses I’ve worn! True to size.... \" Read more 21 customers mention quality, 16 positive, 5 negative 21 customers mention \"Quality\" 16 positive 5 negative Customers find the dress to be of nice quality. \" Amazing dress \" Read more \" Great Dress ... \" Read more \" Nice dress ... \" Read more \" ...The dress is beautiful! BUT! The stitching is off and doesn’t stay, the lines for your waist start to shift around your body and the lining dress... \" Read more 13 customers mention material quality, 11 positive, 2 negative 13 customers mention \"Material quality\" 11 positive 2 negative Customers love the material of the dress, with one mentioning it has a thick layer underneath. \" Beautiful dress. The material is great and it looks nice. you can dress it up or down. Very nice dress. \" Read more \" Loved this dress! Casual material but easily dressed up with heels, a clutch, and a shawl. \" Read more \" ...I wore it to a brunch and received a lot of compliments. The material was nice and didn’t itch my skin, was it too clingy in the wrong places.... \" Read more \" I concider this a good buy. It made from nice fabric and looks nice. XL for 108 cm chest feels right. I am considering buying this in different color. \" Read more 13 customers mention stretchiness, 12 positive, 1 negative 13 customers mention \"Stretchiness\" 12 positive 1 negative Customers appreciate the dress's stretchiness, with one mentioning it provides plenty of room for movement. \" Love this dress, stretchy and flattering to most figures… received many compliments, only downside is straps are not adjustable… \" Read more \" ...U can wear this dress in any event! The material is stretchy and not see through, it has an elastic band on the sides that helps cinch ur waist a bit... \" Read more \" ...I really liked the stretchy material and it was NOT see though. I got it for a wedding but the top is not flattering for small chested ladies.... \" Read more \" ...It is very stretchy so you could size down if you like for a snug fit. \" Read more 13 customers mention value for money, 11 positive, 2 negative 13 customers mention \"Value for money\" 11 positive 2 negative Customers find the dress offers good value for money, describing it as decent for the price and worth the purchase. \" ... Great dress for the price \" Read more \" ...And the \"scrunch\" never seems to lay right. But it is a nice dress for the price . \" Read more \" ...The quality is pretty good not the most expensive but also not super cheap . Def worth it. \" Read more \" ...Definitely worth the purchase . I can’t wait to wear this to my next event. \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Beautiful Fit!",
        "body": "This is very beautiful on. The cut of the dress at the top and the straps at the back is very flattering. It is very stretchy so you could size down if you like for a snug fit. Read more",
        "author": "Customer",
        "rating": 5.0,
        "date": "November 21, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars So pretty and comfy!",
        "body": "Loved this hugged the body right and got compliments! Read more",
        "author": "Jaleesa",
        "rating": 5.0,
        "date": "December 9, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61MENNVJEGL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "4.0 out of 5 stars Decent dress for the price.",
        "body": "This dress was for my sibling, it looked like a very pretty dress from the photos and upon receiving it was like the photos aside from one thing, the top was a bit loose/floppy even for size small/xxs. It did fit well and was very breathable and hugged all the right places. Read more",
        "author": "Jayleen",
        "rating": 4.0,
        "date": "June 5, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars 10/10!",
        "body": "The dress fit SO well! Hugs your curves in all the right places! I had to find a last minute dress for a semi-formal wedding and I was not disappointed. It was incredibly comfortable, the perfect length, and quality was wonderful for the price point. Only downside is that the chest area was a little bigger; I probably could have sized down to a medium. I did have to use body tape to help keep the neckline in place as I was worried if I bent over, my chest would fall out. Overall incredibly happy with this dress and I felt great wearing it! Read more",
        "author": "BRYTNEY M",
        "rating": 5.0,
        "date": "October 11, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/81-FWv4AFyL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Beautiful Dress for semi formal event",
        "body": "Nice dress for a day or evening semi formal event. The material isn’t bad and it looks amazing. Highly recommend Read more",
        "author": "Tania Guzman",
        "rating": 5.0,
        "date": "December 10, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71jB2+MkiKL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Great Purchase",
        "body": "Just what I was hoping for, color and material are perfect. It feels custom fit. Read more",
        "author": "Sydney",
        "rating": 5.0,
        "date": "December 4, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Love this dress!",
        "body": "Definitely love this dress. I’m 5’8 160lbs in a size medium. I would definitely wear this again very comfortably and gave sexy. Read more",
        "author": "Mariah Janaé",
        "rating": 5.0,
        "date": "October 17, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71UAcS7jEcL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/710NesVwMwL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "4.0 out of 5 stars Straps too long",
        "body": "Fit to the body nicely but straps were too long. Read more",
        "author": "Joanna",
        "rating": 4.0,
        "date": "July 21, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Cocktail Sleeveless Bodycon Maxi is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.",
  "about_this_item": "Womens Maxi Dress Cocktail Sleeveless Bodycon Maxi is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.",
  "long_description": "Womens Maxi Dress Cocktail Sleeveless Bodycon Maxi is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Multicolor Floral Print, Pink Flower Print, Pink Floral, Black Floral, Green Floral, Red Floral Print, Multicolor, Black Flower Print, Black Floral Printed, Blue Flower, Multicolor Floral, Apricot Floral, Blue Floral, Multi Floral. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Cocktail Sleeveless Bodycon Maxi is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Multicolor Floral Print, Pink Flower Print, Pink Floral, Black Floral, Green Floral, Red Floral Print, Multicolor, Black Flower Print, Black Floral Printed, Blue Flower, Multicolor Floral, Apricot Floral, Blue Floral, Multi Floral. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "6eafe22f-3c9b-4788-8306-fd2cb3cb2853",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6eafe22f-3c9b-4788-8306-fd2cb3cb2853/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6eafe22f-3c9b-4788-8306-fd2cb3cb2853/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "c0fb703b-0974-45f9-9bc8-5f191dbd244e",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c0fb703b-0974-45f9-9bc8-5f191dbd244e/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c0fb703b-0974-45f9-9bc8-5f191dbd244e/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "9e12ba99-6ea7-4d62-9091-c79153d747be",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9e12ba99-6ea7-4d62-9091-c79153d747be/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9e12ba99-6ea7-4d62-9091-c79153d747be/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "4934eee4-652a-4fe4-a343-d08b49844a6e",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4934eee4-652a-4fe4-a343-d08b49844a6e/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4934eee4-652a-4fe4-a343-d08b49844a6e/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "f2e73e3b-5991-48df-a386-edadb4f7896a",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f2e73e3b-5991-48df-a386-edadb4f7896a/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f2e73e3b-5991-48df-a386-edadb4f7896a/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "004f36a7-967d-4486-af4d-51befc51e6ab",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/004f36a7-967d-4486-af4d-51befc51e6ab/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/004f36a7-967d-4486-af4d-51befc51e6ab/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "f45611c7-4f80-4209-b1bd-6d8ff44538ff",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f45611c7-4f80-4209-b1bd-6d8ff44538ff/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f45611c7-4f80-4209-b1bd-6d8ff44538ff/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "beabfeb0-4d64-4ea2-a8b7-bb718b3d73f0",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/beabfeb0-4d64-4ea2-a8b7-bb718b3d73f0/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/beabfeb0-4d64-4ea2-a8b7-bb718b3d73f0/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "e65302c6-68eb-424a-bbc7-97d960f7c8f5",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e65302c6-68eb-424a-bbc7-97d960f7c8f5/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e65302c6-68eb-424a-bbc7-97d960f7c8f5/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "0e839d9a-e8d7-499e-9aa3-ced5a3cdcf83",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0e839d9a-e8d7-499e-9aa3-ced5a3cdcf83/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0e839d9a-e8d7-499e-9aa3-ced5a3cdcf83/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "8f5614c5-3626-4838-8e3b-a36c0e7709ba",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8f5614c5-3626-4838-8e3b-a36c0e7709ba/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8f5614c5-3626-4838-8e3b-a36c0e7709ba/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "9e318f2c-e82d-4fed-8289-e8045b502b20",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9e318f2c-e82d-4fed-8289-e8045b502b20/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9e318f2c-e82d-4fed-8289-e8045b502b20/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Multicolor Floral Print": "https://m.media-amazon.com/images/I/31yN4Bj5YQL._AC_SR38,50_.jpg",
    "Pink Flower Print": "https://m.media-amazon.com/images/I/31KtHAzPH8L._AC_SR38,50_.jpg",
    "Pink Floral": "https://m.media-amazon.com/images/I/31uohy8AhwL._AC_SR38,50_.jpg",
    "Black Floral": "https://m.media-amazon.com/images/I/3164++tCF+L._AC_SR38,50_.jpg",
    "Green Floral": "https://m.media-amazon.com/images/I/31oi1k3nsaL._AC_SR38,50_.jpg",
    "Red Floral Print": "https://m.media-amazon.com/images/I/31MchfwSscL._AC_SR38,50_.jpg",
    "Multicolor": "https://m.media-amazon.com/images/I/31MvXR9GSbL._AC_SR38,50_.jpg",
    "Black Flower Print": "https://m.media-amazon.com/images/I/31F-Rgton3L._AC_SR38,50_.jpg",
    "Black Floral Printed": "https://m.media-amazon.com/images/I/31qnaID8NeL._AC_SR38,50_.jpg",
    "Blue Flower": "https://m.media-amazon.com/images/I/410GJNQ5wdL._AC_SR38,50_.jpg",
    "Multicolor Floral": "https://m.media-amazon.com/images/I/31LUp8WhRvL._AC_SR38,50_.jpg",
    "Apricot Floral": "https://m.media-amazon.com/images/I/31vQ8NfpnrL._AC_SR38,50_.jpg",
    "Blue Floral": "https://m.media-amazon.com/images/I/310iEznTczL._AC_SR38,50_.jpg",
    "Multi Floral": "https://m.media-amazon.com/images/I/31EwvNBonzL._AC_SR38,50_.jpg",
    "Purple Floral Printed": "https://m.media-amazon.com/images/I/31LMWxcR9sL._AC_SR38,50_.jpg",
    "Dusty Pink Floral Print": "https://m.media-amazon.com/images/I/31XP5bmY8RL._AC_SR38,50_.jpg",
    "Army Green Floral": "https://m.media-amazon.com/images/I/31Z6x1rORqL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Multicolor Floral Print": "61hPnr7fKtL",
    "Pink Flower Print": "51dZOwuflqL",
    "Pink Floral": "61P50Q6y9-L",
    "Black Floral": "51ED1z+5fqL",
    "Green Floral": "61+JsRh14EL",
    "Red Floral Print": "61sub5B4D1L",
    "Multicolor": "61zoRu+tkAL",
    "Black Flower Print": "61etl2uS61L",
    "Black Floral Printed": "61d8cJ+qqTL",
    "Blue Flower": "71I6nFiyIuL",
    "Multicolor Floral": "61iBwqy0kRL",
    "Apricot Floral": "61R0DvqzQiL",
    "Blue Floral": "61oVE7kVnQL",
    "Multi Floral": "61NVvMoAEmL",
    "Purple Floral Printed": "61cVMhufEDL",
    "Dusty Pink Floral Print": "61WvFE+dZOL",
    "Army Green Floral": "51FUujLrYsL"
  },
  "color_images": {
    "Multicolor Floral Print": [
      "https://m.media-amazon.com/images/I/61hPnr7fKtL._SL1500_.jpg"
    ],
    "Pink Flower Print": [
      "https://m.media-amazon.com/images/I/51dZOwuflqL._SL1500_.jpg"
    ],
    "Pink Floral": [
      "https://m.media-amazon.com/images/I/61P50Q6y9-L._SL1500_.jpg"
    ],
    "Black Floral": [
      "https://m.media-amazon.com/images/I/51ED1z+5fqL._SL1500_.jpg"
    ],
    "Green Floral": [
      "https://m.media-amazon.com/images/I/61+JsRh14EL._SL1500_.jpg"
    ],
    "Red Floral Print": [
      "https://m.media-amazon.com/images/I/61sub5B4D1L._SL1500_.jpg"
    ],
    "Multicolor": [
      "https://m.media-amazon.com/images/I/61zoRu+tkAL._SL1500_.jpg"
    ],
    "Black Flower Print": [
      "https://m.media-amazon.com/images/I/61etl2uS61L._SL1500_.jpg"
    ],
    "Black Floral Printed": [
      "https://m.media-amazon.com/images/I/61d8cJ+qqTL._SL1500_.jpg"
    ],
    "Blue Flower": [
      "https://m.media-amazon.com/images/I/71I6nFiyIuL._SL1500_.jpg"
    ],
    "Multicolor Floral": [
      "https://m.media-amazon.com/images/I/61iBwqy0kRL._SL1500_.jpg"
    ],
    "Apricot Floral": [
      "https://m.media-amazon.com/images/I/61R0DvqzQiL._SL1500_.jpg"
    ],
    "Blue Floral": [
      "https://m.media-amazon.com/images/I/61oVE7kVnQL._SL1500_.jpg"
    ],
    "Multi Floral": [
      "https://m.media-amazon.com/images/I/61NVvMoAEmL._SL1500_.jpg"
    ],
    "Purple Floral Printed": [
      "https://m.media-amazon.com/images/I/61cVMhufEDL._SL1500_.jpg"
    ],
    "Dusty Pink Floral Print": [
      "https://m.media-amazon.com/images/I/61WvFE+dZOL._SL1500_.jpg"
    ],
    "Army Green Floral": [
      "https://m.media-amazon.com/images/I/51FUujLrYsL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 295.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51tOCtnN9ML._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-v-neck-ruched",
      "title": "Womens Maxi Dress Long Sleeve V Neck Ruched",
      "price": 41.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/41nKZb3yrHL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi",
      "title": "Womens Maxi Dress Maxi",
      "price": 47.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/61hBgiaCZYL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 103.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71oavYv07yL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-formal-long-sleeve-maxi",
      "title": "Womens Maxi Dress Evening Formal Long Sleeve Maxi",
      "price": 94.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51Nq5R1Ds-L._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-bodycon-v-neck-long-sleeve-ruched",
      "title": "Womens Maxi Dress Bodycon V Neck Long Sleeve Ruched",
      "price": 36.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51TARubmowL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-mermaid-maxi-v-neck",
      "title": "Womens Maxi Dress Formal Mermaid Maxi V Neck",
      "price": 74.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51nAFBOyMBL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-long-sleeve-v-neck",
      "title": "Womens Maxi Dress Bodycon Long Sleeve V Neck",
      "price": 57.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61tCS-pOsgL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-v-neck-evening-formal",
      "title": "Womens Maxi Dress V Neck Evening Formal",
      "price": 94.29,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61car5XZMpL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-one-shoulder-formal",
      "title": "Womens Maxi Dress Evening One Shoulder Formal",
      "price": 88.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51dteyRhDhL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-formal-cocktail",
      "title": "Womens Maxi Dress Long Sleeve Formal Cocktail",
      "price": 48.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61W9LD7yFrL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 44.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61xNiiGVRPL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-one-shoulder-maxi",
      "title": "Womens Maxi Dress One Shoulder Maxi",
      "price": 34.39,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71ZTGUNM7aL._SL1500_.jpg"
      ]
    }
  ]
}