{
  "id": "womens-maxi-dress-long-sleeve-v-neck",
  "handle": "womens-maxi-dress-long-sleeve-v-neck",
  "sku": "JC1401",
  "asin": "B0D6W63PJK",
  "title": "Womens Maxi Dress Long Sleeve V Neck",
  "title_original": "Dokotoo Fall Dresses for Women 2025 Long Sleeve V Neck Textured Casual Lightweight Tiered Ruffle A-Line Mini Babydoll Dress",
  "brand": "Visit the Dokotoo Store",
  "price": 38.98,
  "social_proof": {
    "bought_past_month": 1543,
    "text": "1543+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/7115RY+oWbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71fA2-rDU6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71fuzG4HKwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Jyg8YIGBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71CXhd0PRlL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71U-uUt5LEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71PKY9ttrZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ZjqlL8X1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Af18VPi9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/713aYM6E4tL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71j6zpw6vPL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71PEMMiQ2yL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61wOWyFSq-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71J0U3dRyiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/714X-8sm0hL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/7115RY+oWbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71fA2-rDU6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71fuzG4HKwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Jyg8YIGBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71CXhd0PRlL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71U-uUt5LEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71PKY9ttrZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ZjqlL8X1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Af18VPi9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/713aYM6E4tL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71j6zpw6vPL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71PEMMiQ2yL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61wOWyFSq-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71J0U3dRyiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/714X-8sm0hL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Item model number ‏": "‎ WGLW6121046-P",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ July 1, 2024",
    "ASIN ‏": "‎ B0D6W9DVTC",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#44,243 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #414 in Women's Casual Dresses",
    "Customer Reviews": "4.2 4.2 out of 5 stars (312)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Red",
      "Brown",
      "Khaki",
      "Pink",
      "White",
      "Blue",
      "Purple",
      "Black",
      "Green",
      "Grey"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.2,
    "count": 312,
    "customers_say": "Customers find the dress fits well, hitting just below the knee, and appreciate its beautiful soft pink color. The dress is comfortable, made of fabulous material, and has good length, with one customer noting it's suitable for colder weather. The material thickness receives mixed feedback - while some find it fabulous, others mention it's thicker than expected. Opinions on sizing are divided, with some finding it true to size while others say it runs slightly big. Select to learn more Fit Style Quality Comfort Soft material Length Material thickness Size 39 customers mention \"Fit\" 33 positive 6 negative Customers like how the dress fits, with one mentioning it hangs well above the knee and another noting it hits just above the knees. \"Very thick material. Fits great , but a little too thick for the occassion it was needed for. The black color is not see through at all.\" Read more \"Very comfortable, fabric is fabulous and fits well .\" Read more \"Sending back. Fits really well and is made well. Soft and lightweight but I ordered the cream color and it's see through. Sad.\" Read more \"Love the look and fit , it was pretty true to size. Very soft and comfy, I love it!\" Read more 33 customers mention \"Style\" 32 positive 1 negative Customers find the dress very cute, particularly appreciating its soft pink color, and one customer mentions that the pattern adds a nice touch of femininity. \"Very happy with this dress! Cute , comfortable and great for winter. Heavy material, fits beautifully. Wore with tights and knee high boots.\" Read more \"I absolutely love this dress! It’s super cute , comfortable, and the quality is great....\" Read more \"...Overall, it’s a great balance of comfort and style , and I highly recommend it if you’re looking for an easy-to-wear yet flattering dress.\" Read more \" Beautiful Dress ...\" Read more 31 customers mention \"Quality\" 30 positive 1 negative Customers find the dress to be well-made and of great quality. \" Love this dress . Good quality on the material. Can be dressed up or down based on the occasion.\" Read more \"...If you get the white, you will need a slip, but it’s a great dress that can be dressed up or down....\" Read more \"...Possibly even on the bigger side. Would buy again. Great quality .\" Read more \"Didnt fit my daughter as expected, wasn't fitted, more baggy. Good quality \" Read more 22 customers mention \"Comfort\" 22 positive 0 negative Customers find the dress comfortable, with one mentioning it's suitable for colder weather. \"This dress is so comfortable and flattering! I got tons of compliments. I cannot recommend this one enough, I am buying another color immediately!\" Read more \" Very comfortable , fabric is fabulous and fits well.\" Read more \"I ended up buying the black and the gray! The dress is super comfortable and very flattering! The material is soft and I’m sure will wash up well\" Read more \"Love the look and fit, it was pretty true to size. Very soft and comfy , I love it!\" Read more 12 customers mention \"Soft material\" 11 positive 1 negative Customers appreciate the dress's soft material. \"Sending back. Fits really well and is made well. Soft and lightweight but I ordered the cream color and it's see through. Sad.\" Read more \"Love the look and fit, it was pretty true to size. Very soft and comfy, I love it!\" Read more \"...I needed it for an outdoor wedding so that was a no for me. The material was soft and definitely would be comfy for colder weather....\" Read more \"...It’s super cute, comfortable, and the quality is great. The fabric is soft , comfortable, and slightly thicker, which I really appreciate....\" Read more 11 customers mention \"Length\" 9 positive 2 negative Customers like the dress's length, with one mentioning it's knee-length at 5'7\". \"...dress that isn’t too short can be challenging, but this one has a perfect length – it hits just above my knees....\" Read more \"...I also appreciate the length—it’s just right, not too short or too long , making it easy to dress up with heels or keep it casual with flats....\" Read more \"...I’m 5’7’’ with long legs and this is a great length . It is thick so it doesn’t need a lip. Great quality!\" Read more \"...It’s was a nice length and fit perfectly for a plus sized big chested girly.\" Read more 25 customers mention \"Material thickness\" 15 positive 10 negative Customers have mixed opinions about the dress's material thickness, with some finding it fabulous while others note it's thicker than expected. \"Very comfortable, fabric is fabulous and fits well.\" Read more \"...This dress is THICK too. Zero air flow. I needed it for an outdoor wedding so that was a no for me....\" Read more \" Very thick material . Fits great, but a little too thick for the occassion it was needed for. The black color is not see through at all.\" Read more \" Not a sweater material , so it isn't too hot. Flowy and very cute!\" Read more 15 customers mention \"Size\" 9 positive 6 negative Customers have mixed opinions about the dress's sizing, with some finding it true to size while others say it runs slightly big. \"...I will be buying this dress is more colors! It is also true to size . I was also surprised to see that it was wrinkle resistant, which we all love!\" Read more \"Definitely size down . The material is also thick and bulky.\" Read more \"The dress is true to size . Possibly even on the bigger side. Would buy again. Great quality.\" Read more \"I feel it runs slightly big . However, it comfy and looks great on. Great for fall\" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Comfortable!",
        "body": "I absolutely love this dress! It’s super cute, comfortable, and the quality is great. The fabric is soft, comfortable, and slightly thicker, which I really appreciate. I’m 6' and 194 lbs, so finding a dress that isn’t too short can be challenging, but this one has a perfect length – it hits just above my knees. I usually wear a size 12 in jeans and, after reading the reviews, decided to size down to a medium instead of a large. The top fits perfectly, though it's a little roomy from the waist down. I would have liked a slightly more fitted look there, but overall, I'm really happy with the dress. Great buy! Read more",
        "author": "Rita",
        "rating": 5.0,
        "date": "October 27, 2024",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/612dL0fUu-L._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/61XUbaIIfeL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71g52nF+zHL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Super cute dress!",
        "body": "Wore this dress for fall photos. Was super comfortable and the fit was great. True to size. The color was also as expected. Read more",
        "author": "Allison Becker",
        "rating": 5.0,
        "date": "December 6, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Great purchase",
        "body": "I was actually surprised how well this was made and how cute it was on! The fit is perfect and true to size. Read more",
        "author": "Gabi",
        "rating": 4.0,
        "date": "September 30, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Great quality and fit!",
        "body": "Love this fall dresses. Very comfortable! Read more",
        "author": "Beverly Grooms",
        "rating": 5.0,
        "date": "December 2, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Good quality and cute too.",
        "body": "Love this dress. Good quality on the material. Can be dressed up or down based on the occasion. Read more",
        "author": "Theresa",
        "rating": 5.0,
        "date": "November 26, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Just okay",
        "body": "The fit was okay. I am petite and found it touch big for me. The fabric seemed more casual and a touch frumpy in person. Read more",
        "author": "Jessica",
        "rating": 3.0,
        "date": "April 9, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "1.0 out of 5 stars Beautiful Dress",
        "body": "The dress in the photos is beautiful, however the dress I received did not match the pictures. Read more",
        "author": "Courtney",
        "rating": 1.0,
        "date": "October 13, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Better Than Expected!",
        "body": "I’m 4’11” and this dress hits just below the knee. The material is thicker than I expected, but it feels well-made. Read more",
        "author": "Tonya Scherzer",
        "rating": 5.0,
        "date": "November 30, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Long Sleeve V Neck is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.",
  "about_this_item": "Womens Maxi Dress Long Sleeve V Neck is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.",
  "long_description": "Womens Maxi Dress Long Sleeve V Neck is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Red, Brown, Khaki, Pink, White, Blue, Purple, Black, Green, Grey. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Long Sleeve V Neck is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Red, Brown, Khaki, Pink, White, Blue, Purple, Black, Green, Grey. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "a43b22b4-67f1-4733-bec3-c038ba1d1ff4",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a43b22b4-67f1-4733-bec3-c038ba1d1ff4/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a43b22b4-67f1-4733-bec3-c038ba1d1ff4/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "d4964d27-964f-4acb-85b5-bb38f9133351",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d4964d27-964f-4acb-85b5-bb38f9133351/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d4964d27-964f-4acb-85b5-bb38f9133351/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "a9c36339-1acc-4025-847d-36f33af8102b",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a9c36339-1acc-4025-847d-36f33af8102b/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a9c36339-1acc-4025-847d-36f33af8102b/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "462333b9-a04e-4cd8-b6c2-146131ff5671",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/462333b9-a04e-4cd8-b6c2-146131ff5671/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/462333b9-a04e-4cd8-b6c2-146131ff5671/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "b127dd94-2d0b-47b2-9b14-13be7db5d7d6",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b127dd94-2d0b-47b2-9b14-13be7db5d7d6/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b127dd94-2d0b-47b2-9b14-13be7db5d7d6/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "de20d968-49a4-4ee3-a3f6-6b864c83dcec",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/de20d968-49a4-4ee3-a3f6-6b864c83dcec/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/de20d968-49a4-4ee3-a3f6-6b864c83dcec/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "e1946851-a30a-41b9-8667-36aeab8de2e8",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e1946851-a30a-41b9-8667-36aeab8de2e8/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e1946851-a30a-41b9-8667-36aeab8de2e8/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "741c3dd8-c7c3-4dfd-9641-07877f763699",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/741c3dd8-c7c3-4dfd-9641-07877f763699/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/741c3dd8-c7c3-4dfd-9641-07877f763699/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "097a88cc-b144-4f25-af49-b18ecd8475fe",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/097a88cc-b144-4f25-af49-b18ecd8475fe/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/097a88cc-b144-4f25-af49-b18ecd8475fe/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "c399fa98-b675-4a92-9144-46d45d93d5eb",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c399fa98-b675-4a92-9144-46d45d93d5eb/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c399fa98-b675-4a92-9144-46d45d93d5eb/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "84f0a64b-f316-4a1d-a46a-dc16ce192053",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/84f0a64b-f316-4a1d-a46a-dc16ce192053/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/84f0a64b-f316-4a1d-a46a-dc16ce192053/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "c5c07664-cd96-426c-b728-52e68f6043dc",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c5c07664-cd96-426c-b728-52e68f6043dc/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c5c07664-cd96-426c-b728-52e68f6043dc/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Red": "https://m.media-amazon.com/images/I/41+jUaiXTtL._AC_SR38,50_.jpg",
    "Brown": "https://m.media-amazon.com/images/I/41Y88aTARoL._AC_SR38,50_.jpg",
    "Khaki": "https://m.media-amazon.com/images/I/41lKNd76KoL._AC_SR38,50_.jpg",
    "Pink": "https://m.media-amazon.com/images/I/41KFNjLWosL._AC_SR38,50_.jpg",
    "White": "https://m.media-amazon.com/images/I/41lIKsdhnBL._AC_SR38,50_.jpg",
    "Blue": "https://m.media-amazon.com/images/I/41YQv2Tx9ML._AC_SR38,50_.jpg",
    "Purple": "https://m.media-amazon.com/images/I/41D3pASXvWL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/41nzs+Na-7L._AC_SR38,50_.jpg",
    "Green": "https://m.media-amazon.com/images/I/41w-u2oGKbL._AC_SR38,50_.jpg",
    "Grey": "https://m.media-amazon.com/images/I/41TPqSYtgtL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Red": "7115RY+oWbL",
    "Brown": "71PKY9ttrZL",
    "Khaki": "71ZjqlL8X1L",
    "Pink": "71Af18VPi9L",
    "White": "713aYM6E4tL",
    "Blue": "71j6zpw6vPL",
    "Purple": "71PEMMiQ2yL",
    "Black": "61wOWyFSq-L",
    "Green": "71J0U3dRyiL",
    "Grey": "714X-8sm0hL"
  },
  "color_images": {
    "Red": [
      "https://m.media-amazon.com/images/I/7115RY+oWbL._SL1500_.jpg"
    ],
    "Brown": [
      "https://m.media-amazon.com/images/I/71PKY9ttrZL._SL1500_.jpg"
    ],
    "Khaki": [
      "https://m.media-amazon.com/images/I/71ZjqlL8X1L._SL1500_.jpg"
    ],
    "Pink": [
      "https://m.media-amazon.com/images/I/71Af18VPi9L._SL1500_.jpg"
    ],
    "White": [
      "https://m.media-amazon.com/images/I/713aYM6E4tL._SL1500_.jpg"
    ],
    "Blue": [
      "https://m.media-amazon.com/images/I/71j6zpw6vPL._SL1500_.jpg"
    ],
    "Purple": [
      "https://m.media-amazon.com/images/I/71PEMMiQ2yL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/61wOWyFSq-L._SL1500_.jpg"
    ],
    "Green": [
      "https://m.media-amazon.com/images/I/71J0U3dRyiL._SL1500_.jpg"
    ],
    "Grey": [
      "https://m.media-amazon.com/images/I/714X-8sm0hL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 41.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71gLnAI8qnL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-ruched-evening-high-split-split",
      "title": "Womens Maxi Dress Maxi Ruched Evening High Split Split",
      "price": 72.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71omaPs6UqL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-short-sleeve-evening",
      "title": "Womens Dress Short Sleeve Evening",
      "price": 89.88,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61vi9CZReDL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-formal-cocktail-evening",
      "title": "Womens Dress Formal Cocktail Evening",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71ctK4kwdWL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 45.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/712FTzeTFLL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-formal-mermaid-evening-ruched",
      "title": "Womens Maxi Dress Formal Mermaid Evening Ruched",
      "price": 74.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61qHc0kmHEL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 37.79,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51WFZKRzSdL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 43.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Work",
      "images": [
        "https://m.media-amazon.com/images/I/81JXmyg5QfL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-sleeveless-split-formal-cocktail-v-neck",
      "title": "Womens Maxi Dress Sleeveless Split Formal Cocktail V Neck",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/51jHZEGYXHL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-ruched",
      "title": "Womens Maxi Dress Long Sleeve Ruched",
      "price": 49.29,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61P6bkbQawL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-one-shoulder-maxi-long-sleeve",
      "title": "Womens Maxi Dress One Shoulder Maxi Long Sleeve",
      "price": 45.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61UljfUsK4L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-long-sleeve-evening-formal",
      "title": "Womens Maxi Dress Cocktail Long Sleeve Evening Formal",
      "price": 46.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/6190eiFreBL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-formal-long-sleeve-evening",
      "title": "Womens Maxi Dress Maxi Formal Long Sleeve Evening",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51enCkUtvSL._SL1500_.jpg"
      ]
    }
  ]
}