{
  "id": "womens-maxi-dress-maxi-long-sleeve-v-neck",
  "handle": "womens-maxi-dress-maxi-long-sleeve-v-neck",
  "sku": "JC2269",
  "asin": "B0D7CH88VN",
  "title": "Womens Maxi Dress Maxi Long Sleeve V Neck",
  "title_original": "PRETTYGARDEN Long Sleeve Dress for Women Fall V Neck Tiered A Line Spring Elegant Modest Flowy Wedding Guest Maxi Dresses",
  "brand": "Visit the PRETTYGARDEN Store",
  "price": 47.99,
  "social_proof": {
    "bought_past_month": 442,
    "text": "442+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/71AFiW7Ma1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71fZF6hwiHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81dsMmEgTeL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Thb85vu0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/716DbKO-Y2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/7178lroGH9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71egzUPOzeL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81ckmK6+upL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71JyqbhEzbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71X05bWl5dL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61OrtXRh9WL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71p5EVfS1LL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Ja+AIkEhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71IxFWHiGkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71eSgevObLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71CPGaZAeXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71xDtk0DavL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61np0MHhvmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Y0UZ9mXeL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61JU8JeZumL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71lTu4A5E8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71avz0z52RL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71pcJgKm1YL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71TPb+2Ad0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71SZi0HKGvL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71q20FJ5FLL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/71AFiW7Ma1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71fZF6hwiHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81dsMmEgTeL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Thb85vu0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/716DbKO-Y2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/7178lroGH9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71egzUPOzeL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81ckmK6+upL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71JyqbhEzbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71X05bWl5dL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61OrtXRh9WL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71p5EVfS1LL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Ja+AIkEhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71IxFWHiGkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71eSgevObLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71CPGaZAeXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71xDtk0DavL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61np0MHhvmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Y0UZ9mXeL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61JU8JeZumL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71lTu4A5E8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71avz0z52RL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71pcJgKm1YL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71TPb+2Ad0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71SZi0HKGvL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71q20FJ5FLL._SL1500_.jpg"
  ],
  "aplus_images": [
    "https://m.media-amazon.com/images/I/31G1TFF1v8L._SL1500_.jpg"
  ],
  "description_images": [
    "https://m.media-amazon.com/images/I/31G1TFF1v8L._SL1500_.jpg"
  ],
  "bullets": [],
  "specs": {
    "Package Dimensions ‏": "‎ 8 x 5 x 2 inches; 4.8 ounces",
    "Item model number ‏": "‎ SF_PR779_W_S",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ July 20, 2024",
    "ASIN ‏": "‎ B0D7CHZDZT",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#56,017 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #551 in Women's Casual Dresses",
    "Customer Reviews": "4.0 4.0 out of 5 stars (527)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Brown",
      "Light Green",
      "Black",
      "Brown Yellow",
      "Coffee",
      "Brick Red",
      "Dark Green",
      "Light Blue",
      "Red",
      "Rose Red",
      "Navy",
      "Pink",
      "White",
      "Purple",
      "Blue Green",
      "Royal Blue",
      "Dark Blue",
      "Jujube Red",
      "Light Khaki"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.0,
    "count": 527,
    "customers_say": "Customers find the dress well-made, flattering, and comfortable, with a perfect length and figure-hugging fit. They like its color and versatility for different occasions, with one customer noting it's suitable for fall events. The fabric quality receives mixed feedback - while some love the material, others find it cheap and thin. Customers disagree on the sizing, with some reporting it runs true to size while others find it too large. The dress wrinkles easily according to multiple reviews. Generated from the text of customer reviews Select to learn more Quality (55) Fit (47) Color (20) Wearability (17) Comfort (15) Fabric quality (31) Size (16) Wrinkle resistance (14) 55 customers mention quality, 47 positive, 8 negative 55 customers mention \"Quality\" 47 positive 8 negative Customers find the dress well made and fun looking, though some mention it has terrible quality. \" ...If you're a stick, this is a great dress . If you have curves or are a bigger gal, this dress is going to fit you a bit oddly.... \" Read more \" It is beautiful , fits a little snug across the chest area, but a larger size would not work everywhere else. I kept it, and wear it to church.... \" Read more \" Very cute very nice soft material, but it runs just a little small. \" Read more \" Pretty color and material. Made well with great flow. I am 5’7” and plan on wearing with knee high black boots for family photo shoot.... \" Read more 47 customers mention fit, 33 positive, 14 negative 47 customers mention \"Fit\" 33 positive 14 negative Customers find the dress has a flattering fit and perfect length, with one customer noting it comes down to the top of their ankle. \" Dress looks very good on and is flattering . Good for work, date night, and semi to formal events. Highly recommend. \" Read more \" ...This is my 5th dress I’ve bought from them and it’s beautiful and so flattering . Fits true to size.... \" Read more \" Did not fit . Returned. \" Read more \" ...It is not see through and fits TTS . The fabric is lightweight. \" Read more 20 customers mention color, 18 positive, 2 negative 20 customers mention \"Color\" 18 positive 2 negative Customers like the dress's color, with one mentioning it's a true red and another noting it's a versatile black option. \" The fabric was thinner than I expected. The color was pretty . Delivery took longer than expected. \" Read more \" ...It is very comfortable and the color is gorgeous . I get lots of compliments when I wear this dress. True to size \" Read more \" ...The picture looks maroon/cranberry but it is a true red . It’s perfect for Valentines Day or Christmas. It is not see through and fits TTS.... \" Read more \" ...The color is beautiful and it fits nicely. \" Read more 17 customers mention wearability, 15 positive, 2 negative 17 customers mention \"Wearability\" 15 positive 2 negative Customers find the dress versatile for different occasions, with one mentioning it's suitable for semi-formal events, while another notes it's not too fancy for office wear. \" ...It’s so flattering and fits TTS. It can easily be dressed up or down . \" Read more \" ...I kept it, and wear it to church . I like that it is conservative, versatile, and flows as I walk.... \" Read more \" This dress will be perfect for our Christmas photos this year! The picture looks maroon/cranberry but it is a true red.... \" Read more \" Love this dress!! Can wear year round ! \" Read more 15 customers mention comfort, 13 positive, 2 negative 15 customers mention \"Comfort\" 13 positive 2 negative Customers find the dress comfortable. \" This is so pretty and comfortable . Everytime I wear it i get compliments. (I might have it on my wishlist in other colors!)... \" Read more \" ...The dress is a bit thin but not see through. It is very comfortable and the color is gorgeous. I get lots of compliments when I wear this dress.... \" Read more \" ...I felt so comfortable and did not worry about anything accidentally showing! \" Read more \" Love! Got so many compliments! Very comfy with some stretch. \" Read more 31 customers mention fabric quality, 20 positive, 11 negative 31 customers mention \"Fabric quality\" 20 positive 11 negative Customers have mixed opinions about the fabric of the dress, with some finding it nice and soft, while others describe it as very thin and cheap. \" Nice material , light, soft, no stretch. One button fell off the first time I put it on. Sewed it back on.... \" Read more \" ...The fabric is very thin and wrinkles easily. Sizing was accurate but I didn't love the dress. I wouldn't recommend it. \" Read more \" Very pretty dress. Fits well. I recommend using it with a belt. Good quality fabric \" Read more \" ...It has a flattering fit and I love the flowy fabric ! \" Read more 16 customers mention size, 9 positive, 7 negative 16 customers mention \"Size\" 9 positive 7 negative Customers have mixed opinions about the dress's sizing, with some finding it true to size while others report it being too large. \" It is absolutely stunning on! I love the material and it is true to size .... \" Read more \" Very cute very nice soft material, but it runs just a little small . \" Read more \" The size is true to size . The length is perfect for evening wear!... \" Read more \" Bodice is to small . It flattens our your chest. No darts to allow room \" Read more 14 customers mention wrinkle resistance, 6 positive, 8 negative 14 customers mention \"Wrinkle resistance\" 6 positive 8 negative Customers have mixed opinions about the dress's wrinkle resistance, with several noting that the material wrinkles very easily. \" ...The fabric is very thin and wrinkles easily . Sizing was accurate but I didn't love the dress. I wouldn't recommend it. \" Read more \" It wrinkles very easily . \" Read more \" This material wrinkles like crazy . It is super light weight and not warm enough to be a fall dress. Maybe it could be a fall dress near the equator.... \" Read more \" I live everything about this dress! Its fit is flattering and it resists wrinkles . My only complaint is that it doesn’t have pockets. \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Flattering and comfortable",
        "body": "Pretty dress! The Pretty Garden brand is one of my favorites on Amazon, and this dress didn't disappoint. The material is much lighter than I expected, so I don't anticipate wearing it much as the days get colder, but it will be a perfect spring dress for the office! Read more",
        "author": "Lauren McNair",
        "rating": 5.0,
        "date": "October 29, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Amazing Dress",
        "body": "LOVE LOVE LOVE this dress. The style is so cute. I am 5’ 2” and it fit me perfect I got a medium! It was a little wrinkly but I steamed it and it came out perfect! It’s not see through what so ever! Read more",
        "author": "Samie Gilbertson",
        "rating": 5.0,
        "date": "December 12, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Good for a swearing in ceremony",
        "body": "Nice dress. Lined. Passed knee. Read more",
        "author": "Kimberly",
        "rating": 4.0,
        "date": "November 2, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars I love the way the dress flows and is very figure flattering!",
        "body": "It is absolutely stunning on! I love the material and it is true to size. I have washed it yet but I’m sure it will wash up beautifully on cold setting. Read more",
        "author": "Nancy Mckay",
        "rating": 5.0,
        "date": "November 8, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Buy one size larger",
        "body": "Didn't fit as well as I would have liked. Probably should have gone a size larger. A little on the small size. Nice material though and color. Read more",
        "author": "Plibby",
        "rating": 3.0,
        "date": "September 10, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "1.0 out of 5 stars Returned",
        "body": "Thr dress was a nice color (I got the green) but it was a little tight in the chest area even though the length was perfect. Read more",
        "author": "Tiffanie Fernandez",
        "rating": 1.0,
        "date": "December 20, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Great fit for a maternity shoot",
        "body": "Loved this dress! Used for a Christmas photoshoot! Read more",
        "author": "Marlyn Colon",
        "rating": 5.0,
        "date": "December 21, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Pretty in Green",
        "body": "Very cute and comfortable Read more",
        "author": "Amanda S",
        "rating": 5.0,
        "date": "December 19, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Maxi Long Sleeve V Neck is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.",
  "about_this_item": "Womens Maxi Dress Maxi Long Sleeve V Neck is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.",
  "long_description": "Womens Maxi Dress Maxi Long Sleeve V Neck is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Brown, Light Green, Black, Brown Yellow, Coffee, Brick Red, Dark Green, Light Blue, Red, Rose Red, Navy, Pink, White, Purple. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Maxi Long Sleeve V Neck is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/31G1TFF1v8L._SL1500_.jpg",
      "alt": "Womens Maxi Dress Maxi Long Sleeve V Neck details image 1"
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Brown, Light Green, Black, Brown Yellow, Coffee, Brick Red, Dark Green, Light Blue, Red, Rose Red, Navy, Pink, White, Purple. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "49eb655f-7fca-4cce-b69b-e99e05432aa0",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/49eb655f-7fca-4cce-b69b-e99e05432aa0/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/49eb655f-7fca-4cce-b69b-e99e05432aa0/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/388061e2-a3b8-4d93-a679-18c6567d372e.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "6663e83e-d330-45d2-984a-b2360ec3059f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6663e83e-d330-45d2-984a-b2360ec3059f/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6663e83e-d330-45d2-984a-b2360ec3059f/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/388061e2-a3b8-4d93-a679-18c6567d372e.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "28a9c9cd-fdb3-4dca-b540-f89c7a041dea",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/28a9c9cd-fdb3-4dca-b540-f89c7a041dea/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/28a9c9cd-fdb3-4dca-b540-f89c7a041dea/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/388061e2-a3b8-4d93-a679-18c6567d372e.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "84ebcc59-40f5-4aea-a89b-9ee47bac6732",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/84ebcc59-40f5-4aea-a89b-9ee47bac6732/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/84ebcc59-40f5-4aea-a89b-9ee47bac6732/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/388061e2-a3b8-4d93-a679-18c6567d372e.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "aa5cf3f9-8041-458a-9cad-a71e97a252d8",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/aa5cf3f9-8041-458a-9cad-a71e97a252d8/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/aa5cf3f9-8041-458a-9cad-a71e97a252d8/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/388061e2-a3b8-4d93-a679-18c6567d372e.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "ba74652f-9645-4791-8cc2-b88deab01ab0",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ba74652f-9645-4791-8cc2-b88deab01ab0/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ba74652f-9645-4791-8cc2-b88deab01ab0/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/388061e2-a3b8-4d93-a679-18c6567d372e.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "f90d2b45-fa56-4d30-8f1b-e64b7ec39649",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f90d2b45-fa56-4d30-8f1b-e64b7ec39649/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f90d2b45-fa56-4d30-8f1b-e64b7ec39649/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/388061e2-a3b8-4d93-a679-18c6567d372e.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "76220d0e-7e30-4899-a237-ae5a7a5c2588",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/76220d0e-7e30-4899-a237-ae5a7a5c2588/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/76220d0e-7e30-4899-a237-ae5a7a5c2588/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/388061e2-a3b8-4d93-a679-18c6567d372e.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "5084b3ec-8f2b-4110-847a-4ddfd9f51dc9",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5084b3ec-8f2b-4110-847a-4ddfd9f51dc9/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5084b3ec-8f2b-4110-847a-4ddfd9f51dc9/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/388061e2-a3b8-4d93-a679-18c6567d372e.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "bc60ab68-9d3c-4376-b020-ea12f4453b6e",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bc60ab68-9d3c-4376-b020-ea12f4453b6e/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bc60ab68-9d3c-4376-b020-ea12f4453b6e/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/388061e2-a3b8-4d93-a679-18c6567d372e.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "3380c2e4-b819-433b-8935-d9d499871b4d",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3380c2e4-b819-433b-8935-d9d499871b4d/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3380c2e4-b819-433b-8935-d9d499871b4d/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/388061e2-a3b8-4d93-a679-18c6567d372e.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "edd6a685-6353-4cf7-a784-96df253c3baa",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/edd6a685-6353-4cf7-a784-96df253c3baa/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/edd6a685-6353-4cf7-a784-96df253c3baa/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/388061e2-a3b8-4d93-a679-18c6567d372e.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Brown": "https://m.media-amazon.com/images/I/31D0PTnL1SL._AC_SR38,50_.jpg",
    "Light Green": "https://m.media-amazon.com/images/I/316CwYO0hsL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31Wnw7J7qQL._AC_SR38,50_.jpg",
    "Brown Yellow": "https://m.media-amazon.com/images/I/318gHXfzRiL._AC_SR38,50_.jpg",
    "Coffee": "https://m.media-amazon.com/images/I/31fz7xlS8zL._AC_SR38,50_.jpg",
    "Brick Red": "https://m.media-amazon.com/images/I/31ZdxEKEEeL._AC_SR38,50_.jpg",
    "Dark Green": "https://m.media-amazon.com/images/I/31swF0rOalL._AC_SR38,50_.jpg",
    "Light Blue": "https://m.media-amazon.com/images/I/31ZQs6Z9bfL._AC_SR38,50_.jpg",
    "Red": "https://m.media-amazon.com/images/I/319P1L0KzvL._AC_SR38,50_.jpg",
    "Rose Red": "https://m.media-amazon.com/images/I/31DsQytq-fL._AC_SR38,50_.jpg",
    "Navy": "https://m.media-amazon.com/images/I/31SRbHYsYEL._AC_SR38,50_.jpg",
    "Pink": "https://m.media-amazon.com/images/I/31OMTvGU7CL._AC_SR38,50_.jpg",
    "White": "https://m.media-amazon.com/images/I/212FtC+49OL._AC_SR38,50_.jpg",
    "Purple": "https://m.media-amazon.com/images/I/31OOJMXgsFL._AC_SR38,50_.jpg",
    "Blue Green": "https://m.media-amazon.com/images/I/31bqCmU1fOL._AC_SR38,50_.jpg",
    "Royal Blue": "https://m.media-amazon.com/images/I/31id-UOTv-L._AC_SR38,50_.jpg",
    "Dark Blue": "https://m.media-amazon.com/images/I/31ZWuM7TFSL._AC_SR38,50_.jpg",
    "Jujube Red": "https://m.media-amazon.com/images/I/318GJYABleL._AC_SR38,50_.jpg",
    "Light Khaki": "https://m.media-amazon.com/images/I/31p4ke94jLL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Brown": "71JyqbhEzbL",
    "Light Green": "71X05bWl5dL",
    "Black": "61OrtXRh9WL",
    "Brown Yellow": "71p5EVfS1LL",
    "Coffee": "71Ja+AIkEhL",
    "Brick Red": "71IxFWHiGkL",
    "Dark Green": "71AFiW7Ma1L",
    "Light Blue": "71eSgevObLL",
    "Red": "71CPGaZAeXL",
    "Rose Red": "71xDtk0DavL",
    "Navy": "61np0MHhvmL",
    "Pink": "71Y0UZ9mXeL",
    "White": "61JU8JeZumL",
    "Purple": "71lTu4A5E8L",
    "Blue Green": "71avz0z52RL",
    "Royal Blue": "71pcJgKm1YL",
    "Dark Blue": "71TPb+2Ad0L",
    "Jujube Red": "71SZi0HKGvL",
    "Light Khaki": "71q20FJ5FLL"
  },
  "color_images": {
    "Brown": [
      "https://m.media-amazon.com/images/I/71JyqbhEzbL._SL1500_.jpg"
    ],
    "Light Green": [
      "https://m.media-amazon.com/images/I/71X05bWl5dL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/61OrtXRh9WL._SL1500_.jpg"
    ],
    "Brown Yellow": [
      "https://m.media-amazon.com/images/I/71p5EVfS1LL._SL1500_.jpg"
    ],
    "Coffee": [
      "https://m.media-amazon.com/images/I/71Ja+AIkEhL._SL1500_.jpg"
    ],
    "Brick Red": [
      "https://m.media-amazon.com/images/I/71IxFWHiGkL._SL1500_.jpg"
    ],
    "Dark Green": [
      "https://m.media-amazon.com/images/I/71AFiW7Ma1L._SL1500_.jpg"
    ],
    "Light Blue": [
      "https://m.media-amazon.com/images/I/71eSgevObLL._SL1500_.jpg"
    ],
    "Red": [
      "https://m.media-amazon.com/images/I/71CPGaZAeXL._SL1500_.jpg"
    ],
    "Rose Red": [
      "https://m.media-amazon.com/images/I/71xDtk0DavL._SL1500_.jpg"
    ],
    "Navy": [
      "https://m.media-amazon.com/images/I/61np0MHhvmL._SL1500_.jpg"
    ],
    "Pink": [
      "https://m.media-amazon.com/images/I/71Y0UZ9mXeL._SL1500_.jpg"
    ],
    "White": [
      "https://m.media-amazon.com/images/I/61JU8JeZumL._SL1500_.jpg"
    ],
    "Purple": [
      "https://m.media-amazon.com/images/I/71lTu4A5E8L._SL1500_.jpg"
    ],
    "Blue Green": [
      "https://m.media-amazon.com/images/I/71avz0z52RL._SL1500_.jpg"
    ],
    "Royal Blue": [
      "https://m.media-amazon.com/images/I/71pcJgKm1YL._SL1500_.jpg"
    ],
    "Dark Blue": [
      "https://m.media-amazon.com/images/I/71TPb+2Ad0L._SL1500_.jpg"
    ],
    "Jujube Red": [
      "https://m.media-amazon.com/images/I/71SZi0HKGvL._SL1500_.jpg"
    ],
    "Light Khaki": [
      "https://m.media-amazon.com/images/I/71q20FJ5FLL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-maxi-cocktail",
      "title": "Womens Maxi Dress Maxi Cocktail",
      "price": 41.83,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61bcjfniXPL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 33.29,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71w-AYLMHbL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-formal-evening",
      "title": "Womens Dress Formal Evening",
      "price": 72.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/616d5PsvI0L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-sleeveless",
      "title": "Womens Maxi Dress Maxi Sleeveless",
      "price": 44.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71Jeyaza1PL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-formal",
      "title": "Womens Dress Formal",
      "price": 89.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/615KFis5FsL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-evening-maxi-bodycon",
      "title": "Womens Maxi Dress Evening Maxi Bodycon",
      "price": 48.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61hfLAiSHJL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-long-sleeve",
      "title": "Womens Maxi Dress Bodycon Long Sleeve",
      "price": 40.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61Bip0Ce6yL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-long-sleeve-maxi",
      "title": "Womens Maxi Dress Cocktail Long Sleeve Maxi",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/615VfveT48L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-long-sleeve",
      "title": "Womens Maxi Dress Maxi Long Sleeve",
      "price": 56.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71r1yPvvMgL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/519tG3nYUjL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-sleeveless-maxi",
      "title": "Womens Maxi Dress Formal Sleeveless Maxi",
      "price": 46.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/712ZV1MdHUL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 412.59,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/619I8zkBx3L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 159.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71WPWDwHGyL._SL1500_.jpg"
      ]
    }
  ]
}