{
  "id": "womens-dress-boat-neck-short-sleeve",
  "handle": "womens-dress-boat-neck-short-sleeve",
  "sku": "JC3131",
  "asin": "B0D7GZJ874",
  "title": "Womens Dress Boat Neck Short Sleeve",
  "title_original": "XXTAXN Women's Summer Boat Neck Short Sleeve Elegant Y2k A Line Mini Dress",
  "brand": "Visit the XXTAXN Store",
  "price": 41.99,
  "social_proof": {
    "bought_past_month": 1628,
    "text": "1628+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/51whoY8xuBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61SPisnYEHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61VmIDdIRbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61BtansTXML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61DW4FQu0NL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61qj9+HgiwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61mGIyd+KuL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61BUNbdy7cL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71QUMsL2pCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51pzlPxonSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51-V9xrbwTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/415MG3r-IlL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51A3WnRwbjL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/51whoY8xuBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61SPisnYEHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61VmIDdIRbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61BtansTXML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61DW4FQu0NL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61qj9+HgiwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61mGIyd+KuL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61BUNbdy7cL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71QUMsL2pCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51pzlPxonSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51-V9xrbwTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/415MG3r-IlL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51A3WnRwbjL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Item model number ‏": "‎ XX315",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ June 19, 2024",
    "ASIN ‏": "‎ B0D7H19XTN",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#30,853 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #380 in Women's Casual Dresses",
    "Customer Reviews": "4.3 4.3 out of 5 stars (278)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Red",
      "Winered",
      "White",
      "Black",
      "Green"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.3,
    "count": 278,
    "customers_say": "Customers find the dress chic and versatile, with one mentioning it can be dressed up or down, and they appreciate its flattering fit that shows the silhouette without hugging too tight. The dress receives positive feedback for its quality, stretchiness, and figure-flattering design, with one customer noting how it hugs the body without showing imperfections. The length and material quality receive mixed reviews - while some say it hits above the knee, others find it very short, and while some praise the material for not being thin, others describe it as plastic-like. The sizing is also mixed, with some finding it great while others say it runs small. Select to learn more Style Fit Quality Stretchiness Flattering Length Material quality Size 69 customers mention \"Style\" 67 positive 2 negative Customers find the dress chic and versatile, with one customer noting it can be dressed up or down, while another mentions it matched their daughter's graduation theme. \"...a long torso and it is pretty short, but the top makes it classy and cute while being sexy....\" Read more \"Its perfect. It’s SO CUTE ! I got so many compliments. Guys true to size and has some stretch to it. Will definitely be buying in other colors.\" Read more \"...It’s super cute and surprisingly good/thick material. I’m 5’4 and it’s a bit short on me but not an issue if you’re shorter or wear with tights.\" Read more \"...It’s a beautiful dress , the length is above the knee and material is a little stretchy and doesn’t look cheap....\" Read more 45 customers mention \"Fit\" 37 positive 8 negative Customers like the dress's fit, describing it as sexy and flattering, though some mention it is very tight around the stomach. \"...It is so cute and fits perfectly . I ordered a small and usually wear a small. The black with the white bows is so cute. Can dress up or down....\" Read more \"Absolutely love this dress, tons of compliments. Fit perfectly , not to short for my 5'1 frame\" Read more \"...Neck Short Sleeve Elegant Y2K A-Line Mini Dress is praised for its flattering fit , lightweight fabric, and versatile A-line design, making it...\" Read more \"...i am usually between a medium and a large and i found that the large fit perfectly . this is a high quality dress and very comfy and flattering....\" Read more 22 customers mention \"Quality\" 20 positive 2 negative Customers find the dress lovely made and perfect for special occasions like birthdays. \"...Honestly, it would make such a great dress for even a date night too....\" Read more \"Surprisingly good quality ...\" Read more \"...Great fit and fabric ! It is a bit on the short side. However great dress overall .\" Read more \"The perfect dress . So comfortable because of the spandex, yet so chic! Perfect length.\" Read more 16 customers mention \"Stretchiness\" 15 positive 1 negative Customers appreciate that the dress has some stretch in the quality material. \"Very cute dress, has stretch , and material feels great, not thin at all. I’m 5ft 10in, 34B bra size, and weigh 145lbs....\" Read more \"Fits, like a glove. The material is stretchy , short chic, however the bows are white.\" Read more \"...It’s a beautiful dress, the length is above the knee and material is a little stretchy and doesn’t look cheap....\" Read more \"...It’s SO CUTE! I got so many compliments. Guys true to size and has some stretch to it . Will definitely be buying in other colors.\" Read more 15 customers mention \"Flattering\" 14 positive 1 negative Customers find the dress flattering, with one customer noting it hugs the body without showing imperfections, while another mentions it hides lower belly pooch. \" very flattering and comfortable! I ordered a small at first because I usually am a small, but it was way too short....\" Read more \"...this is a high quality dress and very comfy and flattering . a bit of an odd smell though. it is also very stretchy.\" Read more \"So cute and figure flattering ! I'm 4'11\" it's the perfect length for me. I got so many compliments when I wore it\" Read more \"This fit me very well as it hit every curve . I’m 36 DD, smaller waist and then a bit of a lower tummy....\" Read more 31 customers mention \"Length\" 14 positive 17 negative Customers have mixed opinions about the dress's length, with some finding it above the knee while others consider it very short. \"Beautiful dress but I had to return because it was too short for me\" Read more \"...I'm 5'1 and it fits me a few inches above the knee so not too short and not too long....\" Read more \"I really like this dress but it is way too short . I ordered a M and I am 5’4” and 150. It fit great but otherwise and was nice....\" Read more \"...It shows your silhouette without hugging too tight. It’s also the perfect length , not too long and not uncomfortably short....\" Read more 31 customers mention \"Material quality\" 21 positive 10 negative Customers have mixed opinions about the dress's material, with some finding it great and not thin, while others describe it as plastic-like. \"The dress is nice material with a bit of spandex to allow for a better fit. Ordered a size XL (typically I'm a 12)....\" Read more \"...It looks good on. The material is great (good quality polyester) and is not see-through . Medium weight material that is not thin at all....\" Read more \"Ridiculously small and the material is basically plastic \" Read more \" Fabric is light and breathable but thick enough to wear in fall. I ordered a XL but it stretches enough to wear I exchanged it for a Large....\" Read more 16 customers mention \"Size\" 9 positive 7 negative Customers have mixed opinions about the dress's size, with some finding the sizing great while others say it runs a bit small. \" True to size and super cute!!! Get it!! You’ll love it!\" Read more \" Ridiculously small and the material is basically plastic\" Read more \"I adore this dress! Sizing was perfect ! Every girl needs a little black dress. This one looks like I spent three times what I did!...\" Read more \"...As others said, it hits very short and I found it ran a little small .\" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Buy now and thank me later!!",
        "body": "HOLY CURVE A LICIOUS fit! This dress is snug in the top but fits like a glove! The top has a cut out slit which is really cute with the white bows down the front. This dress does hit me a little shorter in the leg so I’d pair it with a more opaque tight! Otherwise this dress is incredible and the color is a deep burgundy which is a great winter color! Read more",
        "author": "everydaywith_jamie",
        "rating": 5.0,
        "date": "November 16, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Buy this dress",
        "body": "Absolutely LOVE this dress! I purchased it for mt bf's corporate Christmas party and can't wait to wear it! I have a long torso and it is pretty short, but the top makes it classy and cute while being sexy. The fabric is quality, the size is spot on and it fits my curves like a glove. I would give it more than 5 stars if I could. Buy. The. Dress! 5'8\", 36-38DD, 170# ordered a large Read more",
        "author": "Kylie",
        "rating": 5.0,
        "date": "November 12, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Great Dress!",
        "body": "Saw this dress on Tik tok but wanted to be able to return so ordered from here. It is so cute and fits perfectly. I ordered a small and usually wear a small. The black with the white bows is so cute. Can dress up or down. It is a little short, I am 5’6” and will either not be able to bend over or will have to wear little shorts under. I am fine with that though because it is so cute on. It does have some stretch. Read more",
        "author": "Customer",
        "rating": 5.0,
        "date": "August 27, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars NOT too short!!!!!",
        "body": "I was afraid this dress(small) would be baggy on me and just hang straight down, but it still followed the curves of the body so I love it! At 110lb-36B I was a little worried about this! It looks good on. The material is great(good quality polyester) and is not see-through . Medium weight material that is not thin at all. It looks just like depicted. The color is as depicted as well. It looked very short on my Amazon website!!!!! I am 5 foot four and it is mid thigh so it’s the perfect cute length for someone of that height. Adorable dress. Read more",
        "author": "Clothes Lover",
        "rating": 5.0,
        "date": "June 16, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71miG5x2J6L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "4.0 out of 5 stars Nice dress",
        "body": "Beautiful dress for little girls! Read more",
        "author": "Shaleese Turner",
        "rating": 4.0,
        "date": "November 16, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Had to size up, but so cute!",
        "body": "very flattering and comfortable! I ordered a small at first because I usually am a small, but it was way too short. I ordered a medium and the length and fit is perfect. It’s not as form fitting as the small, but I’m fine with that. I still think it’s very flattering. Read more",
        "author": "cam",
        "rating": 5.0,
        "date": "August 1, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61Pg8hA+AvL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "1.0 out of 5 stars Bad fit",
        "body": "Material feels like curtains. There isn't any shape to this dress. Read more",
        "author": "Tisha",
        "rating": 1.0,
        "date": "November 15, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "2.0 out of 5 stars Wanted it to work- Just not it.",
        "body": "I wanted to love this as it looks adorable in pictures, but I just didn't. The fabric is very cheap and thin. As others said, it hits very short and I found it ran a little small. Read more",
        "author": "rachrhodes12",
        "rating": 2.0,
        "date": "December 3, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Dress Boat Neck Short Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.",
  "about_this_item": "Womens Dress Boat Neck Short Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.",
  "long_description": "Womens Dress Boat Neck Short Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Red, Winered, White, Black, Green. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Dress Boat Neck Short Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Red, Winered, White, Black, Green. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "b11465ff-a8d3-425e-8d1c-29c66c7a0bc8",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b11465ff-a8d3-425e-8d1c-29c66c7a0bc8/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b11465ff-a8d3-425e-8d1c-29c66c7a0bc8/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "0e742a13-9595-4c3b-ba10-ce1f06a09450",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0e742a13-9595-4c3b-ba10-ce1f06a09450/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0e742a13-9595-4c3b-ba10-ce1f06a09450/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "52709c55-2feb-47c2-9664-cef47d852a56",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/52709c55-2feb-47c2-9664-cef47d852a56/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/52709c55-2feb-47c2-9664-cef47d852a56/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "95485b4b-c8b5-4077-94ed-a95d034c1897",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/95485b4b-c8b5-4077-94ed-a95d034c1897/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/95485b4b-c8b5-4077-94ed-a95d034c1897/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "33778050-145f-4db2-8bc5-ecac6f5bb6ae",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/33778050-145f-4db2-8bc5-ecac6f5bb6ae/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/33778050-145f-4db2-8bc5-ecac6f5bb6ae/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "63809a6e-a2a6-49aa-8c20-4d49e6386a33",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/63809a6e-a2a6-49aa-8c20-4d49e6386a33/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/63809a6e-a2a6-49aa-8c20-4d49e6386a33/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "d5874d40-98d0-408e-9e3b-2381a9652796",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d5874d40-98d0-408e-9e3b-2381a9652796/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d5874d40-98d0-408e-9e3b-2381a9652796/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "ec2cfd03-4361-4906-ad3a-be2514b4f371",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ec2cfd03-4361-4906-ad3a-be2514b4f371/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ec2cfd03-4361-4906-ad3a-be2514b4f371/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "02a5b8bf-74b3-41f0-9ff3-a553d56ca1a9",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/02a5b8bf-74b3-41f0-9ff3-a553d56ca1a9/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/02a5b8bf-74b3-41f0-9ff3-a553d56ca1a9/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "f992c0b4-f4e2-4a83-94f1-b24951b27e6a",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f992c0b4-f4e2-4a83-94f1-b24951b27e6a/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f992c0b4-f4e2-4a83-94f1-b24951b27e6a/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "3e5669f5-d360-4bb6-9abe-15a29ce54018",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3e5669f5-d360-4bb6-9abe-15a29ce54018/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3e5669f5-d360-4bb6-9abe-15a29ce54018/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "d22af0dd-e2c5-4378-a0ac-583b44ee57b9",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d22af0dd-e2c5-4378-a0ac-583b44ee57b9/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d22af0dd-e2c5-4378-a0ac-583b44ee57b9/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Red": "https://m.media-amazon.com/images/I/314w7Uf1K4L._AC_SR38,50_.jpg",
    "Winered": "https://m.media-amazon.com/images/I/313NvjRw4CL._AC_SR38,50_.jpg",
    "White": "https://m.media-amazon.com/images/I/31yE0S+MdaL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31IZwFWp3UL._AC_SR38,50_.jpg",
    "Green": "https://m.media-amazon.com/images/I/31Pys4nAJHL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Red": "51pzlPxonSL",
    "Winered": "51-V9xrbwTL",
    "White": "415MG3r-IlL",
    "Black": "51whoY8xuBL",
    "Green": "51A3WnRwbjL"
  },
  "color_images": {
    "Red": [
      "https://m.media-amazon.com/images/I/51pzlPxonSL._SL1500_.jpg"
    ],
    "Winered": [
      "https://m.media-amazon.com/images/I/51-V9xrbwTL._SL1500_.jpg"
    ],
    "White": [
      "https://m.media-amazon.com/images/I/415MG3r-IlL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/51whoY8xuBL._SL1500_.jpg"
    ],
    "Green": [
      "https://m.media-amazon.com/images/I/51A3WnRwbjL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 178.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71soUlQJp7L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-bodycon",
      "title": "Womens Maxi Dress Long Sleeve Bodycon",
      "price": 33.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51h6UXGlVHL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-mermaid-formal-evening",
      "title": "Womens Maxi Dress Mermaid Formal Evening",
      "price": 89.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51ZwWhqKP8L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-maxi",
      "title": "Womens Maxi Dress Formal Maxi",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71vrdaLYp0L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-long-sleeve",
      "title": "Womens Maxi Dress Bodycon Long Sleeve",
      "price": 35.69,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61PbYIMkr1L._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-maxi-long-sleeve-v-neck",
      "title": "Womens Maxi Dress Maxi Long Sleeve V Neck",
      "price": 47.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71AFiW7Ma1L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-mermaid-evening-formal-long-sleeve",
      "title": "Womens Maxi Dress Mermaid Evening Formal Long Sleeve",
      "price": 89.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/617AQwGzPJL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-bodycon-v-neck-cocktail",
      "title": "Womens Dress Bodycon V Neck Cocktail",
      "price": 35.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/71iCnekV5RL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 40.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/710dnDgmBGL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-mermaid",
      "title": "Womens Maxi Dress Mermaid",
      "price": 169.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71XYPHhe+uL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail-bodycon-ruched",
      "title": "Womens Dress Cocktail Bodycon Ruched",
      "price": 54.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61NkbYTg92L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-off-shoulder",
      "title": "Womens Maxi Dress Off Shoulder",
      "price": 103.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51ipqmzN4IL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 32.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61PAMnsaq3L._SL1500_.jpg"
      ]
    }
  ]
}