{
  "id": "womens-maxi-dress-split-high-split-maxi-sleeveless",
  "handle": "womens-maxi-dress-split-high-split-maxi-sleeveless",
  "sku": "JC1953",
  "asin": "B0D7W35Q51",
  "title": "Womens Maxi Dress Split High Split Maxi Sleeveless",
  "title_original": "Memoriesea Women's Sexy High Split Sleeveless Backless Party Wedding Maxi Dress",
  "brand": "Visit the Memoriesea Store",
  "price": 51.99,
  "social_proof": {
    "bought_past_month": 239,
    "text": "239+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/512MajSR6WL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61wVd28qmvL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71qoxNxPp4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61jbYFb84kL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71wHb5p5rLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71mX7MnAl2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71w9K-n3z3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51hM3qYAUOL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51AcN6WDaIL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/514kR2cQgeL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/512MajSR6WL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61wVd28qmvL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71qoxNxPp4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61jbYFb84kL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71wHb5p5rLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71mX7MnAl2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71w9K-n3z3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51hM3qYAUOL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51AcN6WDaIL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/514kR2cQgeL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Product Dimensions ‏": "‎ 6.3 x 4.72 x 0.39 inches",
    "Item model number ‏": "‎ ME065",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ June 24, 2024",
    "ASIN ‏": "‎ B0D7W3HVRR",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#58,163 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #184 in Women's Formal Dresses",
    "Customer Reviews": "4.2 4.2 out of 5 stars (209)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Red",
      "Rose Red",
      "Purple",
      "Black"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.2,
    "count": 209,
    "customers_say": "Customers find the dress amazing in quality and appreciate its perfect fit and flattering appearance. The dress is comfortable, stretchy, and thick, with one customer noting it's not thin or see-through. The material quality receives mixed feedback, with some customers describing it as nice while others find it cheap. Generated from the text of customer reviews Select to learn more Quality (30) Looks (26) Fit (24) Material thickness (13) Stretchiness (13) Comfort (11) Flattering (10) Material quality (20) 30 customers mention quality, 25 positive, 5 negative 30 customers mention \"Quality\" 25 positive 5 negative Customers praise the dress's quality, describing it as gorgeous and well-made, with one customer noting it feels expensive. \" Good quality nice thick material and true to size but the slit is just a little too high for comfort \" Read more \" Loved this dress !! Perfect fit & length! \" Read more \" Wish I had better pictures of this amazing dress !... \" Read more \" This dress was amazing I got a lot of compliments! It really flatters your curves! \" Read more 26 customers mention looks, 24 positive, 2 negative 26 customers mention \"Looks\" 24 positive 2 negative Customers find the dress visually appealing. \" Very cute and sexy I wore it on the virgin cruise. Everyone jumped in the pool in their clothes and this dress still rocks. \" Read more \" super cute but came with a big giant stain :... \" Read more \" ...The slight was too high but i altered it and it was beautiful . Wore it to a wedding and got so many compliments on it! \" Read more \" Gorgeous !... \" Read more 24 customers mention fit, 17 positive, 7 negative 24 customers mention \"Fit\" 17 positive 7 negative Customers are satisfied with how the dress fits. \" Wore this dress to a wedding and got lots of compliments! It fit perfectly . The quality is really nice! I’m 5’8 and I got a medium. \" Read more \" ...It fits true to size . I wore it to a wedding and got so many compliments. I will definitely be ordering it in more colors \" Read more \" This was cute, but way too big , and I ordered per size chart. It was also very wrinkled and took a good ironing to try to get out the wrinkles.... \" Read more \" Dress fits like a glove ! Super stylish and got so many compliments \" Read more 13 customers mention material thickness, 12 positive, 1 negative 13 customers mention \"Material thickness\" 12 positive 1 negative Customers appreciate the dress's material thickness, with one noting it's not thin or see-through. \" ...The material is thick , feels expensive, and also has a good amount of stretch (I should note tho it’s not THAT stretchy).... \" Read more \" ...Beautiful material, thick and a good stretch. Ordered size small which states for size 4, size 2 usually worn but it fit perfect. \" Read more \" AMAZING quality. Very thick dress and for the price, you can't beat this quality. THe length is perfect, im 5'4.... \" Read more \" ...It was so soft and stretchy. I think the material was the perfect thickness and for the money it was so worth it! \" Read more 13 customers mention stretchiness, 11 positive, 2 negative 13 customers mention \"Stretchiness\" 11 positive 2 negative Customers like the dress's stretchiness, with one mentioning that the size and fit are perfect for their body. \" ...It was so soft and stretchy . I think the material was the perfect thickness and for the money it was so worth it! \" Read more \" Nice material and has a little stretch . It can be worn casual or formal, just add accessories and bam! \" Read more \" ...say it’s definitely a soft, silky, good quality thick material with some stretch . I’m 5’2” and just touches the floor barefoot.... \" Read more \" ...True to size, has some stretch to it . \" Read more 11 customers mention comfort, 11 positive, 0 negative 11 customers mention \"Comfort\" 11 positive 0 negative Customers find the dress comfortable, with one mentioning its stretchy material. \" Amazing I love it fits like a glove and so comfortable and lightweight but also not a super thin cheap material feeling I love how they have the bow... \" Read more \" ...Spectacular! I loved this dress; it is extremely comfortable and elegant, but at the same time, I could wear it for a dinner with friends.... \" Read more \" ...I wore it for a work gala. Great fit, very comfortable . For reference Im 5’ 4” about 195lbs and I got a large.... \" Read more \" ...It’s very flattering, and the material is thick. It’s strechy and looks great. \" Read more 10 customers mention flattering, 9 positive, 1 negative 10 customers mention \"Flattering\" 9 positive 1 negative Customers find the dress flattering, with one mentioning that it hugs all their curves. \" The dress fit so well , very good quality. It’s very flattering , and the material is thick. It’s strechy and looks great. \" Read more \" OBSESSED! This dress was everything and more. Super flattering and the material was soft and flexible \" Read more \" ...The colour red is a bright cherry red. It hugs all your curves and makes you feel gorgeous \" Read more \" ...i got a size small. i'm 5'4\" and 130lbs! it was absolutely flattering .... \" Read more 20 customers mention material quality, 12 positive, 8 negative 20 customers mention \"Material quality\" 12 positive 8 negative Customers have mixed opinions about the dress's material quality, with some finding it nice while others describe it as cheap. \" Nice material and has a little stretch. It can be worn casual or formal, just add accessories and bam! \" Read more \" Does not look like satin at all once you try it on. It’s more of a spandex material and it is very thin so you can see any undergarments. \" Read more \" This was a beautiful dress. The material was amazing . I did have a tailored so it could really fit my waist very elegant.... \" Read more \" horrible fabric \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Buy the dress!!",
        "body": "This dress was so perfect, the fit, the split, the silky texture. So worth the money, I got so many compliments and danced the night away. I felt like a million bucks! Read more",
        "author": "Karinforya",
        "rating": 5.0,
        "date": "December 10, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Gorgeous!",
        "body": "Super happy, can’t beat the price for this gorgeous dress. Beautiful material, thick and a good stretch. Ordered size small which states for size 4, size 2 usually worn but it fit perfect. Read more",
        "author": "Brett Inglehart",
        "rating": 5.0,
        "date": "November 4, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Fits true to size",
        "body": "This dress exceeds expectations! Fit like an absolute glove. Quality was on point and was so comfortable. Ordered a size small and my daughter is 5’3 112 lbs and the dress looked like it was designed just for her! This dress is a go!!! Read more",
        "author": "Customer",
        "rating": 5.0,
        "date": "December 16, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/713899K+0lL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "1.0 out of 5 stars More like spandex than satin",
        "body": "Does not look like satin at all once you try it on. It’s more of a spandex material and it is very thin so you can see any undergarments. Read more",
        "author": "Monica I.",
        "rating": 1.0,
        "date": "November 9, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Sexy, fabulous",
        "body": "This dress looked very fancy, beautiful and sexy. We had to send it back because my daughter was too young for a dress like this, but an older teen or twenty something would like amazing in this dress. She tried on a size small, 5’6’’ 139 athletic build. We might have kept it but the slit was really high and I didn’t think she was old enough for something like that. Read more",
        "author": "Customer",
        "rating": 5.0,
        "date": "October 29, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Beautiful! yet too revealing in the back for me",
        "body": "Very nice dress. Beautiful color and material. A little too open in the back for my taste. It fit well for my frame 5’10 / 169lbs but too revealing for my preference Read more",
        "author": "Skye Square",
        "rating": 4.0,
        "date": "March 4, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Gorgeous!",
        "body": "I got this last minute for a party and it’s stunning! It’s satin material and feels/looks very expensive Read more",
        "author": "Simmone",
        "rating": 5.0,
        "date": "December 1, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars IF YOU'RE THINKIN ABOUT GETTING IT JUST GET IT",
        "body": "i loved my dress so much! i wore this to a wedding reception and received so many compliments. i also just used a sticky bra on the inside. i got a size small. i'm 5'4\" and 130lbs! it was absolutely flattering. but i did need help to tie the tie on the back behind my neck to keep it tight because if it's loose, it'll make the side of the dress look kinda weird. it'll look loose under the armpit area. it's a bit stretchy and comfortable as well! the material is pretty thick and doesn't feel cheap at all! Read more",
        "author": "Danielle Wilson",
        "rating": 5.0,
        "date": "August 12, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61co6kkzh9L._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71SN22FdKIL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/61w5d-le35L._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71xLWVJBbTL._SY88._SL1500_.jpg"
        ]
      }
    ]
  },
  "short_description": "Womens Maxi Dress Split High Split Maxi Sleeveless is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.",
  "about_this_item": "Womens Maxi Dress Split High Split Maxi Sleeveless is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.",
  "long_description": "Womens Maxi Dress Split High Split Maxi Sleeveless is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Red, Rose Red, Purple, Black. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Split High Split Maxi Sleeveless is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Red, Rose Red, Purple, Black. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "b31267d9-565d-497b-9962-d876e7f6d585",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b31267d9-565d-497b-9962-d876e7f6d585/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b31267d9-565d-497b-9962-d876e7f6d585/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/d91d0d6a-3361-4a08-8db3-bb5604dd06eb.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "c5ba07f2-bf6f-4d01-a5f6-abb6cf5415a8",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c5ba07f2-bf6f-4d01-a5f6-abb6cf5415a8/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c5ba07f2-bf6f-4d01-a5f6-abb6cf5415a8/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/d91d0d6a-3361-4a08-8db3-bb5604dd06eb.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "d40740db-a649-44eb-afde-1194b1013975",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d40740db-a649-44eb-afde-1194b1013975/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d40740db-a649-44eb-afde-1194b1013975/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/d91d0d6a-3361-4a08-8db3-bb5604dd06eb.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "326e06b4-6b70-461c-9fba-933d82e70524",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/326e06b4-6b70-461c-9fba-933d82e70524/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/326e06b4-6b70-461c-9fba-933d82e70524/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/d91d0d6a-3361-4a08-8db3-bb5604dd06eb.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "c94203d7-cd5c-4cee-87ed-29e058ada66c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c94203d7-cd5c-4cee-87ed-29e058ada66c/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c94203d7-cd5c-4cee-87ed-29e058ada66c/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/d91d0d6a-3361-4a08-8db3-bb5604dd06eb.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "fc9298b4-743d-4e41-b10b-681ae913aa92",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/fc9298b4-743d-4e41-b10b-681ae913aa92/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/fc9298b4-743d-4e41-b10b-681ae913aa92/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/d91d0d6a-3361-4a08-8db3-bb5604dd06eb.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "698628a0-4b4d-4f6a-a2b2-28e018dbfc1d",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/698628a0-4b4d-4f6a-a2b2-28e018dbfc1d/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/698628a0-4b4d-4f6a-a2b2-28e018dbfc1d/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/d91d0d6a-3361-4a08-8db3-bb5604dd06eb.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "5310805b-3786-453c-9eea-4f7b2fc4dd37",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5310805b-3786-453c-9eea-4f7b2fc4dd37/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5310805b-3786-453c-9eea-4f7b2fc4dd37/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/d91d0d6a-3361-4a08-8db3-bb5604dd06eb.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Red": "https://m.media-amazon.com/images/I/31ZaS8SsfrL._AC_SR38,50_.jpg",
    "Rose Red": "https://m.media-amazon.com/images/I/31+gFFfX7uL._AC_SR38,50_.jpg",
    "Purple": "https://m.media-amazon.com/images/I/31xd18t+KHL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31upP-ct+uL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Red": "51hM3qYAUOL",
    "Rose Red": "51AcN6WDaIL",
    "Purple": "514kR2cQgeL",
    "Black": "512MajSR6WL"
  },
  "color_images": {
    "Red": [
      "https://m.media-amazon.com/images/I/51hM3qYAUOL._SL1500_.jpg"
    ],
    "Rose Red": [
      "https://m.media-amazon.com/images/I/51AcN6WDaIL._SL1500_.jpg"
    ],
    "Purple": [
      "https://m.media-amazon.com/images/I/514kR2cQgeL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/512MajSR6WL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 36.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61zhcs54aWL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-bodycon",
      "title": "Womens Dress Bodycon",
      "price": 30.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71Br1mzvDtL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-formal",
      "title": "Womens Maxi Dress Evening Formal",
      "price": 82.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61sqAown2BL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-formal-cocktail",
      "title": "Womens Dress Formal Cocktail",
      "price": 45.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61+Szy2AMQL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-v-neck-sleeveless",
      "title": "Womens Dress V Neck Sleeveless",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/81T7G18uRnL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-maxi-long-sleeve-v-neck",
      "title": "Womens Maxi Dress Maxi Long Sleeve V Neck",
      "price": 47.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71AFiW7Ma1L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-short-sleeve-bodycon-maxi",
      "title": "Womens Maxi Dress Short Sleeve Bodycon Maxi",
      "price": 19.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/31RG-6bRDnL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-long-sleeve",
      "title": "Womens Maxi Dress Maxi Long Sleeve",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61OsL3-CxuL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 44.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/813GmOhQ3+L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-formal",
      "title": "Womens Maxi Dress Maxi Formal",
      "price": 69.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71cI4MN0D8L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-one-shoulder-maxi",
      "title": "Womens Maxi Dress One Shoulder Maxi",
      "price": 95.97,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/71HXdUXaO8L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-bodycon",
      "title": "Womens Maxi Dress Long Sleeve Bodycon",
      "price": 40.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61Y6PIDAPGL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-evening-mermaid",
      "title": "Womens Maxi Dress Long Sleeve Evening Mermaid",
      "price": 179.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/814SaE2FzTL._SL1500_.jpg"
      ]
    }
  ]
}