{
  "id": "womens-dress-sleeveless",
  "handle": "womens-dress-sleeveless",
  "sku": "JC2723",
  "asin": "B0D8JC5F5N",
  "title": "Womens Dress Sleeveless",
  "title_original": "utcoco Denim Dress for Women Sleeveless Button Down Slim Fit Midi Jean Dresses for Women 2025",
  "brand": "Visit the utcoco Store",
  "price": 41.28,
  "social_proof": {
    "bought_past_month": 99,
    "text": "99+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/61lY17e0IcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71LaknNGgDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61J8jS-nQQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61NK-rcRyFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51lFmP7+3xL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/511CD3z1oOL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/513AgRn6ybL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51bu0iavp3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ET5yiUCmL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/61lY17e0IcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71LaknNGgDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61J8jS-nQQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61NK-rcRyFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51lFmP7+3xL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/511CD3z1oOL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/513AgRn6ybL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51bu0iavp3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ET5yiUCmL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Date First Available ‏": "‎ March 28, 2024",
    "ASIN ‏": "‎ B0DK3DV5N4",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#63,408 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #344 in Women's Formal Dresses #925 in Women's Casual Dresses",
    "Customer Reviews": "4.2 4.2 out of 5 stars (165)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Blue",
      "Dark Blue"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.2,
    "count": 165,
    "customers_say": "Customers find the denim dress well-made, comfortable, and flattering, with one noting it's particularly suitable for pear-shaped figures. The dress is versatile, with one customer mentioning it can be dressed up or down, and they appreciate its nice material. While some it's true to size, others mention it runs small on top. Select to learn more Fit Look Quality Comfort Flattering Versatility Fabric quality Size 32 customers mention \"Fit\" 26 positive 6 negative Customers like how the dress fits, with one mentioning that it ends nicely at the bosom. \"This dress is so adorable! Has a stretch around the zipper making a perfect fit ! I let a friend borrow it and she also looked amazing!...\" Read more \"This is so cute and fits great . I love the comfy fit of it. Price could be less\" Read more \"Love love love this dress. You’ll get so many compliments. It’s form fitting and flattering...\" Read more \" Great fit ! Just slightly extra fabric at the bottom.\" Read more 31 customers mention \"Look\" 27 positive 4 negative Customers find the dress cute, with one mentioning it has a touch of class. \"...could’ve got by with a L. Little longer than on the model but still super cute ....\" Read more \"Absolutely Love—- so cute and sexy…. I received so many compliments on the style and fit…. Great fit, super comfortable, and stylish and chic….\" Read more \"...normally like clothes that have seams outlining the bust but this was so cute , I had to try it....\" Read more \" Cute dress , decent price, but the breast cups fit is way off. It's designed like for little girls, not women....\" Read more 21 customers mention \"Quality\" 18 positive 3 negative Customers find the denim dress to be well-made and of high quality. \"...Not giving it a bad review tho, because it was cute and well made , just not for me and that was obvious from the pictures....\" Read more \"5'6 107 lbs XS Perfect fit, nice quality , flattering.\" Read more \" Absolutely love ! Get compliments all the time!!\" Read more \"Great Fit- Nice Dress ...\" Read more 11 customers mention \"Comfort\" 10 positive 1 negative Customers find the dress comfortable. \"...It’s comfortable , not tight, light fabric- not heavy like denim but appears to be. Really love the way it hangs....\" Read more \"It is true to size and it’s a very comfortable dress . I love it.\" Read more \"...It gives me a good lift with my girls and it’s is very comfortable to wear in the summer and spring.\" Read more \"...True to size. Great material, comfortable to wear . Highly recommend!\" Read more 11 customers mention \"Flattering\" 11 positive 0 negative Customers find the dress flattering, with one mentioning it works well for pear shapes. \"...I think it is flattering . The snaps unsnap on the skirt portion but not the top. I am able to wear this without a bra....\" Read more \"...The top fit perfectly and was so flattering … until you got to the bottom. Sad. So stretchy too!\" Read more \" Really flattering ! I am a pear shape size 10, small tatas, 5'5\" and it's hitting in all the right places. Pretty great quality too!...\" Read more \"...I'm 5'8\" and it hits just below the knee. The v neck is flattering , but doesn't show cleavage. If you are busty, consider sizing up....\" Read more 8 customers mention \"Versatility\" 8 positive 0 negative Customers find the dress versatile, with one mentioning it can be dressed up or down, while another notes it can be worn with nice sandals. \"I like the comfortability. You can dress it up or dress it down you can wear it with heels or flats and all of that just looks outstanding\" Read more \"Flattering and nice material. Perfect for date night \" Read more \"...By the way the stitching looks it may not hold up long, but perfect for an event .\" Read more \"Love this dress the look is amazing. Great piece in my wardrobe .\" Read more 7 customers mention \"Fabric quality\" 7 positive 0 negative Customers like the fabric quality of the dress. \" Great quality fabric . Downside, the bust cups are designed for small chests and thus, for normally sized, or even large size, it looks weird....\" Read more \"I washed it but it still smells strong. Nice material though. I’ll be back after I try it on for a day.\" Read more \" Nice quality material , this is a very well made dress good Jean material yet lightweight....\" Read more \"...Got so many compliments when I wore it. True to size. Great material , comfortable to wear. Highly recommend!\" Read more 11 customers mention \"Size\" 5 positive 6 negative Customers have mixed opinions about the dress's sizing, with some finding it true to size while others report that it runs small on top. \"...I only give it 4 starts because I am larger on the top and it runs small on top ...other than that..it is great!.\" Read more \"Great dress! Got so many compliments when I wore it. True to size . Great material, comfortable to wear. Highly recommend!\" Read more \"Not true to size also very small bust area \" Read more \" Runs true to size . Received complements. good quality for price\" Read more",
    "items": [
      {
        "title": "1.0 out of 5 stars Not value for money",
        "body": "Not the same cut as the photo. The dress was pretty but not the same style as the photo. Read more",
        "author": "Shanshr",
        "rating": 1.0,
        "date": "December 5, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "1.0 out of 5 stars Meh",
        "body": "Odd fit, not for anyone over a b cup Read more",
        "author": "Customer",
        "rating": 1.0,
        "date": "November 10, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "1.0 out of 5 stars Cheap snaps, awkward fit",
        "body": "Not as cute as it appears on the model. Very lightweight cheap snaps that pop open easily. Also, something is off with the dimensions of the top part of the dress. One snap came all the way loose from the fabric my first time trying on dress. Read more",
        "author": "Kennedy",
        "rating": 1.0,
        "date": "April 1, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "1.0 out of 5 stars Save your money",
        "body": "Sizing smaller than should be. Almost took 2 months too arrive. Disappointed Read more",
        "author": "Lisa Marks",
        "rating": 1.0,
        "date": "May 29, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "1.0 out of 5 stars Does not look like the picture.",
        "body": "Too much material. Read more",
        "author": "L",
        "rating": 1.0,
        "date": "August 6, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Cute dress for summer",
        "body": "36-30-40 measurements, 5’7”, 145lbs and purchased this in a small. There is just enough stretch to this dress to keep it comfortable. The material is thick while also being breathable. I have worn this dress on a hot summer day and still been comfortable. I think it is flattering. The snaps unsnap on the skirt portion but not the top. I am able to wear this without a bra. If you are more than a 34D-36B it might be tight in the chest. My primary critique is that the bust line sewn in isn’t exactly in a natural place for most women unless you sit very high in the dress. This washes well. I think the fit is true to size and I would purchase this again. Read more",
        "author": "MrsSlim",
        "rating": 4.0,
        "date": "July 18, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Nice quality",
        "body": "5'6 107 lbs XS Perfect fit, nice quality, flattering. Read more",
        "author": "Silver K",
        "rating": 5.0,
        "date": "November 6, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "2.0 out of 5 stars Feels uncomfortable in the chest area , breast cups higher than they should be",
        "body": "Cute dress, decent price, but the breast cups fit is way off. It's designed like for little girls, not women. The top area acts like you have no cleavage or you are a nun and it might look fine to others but you will feel immediately that where the dress shows your boobs is higher than your actual boobs. I'm not a big chested lady, nor do I try to accentuate my chest, so this was a weird thing for me to complain about, but I am because it's different than any other dress. It should end nicely at your bosom, but it comes up higher in a way that had me constantly pulling it down. I would not buy it again, nor would I trust this company to make good products. I don't know who they made this for. If you have boobs that sit higher on your chest than the average person, or if you are a really tall child with no boobs, perhaps it feels fine. The average person, it's gonna feel a bit off in the chest area. Not including a picture because you literally can't tell looking at it since I am smaller chested, if you had more cleavage it might look like you have two sets of boobs, or it might just feel uncomfortable. Read more",
        "author": "Korenski",
        "rating": 2.0,
        "date": "September 13, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Dress Sleeveless is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.",
  "about_this_item": "Womens Dress Sleeveless is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.",
  "long_description": "Womens Dress Sleeveless is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Blue, Dark Blue. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Dress Sleeveless is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Blue, Dark Blue. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "b4b20db6-87e7-4513-bb83-b9ae51537972",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b4b20db6-87e7-4513-bb83-b9ae51537972/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b4b20db6-87e7-4513-bb83-b9ae51537972/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/82c43e56-058b-4c06-b43b-c9d03525c489.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "6d1e5a31-6607-4247-9f7a-1fcdd6532064",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6d1e5a31-6607-4247-9f7a-1fcdd6532064/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6d1e5a31-6607-4247-9f7a-1fcdd6532064/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/82c43e56-058b-4c06-b43b-c9d03525c489.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "86bd81c6-727f-43c6-9a18-55a52051d26e",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/86bd81c6-727f-43c6-9a18-55a52051d26e/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/86bd81c6-727f-43c6-9a18-55a52051d26e/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/82c43e56-058b-4c06-b43b-c9d03525c489.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "22ffd973-0677-4aef-b38c-e0b718b74c63",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/22ffd973-0677-4aef-b38c-e0b718b74c63/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/22ffd973-0677-4aef-b38c-e0b718b74c63/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/82c43e56-058b-4c06-b43b-c9d03525c489.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Blue": "https://m.media-amazon.com/images/I/41fWYKxjpaL._AC_SR38,50_.jpg",
    "Dark Blue": "https://m.media-amazon.com/images/I/31aIw2mJJfL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Blue": "61lY17e0IcL",
    "Dark Blue": "61ET5yiUCmL"
  },
  "color_images": {
    "Blue": [
      "https://m.media-amazon.com/images/I/61lY17e0IcL._SL1500_.jpg"
    ],
    "Dark Blue": [
      "https://m.media-amazon.com/images/I/61ET5yiUCmL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-one-shoulder-long-sleeve-maxi-formal",
      "title": "Womens Maxi Dress One Shoulder Long Sleeve Maxi Formal",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51osX5ku23L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 29.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/714NKRHRX2L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-sleeveless-formal-cocktail-v-neck-evening",
      "title": "Womens Maxi Dress Sleeveless Formal Cocktail V Neck Evening",
      "price": 72.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61q-2Wqi91L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail-bodycon-v-neck-sleeveless-ruched",
      "title": "Womens Dress Cocktail Bodycon V Neck Sleeveless Ruched",
      "price": 43.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51K9NAs7S1L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-long-sleeve",
      "title": "Womens Maxi Dress Cocktail Long Sleeve",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61rn8pl8A6L._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress-formal",
      "title": "Womens Dress Formal",
      "price": 74.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/517I6+Y980L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 10.95,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/81VSldp0TJL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 199.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/51rRJcl6flL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-v-neck-long-sleeve-bodycon",
      "title": "Womens Maxi Dress V Neck Long Sleeve Bodycon",
      "price": 30.59,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Sweaters > Pullovers",
      "images": [
        "https://m.media-amazon.com/images/I/71a0x4LTzmL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-ruched-bodycon-formal-cocktail-long-sleeve",
      "title": "Womens Maxi Dress Maxi Ruched Bodycon Formal Cocktail Long Sleeve",
      "price": 56.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/51HFt7oTd4L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-mermaid",
      "title": "Womens Maxi Dress Evening Mermaid",
      "price": 108.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51a9Odw5waL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail",
      "title": "Womens Dress Cocktail",
      "price": 34.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/81SP-ORh7dL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-sleeveless-cocktail-bodycon",
      "title": "Womens Dress Sleeveless Cocktail Bodycon",
      "price": 36.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61NaDgRQ-DL._SL1500_.jpg"
      ]
    }
  ]
}