{
  "id": "womens-dress-v-neck",
  "handle": "womens-dress-v-neck",
  "sku": "JC2957",
  "asin": "B0D8Y1CRHN",
  "title": "Womens Dress V Neck",
  "title_original": "Women's Pullovers Jumper Sweaters Lantern Sleeve Casual V Neck Fall Knit Mini Sweater Dresses",
  "brand": "Visit the VAFOLY Store",
  "price": 47.98,
  "social_proof": {
    "bought_past_month": 56,
    "text": "56+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/71Fwy1JZcjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81t8nYbtGgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81Tcyr6aZdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81aAHWanJ7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71FLeBosoJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81v3pVKAtLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71O+Sx4ufkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81F4o4VbeXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81f-MxNqbuL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81O6WcK-02L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81L9m1pz+kL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/819qfpFa51L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81Yi0RuPgUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/717WPABmlyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81XWY3ppZvL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/817VwbrQwCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81ElPlMz4wL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/71Fwy1JZcjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81t8nYbtGgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81Tcyr6aZdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81aAHWanJ7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71FLeBosoJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81v3pVKAtLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71O+Sx4ufkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81F4o4VbeXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81f-MxNqbuL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81O6WcK-02L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81L9m1pz+kL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/819qfpFa51L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81Yi0RuPgUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/717WPABmlyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81XWY3ppZvL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/817VwbrQwCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81ElPlMz4wL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ July 6, 2024",
    "Manufacturer ‏": "‎ VAFOLY",
    "ASIN ‏": "‎ B0D8XZZ4WG",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#3,090 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #120 in Women's Casual Dresses",
    "Customer Reviews": "4.1 4.1 out of 5 stars (458)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Brown",
      "Apricot",
      "Pure White",
      "Black",
      "Rose Red",
      "Pink",
      "Beige",
      "Olive-green",
      "Caramel",
      "Red Dahlia",
      "Denim Blue",
      "Green",
      "Grey"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.1,
    "count": 458,
    "customers_say": "Customers like the sweater dress's style, with one noting its romantic lantern sleeves, and appreciate its soft material, comfort, and quality. The fit and size receive mixed feedback - while some find it true to size, others say it runs large and is oversized. The length and material thickness also get mixed reviews, with some praising the great length while others find it extremely short, and some describing the material as thick while others say it's very thin. Generated from the text of customer reviews Select to learn more Style (64) Soft material (50) Comfort (45) Quality (44) Fit (58) Size (42) Length (36) Material thickness (24) 64 customers mention style, 56 positive, 8 negative 64 customers mention \"Style\" 56 positive 8 negative Customers find the sweater cute and nice, with one customer noting that the lantern sleeves add a romantic touch, while another mentions it creates an effortlessly put-together look. \" Comfy. Cute . Just like the picture! True to size. I’m usually xsmall but I ordered a small and I’m happy did. \" Read more \" This sweater dress is beautiful , the quality is amazing the length is perfect, I love the it fit I did order another color apricot I am 130 pounds... \" Read more \" True to size. Flattering. Value for the price. Super cute . Perfect option for the office or dinner out. \" Read more \" This is a beautiful dress . Exceptional quality. My mistake was not consulting the sizing chart. The \"recommended size\" for me was an XL.... \" Read more 50 customers mention soft material, 49 positive, 1 negative 50 customers mention \"Soft material\" 49 positive 1 negative Customers find the material of the sweater super soft and smooth. \" Absolutely love this sweater is soft . It’s the perfect length can wear it as a dress or with some jeans and boots. It’s warm. It’s stretchy durable.... \" Read more \" This dress is super soft and warm.The fit is true to size and the perfect length .The material is not see threw and it pairs well with my fall boots . \" Read more \" Very cute; very soft . Warm. About a medium thickness. Slightly flattering with a touch of flounce sleeves and a loose fit.... \" Read more \" Love this dress. I’m 5’2” and 120#. Fit perfect. Super comfortable and so soft . Not too long. Other sweater dresses I tired were too long.... \" Read more 45 customers mention comfort, 43 positive, 2 negative 45 customers mention \"Comfort\" 43 positive 2 negative Customers find the sweater comfortable and cozy. \" This sweater dress is comfortable and warm but still looks so cute on. I ordered the blue and it looks exactly like the picture.... \" Read more \" ...Color matches description and material isn’t cheap made. Super soft and comfy not too short true to size and draws a lot of attention \" Read more \" ...love this dress can pull it up and use as a blouse with leggings very comfortable . I bought a L and could wear a M no problem at all. \" Read more \" this was a gift for my wife and she really likes it. its very warm and cozy \" Read more 44 customers mention quality, 37 positive, 7 negative 44 customers mention \"Quality\" 37 positive 7 negative Customers find the sweater to be of great quality. \" Good quality pleasantly surprised. I don’t ever order clothes on Amazon. \" Read more \" ... Great dress , buy it and don’t wear leggings under! I bough the green and wore tan suede 2” heel knee boots and it was a great outfit.... \" Read more \" Adorable dress! Nice and warm but it shrinks terribly when you wash it and the material doesn’t hold up well in the wash.... \" Read more \" Great sweater dress... \" Read more 58 customers mention fit, 39 positive, 19 negative 58 customers mention \"Fit\" 39 positive 19 negative Customers have mixed opinions about the dress's fit, with some finding it true to size and great for plus sizes, while others report that it runs slightly large and is super huge. \" Super comfortable. Perfect fit . \" Read more \" I love the fit . I wash it in cold water hang dried, it maintains the beauty of the dress. I would highly recommend it. It’s true to size.... \" Read more \" Was not the style I was looking for, not form fitting \" Read more \" Really like this dress. This is a size Medium and I think it is a great fit . The material is very comfortable and the quality is nice for the value. \" Read more 42 customers mention size, 23 positive, 19 negative 42 customers mention \"Size\" 23 positive 19 negative Customers have mixed opinions about the dress size, with some finding it true to size while others describe it as oversized. \" All I can really say is it's perfect, true to size , comfortable, professional and cute. I'll be purchasing more. \" Read more \" Thin , over priced! Runs very large ! I’m 5’7 190 and normally cl , large was like a bag , traded for medium, should have traded for a small \" Read more \" ...It’s a Christmas gift but it’s soft and looks true to size . Nice \" Read more \" ...This one was SO comfortable and soft. The quality feels great. It is oversized , but still looked cute and not too baggy. Might size down next time \" Read more 36 customers mention length, 22 positive, 14 negative 36 customers mention \"Length\" 22 positive 14 negative Customers have mixed opinions about the dress length, with some finding it great while others say it's a little short and not suitable as a dress. \" This dress is super soft and warm.The fit is true to size and the perfect length .The material is not see threw and it pairs well with my fall boots . \" Read more \" Lovely sweater. Very very soft it’s just very long . The sleeves are super long and no way to push them up. I’m usually a medium.... \" Read more \" Fit great on a curvy girl. Room in the tummy area and great length \" Read more \" ...It fit like a glove. Not too short , extremely comfortable. Can wear as a dress or with leggings.... \" Read more 24 customers mention material thickness, 11 positive, 13 negative 24 customers mention \"Material thickness\" 11 positive 13 negative Customers have mixed opinions about the sweater's material thickness, with some finding it thick and good, while others describe it as very thin and not nice. \" Pretty, but very thin and see through. Sizing is good \" Read more \" Great fabric and true to size \" Read more \" Thin , over priced! Runs very large ! I’m 5’7 190 and normally cl , large was like a bag , traded for medium, should have traded for a small \" Read more \" Very cute; very soft. Warm. About a medium thickness . Slightly flattering with a touch of flounce sleeves and a loose fit.... \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Nice and soft sweater. Super cute on",
        "body": "I sometimes buy clothing on Amazon and cross my fingers. This looked super cute but when it arrived, I was soooo surprised. The blue is a beautiful antique color, the fit was perfect, I’m 5’6”, 165 lbs and it was a true large. I threw on a pair of leggings and off to the grocery store I go. LOVE this sweater Read more",
        "author": "Kim Twiss",
        "rating": 5.0,
        "date": "December 23, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars My new favorite sweater",
        "body": "This is actually more comfortable than I expected. I would highly recommend this sweater. It’s soft, warm and versatile. You can wear it as a short dress, with jeans, yoga pants, etc. Fit was right on for size. Need more like this! Read more",
        "author": "Mandi Nichols",
        "rating": 5.0,
        "date": "December 1, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars VERY NICE QUALITY...VERY PRETTY",
        "body": "The media could not be loaded. Id been wanting a sweater dress for quite some time. I finally broke down and bought one. As you will see in the video, it is roomy in my normal size of Large..has adorable poof sleeves. Cableknit and v-neck. This is beautiful and so soft..and will be perfect addition to your wardrobe. Read more",
        "author": "Tracy Carter",
        "rating": 4.0,
        "date": "December 16, 2024",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Soft and cozy.",
        "body": "Absolutely love this sweater is soft. It’s the perfect length can wear it as a dress or with some jeans and boots. It’s warm. It’s stretchy durable. It’s a nice winter sweater. Read more",
        "author": "Michelle benetier",
        "rating": 5.0,
        "date": "November 26, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Good",
        "body": "Very cute; very soft. Warm. About a medium thickness. Slightly flattering with a touch of flounce sleeves and a loose fit. I’d expect it to start looking not too great after 5ish washes. Shape is almost boxy. Quality is target quality. Read more",
        "author": "Happy Customer",
        "rating": 5.0,
        "date": "November 12, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Sweater dress",
        "body": "Very soft and comfortable. True to size. Looks great! Read more",
        "author": "tracy ellis",
        "rating": 5.0,
        "date": "December 21, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars So-so",
        "body": "Pretty, but very thin and see through. Sizing is good Read more",
        "author": "Jenny Smith",
        "rating": 3.0,
        "date": "December 1, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Great sweater dress",
        "body": "Loved this. I'm 5'8\", between 155 to 160. This was long enough I didn't need the slip skirt underneath it. The material is light, but warm and comfortable. It's soft too. Have gotten many compliments on it. Read more",
        "author": "Debbi Martinez",
        "rating": 5.0,
        "date": "December 15, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Dress V Neck is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.",
  "about_this_item": "Womens Dress V Neck is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.",
  "long_description": "Womens Dress V Neck is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Brown, Apricot, Pure White, Black, Rose Red, Pink, Beige, Olive-green, Caramel, Red Dahlia, Denim Blue, Green, Grey. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Dress V Neck is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Brown, Apricot, Pure White, Black, Rose Red, Pink, Beige, Olive-green, Caramel, Red Dahlia, Denim Blue, Green, Grey. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "8da39748-1241-4786-83c6-86f2b0948ee8",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8da39748-1241-4786-83c6-86f2b0948ee8/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8da39748-1241-4786-83c6-86f2b0948ee8/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "7723ccdd-46da-4fd5-ae1d-81d6b57848ce",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7723ccdd-46da-4fd5-ae1d-81d6b57848ce/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7723ccdd-46da-4fd5-ae1d-81d6b57848ce/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "8a14ef34-2010-40f3-9c70-842fbf245c78",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8a14ef34-2010-40f3-9c70-842fbf245c78/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8a14ef34-2010-40f3-9c70-842fbf245c78/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "e23ba943-3551-4097-8085-c54f48309686",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e23ba943-3551-4097-8085-c54f48309686/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e23ba943-3551-4097-8085-c54f48309686/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "23fb90e8-83cc-4980-a79a-f35ef6ecb9eb",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/23fb90e8-83cc-4980-a79a-f35ef6ecb9eb/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/23fb90e8-83cc-4980-a79a-f35ef6ecb9eb/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "1df47b4f-c0d4-4c6e-a6dc-b7e3067b034c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1df47b4f-c0d4-4c6e-a6dc-b7e3067b034c/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1df47b4f-c0d4-4c6e-a6dc-b7e3067b034c/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "5d66afae-24c8-441a-b497-771aa92a2aae",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5d66afae-24c8-441a-b497-771aa92a2aae/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5d66afae-24c8-441a-b497-771aa92a2aae/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "f5d78b0b-4b2f-46fc-863f-414274a5aa87",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f5d78b0b-4b2f-46fc-863f-414274a5aa87/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f5d78b0b-4b2f-46fc-863f-414274a5aa87/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "30903a02-410a-494c-b403-95478c6ee140",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/30903a02-410a-494c-b403-95478c6ee140/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/30903a02-410a-494c-b403-95478c6ee140/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "5e1b9906-cf22-4840-b8fd-d3f35ab05a2a",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5e1b9906-cf22-4840-b8fd-d3f35ab05a2a/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5e1b9906-cf22-4840-b8fd-d3f35ab05a2a/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Brown": "https://m.media-amazon.com/images/I/41SozHbjIUL._AC_SR38,50_.jpg",
    "Apricot": "https://m.media-amazon.com/images/I/41k4HR9jpWL._AC_SR38,50_.jpg",
    "Pure White": "https://m.media-amazon.com/images/I/41mKLsPrZeL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/41PArVafyQL._AC_SR38,50_.jpg",
    "Rose Red": "https://m.media-amazon.com/images/I/41CNst-ZwdL._AC_SR38,50_.jpg",
    "Pink": "https://m.media-amazon.com/images/I/41qj+DOc9aL._AC_SR38,50_.jpg",
    "Beige": "https://m.media-amazon.com/images/I/41bQsGaGamL._AC_SR38,50_.jpg",
    "Olive-green": "https://m.media-amazon.com/images/I/41cPNI4fI+L._AC_SR38,50_.jpg",
    "Caramel": "https://m.media-amazon.com/images/I/41T+F+RmhkL._AC_SR38,50_.jpg",
    "Red Dahlia": "https://m.media-amazon.com/images/I/41+h0eoP+PL._AC_SR38,50_.jpg",
    "Denim Blue": "https://m.media-amazon.com/images/I/414fOftul1L._AC_SR38,50_.jpg",
    "Green": "https://m.media-amazon.com/images/I/41eeL9759uL._AC_SR38,50_.jpg",
    "Grey": "https://m.media-amazon.com/images/I/4123Q20hY8L._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Brown": "81v3pVKAtLL",
    "Apricot": "71O+Sx4ufkL",
    "Pure White": "81F4o4VbeXL",
    "Black": "81f-MxNqbuL",
    "Rose Red": "81O6WcK-02L",
    "Pink": "81L9m1pz+kL",
    "Beige": "71Fwy1JZcjL",
    "Olive-green": "819qfpFa51L",
    "Caramel": "81Yi0RuPgUL",
    "Red Dahlia": "717WPABmlyL",
    "Denim Blue": "81XWY3ppZvL",
    "Green": "817VwbrQwCL",
    "Grey": "81ElPlMz4wL"
  },
  "color_images": {
    "Brown": [
      "https://m.media-amazon.com/images/I/81v3pVKAtLL._SL1500_.jpg"
    ],
    "Apricot": [
      "https://m.media-amazon.com/images/I/71O+Sx4ufkL._SL1500_.jpg"
    ],
    "Pure White": [
      "https://m.media-amazon.com/images/I/81F4o4VbeXL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/81f-MxNqbuL._SL1500_.jpg"
    ],
    "Rose Red": [
      "https://m.media-amazon.com/images/I/81O6WcK-02L._SL1500_.jpg"
    ],
    "Pink": [
      "https://m.media-amazon.com/images/I/81L9m1pz+kL._SL1500_.jpg"
    ],
    "Beige": [
      "https://m.media-amazon.com/images/I/71Fwy1JZcjL._SL1500_.jpg"
    ],
    "Olive-green": [
      "https://m.media-amazon.com/images/I/819qfpFa51L._SL1500_.jpg"
    ],
    "Caramel": [
      "https://m.media-amazon.com/images/I/81Yi0RuPgUL._SL1500_.jpg"
    ],
    "Red Dahlia": [
      "https://m.media-amazon.com/images/I/717WPABmlyL._SL1500_.jpg"
    ],
    "Denim Blue": [
      "https://m.media-amazon.com/images/I/81XWY3ppZvL._SL1500_.jpg"
    ],
    "Green": [
      "https://m.media-amazon.com/images/I/817VwbrQwCL._SL1500_.jpg"
    ],
    "Grey": [
      "https://m.media-amazon.com/images/I/81ElPlMz4wL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-formal-cocktail-ruched-maxi-sleeveless-bodycon",
      "title": "Womens Maxi Dress Formal Cocktail Ruched Maxi Sleeveless Bodycon",
      "price": 48.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51lcEKwzt8L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 99.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51MWKDRcToL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal",
      "title": "Womens Maxi Dress Formal",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51eAiny1x-L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-ruched-formal-maxi-bodycon",
      "title": "Womens Maxi Dress Ruched Formal Maxi Bodycon",
      "price": 62.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61ipOhuw3WL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail",
      "title": "Womens Dress Cocktail",
      "price": 37.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61+EOqv4F9L._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 26.45,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/713OuBdQBYL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 564.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/614g9yo8opL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-cocktail-maxi-split",
      "title": "Womens Maxi Dress Formal Cocktail Maxi Split",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61G8RF1nKaL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-formal",
      "title": "Womens Dress Formal",
      "price": 89.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51Ba9fw8pTL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-split-sleeveless-cocktail-bodycon",
      "title": "Womens Dress Split Sleeveless Cocktail Bodycon",
      "price": 27.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51OoLUBGjtL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 79.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Wedding Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/51nJyQaIwAL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-mermaid",
      "title": "Womens Maxi Dress Cocktail Mermaid",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51QRiCCVj+L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening-bodycon-short-sleeve",
      "title": "Womens Maxi Dress Formal Evening Bodycon Short Sleeve",
      "price": 63.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61whKp-35lL._SL1500_.jpg"
      ]
    }
  ]
}