{
  "id": "womens-maxi-dress-formal-split-cocktail-v-neck",
  "handle": "womens-maxi-dress-formal-split-cocktail-v-neck",
  "sku": "JC2863",
  "asin": "B0D8ZPXDVG",
  "title": "Womens Maxi Dress Formal Split Cocktail V Neck",
  "title_original": "Women's Black Long Formal Dresses Cocktail Wedding Guest Dress Ruffle Split Elegant V Neck Party Gowns",
  "brand": "COOAN",
  "price": 59.99,
  "social_proof": {
    "bought_past_month": 333,
    "text": "333+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/51usYen8xPL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51854ONZ0PL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/714+afOwXjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51eokqXLp1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51QISZSYnlL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61oWT89DacL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51ikFnvGeZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61djBid4F6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51kNxBRxM8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51+Y66QYriL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51TJ0iaNPRL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Bo5hrXNWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/512o9RUUsdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51r0gr1gx9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51y7Itc424L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61OWMdcxtYL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51DkmFW0i8L._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/51usYen8xPL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51854ONZ0PL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/714+afOwXjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51eokqXLp1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51QISZSYnlL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61oWT89DacL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51ikFnvGeZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61djBid4F6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51kNxBRxM8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51+Y66QYriL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51TJ0iaNPRL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Bo5hrXNWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/512o9RUUsdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51r0gr1gx9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51y7Itc424L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61OWMdcxtYL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51DkmFW0i8L._SL1500_.jpg"
  ],
  "aplus_images": [
    "https://m.media-amazon.com/images/I/51ulSuLyoSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31JDPz%2BVK1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41Tp3rxpLWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41BW4em1xEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41li76o710L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31D66f0OQ2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41bGPf7JaBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31QFJ0JyGPL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/412VtqWMv0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41K-GT-hqzL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41%2BuzTKIo9L._SL1500_.jpg"
  ],
  "description_images": [
    "https://m.media-amazon.com/images/I/51ulSuLyoSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31JDPz%2BVK1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41Tp3rxpLWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41BW4em1xEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41li76o710L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31D66f0OQ2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41bGPf7JaBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31QFJ0JyGPL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/412VtqWMv0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41K-GT-hqzL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41%2BuzTKIo9L._SL1500_.jpg"
  ],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ November 20, 2025",
    "ASIN ‏": "‎ B0G34KTBSQ",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#81,725 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #444 in Women's Formal Dresses",
    "Customer Reviews": "4.3 4.3 out of 5 stars (197)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "T-30-sleeveless Red-2",
      "Pink-t30",
      "Green-t30",
      "Sleeveless Maroon-t30",
      "Sleeveless Black-t30",
      "Black-t30",
      "Burgundy Red-t30",
      "Red-t30",
      "Sleeveless Red-t30",
      "Colored Blue-t30",
      "Sleeveless Aqua-t30",
      "Sleeveless Green-t30"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.3,
    "count": 197,
    "customers_say": "Customers find the dress fits well and is true to size, with one noting it's particularly suitable for short people. They appreciate its elegant appearance, with one mentioning it's sexy without being over-revealing, and another noting it doesn't look expensive. The dress receives positive feedback for its quality, material, comfort, and flattering style, making it suitable for various dressy occasions. Generated from the text of customer reviews Select to learn more Fit (38) Elegance (25) Quality (21) Material quality (15) Comfort (13) Flattering style (9) Size (9) Dress style (8) 38 customers mention fit, 31 positive, 7 negative 38 customers mention \"Fit\" 31 positive 7 negative Customers are satisfied with how the dress fits, particularly noting its perfect length, and one customer mentions it's suitable for short people. \" May be the best dress I ever bought on Amazon! Great quality, perfect fit and length for me, very flattering style, reasonable price, and SO... \" Read more \" ...Would definitely recommend buying this dress. I’m 5’5” and the length is perfect . \" Read more \" This dress is beautiful, it fits perfectly and very flattering, I love the style, the sleeves, everything about it, I feel very comfortable and sexy... \" Read more \" I got the recommended size based off of Amazon and it fit perfectly ! Everyone loved the dress and honestly I did too.... \" Read more 25 customers mention elegance, 25 positive, 0 negative 25 customers mention \"Elegance\" 25 positive 0 negative Customers find the dress elegant, with one mentioning it looks sexy without being over-revealing, while another notes it doesn't appear expensive. \" Beautiful dress . Very nice material and style. Unfortunately it was too tight in the chest and torso area. Size large 190 lbs 40D. \" Read more \" Very pretty dress , but made poorly. I wore it once and washed it per washing instructions. Some of the stitching came loose all around the mid section \" Read more \" I have not worn it yet, but I love the style !! \" Read more \" This dress is beautiful , it fits perfectly and very flattering, I love the style, the sleeves, everything about it, I feel very comfortable and sexy... \" Read more 21 customers mention quality, 19 positive, 2 negative 21 customers mention \"Quality\" 19 positive 2 negative Customers find the dress to be of good quality. \" Nice dress , wrong for me \" Read more \" ...The dress is well made . \" Read more \" material is very sturdy and has a zipper in the back, very well made , the style is flattering, the length is perfect not too long, I purchase Black... \" Read more \" Great dress !... \" Read more 15 customers mention material quality, 14 positive, 1 negative 15 customers mention \"Material quality\" 14 positive 1 negative Customers like the material of the dress, describing it as nice, with one customer noting that the satin fabric dresses up well. \" Fabric is see through \" Read more \" Beautiful dress. Very nice material and style. Unfortunately it was too tight in the chest and torso area. Size large 190 lbs 40D. \" Read more \" Fabric was very nice but the seam at the waist was so tight that the dress did not fit so I had to return it.... \" Read more \" Love this dress! The fit was perfect! The material was nice and the color was gorgeous! Highly recommend!! \" Read more 13 customers mention comfort, 13 positive, 0 negative 13 customers mention \"Comfort\" 13 positive 0 negative Customers find the dress comfortable. \" Dress is true to size, material is nice and comfortable . Price was great for a dress to wear to a wedding. \" Read more \" Fabric is a great weight and it’s very comfortable . The slit is a little higher than I’d like but I know how to work a needle and thread.... \" Read more \" ...and length for me, very flattering style, reasonable price, and SO comfortable ! Fast, overnight early AM delivery.... \" Read more \" ...Love it and can’t wait to wear it on our trip soon. Light comfortable and a little bit of stretching.... \" Read more 9 customers mention flattering style, 9 positive, 0 negative 9 customers mention \"Flattering style\" 9 positive 0 negative Customers find the dress flattering. \" This dress is beautiful, it fits perfectly and very flattering , I love the style, the sleeves, everything about it, I feel very comfortable and sexy... \" Read more \" Quality fabric Flattering . love the peekaboo split. I ordered size 2X. I’m 5’2” 190lbs Size 40DDD Perfect fit. \" Read more \" I actually love this dress! It is so flattering and the material is amazing! It is thick yet comfortable.... \" Read more \" ...Great quality, perfect fit and length for me, very flattering style , reasonable price, and SO comfortable! Fast, overnight early AM delivery.... \" Read more 9 customers mention size, 7 positive, 2 negative 9 customers mention \"Size\" 7 positive 2 negative the dress fits true to size. \" ... True to size . Hand wash only is a little weird to me, I should have checked that first. BUT I still love it and highly recommend! \" Read more \" Dress is true to size , material is nice and comfortable. Price was great for a dress to wear to a wedding. \" Read more \" Sizing and Length ... \" Read more \" It runs a tad small ..order a size up. \" Read more 8 customers mention dress style, 8 positive, 0 negative 8 customers mention \"Dress style\" 8 positive 0 negative Customers like the dress style, finding it great for any dressy occasion, with one customer noting it can be dressed up or down, while another mentions it's perfect for cruise ship dinners. \" Cute little casual dress. Can definitely be dressed up or down . True to size. Comfortable. \" Read more \" ...It checked all of the boxes and was perfect for the event .... \" Read more \" ...This dress would be great for any dressy occasion . \" Read more \" This was the perfect dress to wear to a formal wedding . It hid all the extra fluff that you want to cover and was a flattering fit.... \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars very well made",
        "body": "material is very sturdy and has a zipper in the back, very well made, the style is flattering, the length is perfect not too long, I purchase Black in a size Large it fit perfect. This dress would be great for any dressy occasion. Read more",
        "author": "victoria lynn",
        "rating": 5.0,
        "date": "October 1, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Last Minute, Perfect purchase!",
        "body": "I was invited to a Black Tie event 2 days before the event took place and needed a dress asap! I was panicked and trying to find a dress that I would be comfortable in, was made with quality material and looked elegant. When I ordered this dress, it was initially a back up dress. It arrived two hours before the event, but when I pulled it out of the bag I was immediately impressed. It checked all of the boxes and was perfect for the event. I did not have time to wash it before I wore it (I know, I know) but it did not have a nasty chemical smell and had minor wrinkles. I steamed it within 30 mins, put the dress on and instantly felt beautiful. I was comfortable even when sitting & eating dinner, the slit in the dress offered some elegant charm. I paired it with some silver glitter heels, which looked super cute. I got many compliments, despite being a last minute dress. This dress did not disappoint!! Read more",
        "author": "AllyM",
        "rating": 5.0,
        "date": "November 14, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Amazing dress saved my evening!",
        "body": "This dress is one of my biggest Amazon wins of all time. Tonight I attended a military gala with my husband, and tried on my current dresses, last night, the night before. Nothing fit. At 11:45 pm I ordered this dress according to the size chart with next day shipping. Worked all day and slipped into this with 30 minutes left until we needed to leave. It fit so well, the fabric is soft, but substantial enough to drape well. The neckline is just right and stays put without tacking. I did quickly tack the slit shut about six inches for my own comfort, but this dress is amazing for the price point. It saved me. One of my husband’s buddies arrived with his wife, and she was wearing the same dress! She ordered it even later than I did, with only 6 minutes to spare for next day shipping! We laughed so hard at the coincidence. My advice is buy this dress, but don’t stress yourself out and wait until the night before! I came straight home from the gala tonight to write this review. Terrific dress. Read more",
        "author": "twofish",
        "rating": 5.0,
        "date": "August 10, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71wptMXrf2L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "4.0 out of 5 stars Sizing and Length",
        "body": "I got the recommended size based off of Amazon and it fit perfectly! Everyone loved the dress and honestly I did too. I did wish it was more floor length but it goes right to your ankle Read more",
        "author": "Alexis Cody",
        "rating": 4.0,
        "date": "October 24, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Lovely dress",
        "body": "I love this dress! Very snuggly, received many compliments! I’m 5’2 and was the perfect length for me. Read more",
        "author": "Annie Pm",
        "rating": 5.0,
        "date": "November 26, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61B1DUvM59L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "3.0 out of 5 stars Too short",
        "body": "Solid dress but if you’re taller than 5 foot 1 inch, it would be too short for you to wear. I wanted to wear heels with mine and couldn’t so returned it Read more",
        "author": "AT Hilton",
        "rating": 3.0,
        "date": "July 12, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Fit good",
        "body": "Very pretty dress. Bought for my granddaughter to wear to a dance. Fit and looked great Read more",
        "author": "Deb",
        "rating": 5.0,
        "date": "November 18, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Perfect Wedding Dress",
        "body": "This was the perfect dress to wear to a formal wedding. It hid all the extra fluff that you want to cover and was a flattering fit. It was true to size and very comfortable. Read more",
        "author": "Bethany N Bentley",
        "rating": 5.0,
        "date": "September 30, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Formal Split Cocktail V Neck is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.",
  "about_this_item": "Womens Maxi Dress Formal Split Cocktail V Neck is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.",
  "long_description": "Womens Maxi Dress Formal Split Cocktail V Neck is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: T-30-sleeveless Red-2, Pink-t30, Green-t30, Sleeveless Maroon-t30, Sleeveless Black-t30, Black-t30, Burgundy Red-t30, Red-t30, Sleeveless Red-t30, Colored Blue-t30, Sleeveless Aqua-t30, Sleeveless Green-t30. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Formal Split Cocktail V Neck is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/51ulSuLyoSL._SL1500_.jpg",
      "alt": "Womens Maxi Dress Formal Split Cocktail V Neck details image 1"
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/31JDPz%2BVK1L._SL1500_.jpg",
      "alt": "Womens Maxi Dress Formal Split Cocktail V Neck details image 2"
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/41Tp3rxpLWL._SL1500_.jpg",
      "alt": "Womens Maxi Dress Formal Split Cocktail V Neck details image 3"
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/41BW4em1xEL._SL1500_.jpg",
      "alt": "Womens Maxi Dress Formal Split Cocktail V Neck details image 4"
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: T-30-sleeveless Red-2, Pink-t30, Green-t30, Sleeveless Maroon-t30, Sleeveless Black-t30, Black-t30, Burgundy Red-t30, Red-t30, Sleeveless Red-t30, Colored Blue-t30, Sleeveless Aqua-t30, Sleeveless Green-t30. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/41li76o710L._SL1500_.jpg",
      "alt": "Womens Maxi Dress Formal Split Cocktail V Neck details image 5"
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "4b84e065-1ded-42ae-b845-81e5cf52e4d2",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4b84e065-1ded-42ae-b845-81e5cf52e4d2/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4b84e065-1ded-42ae-b845-81e5cf52e4d2/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "991c59d2-c383-4381-9d04-7730a9d43e1c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/991c59d2-c383-4381-9d04-7730a9d43e1c/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/991c59d2-c383-4381-9d04-7730a9d43e1c/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "T-30-sleeveless Red-2": "https://m.media-amazon.com/images/I/31SToIGhF4L._AC_SR38,50_.jpg",
    "Pink-t30": "https://m.media-amazon.com/images/I/31ZbiR-wBUL._AC_SR38,50_.jpg",
    "Green-t30": "https://m.media-amazon.com/images/I/311uDQLWA+L._AC_SR38,50_.jpg",
    "Sleeveless Maroon-t30": "https://m.media-amazon.com/images/I/31B7kSLxikL._AC_SR38,50_.jpg",
    "Sleeveless Black-t30": "https://m.media-amazon.com/images/I/31iq6IVCRKL._AC_SR38,50_.jpg",
    "Black-t30": "https://m.media-amazon.com/images/I/31z+y6Fi3dL._AC_SR38,50_.jpg",
    "Burgundy Red-t30": "https://m.media-amazon.com/images/I/31QFJ0JyGPL._AC_SR38,50_.jpg",
    "Red-t30": "https://m.media-amazon.com/images/I/31QGjk-x90L._AC_SR38,50_.jpg",
    "Sleeveless Red-t30": "https://m.media-amazon.com/images/I/317eexL90OL._AC_SR38,50_.jpg",
    "Colored Blue-t30": "https://m.media-amazon.com/images/I/31Lr5Vlr6QL._AC_SR38,50_.jpg",
    "Sleeveless Aqua-t30": "https://m.media-amazon.com/images/I/31cLQoXoJIL._AC_SR38,50_.jpg",
    "Sleeveless Green-t30": "https://m.media-amazon.com/images/I/313Rj+DM3nL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "T-30-sleeveless Red-2": "51ikFnvGeZL",
    "Pink-t30": "61djBid4F6L",
    "Green-t30": "51kNxBRxM8L",
    "Sleeveless Maroon-t30": "51+Y66QYriL",
    "Sleeveless Black-t30": "51TJ0iaNPRL",
    "Black-t30": "51usYen8xPL",
    "Burgundy Red-t30": "61Bo5hrXNWL",
    "Red-t30": "512o9RUUsdL",
    "Sleeveless Red-t30": "51r0gr1gx9L",
    "Colored Blue-t30": "51y7Itc424L",
    "Sleeveless Aqua-t30": "61OWMdcxtYL",
    "Sleeveless Green-t30": "51DkmFW0i8L"
  },
  "color_images": {
    "T-30-sleeveless Red-2": [
      "https://m.media-amazon.com/images/I/51ikFnvGeZL._SL1500_.jpg"
    ],
    "Pink-t30": [
      "https://m.media-amazon.com/images/I/61djBid4F6L._SL1500_.jpg"
    ],
    "Green-t30": [
      "https://m.media-amazon.com/images/I/51kNxBRxM8L._SL1500_.jpg"
    ],
    "Sleeveless Maroon-t30": [
      "https://m.media-amazon.com/images/I/51+Y66QYriL._SL1500_.jpg"
    ],
    "Sleeveless Black-t30": [
      "https://m.media-amazon.com/images/I/51TJ0iaNPRL._SL1500_.jpg"
    ],
    "Black-t30": [
      "https://m.media-amazon.com/images/I/51usYen8xPL._SL1500_.jpg"
    ],
    "Burgundy Red-t30": [
      "https://m.media-amazon.com/images/I/61Bo5hrXNWL._SL1500_.jpg"
    ],
    "Red-t30": [
      "https://m.media-amazon.com/images/I/512o9RUUsdL._SL1500_.jpg"
    ],
    "Sleeveless Red-t30": [
      "https://m.media-amazon.com/images/I/51r0gr1gx9L._SL1500_.jpg"
    ],
    "Colored Blue-t30": [
      "https://m.media-amazon.com/images/I/51y7Itc424L._SL1500_.jpg"
    ],
    "Sleeveless Aqua-t30": [
      "https://m.media-amazon.com/images/I/61OWMdcxtYL._SL1500_.jpg"
    ],
    "Sleeveless Green-t30": [
      "https://m.media-amazon.com/images/I/51DkmFW0i8L._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-bodycon-long-sleeve-maxi",
      "title": "Womens Maxi Dress Bodycon Long Sleeve Maxi",
      "price": 33.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/6141wAGtV8L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-mermaid",
      "title": "Womens Maxi Dress Formal Mermaid",
      "price": 72.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51h32CIJKqL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61LRpdOCktL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-maxi",
      "title": "Womens Maxi Dress Long Sleeve Maxi",
      "price": 39.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71VSUKMEenL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon",
      "title": "Womens Maxi Dress Bodycon",
      "price": 35.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51f+GgnvkTL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-evening-v-neck-formal",
      "title": "Womens Maxi Dress Evening V Neck Formal",
      "price": 89.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61N7xSWWaVL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-short-sleeve-maxi",
      "title": "Womens Maxi Dress Evening Short Sleeve Maxi",
      "price": 108.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61wOhOilEWL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-formal",
      "title": "Womens Maxi Dress Evening Formal",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61CLAYjFO6L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 82.82,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/91BO3WpqxPL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-sleeveless-maxi",
      "title": "Womens Maxi Dress Sleeveless Maxi",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51JKH0nQu5L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-v-neck",
      "title": "Womens Dress V Neck",
      "price": 19.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/615dowAZsGL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-formal-evening",
      "title": "Womens Maxi Dress Long Sleeve Formal Evening",
      "price": 79.89,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61-fASfMR4L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-split-high-split-bodycon-sleeveless-formal",
      "title": "Womens Dress Split High Split Bodycon Sleeveless Formal",
      "price": 84.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/718lfV3E+kL._SL1500_.jpg"
      ]
    }
  ]
}