{
  "id": "womens-maxi-dress-v-neck-maxi-bodycon-split-formal-evening",
  "handle": "womens-maxi-dress-v-neck-maxi-bodycon-split-formal-evening",
  "sku": "JC1733",
  "asin": "B0D8VLSSY2",
  "title": "Womens Maxi Dress V Neck Maxi Bodycon Split Formal Evening",
  "title_original": "KUTUMAI Women Sexy Sequin Bodycon Maxi Dress V Neck Split Back Formal Evening Cocktail Party Long Dresses",
  "brand": "Visit the KUTUMAI Store",
  "price": 59.99,
  "social_proof": {
    "bought_past_month": 229,
    "text": "229+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/61ll5FCrhKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71OQj0L-9EL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ZIJimpG1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61amtkDwNrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71CKCVK7KUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ONFvWOB-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71eNj5YwS3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Aep8NZimL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61DQ-sxKFQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/711+Tf-xKhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61e5rNXJg3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71CN28fCEtL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/615zhvzNGwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ilOR1RBmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71W64tUcCvL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/61ll5FCrhKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71OQj0L-9EL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ZIJimpG1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61amtkDwNrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71CKCVK7KUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ONFvWOB-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71eNj5YwS3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Aep8NZimL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61DQ-sxKFQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/711+Tf-xKhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61e5rNXJg3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71CN28fCEtL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/615zhvzNGwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ilOR1RBmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71W64tUcCvL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ July 5, 2024",
    "ASIN ‏": "‎ B0D8VL6974",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#66,696 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #233 in Women's Formal Dresses",
    "Customer Reviews": "4.1 4.1 out of 5 stars (123)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Wine",
      "Navy",
      "Black"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.1,
    "count": 123,
    "customers_say": "Customers find the dress great for fancy evening events and appreciate its flattering fit, comfort, and stretchy material. The dress receives positive feedback for its appearance, with one customer noting it's perfect for Valentine's date night. However, the material quality receives mixed reviews, with several customers describing it as somewhat cheap, and the sparkles are criticized for being sparse and scattered. Select to learn more Looks Quality Fit Comfort Flattering Stretchy fabric Material quality Sparkle 20 customers mention \"Looks\" 17 positive 3 negative Customers find the dress gorgeous, with one mentioning it's perfect for Valentine's date night, while others say it looks cheap. \"...The dress was sexy and classy. The material was comfortable. The dress did not look cheap and I felt like a tall glass of vintage red wine....\" Read more \" Cute but the strands are delicate.\" Read more \" Gorgeous !!...\" Read more \" Very pretty dress ! Super comfortable and photographs well. Excited to wear again. I sized down to a small for a better fit....\" Read more 12 customers mention \"Quality\" 10 positive 2 negative Customers find the dress to be of good quality, with one mentioning it works well for gala events and another noting it's perfect for Valentine's date night. \" Lovely dress . True to size. However, recommend a size down if not well endowed on bust area. Worth the price.\" Read more \"This dress great , comfy, sexy and soft.\" Read more \"...The material is soft on the inside and of decent quality .\" Read more \"This dress is definitely beautiful. I loved. The quality is very good ; it's very comfortable and elegant.\" Read more 11 customers mention \"Fit\" 11 positive 0 negative Customers are satisfied with how the dress fits. \"This dress definitely sparkles and fit well , sizing id say is accurate but material feels kinda cheap but thin and lite weight which makes it...\" Read more \"This dress fit perfectly and made me feel so confident! It's ideal for petite women since there's no need to hem....\" Read more \"I am 5'4\" with a booty and the dress fit great ! The material is soft on the inside and of decent quality.\" Read more \"...Look/Fit: I’m 5’2 125 pounds and the dress fit me well ....\" Read more 10 customers mention \"Comfort\" 10 positive 0 negative Customers find the dress comfortable, with one mentioning it's not scratchy at all. \"Very pretty dress! Super comfortable and photographs well. Excited to wear again. I sized down to a small for a better fit....\" Read more \"I don’t think I’ve ever felt this good. The fabric was stretchy and comfortable . I’m 5 ft and 145 pounds and a small was perfect.\" Read more \"...I loved. The quality is very good; it's very comfortable and elegant.\" Read more \"...The dress was sexy and classy. The material was comfortable . The dress did not look cheap and I felt like a tall glass of vintage red wine....\" Read more 7 customers mention \"Flattering\" 7 positive 0 negative Customers find the dress flattering, with one mentioning it stops at the ankles. \" Very flattering dress\" Read more \"Most flattering dress I’ve ever had! Wore it to my formal 30th birthday and it was perfect\" Read more \"...Super super comfortable & flattering .\" Read more \"...Heavy probably could Have got a small it was perfect very flattering \" Read more 5 customers mention \"Stretchy fabric\" 4 positive 1 negative Customers appreciate the dress's stretchy material. \"I don’t think I’ve ever felt this good. The fabric was stretchy and comfortable. I’m 5 ft and 145 pounds and a small was perfect.\" Read more \"... Very stretchy material but wouldn’t recommend for the price.\" Read more \"...baby bump but this dress is surprisingly very nice fabric and very stretchy ....\" Read more \"...It had sparse glitter and flexible square silver sequins....\" Read more 10 customers mention \"Material quality\" 3 positive 7 negative Customers have mixed opinions about the material quality of the dress, with some finding it cheap. \"The fabric looks extremely cheap for the price I paid. Might as well get a dress off SHEIN for half the price. Very disappointing.\" Read more \"I appreciate the shape and neckline of the dress, but I didn't love the fabric . I think it was the \"sparkles\" they added to it....\" Read more \"...pregnant with a little baby bump but this dress is surprisingly very nice fabric and very stretchy....\" Read more \"...sparkles and fit well, sizing id say is accurate but material feels kinda cheap but thin and lite weight which makes it decently comfortable....\" Read more 7 customers mention \"Sparkle\" 2 positive 5 negative Customers have mixed opinions about the dress's sparkle, with several noting that the glitter is sparse and scattered, while one customer mentions that it falls off. \"Beautiful dress but very cheap material, the glitter falls off as you’re taking it out of the package and it doesn’t seem to hold well possibly a 1-...\" Read more \"...based on the pictures, but I was disappointed that there were few sparkles . It had sparse glitter and flexible square silver sequins....\" Read more \"This dress definitely sparkles and fit well, sizing id say is accurate but material feels kinda cheap but thin and lite weight which makes it...\" Read more \"...It’s just a scattered assortment of glitter . The shape and fit of the dress were perfect, but these random glitter pieces are not it.\" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Fit well",
        "body": "Very pretty dress! Super comfortable and photographs well. Excited to wear again. I sized down to a small for a better fit. I’m short 5’2 and had room for heels but flats worked well without being too long. Read more",
        "author": "Martin4",
        "rating": 5.0,
        "date": "December 3, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61rDJd2vw4L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Comfortable and sexy!",
        "body": "I love this dress! I bought this very last minute for my law school “prom” and I’m so glad I did. I ordered a M and L, and the medium fit the best. I am 150-160lbs, 5ft 5in with athletic build, wide hips and B-cup. The dress was soft and the sparkles did not fall off at all. The straps held very well and the length was perfect with heels. The color and fit are stunning and I was very comfortable. I bloat a ton and I felt so sexy in this dress and I didn’t feel like my stomach was on display. Overall, a great dress for a fancy evening! Read more",
        "author": "Carter",
        "rating": 5.0,
        "date": "March 27, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71v8LX0+bmL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/61QK6YxatFL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "4.0 out of 5 stars Cute but the strands can be torn easily",
        "body": "Cute but the strands are delicate. Read more",
        "author": "Stephanie orozco",
        "rating": 4.0,
        "date": "November 10, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Exactly the picture",
        "body": "This dress is definitely beautiful. I loved. The quality is very good; it's very comfortable and elegant. Read more",
        "author": "Liliana Castaño",
        "rating": 5.0,
        "date": "November 2, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71lN8boIIML._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/511XVME+vKL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "1.0 out of 5 stars Cheap material not worth $50",
        "body": "Beautiful dress but very cheap material, the glitter falls off as you’re taking it out of the package and it doesn’t seem to hold well possibly a 1-2 time use not sure how it would hold up washing it. As for the parts you can tie the string is very thin and fragile. Very stretchy material but wouldn’t recommend for the price. Read more",
        "author": "Ana barraza",
        "rating": 1.0,
        "date": "August 18, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Sexy, Classy, Gorgeous",
        "body": "The media could not be loaded. This dress gives sexy, classy, not doing too much, but enough to get all the attention. I wore it to a Christmas gala and got tons of compliments Look/Fit: I’m 5’2 125 pounds and the dress fit me well. I would have preferred if it was just a tad bit tighter on me for that “fit like a glove” effect, but it didn’t take away from the overall look. It also stops at my ankles Quality: The fabric is thin and thick enough, not see through, and you won’t leave a trail of sparkles wherever you walk I’d say buy the dress, and think about getting it altered if you cared to. Read more",
        "author": "Zikora Ifunanya",
        "rating": 5.0,
        "date": "January 3, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71DhgKjrdkL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71bIqWwpJDL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71BDoLiZF9L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "3.0 out of 5 stars Okay dress",
        "body": "It was okay. The dress came in with some straps broken and somewhat cheap material. I don’t end up wearing because it came late too Read more",
        "author": "Tiffany ES",
        "rating": 3.0,
        "date": "October 20, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars 10/10 loved it",
        "body": "i loved the dress!! pretty stretchy! great material ! the sizing was perfect! it looks exactly like the picture Read more",
        "author": "Jachiya Duffy",
        "rating": 5.0,
        "date": "December 5, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71963sqQHUL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71iuu4PAPvL._SY88._SL1500_.jpg"
        ]
      }
    ]
  },
  "short_description": "Womens Maxi Dress V Neck Maxi Bodycon Split Formal Evening is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.",
  "about_this_item": "Womens Maxi Dress V Neck Maxi Bodycon Split Formal Evening is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.",
  "long_description": "Womens Maxi Dress V Neck Maxi Bodycon Split Formal Evening is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Wine, Navy, Black. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress V Neck Maxi Bodycon Split Formal Evening is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Wine, Navy, Black. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "2a3a0541-acd4-4dc7-a5be-b67ea81c17ba",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2a3a0541-acd4-4dc7-a5be-b67ea81c17ba/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2a3a0541-acd4-4dc7-a5be-b67ea81c17ba/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "77e845a1-9fe4-4fdb-995e-d98ca913bae5",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/77e845a1-9fe4-4fdb-995e-d98ca913bae5/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/77e845a1-9fe4-4fdb-995e-d98ca913bae5/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "301c0fea-06c1-490e-8d96-75009801dd82",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/301c0fea-06c1-490e-8d96-75009801dd82/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/301c0fea-06c1-490e-8d96-75009801dd82/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "71f190a2-bf9e-4e26-acb2-4577f2c7e2f3",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/71f190a2-bf9e-4e26-acb2-4577f2c7e2f3/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/71f190a2-bf9e-4e26-acb2-4577f2c7e2f3/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "bb13f6e6-9659-4bef-9dd4-1387bb05d92b",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bb13f6e6-9659-4bef-9dd4-1387bb05d92b/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bb13f6e6-9659-4bef-9dd4-1387bb05d92b/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "d3c83181-cca4-460a-ac4b-a1ef592fae37",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d3c83181-cca4-460a-ac4b-a1ef592fae37/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d3c83181-cca4-460a-ac4b-a1ef592fae37/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "a67aeb54-ed3d-484a-80c3-32032dc61367",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a67aeb54-ed3d-484a-80c3-32032dc61367/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a67aeb54-ed3d-484a-80c3-32032dc61367/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "858e2932-9491-4744-aeb6-dc03c3afb313",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/858e2932-9491-4744-aeb6-dc03c3afb313/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/858e2932-9491-4744-aeb6-dc03c3afb313/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Wine": "https://m.media-amazon.com/images/I/41nEHvp7SzL._AC_SR38,50_.jpg",
    "Navy": "https://m.media-amazon.com/images/I/41GYsLBXriL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/417x-GGPiTL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Wine": "61ONFvWOB-L",
    "Navy": "61e5rNXJg3L",
    "Black": "61ll5FCrhKL"
  },
  "color_images": {
    "Wine": [
      "https://m.media-amazon.com/images/I/61ONFvWOB-L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71eNj5YwS3L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61Aep8NZimL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61DQ-sxKFQL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/711+Tf-xKhL._SL1500_.jpg"
    ],
    "Navy": [
      "https://m.media-amazon.com/images/I/61e5rNXJg3L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71CN28fCEtL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/615zhvzNGwL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61ilOR1RBmL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71W64tUcCvL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/61ll5FCrhKL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71OQj0L-9EL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61ZIJimpG1L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61amtkDwNrL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71CKCVK7KUL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 395.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61xT1YW6OML._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-v-neck-sleeveless-bodycon-cocktail",
      "title": "Womens Dress V Neck Sleeveless Bodycon Cocktail",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51P8ZqIY9oL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-long-sleeve-formal-bodycon-cocktail",
      "title": "Womens Maxi Dress Maxi Long Sleeve Formal Bodycon Cocktail",
      "price": 54.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/51Bb91rcI1L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-short-sleeve-maxi",
      "title": "Womens Maxi Dress Short Sleeve Maxi",
      "price": 33.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71gMNd2Q8WL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-off-shoulder",
      "title": "Womens Maxi Dress Off Shoulder",
      "price": 112.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/718bcEDLmoL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-bodycon-ruched-long-sleeve",
      "title": "Womens Maxi Dress Bodycon Ruched Long Sleeve",
      "price": 29.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71D0M7OhasL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 83.3,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Work",
      "images": [
        "https://m.media-amazon.com/images/I/71W91kSNExL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-long-sleeve-formal",
      "title": "Womens Maxi Dress Evening Long Sleeve Formal",
      "price": 72.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51PnUgcUJHL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-formal-sleeveless",
      "title": "Womens Dress Formal Sleeveless",
      "price": 41.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/616zDDTqi3L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-bodycon-sleeveless-cocktail-ruched-v-neck",
      "title": "Womens Dress Bodycon Sleeveless Cocktail Ruched V Neck",
      "price": 56.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61vGL0kNJYL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-ruched-long-sleeve",
      "title": "Womens Maxi Dress Maxi Ruched Long Sleeve",
      "price": 54.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71jybg4ZruL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-maxi",
      "title": "Womens Maxi Dress Long Sleeve Maxi",
      "price": 49.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61LxxVOg3RL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-boat-neck-sleeveless",
      "title": "Womens Dress Boat Neck Sleeveless",
      "price": 19.79,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/518oJldZIfL._SL1500_.jpg"
      ]
    }
  ]
}