{
  "id": "womens-maxi-dress-long-sleeve",
  "handle": "womens-maxi-dress-long-sleeve",
  "sku": "JC3265",
  "asin": "B0D9GTC2WX",
  "title": "Womens Maxi Dress Long Sleeve",
  "title_original": "ZESICA Womens 2026 Fall Turtleneck Long Sleeve Sweater Dress Tie Waist Casual Loose Ribbed Knit A Line Midi Dresses",
  "brand": "Visit the ZESICA Store",
  "price": 51.29,
  "social_proof": {
    "bought_past_month": 1789,
    "text": "1789+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/61PiBYMUlgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/717fEjpEzxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71y399fWmgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71o94j8RKCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/818bk+GlM5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81RU1MYrsML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71obhmqIhiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/713tfvAkA-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71LAzvbG5nL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71zkj2hFslL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/711ISx5WozL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71huyZm7wnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71iLiAR0ynL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/712SpVn0q7L._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/61PiBYMUlgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/717fEjpEzxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71y399fWmgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71o94j8RKCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/818bk+GlM5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81RU1MYrsML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71obhmqIhiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/713tfvAkA-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71LAzvbG5nL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71zkj2hFslL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/711ISx5WozL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71huyZm7wnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71iLiAR0ynL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/712SpVn0q7L._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Product Dimensions ‏": "‎ 1.97 x 0.79 x 0.39 inches",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ July 30, 2024",
    "Manufacturer ‏": "‎ ZESICA",
    "ASIN ‏": "‎ B0D9GW288M",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#4,846 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #20 in Women's Casual Dresses",
    "Customer Reviews": "4.4 4.4 out of 5 stars (1,115)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Brown",
      "Khaki",
      "Pink",
      "Eggplant",
      "Apricot",
      "Black",
      "Teal",
      "Dusty Blue",
      "Grey"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.4,
    "count": 1115,
    "customers_say": "Customers find the dress chic and well-made, appreciating its thick fabric that's warm without being too heavy. The fit receives positive feedback, with one customer noting it accommodates an umbilical hernia belt, and they find it comfortable and flattering. The length receives mixed reviews, with some finding it nice while others say it's too long, particularly noting it's geared towards short-waisted people. Select to learn more Style Fit Quality Comfort Flattering Material quality Warmth Length 216 customers mention \"Style\" 203 positive 13 negative Customers find the dress chic and of nice quality, with one customer noting it looks expensive, though some find it cheap looking. \"A beautiful dress . Very modest ! I wore it Sunday to church and received many compliments I’m 5’6”…210 lbs and the XL FIT me exceptionally\" Read more \"I love the color I ordered a teal it is beautiful it may be just a little long but if it is I can him it the quality of the fabric seems great, and...\" Read more \"This dress is cute . It’s hard to know what size, color etc is best when ordering online. I normally wear a size 8 or Medium....\" Read more \" Gorgeous & Classy! I was thinking ahead for the holidays but is perfect for work attire as well, dressy or everyday!...\" Read more 165 customers mention \"Fit\" 152 positive 13 negative Customers are satisfied with how the dress fits, particularly noting its beautiful color and perfect sizing, with one customer mentioning it sits nicely and another noting it falls just above the ankles. \" Great fit and color. Great for the office or to attend a personal event. Thinking about getting a few more in different colors\" Read more \"Love this dress. Fits true to size . I weigh 145 5’4 I ordered a med. and it’s perfect length and fits nicely. Seems to be a good quality material.\" Read more \"I absolutely LOVE this dress. It fits well , great material, stretchy fabric but keeps it’s shape. Sophisticated style....\" Read more \"Very well made, the material is thick and it fits perfectly . The first time I wore it I received multiple compliments from friends....\" Read more 138 customers mention \"Quality\" 134 positive 4 negative Customers praise the dress's construction, describing it as well-made and perfect. \"This dress is beautiful and well made . All sweater material. It’s ribbed at the top . I wasn’t sure on the sizing. I went up a size to a large....\" Read more \"...It is a great dress - I put it with a different belt (after going in the dryer for wrinkles) I don’t know how this will wash....\" Read more \"So chic! Great quality and super comfortable. One of those pieces that doesn’t go out of style and will be worn year after year. Fits TTS\" Read more \"...The make of the dress is nice and thick. Not to heavy, just right. Nice and warm. There is a nice stretchy also. Stick with regular size.\" Read more 88 customers mention \"Comfort\" 88 positive 0 negative Customers find the dress comfortable and cozy, with one customer noting that it doesn't feel constricting. \"This dress is super stretchy and comfortable . It's like a stretchy thick knit. The skirt is not as flowing at the photo, but it is still nice....\" Read more \"...It’s very comfortable . I did wear it with a spankx which made it more comfortable since it is form fitting. I would recommend this purchase....\" Read more \"...Normally I wouldn't make a no-pocket dress a favorite, but its so comfortable and stylish I'll make an exception.\" Read more \"...This dress is AWESOME- it fits like a glove, super comfortable , flattering, warm, and flowy. The color is rich and it’s everything that I wanted.\" Read more 63 customers mention \"Flattering\" 58 positive 5 negative Customers find the dress flattering, with one mentioning it works well for covering back fat and another noting it's suitable for formal occasions like weddings. \"...Very sharp looking. Seems well made. Flattering . I bought the black and white and the turquoise and black in the same size the funny thing is...\" Read more \"This is a perfect dress for a winter wedding. It’s very flattering especially when you are wearing some support underneath. Spot on\" Read more \"...It's a flattering dress and I plan on wearing it for the holidays....\" Read more \"Great dress. Fit perfectly and its so flattering on you\" Read more 62 customers mention \"Material quality\" 59 positive 3 negative Customers like the material of the dress, describing it as nice and thick, with one customer noting it's perfect for spring weather. \"Absolutely love the pattern, color, fabric and fit! Only reason it’s not 5 stars is it doesn’t have pockets.\" Read more \"Bought this for someone else and she loved it, looked great. Nice material and flowy at the bottom. Dress came down right before the ankles....\" Read more \"Super cute! Nice fabric , accurate sizing, dress hangs nicely on the body.\" Read more \"I love the material and flow of the dress. It appears to be geared towards short waisted people....\" Read more 55 customers mention \"Warmth\" 54 positive 1 negative Customers find the dress warm and comfortable for fall and winter, noting it's perfect for chilly months without being too thick or heavy. \"...dress is AWESOME- it fits like a glove, super comfortable, flattering, warm , and flowy. The color is rich and it’s everything that I wanted.\" Read more \"...It really looked good on. Very warm , quality material and good weight. True to color; good fabric. I’m pleased with the purchase\" Read more \"This is the perfect winter dress . Cozy without being overly warm. Very flattering for your figure....\" Read more \"...I’m usually someone that is very cold and this kept me warm \" Read more 44 customers mention \"Length\" 25 positive 19 negative Customers have mixed opinions about the dress's length, with some finding it nice and not too long, while others note that it's geared towards short waisted people. \"Love this dress! It’s so comfortable and stretchy, a great length . Wore it out to lunch after church and was stopped and complimented on it....\" Read more \"Very nice, but too long \" Read more \"This sweater dress is the perfect length and the material is soft and comfortable. It is a very classic look. I love, love this dress....\" Read more \"...body types but I found the dress to be true to size but the sleeves were a little long on me, i just folded up and it looked like it was made that...\" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Zesica Fall Fashion Turtleneck Dress -Black",
        "body": "As a petite female, I have been a fan of Zesica’s clothing line for a couple of yrs now. The length of this dress is perfect for my 5’2” height. The top to waist is comfortably fitted while not tight or loose. The sleeves also are a perfect length while the skirt section is flowy. The black dress is exactly as pictured-a dark Halloweeny black- not old or worn looking. The turtleneck fits comfortably and does not feel like it’s chocking you. As the cool fall weather comes in this dress is toasty with a heavier sweater/ skirt than what is not so easily found often. Great quality and I will wear this into the winter. Read more",
        "author": "Maureen",
        "rating": 5.0,
        "date": "September 29, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars No pockets, but still amazing",
        "body": "My dog loves towels. After I shower he gets to play with his towel as a reward for waiting patiently. Towels are his favorite thing. But this is about a dress! I hear you say. And to that I say my dog treated this dress the way he treats towels. He was upset I was wearing it and he didn't get a new towel of his own. He wanted to be under the skirt so he could experience the towel and that's saying something because he's 125 lbs of muscle. It was long and full so we both fit. The material is about as think as those microfiber towels and nice and soft. I have fibromyalgia and feel the clothes I wear so comfortable clothes is my top priority. It wasn't too thick, but it was good quality material. There weren't any sheer spots or anything. It looked fabulous. Like, the guys at work noticed it was new and complimented it as the perfect style for me fabulous. More importantly, I loved the way it looked. If this dress had pockets I would buy it in five colors and make it my official work uniform. If there is a version with pockets I'd love to know! Normally I wouldn't make a no-pocket dress a favorite, but its so comfortable and stylish I'll make an exception. Read more",
        "author": "MacD",
        "rating": 5.0,
        "date": "September 25, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Beautiful dress! 5 stars.",
        "body": "I’m 5’7”, and wanted to wear this dress to work, with boots. This dress is AWESOME- it fits like a glove, super comfortable, flattering, warm, and flowy. The color is rich and it’s everything that I wanted. Read more",
        "author": "ZG",
        "rating": 5.0,
        "date": "October 28, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71lZrsk799L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "4.0 out of 5 stars Looks more expensive than it is ~",
        "body": "This is adorable! Nice material. Fits true to size. I don't love the belt - it's too narrow. I replaced it with a leather belt from my closet about twice the size of the original. Read more",
        "author": "Rebecca Faoro",
        "rating": 4.0,
        "date": "December 1, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars CLASSIC AND BEAUTIFUL!",
        "body": "This sweater dress is the perfect length and the material is soft and comfortable. It is a very classic look. I love, love this dress. Most sweater dresses I have purchased are thin and clingy. This is just the opposite. Beautiful and elegant design! Read more",
        "author": "Carilyn F.",
        "rating": 5.0,
        "date": "November 29, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Fantastic dress",
        "body": "Love this dress! It’s so comfortable and stretchy, a great length. Wore it out to lunch after church and was stopped and complimented on it. It’s slim/fitted enough that you can wear a sweater if needed but it’s plenty warm on its own. It fit as expected. Read more",
        "author": "Me",
        "rating": 5.0,
        "date": "November 19, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Great Dress!!!!!",
        "body": "True to size, very comfortable dress. I received compliments. Great fall/winter dress not too heavy yet warm enough. I paired it with some boots!! Will buy in other colors!!! Highly recommend very nice fabric!!!! Read more",
        "author": "S. Rozier",
        "rating": 5.0,
        "date": "November 12, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Good quality",
        "body": "I really liked the color combination, but it didn't quite fit my body shape. The quality is good, and it fits true to size. The fabric is very stretchy at the bottom. Read more",
        "author": "Jean C.",
        "rating": 3.0,
        "date": "December 9, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.",
  "about_this_item": "Womens Maxi Dress Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.",
  "long_description": "Womens Maxi Dress Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Brown, Khaki, Pink, Eggplant, Apricot, Black, Teal, Dusty Blue, Grey. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Brown, Khaki, Pink, Eggplant, Apricot, Black, Teal, Dusty Blue, Grey. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "b8653408-57f6-40ef-9a66-69bfabf3c277",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b8653408-57f6-40ef-9a66-69bfabf3c277/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b8653408-57f6-40ef-9a66-69bfabf3c277/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "daeeecb2-60bd-4b2e-8cee-f77e5e4b27e2",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/daeeecb2-60bd-4b2e-8cee-f77e5e4b27e2/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/daeeecb2-60bd-4b2e-8cee-f77e5e4b27e2/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "d648e5f3-2a35-4dc4-a4c4-13e67a923cd5",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d648e5f3-2a35-4dc4-a4c4-13e67a923cd5/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d648e5f3-2a35-4dc4-a4c4-13e67a923cd5/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "51de5b3a-048d-4ea0-8b5b-f7083a640d0a",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/51de5b3a-048d-4ea0-8b5b-f7083a640d0a/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/51de5b3a-048d-4ea0-8b5b-f7083a640d0a/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "74894545-d9bc-4477-889a-f457123225b4",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/74894545-d9bc-4477-889a-f457123225b4/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/74894545-d9bc-4477-889a-f457123225b4/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "fb2504aa-09b4-4560-a2c4-df20c51aa5a5",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/fb2504aa-09b4-4560-a2c4-df20c51aa5a5/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/fb2504aa-09b4-4560-a2c4-df20c51aa5a5/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "ac01ca6f-35c6-445f-a1ab-ddb2f947f748",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ac01ca6f-35c6-445f-a1ab-ddb2f947f748/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ac01ca6f-35c6-445f-a1ab-ddb2f947f748/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "a97e7709-6d88-4722-bade-90f572010260",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a97e7709-6d88-4722-bade-90f572010260/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a97e7709-6d88-4722-bade-90f572010260/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "88b4fe9d-997e-4e4d-ab7c-b5a0ca0b44e7",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/88b4fe9d-997e-4e4d-ab7c-b5a0ca0b44e7/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/88b4fe9d-997e-4e4d-ab7c-b5a0ca0b44e7/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "3d1846a5-a98e-4a4a-9ee9-a37121d8da54",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3d1846a5-a98e-4a4a-9ee9-a37121d8da54/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3d1846a5-a98e-4a4a-9ee9-a37121d8da54/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "f00aac94-6ffa-4200-b42e-156b9389b576",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f00aac94-6ffa-4200-b42e-156b9389b576/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f00aac94-6ffa-4200-b42e-156b9389b576/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "a5d50bf7-2a16-49e5-a26b-5f88d17b443a",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a5d50bf7-2a16-49e5-a26b-5f88d17b443a/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a5d50bf7-2a16-49e5-a26b-5f88d17b443a/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Brown": "https://m.media-amazon.com/images/I/31dgs3sDaJL._AC_SR38,50_.jpg",
    "Khaki": "https://m.media-amazon.com/images/I/315rm3tY6FL._AC_SR38,50_.jpg",
    "Pink": "https://m.media-amazon.com/images/I/31jQziEYbxL._AC_SR38,50_.jpg",
    "Eggplant": "https://m.media-amazon.com/images/I/313bs34IbKL._AC_SR38,50_.jpg",
    "Apricot": "https://m.media-amazon.com/images/I/31cCmsQBpZL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31Z0h3g4UpL._AC_SR38,50_.jpg",
    "Teal": "https://m.media-amazon.com/images/I/318XH2OX99L._AC_SR38,50_.jpg",
    "Dusty Blue": "https://m.media-amazon.com/images/I/315r8SSJzbL._AC_SR38,50_.jpg",
    "Grey": "https://m.media-amazon.com/images/I/31HFQdVRTRL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Brown": "71obhmqIhiL",
    "Khaki": "713tfvAkA-L",
    "Pink": "71LAzvbG5nL",
    "Eggplant": "71zkj2hFslL",
    "Apricot": "711ISx5WozL",
    "Black": "61PiBYMUlgL",
    "Teal": "71huyZm7wnL",
    "Dusty Blue": "71iLiAR0ynL",
    "Grey": "712SpVn0q7L"
  },
  "color_images": {
    "Brown": [
      "https://m.media-amazon.com/images/I/71obhmqIhiL._SL1500_.jpg"
    ],
    "Khaki": [
      "https://m.media-amazon.com/images/I/713tfvAkA-L._SL1500_.jpg"
    ],
    "Pink": [
      "https://m.media-amazon.com/images/I/71LAzvbG5nL._SL1500_.jpg"
    ],
    "Eggplant": [
      "https://m.media-amazon.com/images/I/71zkj2hFslL._SL1500_.jpg"
    ],
    "Apricot": [
      "https://m.media-amazon.com/images/I/711ISx5WozL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/61PiBYMUlgL._SL1500_.jpg"
    ],
    "Teal": [
      "https://m.media-amazon.com/images/I/71huyZm7wnL._SL1500_.jpg"
    ],
    "Dusty Blue": [
      "https://m.media-amazon.com/images/I/71iLiAR0ynL._SL1500_.jpg"
    ],
    "Grey": [
      "https://m.media-amazon.com/images/I/712SpVn0q7L._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress-cocktail-bodycon",
      "title": "Womens Dress Cocktail Bodycon",
      "price": 47.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61NfEwzl3xL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-one-shoulder-maxi-formal",
      "title": "Womens Maxi Dress Evening One Shoulder Maxi Formal",
      "price": 69.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/5150AIQL4eL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail",
      "title": "Womens Dress Cocktail",
      "price": 103.54,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61JApwce25L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-formal-bodycon-evening-sleeveless",
      "title": "Womens Maxi Dress Maxi Formal Bodycon Evening Sleeveless",
      "price": 61.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61s8qg6u1VL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 158.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71PmRANW40L._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress-bodycon-split-ruched-off-shoulder",
      "title": "Womens Dress Bodycon Split Ruched Off Shoulder",
      "price": 38.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/41JjYcPgcpL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 95.61,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Work",
      "images": [
        "https://m.media-amazon.com/images/I/71hVgSIB1jL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 138.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51PZNrlyY9L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-split-evening-formal",
      "title": "Womens Maxi Dress Split Evening Formal",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51BZ1BqPx8L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 65.97,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/81wr8PDg55L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-v-neck",
      "title": "Womens Dress V Neck",
      "price": 82.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/710bSTpZ9hL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 278.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/91YXeyW506L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening-long-sleeve",
      "title": "Womens Maxi Dress Formal Evening Long Sleeve",
      "price": 87.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61nnk+flvaL._SL1500_.jpg"
      ]
    }
  ]
}