{
  "id": "womens-maxi-dress-long-sleeve-bodycon",
  "handle": "womens-maxi-dress-long-sleeve-bodycon",
  "sku": "JC2448",
  "asin": "B0D93HNVDM",
  "title": "Womens Maxi Dress Long Sleeve Bodycon",
  "title_original": "Saodimallsu Womens Long Sleeve Sweater Dress Bodycon Crew Neck Fall Slimming Knit Mini Dresses",
  "brand": "Visit the Saodimallsu Store",
  "price": 44.98,
  "social_proof": {
    "bought_past_month": 119,
    "text": "119+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/712XBlOWgrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/611d+xkTxZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/6121a1ajrOL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71iQlT3LzSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61WyS5T9GLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61KEF8MjQqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81ZiMJBT75L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81MI6s-bXeL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71tWSDKHEWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81YLlSQeD1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71N8zPYyCAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81zBm7VQO9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81tT43Q8B3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81vE6PZOe+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/7175vLPUCcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81exQJ2dr1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71uk1eIH+EL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81jtfCCrY8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81FkHc3sWCL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/712XBlOWgrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/611d+xkTxZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/6121a1ajrOL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71iQlT3LzSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61WyS5T9GLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61KEF8MjQqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81ZiMJBT75L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81MI6s-bXeL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71tWSDKHEWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81YLlSQeD1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71N8zPYyCAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81zBm7VQO9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81tT43Q8B3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81vE6PZOe+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/7175vLPUCcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81exQJ2dr1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71uk1eIH+EL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81jtfCCrY8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81FkHc3sWCL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Package Dimensions ‏": "‎ 7.87 x 5.91 x 0.79 inches; 1.1 Pounds",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ September 3, 2024",
    "Manufacturer ‏": "‎ Saodimallsu",
    "ASIN ‏": "‎ B0D93JXPSM",
    "Best Sellers Rank": "#12,765 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #65 in Women's Club & Night Out Dresses",
    "Customer Reviews": "4.3 4.3 out of 5 stars (122)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Brown",
      "Blue",
      "Burgundy",
      "Apricot",
      "Black",
      "Navy Blue",
      "Brick Red",
      "Khaki",
      "Pink",
      "White",
      "Beige",
      "Coffe",
      "Green",
      "Grey"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.3,
    "count": 122,
    "customers_say": "Customers find the sweater dress classy and appreciate its perfect length, with one noting it's loose enough to hide panty lines. They describe it as comfortable, soft, flattering, and warm, with one mentioning it hugs the bump well. The neckline receives mixed feedback, with several customers noting it's high, and opinions about transparency are divided, with some saying it's not see-through while others find it slightly transparent. Generated from the text of customer reviews Select to learn more Quality (19) Fit (16) Comfort (9) Fabric softness (5) Flattering (5) Warmth (5) See through (4) Neckline (4) 19 customers mention quality, 18 positive, 1 negative 19 customers mention \"Quality\" 18 positive 1 negative Customers have mixed opinions about the dress's quality, with some finding it classy and well-made, while others describe it as terrible. \" Fits well, soft, warm and cute \" Read more \" Terrible . Huge \" Read more \" Super cute dress !!! \" Read more \" CUTE dress but it is slightly see through as white and requires a slip underneath \" Read more 16 customers mention fit, 13 positive, 3 negative 16 customers mention \"Fit\" 13 positive 3 negative Customers like how the dress fits, noting its perfect length and not being too long. One customer mentions that the sleeves hit right at the wrists, while another notes it's loose enough to hide panty lines. \" The dress fits really well and is very form fitting \" Read more \" Beautiful fit , soft fabric but quite a bit of fuzzing after wash stops me from giving 5 stars \" Read more \" Live the fit , quality and style of this dress! I used it for New Year’s Eve house left with my family and I enjoyed being in it!... \" Read more \" ...Also perfect length not to short . \" Read more 9 customers mention comfort, 8 positive, 1 negative 9 customers mention \"Comfort\" 8 positive 1 negative Customers find the dress comfortable. \" So cute and soft and comfy ! \" Read more \" ...The quality was excellent. The color was a soft olive. COMFORTABLE . My two girlfriends saw me wearing it and said they had to have one!... \" Read more \" Super comfy , warm and cute. \" Read more \" Very comfy and flattering! This dress is the one I got engaged in!... \" Read more 5 customers mention fabric softness, 5 positive, 0 negative 5 customers mention \"Fabric softness\" 5 positive 0 negative Customers like the fabric of the dress, describing it as soft. \" ...The material is soft , stretchy, and really comfortable while still looking elegant. It hugs the bump in such a flattering way without feeling tight.... \" Read more \" Fits well, soft , warm and cute \" Read more \" Beautiful fit, soft fabric but quite a bit of fuzzing after wash stops me from giving 5 stars \" Read more \" ...The material is soft and comfortable.... \" Read more 5 customers mention flattering, 5 positive, 0 negative 5 customers mention \"Flattering\" 5 positive 0 negative Customers find the dress flattering, with one mentioning it hugs the bump well. \" This dress was so flattering . I loved it for our baby’s year old photo shoot.... \" Read more \" This dress fit great and was very flattering . \" Read more \" Very comfy and flattering ! This dress is the one I got engaged in!... \" Read more \" ...It hugs the bump in such a flattering way without feeling tight. I wore it with beige boots and it looked so cute for fall.... \" Read more 5 customers mention warmth, 5 positive, 0 negative 5 customers mention \"Warmth\" 5 positive 0 negative Customers find the dress warm, with one mentioning it works well for cold weather. \" ...It’s VERY comfortable and warm . I’d highly suggest it! \" Read more \" ...It kept me warm yet didn’t feel that hot! Perfect! \" Read more \" Great winter cold weather dress... \" Read more \" Fits well, soft, warm and cute \" Read more 4 customers mention see through, 2 positive, 2 negative 4 customers mention \"See through\" 2 positive 2 negative Customers have mixed opinions about the dress's transparency, with some finding it not see-through, while one customer notes it is slightly see-through. \" ...Although it is thin, it is not see-through . The sleeve length hits right at my wrists and the length hits a few inches above my knees.... \" Read more \" ...It is slightly see through , so keep that in mind for what you might wear underneath. \" Read more \" A little thin but not see through . Quality is okay for what you pay for. Wore it for an engagement shoot. \" Read more \" CUTE dress but it is slightly see through as white and requires a slip underneath \" Read more 4 customers mention neckline, 0 positive, 4 negative 4 customers mention \"Neckline\" 0 positive 4 negative Customers have mixed opinions about the neckline of the dress, with some appreciating that it's high, while one customer notes that it looks and feels unfinished, and another mentions that the seams can appear spaced out. \" Neck line is a bit high \" Read more \" The pic is very deceiving. This is a mock neck dress . I usually wear a medium but could have sized down as well. \" Read more \" ...But it’s not good. The fit is weird and awkward. The neckline looks and feels unfinished . It’s super baggy and the shoulders look funny.... \" Read more \" ...bra underneath because when you put the dress on the seams can look a bit spaced out if that makes sense.... \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Super cute, good fit",
        "body": "I'm 5'1\", 140 lbs, small up top, wide hips. Purchased the medium in beige and it fits good. Not too tight and just loose enough to not show panty lines (I do wear shape wear tho). It stops about 2\" above my knees. And I paired it with cable knit long socks, knee high boots and a cropped distressed pleather jacket. The material is soft and comfortable. I've worn sweaters like this before and the material will stretch out over time around the collar and sleeve holes. It also pills if you're not careful when you wash it. I wash mine separate and air dry. Read more",
        "author": "That Girl",
        "rating": 5.0,
        "date": "November 18, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Perfect sweater Dress",
        "body": "This sweater dress fit perfect. I’m 5’3”+ Just short enough. Just long enough. The quality was excellent. The color was a soft olive. COMFORTABLE. My two girlfriends saw me wearing it and said they had to have one! Since I bought three in different colors, I gifted one to each then bought four more. I bought olive, espresso, brown, black, red! I’m in love with the espresso, black and olive colors. I haven’t looked closely at the other ones. Im excited to have discovered this label!!! Plus they are surprisingly affordable great quality. I’m so excited. Highly recommend!! 5 stars!!!!! Read more",
        "author": "Irene",
        "rating": 5.0,
        "date": "October 17, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Beautiful Fall Dress",
        "body": "Beautiful fit, soft fabric but quite a bit of fuzzing after wash stops me from giving 5 stars Read more",
        "author": "Robin P",
        "rating": 4.0,
        "date": "November 17, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Pretty and great quality for price",
        "body": "Very comfy and flattering! This dress is the one I got engaged in! I’d highly recommend pairing with a belt to be a bit more formal fitting, but overall it is a wonderful dress for the price. It is slightly see through, so keep that in mind for what you might wear underneath. Read more",
        "author": "Alyse",
        "rating": 5.0,
        "date": "November 19, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars So good!",
        "body": "I love this more than I thought I would!!! As someone who has never worn a sweater dress before, I love this! I am 5’2, curvy with wider hips and a small waist and this fits like a glove! It’s not too short and it’s not too long. It does look shorter in the back bc of my butt but it doesn’t bother me. I bought a brown belt to go with it and it looks great!!! I might order the burgundy color too but we’ll see! I plan on wearing this on thanksgiving and probably Christmas too. Read more",
        "author": "Hannah Wise",
        "rating": 5.0,
        "date": "November 4, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Sweater dress",
        "body": "Fits well, soft, warm and cute Read more",
        "author": "Kimberly Herrera",
        "rating": 5.0,
        "date": "September 25, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "1.0 out of 5 stars Not to size",
        "body": "Terrible. Huge Read more",
        "author": "amber",
        "rating": 1.0,
        "date": "December 5, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Neck line is high. Can’t tell front from back",
        "body": "Neck line is a bit high Read more",
        "author": "Lauren Jordan",
        "rating": 3.0,
        "date": "November 18, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Long Sleeve Bodycon is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.",
  "about_this_item": "Womens Maxi Dress Long Sleeve Bodycon is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.",
  "long_description": "Womens Maxi Dress Long Sleeve Bodycon is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Brown, Blue, Burgundy, Apricot, Black, Navy Blue, Brick Red, Khaki, Pink, White, Beige, Coffe, Green, Grey. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Long Sleeve Bodycon is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Brown, Blue, Burgundy, Apricot, Black, Navy Blue, Brick Red, Khaki, Pink, White, Beige, Coffe, Green, Grey. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "5ad8f9c4-6038-453e-bdc4-772afcca7ef9",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5ad8f9c4-6038-453e-bdc4-772afcca7ef9/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5ad8f9c4-6038-453e-bdc4-772afcca7ef9/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/195ac649-05ac-46a3-ba50-0205b5e765b3.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "7d7e917a-35a5-4447-a0c2-da9e6091dee9",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7d7e917a-35a5-4447-a0c2-da9e6091dee9/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7d7e917a-35a5-4447-a0c2-da9e6091dee9/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/195ac649-05ac-46a3-ba50-0205b5e765b3.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "95a7ac3a-6135-4d04-abda-712af69049ec",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/95a7ac3a-6135-4d04-abda-712af69049ec/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/95a7ac3a-6135-4d04-abda-712af69049ec/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/195ac649-05ac-46a3-ba50-0205b5e765b3.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "053345de-72c9-4fcb-af75-b7421379ac87",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/053345de-72c9-4fcb-af75-b7421379ac87/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/053345de-72c9-4fcb-af75-b7421379ac87/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/195ac649-05ac-46a3-ba50-0205b5e765b3.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "381e23fd-3fa3-4d2d-99db-8f655576bdee",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/381e23fd-3fa3-4d2d-99db-8f655576bdee/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/381e23fd-3fa3-4d2d-99db-8f655576bdee/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/195ac649-05ac-46a3-ba50-0205b5e765b3.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "5121bad7-2004-4178-b9d0-fe488f7d48aa",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5121bad7-2004-4178-b9d0-fe488f7d48aa/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5121bad7-2004-4178-b9d0-fe488f7d48aa/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/195ac649-05ac-46a3-ba50-0205b5e765b3.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "5bbd5726-0885-4b2d-95ac-b2a3fe5bc2d5",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5bbd5726-0885-4b2d-95ac-b2a3fe5bc2d5/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5bbd5726-0885-4b2d-95ac-b2a3fe5bc2d5/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/195ac649-05ac-46a3-ba50-0205b5e765b3.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "809ccac5-d898-471d-904c-e673973c5a9e",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/809ccac5-d898-471d-904c-e673973c5a9e/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/809ccac5-d898-471d-904c-e673973c5a9e/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/195ac649-05ac-46a3-ba50-0205b5e765b3.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "24fa6523-0063-470e-8c1a-fe8cbec0ecfd",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/24fa6523-0063-470e-8c1a-fe8cbec0ecfd/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/24fa6523-0063-470e-8c1a-fe8cbec0ecfd/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/195ac649-05ac-46a3-ba50-0205b5e765b3.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "b52af12f-b9d8-4af2-8f37-2b634fa5e3f0",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b52af12f-b9d8-4af2-8f37-2b634fa5e3f0/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b52af12f-b9d8-4af2-8f37-2b634fa5e3f0/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/195ac649-05ac-46a3-ba50-0205b5e765b3.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "0aa770f1-58a4-4e7c-8213-b3ff5c7f792b",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0aa770f1-58a4-4e7c-8213-b3ff5c7f792b/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0aa770f1-58a4-4e7c-8213-b3ff5c7f792b/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/195ac649-05ac-46a3-ba50-0205b5e765b3.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "40d2aee4-7b64-4696-bff1-86724351d2b0",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/40d2aee4-7b64-4696-bff1-86724351d2b0/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/40d2aee4-7b64-4696-bff1-86724351d2b0/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/195ac649-05ac-46a3-ba50-0205b5e765b3.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Brown": "https://m.media-amazon.com/images/I/41MNCAmNwYL._AC_SR38,50_.jpg",
    "Blue": "https://m.media-amazon.com/images/I/41n-KBmQElL._AC_SR38,50_.jpg",
    "Burgundy": "https://m.media-amazon.com/images/I/41-QXUNNebL._AC_SR38,50_.jpg",
    "Apricot": "https://m.media-amazon.com/images/I/41GRh0umVYL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/41i7uCVGxLL._AC_SR38,50_.jpg",
    "Navy Blue": "https://m.media-amazon.com/images/I/41Z1ykwFTVL._AC_SR38,50_.jpg",
    "Brick Red": "https://m.media-amazon.com/images/I/4189ZTWjs6L._AC_SR38,50_.jpg",
    "Khaki": "https://m.media-amazon.com/images/I/41B1xZUhPGL._AC_SR38,50_.jpg",
    "Pink": "https://m.media-amazon.com/images/I/41IR5Najm9L._AC_SR38,50_.jpg",
    "White": "https://m.media-amazon.com/images/I/41vP1ikpjiL._AC_SR38,50_.jpg",
    "Beige": "https://m.media-amazon.com/images/I/41IQ6iM1gWL._AC_SR38,50_.jpg",
    "Coffe": "https://m.media-amazon.com/images/I/41cMXc1hEUL._AC_SR38,50_.jpg",
    "Green": "https://m.media-amazon.com/images/I/41lYiGZ7joL._AC_SR38,50_.jpg",
    "Grey": "https://m.media-amazon.com/images/I/41Ga95b-qWL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Brown": "81ZiMJBT75L",
    "Blue": "81MI6s-bXeL",
    "Burgundy": "71tWSDKHEWL",
    "Apricot": "81YLlSQeD1L",
    "Black": "712XBlOWgrL",
    "Navy Blue": "71N8zPYyCAL",
    "Brick Red": "81zBm7VQO9L",
    "Khaki": "81tT43Q8B3L",
    "Pink": "81vE6PZOe+L",
    "White": "7175vLPUCcL",
    "Beige": "81exQJ2dr1L",
    "Coffe": "71uk1eIH+EL",
    "Green": "81jtfCCrY8L",
    "Grey": "81FkHc3sWCL"
  },
  "color_images": {
    "Brown": [
      "https://m.media-amazon.com/images/I/81ZiMJBT75L._SL1500_.jpg"
    ],
    "Blue": [
      "https://m.media-amazon.com/images/I/81MI6s-bXeL._SL1500_.jpg"
    ],
    "Burgundy": [
      "https://m.media-amazon.com/images/I/71tWSDKHEWL._SL1500_.jpg"
    ],
    "Apricot": [
      "https://m.media-amazon.com/images/I/81YLlSQeD1L._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/712XBlOWgrL._SL1500_.jpg"
    ],
    "Navy Blue": [
      "https://m.media-amazon.com/images/I/71N8zPYyCAL._SL1500_.jpg"
    ],
    "Brick Red": [
      "https://m.media-amazon.com/images/I/81zBm7VQO9L._SL1500_.jpg"
    ],
    "Khaki": [
      "https://m.media-amazon.com/images/I/81tT43Q8B3L._SL1500_.jpg"
    ],
    "Pink": [
      "https://m.media-amazon.com/images/I/81vE6PZOe+L._SL1500_.jpg"
    ],
    "White": [
      "https://m.media-amazon.com/images/I/7175vLPUCcL._SL1500_.jpg"
    ],
    "Beige": [
      "https://m.media-amazon.com/images/I/81exQJ2dr1L._SL1500_.jpg"
    ],
    "Coffe": [
      "https://m.media-amazon.com/images/I/71uk1eIH+EL._SL1500_.jpg"
    ],
    "Green": [
      "https://m.media-amazon.com/images/I/81jtfCCrY8L._SL1500_.jpg"
    ],
    "Grey": [
      "https://m.media-amazon.com/images/I/81FkHc3sWCL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress-ruched-bodycon-sleeveless",
      "title": "Womens Dress Ruched Bodycon Sleeveless",
      "price": 29.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61GXSrzRjgL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 74.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51RX0pNwDVL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-v-neck-long-sleeve-ruched",
      "title": "Womens Maxi Dress V Neck Long Sleeve Ruched",
      "price": 35.9,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/61U3G0X5KOL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-off-shoulder-long-sleeve",
      "title": "Womens Maxi Dress Off Shoulder Long Sleeve",
      "price": 54.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71Ij3RfAevL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-mermaid-off-shoulder-evening-maxi-formal-bodycon",
      "title": "Womens Maxi Dress Mermaid Off Shoulder Evening Maxi Formal Bodycon",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71pUTmVdOjL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-one-shoulder-evening-formal",
      "title": "Womens Maxi Dress One Shoulder Evening Formal",
      "price": 74.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61c-8Xfw+kL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-short-sleeve",
      "title": "Womens Maxi Dress Maxi Short Sleeve",
      "price": 19.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51ww9izCuIL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-v-neck-evening",
      "title": "Womens Maxi Dress V Neck Evening",
      "price": 88.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51uJG32UaoL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-ruched-long-sleeve",
      "title": "Womens Maxi Dress Maxi Ruched Long Sleeve",
      "price": 44.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61X8e51a0bL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-long-sleeve",
      "title": "Womens Maxi Dress Bodycon Long Sleeve",
      "price": 35.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71sEzHZFs6L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-sleeveless-bodycon",
      "title": "Womens Dress Sleeveless Bodycon",
      "price": 29.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/71ZyZt+SGML._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-evening-mermaid-formal-one-shoulder",
      "title": "Womens Maxi Dress Maxi Evening Mermaid Formal One Shoulder",
      "price": 72.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51+4CGpYBtL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail",
      "title": "Womens Dress Cocktail",
      "price": 55.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71lQNHvgTIL._SL1500_.jpg"
      ]
    }
  ]
}