{
  "id": "womens-dress",
  "handle": "womens-dress",
  "sku": "JC1641",
  "asin": "B0DB7ZVT35",
  "title": "Womens Dress",
  "title_original": "Hooever Women's Corduroy Overall Dress Round Neck A Line Skirtall Jumper Mini Dress Pinafore with Pockets",
  "brand": "Visit the Hooever Store",
  "price": 27.99,
  "social_proof": {
    "bought_past_month": 781,
    "text": "781+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/81Ih6Xzd7QL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71aeKUiGMgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81RIpK-+qpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/812FzsA5QUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81NhVjbOMoL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81fZ3gjNzDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81dDmfwQrWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81ZFWgpbPFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71vfkwVWF4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81espM4ttdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81Fp1ug1DFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71snhD1fpCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81-AwRqEuVL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81u9d3qQuYL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/81Ih6Xzd7QL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71aeKUiGMgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81RIpK-+qpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/812FzsA5QUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81NhVjbOMoL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81fZ3gjNzDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81dDmfwQrWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81ZFWgpbPFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71vfkwVWF4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81espM4ttdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81Fp1ug1DFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71snhD1fpCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81-AwRqEuVL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81u9d3qQuYL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ July 26, 2024",
    "ASIN ‏": "‎ B0DB7T7XSK",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#8,865 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #43 in Women's Casual Dresses",
    "Customer Reviews": "4.0 4.0 out of 5 stars (568)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Darkgreen",
      "Winered",
      "Brown",
      "Khaki",
      "Pink",
      "Purple",
      "Black",
      "Darkgrey",
      "Dustyblue"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.0,
    "count": 568,
    "customers_say": "Customers find the dress cute, comfortable, and well-made, with great material quality and thickness. They appreciate its fit, noting it hits right above the knee, and consider it perfect for fall and winter wear, with one customer mentioning it pairs well with a fitted tee or tank. The sizing receives mixed feedback - while some find it true to size, others report it runs big and is not suitable for petite customers. Select to learn more Cute Quality Fit Material quality Comfort Fall/winter Size Length 95 customers mention \"Cute\" 93 positive 2 negative Customers find the dress cute, with one mentioning it looks good with boots and another noting it has a designer-like appearance for less money. \"Perfect fit and super cute ! Very flattering as the cut was more fitted in the waist. Other similar style dresses are soo baggy and make you look big....\" Read more \"...It’s the perfect fall outfit — soft, cute , and easy to style with boots, tights, or a simple undershirt. I will say it runs a bit big....\" Read more \"LOOOOVE!! So cute and flattering! I am 5’6 and 135 pounds and the small fits great! Not too baggy but loose fitting. Length is perfect!...\" Read more \" Very cute . However the low back makes it so the straps wouldn’t stay in place for me. Length and color are right\" Read more 55 customers mention \"Quality\" 53 positive 2 negative Customers find the dress to be of good quality, with one customer noting it is very well sewn. \"...I am wearing the size small in the video. Great quality , soft, and comfortable. I washed it and air dried it after and it did not shrink or anything....\" Read more \"Fits great, good quality . Tops fit between L/XL and the large was perfect and not snug in the chest/shoulders area. Color exactly as shown.\" Read more \" Great dress . Fits true to size.\" Read more \"...The corduroy material is soft and well made . I love that this dress is a designer look alike for less. I highly recommend!\" Read more 47 customers mention \"Fit\" 33 positive 14 negative Customers like how the dress fits, noting that it hits right above the knee, and one customer mentions it pairs well with a fitted tee or tank. \" Great fit and very cute. Material not too heavy.\" Read more \" Fits great , good quality. Tops fit between L/XL and the large was perfect and not snug in the chest/shoulders area. Color exactly as shown.\" Read more \"...I didnt want to wear with leggings and now it barely covers my bottom . I'm only 5'4. I won't be wearing this.\" Read more \" Fits well and is flattering on! Very comfortable and received lots of compliments!\" Read more 45 customers mention \"Material quality\" 38 positive 7 negative Customers like the material of the dress, noting its great thickness and good quality, with one customer mentioning it's suitable for fall without being too thin. \"...They have no stretch but they do run “bigger” the material is thick and a good quality. I’ve paired with the floral top and with solid tops as well.\" Read more \"...Made for someone without buddocks. Great material and style, just too short.\" Read more \"REALLY decent quality for the price. Nice and thick , hangs nicely, I'm 5'2 and in the 160ish range and ordered a medium. Fits perfectly!\" Read more \"...I can happily say this was not only comfortable, the fabric was great quality , and I ended up wearing them for my engagement photos...\" Read more 28 customers mention \"Comfort\" 25 positive 3 negative Customers find the dress comfortable. \"...I am wearing the size small in the video. Great quality, soft, and comfortable . I washed it and air dried it after and it did not shrink or anything....\" Read more \"Absolutely Love This Dress – Stylish, Comfy & Flattering! I’m obsessed with this dress!...\" Read more \"...I have a large chest and wide hips and I felt very comfortable in it. I wouldn’t recommend this for taller girls.\" Read more \"Love the dress, does run big. Wearing an xs usually use size 2-4. Super comfy . Great for the winter. Love the pockets, definitely fits phones.\" Read more 21 customers mention \"Fall/winter\" 21 positive 0 negative Customers find this dress perfect for fall and winter, particularly noting its suitability for holiday events and friendsgiving gatherings. \"This is the perfect fall dress . The shape and style can be worn casually or dressed up with tights and boots.\" Read more \"I love it - it’s perfect for fall - can dress it up a bit with cute booties and a cardigan....\" Read more \"...This is seriously the perfect dress for casual or slightly dressy wear too. I’m in love!\" Read more \"Bought this on a whim and I'm SO glad I did! It was the perfect dress for family photos . Great quality and the fabric is nice and thick....\" Read more 81 customers mention \"Size\" 36 positive 45 negative Customers have mixed experiences with the dress's sizing, with some finding it true to size while others report it runs big and is way off. \" Runs big … but I love it so much I ordered it in the right size. My friend liked this one so instead of returning it, I gave it to her....\" Read more \"...It's so cute and you can dress it up or wear it casual. It's true to size . Washes well without shrinking.\" Read more \"...It did shrink a bit after I washed it, but I was glad because it was too big when I first tried it on and almost returned it....\" Read more \"Cutest dress that fits true to size ! Love corduroy and pockets!! Material is sturdy and feels like good quality!\" Read more 54 customers mention \"Length\" 27 positive 27 negative Customers have mixed opinions about the dress's length, with some finding it great while others say it's too short for their liking, particularly noting it's not suitable for tall women. \"...It is a thick and breathable. It has a good fit in the hips and good length . It doesn’t have much stretch to it but that goes with the look....\" Read more \"I love everything about this jumper, except that it is too short . If you bend over, expect to expose yourself. Made for someone without buddocks....\" Read more \"... perfect length ! The material was not too thick. Very comfortable. You can dress it up, or go for the more casual look .\" Read more \"This dress is super cute but very stiff and short . I kept it but will have to wear leggings under it (I'm 5'10\" and ordered a large)\" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Adorable dress bought in two colors!",
        "body": "I love this little corduroy dress so much that I ended up buying it in both the camel and the purple. It’s the perfect fall outfit — soft, cute, and easy to style with boots, tights, or a simple undershirt. I will say it runs a bit big. I’m 5’3”, normally a 0 in pants and a small/XS in tops, and the XS was perfect with the intended oversized fit. If you’re taller, it may run a little short, but for anyone 5’5” and under the length is great. Such a good staple piece for the price. Highly recommend! Read more",
        "author": "Lauren",
        "rating": 5.0,
        "date": "December 3, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71P+NaEFMvL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Great fit!",
        "body": "Perfect fit and super cute! Very flattering as the cut was more fitted in the waist. Other similar style dresses are soo baggy and make you look big. The fabric was good quality, as well as the length. Wore it to Thanksgiving with a fitted white turtleneck underneath. Read more",
        "author": "Nicole",
        "rating": 5.0,
        "date": "December 21, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Great for shorter curvy girls",
        "body": "This dress was super cute for a fall night out and I got it for our family Christmas pictures. I wore a lace long sleeve under and it was great and looked so cute. I will say it will shrink if you dry it (I did on accident) and now it’s soo short. Totally my fault. Also the material does get a weird wrinkle to it but it didn’t bother me too much. It’s flattering for curvy girls. I have a large chest and wide hips and I felt very comfortable in it. I wouldn’t recommend this for taller girls. Read more",
        "author": "Allysa",
        "rating": 4.0,
        "date": "December 8, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71pA-b31O5L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "3.0 out of 5 stars Do not put in dryer",
        "body": "Dress is fine, but shrinks a lot! Sized down to give more shape, but after mistakenly tossing it in the dryer, I’m trapped wrapped in a blanket at my desk today. Read more",
        "author": "Samantha Griffin",
        "rating": 3.0,
        "date": "December 9, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars perfect for the holiday.",
        "body": "The media could not be loaded. super cute! I got a size S and the color was like a fern Christmas tree (dark like the picture). Length was prefect, glad I didnt get an xs. Quality is good and thick shape is puffy and not tight. I would recommend. Read more",
        "author": "Tenabrie Custer",
        "rating": 5.0,
        "date": "December 6, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Cute cute cute",
        "body": "This was the perfect dress for my family pictures this fall! It’s true to color and the brown was my favorite! I typically buy a M but after reading other reviews the item does rub large so I got a small and I probably could have gotten an xs if I wanted a different figure, the small was loose but cute! Read more",
        "author": "Alexa Stewart",
        "rating": 5.0,
        "date": "December 11, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Great winter dress",
        "body": "Love the dress, does run big. Wearing an xs usually use size 2-4. Super comfy. Great for the winter. Love the pockets, definitely fits phones. Read more",
        "author": "Helen Martinez",
        "rating": 5.0,
        "date": "November 29, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71U7W+twl+L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "4.0 out of 5 stars Great Fall Dress",
        "body": "I ordered the dress in size Large. For reference, I’m 5’4”, 195 lbs, and wear a 38 DDD. The dress itself is really cute and hits about 2” above my knees, which is a nice length on me. However, it was too tight in the bust area, so I’d recommend sizing up if you’re larger in the chest. The corduroy fabric and style are great overall but keep fit in mind when choosing your size. I’ll be returning the Large and reordering in an XL. Read more",
        "author": "Haley Noland",
        "rating": 4.0,
        "date": "September 6, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Dress is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.",
  "about_this_item": "Womens Dress is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.",
  "long_description": "Womens Dress is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Darkgreen, Winered, Brown, Khaki, Pink, Purple, Black, Darkgrey, Dustyblue. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Dress is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Darkgreen, Winered, Brown, Khaki, Pink, Purple, Black, Darkgrey, Dustyblue. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "f8720766-9988-43d9-a166-02f82a4dd244",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f8720766-9988-43d9-a166-02f82a4dd244/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f8720766-9988-43d9-a166-02f82a4dd244/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/d660e088-e1a2-40d4-b384-04c781a83e8b.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "eaac1a77-6fdd-49a2-8b3d-b20ccce80f2b",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/eaac1a77-6fdd-49a2-8b3d-b20ccce80f2b/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/eaac1a77-6fdd-49a2-8b3d-b20ccce80f2b/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/d660e088-e1a2-40d4-b384-04c781a83e8b.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "bd750c8e-2936-44f0-8c8f-37efe7b18ad8",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bd750c8e-2936-44f0-8c8f-37efe7b18ad8/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bd750c8e-2936-44f0-8c8f-37efe7b18ad8/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/d660e088-e1a2-40d4-b384-04c781a83e8b.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "4a63d569-a968-434d-b14d-d0fb50275ccc",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4a63d569-a968-434d-b14d-d0fb50275ccc/embedded.cc.default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4a63d569-a968-434d-b14d-d0fb50275ccc/embedded.cc.default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/d660e088-e1a2-40d4-b384-04c781a83e8b.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "8175d350-a52b-4035-a80b-46c13468c4d0",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8175d350-a52b-4035-a80b-46c13468c4d0/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8175d350-a52b-4035-a80b-46c13468c4d0/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/d660e088-e1a2-40d4-b384-04c781a83e8b.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "4c6d424a-9f93-4a51-901c-d3b9654b7e13",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4c6d424a-9f93-4a51-901c-d3b9654b7e13/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4c6d424a-9f93-4a51-901c-d3b9654b7e13/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/d660e088-e1a2-40d4-b384-04c781a83e8b.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "287a7e60-cfce-4177-b05e-2e3d39c139fc",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/287a7e60-cfce-4177-b05e-2e3d39c139fc/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/287a7e60-cfce-4177-b05e-2e3d39c139fc/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/d660e088-e1a2-40d4-b384-04c781a83e8b.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "2d4fcf9b-cd3c-4776-8d1f-f46d28b9ac07",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2d4fcf9b-cd3c-4776-8d1f-f46d28b9ac07/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2d4fcf9b-cd3c-4776-8d1f-f46d28b9ac07/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/d660e088-e1a2-40d4-b384-04c781a83e8b.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "f7b1ef25-f6bb-412a-b994-238bbc2c9192",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f7b1ef25-f6bb-412a-b994-238bbc2c9192/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f7b1ef25-f6bb-412a-b994-238bbc2c9192/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/d660e088-e1a2-40d4-b384-04c781a83e8b.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "cc54e0cd-45e4-4233-9b4c-076a2ca6eb62",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/cc54e0cd-45e4-4233-9b4c-076a2ca6eb62/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/cc54e0cd-45e4-4233-9b4c-076a2ca6eb62/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/d660e088-e1a2-40d4-b384-04c781a83e8b.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "3e2356ad-fcb0-4de3-ba62-67e60ddbdd23",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3e2356ad-fcb0-4de3-ba62-67e60ddbdd23/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3e2356ad-fcb0-4de3-ba62-67e60ddbdd23/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/d660e088-e1a2-40d4-b384-04c781a83e8b.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "0aea720d-e965-4ba5-9a8b-9ea1afe835bb",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0aea720d-e965-4ba5-9a8b-9ea1afe835bb/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0aea720d-e965-4ba5-9a8b-9ea1afe835bb/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/d660e088-e1a2-40d4-b384-04c781a83e8b.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Darkgreen": "https://m.media-amazon.com/images/I/41iLZhia3DL._AC_SR38,50_.jpg",
    "Winered": "https://m.media-amazon.com/images/I/41VopzTcraL._AC_SR38,50_.jpg",
    "Brown": "https://m.media-amazon.com/images/I/41Y0BfZGvzL._AC_SR38,50_.jpg",
    "Khaki": "https://m.media-amazon.com/images/I/412FYBzUWiL._AC_SR38,50_.jpg",
    "Pink": "https://m.media-amazon.com/images/I/41wnyyrpo4L._AC_SR38,50_.jpg",
    "Purple": "https://m.media-amazon.com/images/I/41NdHDl+YTL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/41n8usPXR8L._AC_SR38,50_.jpg",
    "Darkgrey": "https://m.media-amazon.com/images/I/41mw3OBUcpL._AC_SR38,50_.jpg",
    "Dustyblue": "https://m.media-amazon.com/images/I/41nChzEW0lL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Darkgreen": "81Ih6Xzd7QL",
    "Winered": "81dDmfwQrWL",
    "Brown": "81ZFWgpbPFL",
    "Khaki": "71vfkwVWF4L",
    "Pink": "81espM4ttdL",
    "Purple": "81Fp1ug1DFL",
    "Black": "71snhD1fpCL",
    "Darkgrey": "81-AwRqEuVL",
    "Dustyblue": "81u9d3qQuYL"
  },
  "color_images": {
    "Darkgreen": [
      "https://m.media-amazon.com/images/I/81Ih6Xzd7QL._SL1500_.jpg"
    ],
    "Winered": [
      "https://m.media-amazon.com/images/I/81dDmfwQrWL._SL1500_.jpg"
    ],
    "Brown": [
      "https://m.media-amazon.com/images/I/81ZFWgpbPFL._SL1500_.jpg"
    ],
    "Khaki": [
      "https://m.media-amazon.com/images/I/71vfkwVWF4L._SL1500_.jpg"
    ],
    "Pink": [
      "https://m.media-amazon.com/images/I/81espM4ttdL._SL1500_.jpg"
    ],
    "Purple": [
      "https://m.media-amazon.com/images/I/81Fp1ug1DFL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/71snhD1fpCL._SL1500_.jpg"
    ],
    "Darkgrey": [
      "https://m.media-amazon.com/images/I/81-AwRqEuVL._SL1500_.jpg"
    ],
    "Dustyblue": [
      "https://m.media-amazon.com/images/I/81u9d3qQuYL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-sleeveless-maxi",
      "title": "Womens Maxi Dress Sleeveless Maxi",
      "price": 48.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71qwUjryGiL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 43.69,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61-pFN+nfgL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-bodycon",
      "title": "Womens Maxi Dress Maxi Bodycon",
      "price": 36.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61o6MKJoZLL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-one-shoulder-formal-mermaid-bodycon-evening-maxi",
      "title": "Womens Maxi Dress One Shoulder Formal Mermaid Bodycon Evening Maxi",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71mgUBuGwhL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-v-neck-short-sleeve",
      "title": "Womens Dress V Neck Short Sleeve",
      "price": 34.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71T+iJeFITL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress-cocktail-ruched-evening-split",
      "title": "Womens Dress Cocktail Ruched Evening Split",
      "price": 29.69,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/61003bnFhAS._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-maxi",
      "title": "Womens Maxi Dress Formal Maxi",
      "price": 64.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/61RWPo72AmL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-mermaid-one-shoulder",
      "title": "Womens Maxi Dress Mermaid One Shoulder",
      "price": 238.74,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51lR3NNtXCL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-maxi-formal-long-sleeve-v-neck",
      "title": "Womens Maxi Dress Cocktail Maxi Formal Long Sleeve V Neck",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61cfJoIR5bL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-bodycon-ruched",
      "title": "Womens Maxi Dress Cocktail Bodycon Ruched",
      "price": 49.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51+rVhgLHSL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-formal",
      "title": "Womens Dress Formal",
      "price": 75.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51TVxkZ3J2L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening",
      "title": "Womens Maxi Dress Formal Evening",
      "price": 64.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/516ScMrYzlL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-ruched-bodycon-v-neck",
      "title": "Womens Maxi Dress Long Sleeve Ruched Bodycon V Neck",
      "price": 33.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51AvldIvTmL._SL1500_.jpg"
      ]
    }
  ]
}