{
  "id": "womens-dress",
  "handle": "womens-dress",
  "sku": "JC1885",
  "asin": "B0DBHRTMZS",
  "title": "Womens Dress",
  "title_original": "LuFeng Women's Square Neck Cap Sleeve Fully Lined Mini Dress Zipper A Line Party Club Dresses",
  "brand": "Visit the LuFeng Store",
  "price": 48.99,
  "social_proof": {
    "bought_past_month": 820,
    "text": "820+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/61W1l5DXSdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/613MatQ+UoL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71c3OEq7fjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71afU5M5orL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61gXcRFxWJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/618Cv79Q0pL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51DbWeRniZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61UHbWV58-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61EYc-i4iXL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/61W1l5DXSdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/613MatQ+UoL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71c3OEq7fjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71afU5M5orL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61gXcRFxWJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/618Cv79Q0pL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51DbWeRniZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61UHbWV58-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61EYc-i4iXL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Date First Available ‏": "‎ July 29, 2024",
    "ASIN ‏": "‎ B0DBHTR2VK",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#51,811 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #270 in Women's Club & Night Out Dresses",
    "Customer Reviews": "4.2 4.2 out of 5 stars (239)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Red",
      "White",
      "Black"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.2,
    "count": 239,
    "customers_say": "Customers find the dress well-made and perfect for night out events, with thick, heavy-duty fabric that's not see-through. They describe it as beautiful and flattering, with one customer noting it shapes well in the right areas. The sizing receives mixed feedback - while some say it's true to size, others find it too small. The dress's stretchiness also gets mixed reviews, with several customers noting there's not enough stretch. Generated from the text of customer reviews Select to learn more Fit (35) Quality (35) Dress quality (33) Material quality (33) Flattering (14) See through (7) Size (26) Stretchiness (8) 35 customers mention fit, 27 positive, 8 negative 35 customers mention \"Fit\" 27 positive 8 negative Customers are satisfied with how the dress fits. \" very cute dress fits true to size , i wore this to my graduation. the material was good its not thin and doesn't feel cheap.... \" Read more \" great fit \" Read more \" It fits perfectly ! I’m 5’3” and 162lbs the large fit perfectly! I love the color. I might get it in black. \" Read more \" ...is 25-26 inches, so I expected a snug fit, but it’s actually loose around the waist .... \" Read more 35 customers mention quality, 33 positive, 2 negative 35 customers mention \"Quality\" 33 positive 2 negative Customers find this dress to be a perfect little black dress for any occasion, describing it as sexy and well-made. \" Great quality , fabric, true to size, not see through, and flattering, but was too short for comfort for me (I am 5’3” but have a very long torso). \" Read more \" ...It hugs my curves amazingly. The material is amazing it’s good quality not too thin and not too thick. \" Read more \" Amazing dress ! Quality is exceptional super thick, (not uncomfortable tho) not see through at all, the length and hourglass shaping is perfect.... \" Read more \" ...This is absolutely the best dress ! It’s flattering in me and it shapes me in the right areas! The quality doesn’t look flimsy or cheap.... \" Read more 33 customers mention dress quality, 32 positive, 1 negative 33 customers mention \"Dress quality\" 32 positive 1 negative Customers find the dress beautiful and well-made, describing it as a perfect little black dress for any occasion, with one customer noting that the fabric looks expensive. \" This is such a beautiful dress . \" Read more \" ...The quality doesn’t look flimsy or cheap. It’s beautiful \" Read more \" ...I want it in black for the perfect little black dress . \" Read more \" Dress is classy and sexy . I got a small I am 5 feet 4 inches 145lbs. Fits perfectly. Good Quality \" Read more 33 customers mention material quality, 30 positive, 3 negative 33 customers mention \"Material quality\" 30 positive 3 negative Customers appreciate the dress's material quality, noting it is made with thick, heavy-duty fabric that is not cheap. \" Great material . Just didn’t fit the zipper was to long punched up in the back. Order a small I’m 4”11” would have kept the dress if it fit. \" Read more \" The dress is really cute and good thick material , however, it is not true to size.... \" Read more \" ... Thick material and comfortable \" Read more \" The material of this dress is thick and feels strong. I love the fit of it as well, I am 5 ft and 170 lbs and found this dress to fit so nicely.... \" Read more 14 customers mention flattering, 14 positive, 0 negative 14 customers mention \"Flattering\" 14 positive 0 negative Customers find the dress flattering, with one mentioning how it shapes the body in the right areas and another noting how it hugs curves amazingly. \" ...The dress is really thick and super flattering . The quality really surprised me, it is really structured and not see through at all.... \" Read more \" ...Beautiful fit, snug but not overly snug, and so so flattering . Would 100% recommend. \" Read more \" True to size, very flattering does have slight chemical smell wash prior to wearing \" Read more \" Great quality, fabric, true to size, not see through, and flattering , but was too short for comfort for me (I am 5’3” but have a very long torso). \" Read more 7 customers mention see through, 7 positive, 0 negative 7 customers mention \"See through\" 7 positive 0 negative Customers appreciate that the dress is not see-through. \" Great quality, fabric, true to size, not see through , and flattering, but was too short for comfort for me (I am 5’3” but have a very long torso). \" Read more \" ...Quality is exceptional super thick, (not uncomfortable tho) not see through at all , the length and hourglass shaping is perfect.... \" Read more \" ...The fabric is nice and lightweight, and not see-through . \" Read more \" ...Very comfortable, a tad short but not too bad. Not see through but I still wore a stick on bra just for extra coverage. \" Read more 26 customers mention size, 9 positive, 17 negative 26 customers mention \"Size\" 9 positive 17 negative Customers have mixed experiences with the dress's sizing, with some finding it true to size and perfect in length, while others report it being too small and running large. \" The dress is really cute and good thick material, however, it is not true to size .... \" Read more \" Great quality, fabric, true to size , not see through, and flattering, but was too short for comfort for me (I am 5’3” but have a very long torso). \" Read more \" Im so confused. XL was TOO BIG..L was too short and small. 185 lbs - 5'5\" - Female - 42 chest 37 in waist a d 45 in hips Great quality.... \" Read more \" ...Also keep in mind that it's very short . Otherwise, I liked the material!... \" Read more 8 customers mention stretchiness, 3 positive, 5 negative 8 customers mention \"Stretchiness\" 3 positive 5 negative Customers have mixed opinions about the dress's stretchiness, with several noting that it lacks elasticity. \" ...The dress is not stretchy but it looks so flattering (besides my mishap). Can't wait to try a larger size. \" Read more \" ...Great price I thought and it came quick. Gorgeous on. Stretches with your body as long as your get the right size for you.... \" Read more \" Dress is flattering. Heavy duty material. No stretch at all so size up. Does have a zipper in the back. Comfortable fitting & light weight. \" Read more \" Runs very small and no stretch . Material was thick and lining was slippery in a way that makes the dress ride up and the lining stick out. \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Great Fit!",
        "body": "Quality and fit was perfect! I ordered it in white and it came in off-white which is fine. But do beware if you need it to be white you will get an off-white. I ordered a large and I’m 5’4 and 170lbs. The breast area is a lil snug but nothing you can’t work with. Definitely recommend. Read more",
        "author": "Raul",
        "rating": 5.0,
        "date": "December 4, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Beautiful Dress for bday dinner",
        "body": "My daughter loves this dress but it's too big. She needs an XS. The material is well made Read more",
        "author": "Tracey A German",
        "rating": 5.0,
        "date": "October 28, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61gefT7DHqL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Amazing dress!",
        "body": "Amazing dress! Quality is exceptional super thick, (not uncomfortable tho) not see through at all, the length and hourglass shaping is perfect. Super flattering, great option for graduation! Read more",
        "author": "Rob B.",
        "rating": 5.0,
        "date": "October 27, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Flattering dress",
        "body": "The dress is beautiful. My only issue is the chest area was too small for me. So I had originally ordered a Medium and will be exchanging for a Large. The dress is not stretchy but it looks so flattering (besides my mishap). Can't wait to try a larger size. Read more",
        "author": "Eveelynn",
        "rating": 4.0,
        "date": "December 10, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Soooo feminine and cute!",
        "body": "I needed a red outfit for a baby shower this past February, and this was the perfect dress! It was true to size. Read more",
        "author": "Franshayla",
        "rating": 5.0,
        "date": "October 24, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/818RjfEacmL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/81apC3F2WtL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "3.0 out of 5 stars Stain",
        "body": "Everything is great the material is good but there was some stain on the dress on back zipper side so I’m returning it. Read more",
        "author": "Sam",
        "rating": 3.0,
        "date": "December 8, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61859nuF4TL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "1.0 out of 5 stars ABSOLUTELY DISGUSTING!!!!!",
        "body": "The dress I received had sweat stains in the underarm area, makeup stains on the front, black marks on the neckline, and other marks all over the OUTSIDE AND INSIDE of the dress which tells me it’s been worn, returned, and then resold. SO SO GROSS!!! I ordered this dress originally in a size XL because some reviews said it ran small. The XL was HUGE on me, so I ordered a L. The shipping for both items was quick and easy and both arrived a day before it was supposed to (the only positive). Read more",
        "author": "taya",
        "rating": 1.0,
        "date": "December 10, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61vblcXSYKL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/61+eHBDwepL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/61SfTvrnK8L._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/61fjmFfBulL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/61WSoTuBDBL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/719EsOapmFL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars So flattering",
        "body": "I wore this for my college graduation and got plenty of compliments. The fit was surprisingly accurate, I got a small and am around 135 lbs and 5'4. Great price I thought and it came quick. Gorgeous on. Stretches with your body as long as your get the right size for you. Very comfortable, a tad short but not too bad. Not see through but I still wore a stick on bra just for extra coverage. Read more",
        "author": "Devyn",
        "rating": 5.0,
        "date": "July 24, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Dress is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.",
  "about_this_item": "Womens Dress is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.",
  "long_description": "Womens Dress is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Red, White, Black. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Dress is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Red, White, Black. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "16513b4d-455f-4aa4-a195-1f804852f45f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/16513b4d-455f-4aa4-a195-1f804852f45f/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/16513b4d-455f-4aa4-a195-1f804852f45f/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "61b48075-2cfb-453d-a364-2288c29ed8b7",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/61b48075-2cfb-453d-a364-2288c29ed8b7/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/61b48075-2cfb-453d-a364-2288c29ed8b7/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Red": "https://m.media-amazon.com/images/I/31baWgyaW0L._AC_SR38,50_.jpg",
    "White": "https://m.media-amazon.com/images/I/31HhaBmgbFL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31lp6RyzHKL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Red": "61UHbWV58-L",
    "White": "61W1l5DXSdL",
    "Black": "61EYc-i4iXL"
  },
  "color_images": {
    "Red": [
      "https://m.media-amazon.com/images/I/61UHbWV58-L._SL1500_.jpg"
    ],
    "White": [
      "https://m.media-amazon.com/images/I/61W1l5DXSdL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/61EYc-i4iXL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-sleeveless-maxi",
      "title": "Womens Maxi Dress Sleeveless Maxi",
      "price": 48.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71qwUjryGiL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 43.69,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61-pFN+nfgL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-bodycon",
      "title": "Womens Maxi Dress Maxi Bodycon",
      "price": 36.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61o6MKJoZLL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-one-shoulder-formal-mermaid-bodycon-evening-maxi",
      "title": "Womens Maxi Dress One Shoulder Formal Mermaid Bodycon Evening Maxi",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71mgUBuGwhL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-v-neck-short-sleeve",
      "title": "Womens Dress V Neck Short Sleeve",
      "price": 34.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71T+iJeFITL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress-cocktail-ruched-evening-split",
      "title": "Womens Dress Cocktail Ruched Evening Split",
      "price": 29.69,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/61003bnFhAS._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-maxi",
      "title": "Womens Maxi Dress Formal Maxi",
      "price": 64.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/61RWPo72AmL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-mermaid-one-shoulder",
      "title": "Womens Maxi Dress Mermaid One Shoulder",
      "price": 238.74,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51lR3NNtXCL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-maxi-formal-long-sleeve-v-neck",
      "title": "Womens Maxi Dress Cocktail Maxi Formal Long Sleeve V Neck",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61cfJoIR5bL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-bodycon-ruched",
      "title": "Womens Maxi Dress Cocktail Bodycon Ruched",
      "price": 49.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51+rVhgLHSL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-formal",
      "title": "Womens Dress Formal",
      "price": 75.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51TVxkZ3J2L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening",
      "title": "Womens Maxi Dress Formal Evening",
      "price": 64.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/516ScMrYzlL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-ruched-bodycon-v-neck",
      "title": "Womens Maxi Dress Long Sleeve Ruched Bodycon V Neck",
      "price": 33.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51AvldIvTmL._SL1500_.jpg"
      ]
    }
  ]
}