{
  "id": "womens-maxi-dress-short-sleeve-maxi",
  "handle": "womens-maxi-dress-short-sleeve-maxi",
  "sku": "JC3143",
  "asin": "B0DCZCYJ32",
  "title": "Womens Maxi Dress Short Sleeve Maxi",
  "title_original": "YMDUCH Women's Casual Short Sleeve Square Neck Solid Slim Flowy Maxi Dress with Pockets",
  "brand": "Visit the YMDUCH Store",
  "price": 47.99,
  "social_proof": {
    "bought_past_month": 341,
    "text": "341+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/61oiPZg7y7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81mdK0STKUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81XdhLdHCML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81Ek8mjZ-sL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81cvCdod+-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/718J8u4ES6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71aZ0HMIzLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61x7NZShcAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81SXDNu58cL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71OClmIHujL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81UovU0OlmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81+tQ8FMQ9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81+hIeOPVHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/813wcVu0x3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51YuhsyoA6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81TVjuiY1aL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81hvMnhPqsL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81A+6EF+yQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91QvuFzbTfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71RhAbHHsZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51eEsJBTt7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/810pzieosHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81iNxkiqVAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/8183FuspwxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81-H8CM2yVL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71LTK9fH0oL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51yLiOaq1sL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81Ga0BpvkyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81Lc3j6tzPL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81Ftg0pMgsL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81OAYRImEgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71aQD4dL2OL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51J6zsuZnTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81HsWZaOUZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81uk82lqAmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81VHN4XJP+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91n6oZF-DsL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71GZ0IaevbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61FilSe-YBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81NMCnFOUAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81EbcTmmyjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81XxJHjOlzL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/814uOcTpNqL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/61oiPZg7y7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81mdK0STKUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81XdhLdHCML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81Ek8mjZ-sL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81cvCdod+-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/718J8u4ES6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71aZ0HMIzLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61x7NZShcAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81SXDNu58cL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71OClmIHujL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81UovU0OlmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81+tQ8FMQ9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81+hIeOPVHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/813wcVu0x3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51YuhsyoA6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81TVjuiY1aL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81hvMnhPqsL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81A+6EF+yQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91QvuFzbTfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71RhAbHHsZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51eEsJBTt7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/810pzieosHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81iNxkiqVAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/8183FuspwxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81-H8CM2yVL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71LTK9fH0oL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51yLiOaq1sL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81Ga0BpvkyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81Lc3j6tzPL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81Ftg0pMgsL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81OAYRImEgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71aQD4dL2OL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51J6zsuZnTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81HsWZaOUZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81uk82lqAmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81VHN4XJP+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91n6oZF-DsL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71GZ0IaevbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61FilSe-YBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81NMCnFOUAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81EbcTmmyjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81XxJHjOlzL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/814uOcTpNqL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Date First Available ‏": "‎ August 13, 2024",
    "ASIN ‏": "‎ B0DCZFC9KC",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#35,637 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #84 in Women's Formal Dresses #333 in Women's Casual Dresses",
    "Customer Reviews": "4.2 4.2 out of 5 stars (328)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Red",
      "Sky Blue",
      "Navy",
      "Pink",
      "Violet",
      "White",
      "Black"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.2,
    "count": 328,
    "customers_say": "Customers find the dress stylish with an instant feminine silhouette, and appreciate its great fit and length. The dress is well-made, comfortable, and flattering, with one customer noting how it hugs the figure in the right places. The fabric quality and material weight receive mixed feedback - while some like the material, others dislike it, and many find it heavy. The pockets are appreciated, though one customer mentions they don't lie flat. Generated from the text of customer reviews Select to learn more Style (52) Fit (48) Quality (40) Comfort (25) Flattering (24) Fabric quality (38) Material weight (32) Pockets (32) 52 customers mention style, 45 positive, 7 negative 52 customers mention \"Style\" 45 positive 7 negative Customers find the dress stylish, with an instant feminine silhouette and put-together appearance, and one customer particularly appreciates the corset detail in the back. \" This dress is so beautiful and flattering. I love that the fabric is double lined and heavier. It helps with shaping and contouring the waistline. \" Read more \" Beautiful dress with perfect fit and excellent quality. However, the color is not as expected.... \" Read more \" ...I love the material. It is very flattering and elegant . It is very thick as you can see and comfortable. Comes with stretch but not too much,l. \" Read more \" Cute dress \" Read more 48 customers mention fit, 38 positive, 10 negative 48 customers mention \"Fit\" 38 positive 10 negative Customers are satisfied with how the dress fits, particularly noting its great length, and one customer mentions that the drawstrings in the back help with the overall fit. \" Was great purchase! Fits well and is very stretchy and breathable. The style is perfect match to the pictures that were on the item. \" Read more \" Beautiful dress with perfect fit and excellent quality. However, the color is not as expected.... \" Read more \" ...This is so well made fits great . These drawings in the back help with the overall fit. I have broad shoulders/athletic shape and this was perfect.... \" Read more \" The fabric is nice and thick but the dress is too high waisted and not remotely as long as pictured. I am 5’ 7” and the dress hit right below my knees \" Read more 40 customers mention quality, 38 positive, 2 negative 40 customers mention \"Quality\" 38 positive 2 negative Customers find the dress to be well-made and fantastic, with one customer specifically praising the corset back design. \" Absolutely love this dress. Great quality and fit. Very flattering and comfortable. \" Read more \" Overall Great Dress but not true to colour... \" Read more \" This dress is amazing ! I feel like a princess in it. It has a stretchy material and is very thick with multiple layers. Not a see through white.... \" Read more \" This is a very nice dress ! the material is stretchy and breathable and i love the pockets.... \" Read more 25 customers mention comfort, 25 positive, 0 negative 25 customers mention \"Comfort\" 25 positive 0 negative Customers find the dress comfortable, with one mentioning it is very stretchy. \" ...Disappointing on that point. Good fit. Comfortable . Stretchy. Moves with you. Holds shape. Nice flow. Easy care. Love the square neckline.... \" Read more \" Picked this form my daughters orchestra dress. Fit well and is very comfortable . \" Read more \" ...Material is a thicker and heavier material but extremely comfortable . Feels like you are wearing pajamas.... \" Read more \" The softest and most comfortable dress I’ve ever wore. I love how it holds you in and love that it is lined A+++++++ \" Read more 24 customers mention flattering, 24 positive, 0 negative 24 customers mention \"Flattering\" 24 positive 0 negative Customers find the dress flattering, with individual reviews noting how it accentuates cleavage, hugs curves in the right places, and covers armpit fat. \" ...It wasn’t heavy. It was very flowing. The fabric was very soft very flattering for me as well. It has a really good stretch and I love the pockets.... \" Read more \" ...The fit is great and it’s so flattering . Could definitely be dressed up or down. Fits true to my size. Would definitely order in more colors! \" Read more \" ...I love the material. It is very flattering and elegant. It is very thick as you can see and comfortable. Comes with stretch but not too much,l. \" Read more \" Such a flattering dress ! Will recommended to anyone! So elegant too! \" Read more 38 customers mention fabric quality, 22 positive, 16 negative 38 customers mention \"Fabric quality\" 22 positive 16 negative Customers have mixed opinions about the fabric of the dress, with some finding it good and thick, while others express dissatisfaction with it. \" ...Perfect for work, wedding guest, baby shower. Very versatile, fabric is great . Bought it in red \" Read more \" ...It's like swimsuit material . Very shiny and cheap looking.... \" Read more \" The fabric is nice and thick but the dress is too high waisted and not remotely as long as pictured. I am 5’ 7” and the dress hit right below my knees \" Read more \" Fabric is horrible , shiny and looks extremely cheap. Fits nothing like the photo. The extra large size is more like a large. \" Read more 32 customers mention material weight, 17 positive, 15 negative 32 customers mention \"Material weight\" 17 positive 15 negative Customers have mixed opinions about the dress's material weight, with several finding it heavy. \" Comfortable lightweight dress during the hot summer! Looks put together even though the material wears like sports clothes.... \" Read more \" Product is thick and heavy it’s like swimsuit material Super stretchy not very breathable it is double lined definitely worth the money though... \" Read more \" ...The fabric has a nice weight to it, feels high-quality, and moves beautifully.... \" Read more \" Flattering but heavy material ... \" Read more 32 customers mention pockets, 22 positive, 10 negative 32 customers mention \"Pockets\" 22 positive 10 negative Customers have mixed opinions about the dress's pockets, with some loving them and noting they are positioned right on the hips, while others report issues with them not lying flat. \" ...up all my armpit fat and rolls and cellulite amazingly, plus it has pockets ! it’s super flattering and nice fabric quality i am honestly shocked.... \" Read more \" ...Feels like you are wearing pajamas. Has pockets and a very complimentary neck line. I am planning on buying multiple colors. Great value.... \" Read more \" I am 5'4\". The pockets stick out a little bit and they sat right where my \"love handles\" would be so it looked quite odd.... \" Read more \" ...the material is stretchy and breathable and i love the pockets . the only thing is the white is not a pure white and more off white. \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Confidence in a dress",
        "body": "Flattering: This red dress is stunning. The fit is incredibly flattering—cinches the waist just right and flows in all the right places. It instantly made me feel more confident the second I put it on. It’s the kind of dress that makes you want to twirl in front of the mirror. The fabric has a nice weight to it, feels high-quality, and moves beautifully. Whether you’re dressing it up for a night out or wearing it with flats for a more casual vibe, it’s the perfect showstopper. Highly recommend if you want a dress that makes a statement without trying too hard. I got it in red and wow it is beautiful! Read more",
        "author": "kjs",
        "rating": 5.0,
        "date": "July 3, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Instant feminine silhouette",
        "body": "I often refer to my body type as \"The Fridge\". No matter my weight, I don't go in in the middle very much. But this dress give me such a feminine silhouette! The fabric is nice and heavy, and it drapes very well. It's true that the fabric feels a lot like a swimsuit, but I think that helps it with its sturdiness. As a mom, I feel like I don't have to worry about my kids pulling on this one. And the pockets are so deep! It's pretty versatile. It can be dressed up or down. I've already worn this to a casual Oktoberfest celebration, with a short-sleeved button-down shirt and flip-flops to dress it down. And I'll definitely wear this to date night, too! This dress has great value for what it costs, since I'll wear it to so many occasions. Read more",
        "author": "Dinah Sawyer",
        "rating": 5.0,
        "date": "October 19, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Simply in Love",
        "body": "This dress is amazing! I feel like a princess in it. It has a stretchy material and is very thick with multiple layers. Not a see through white. My one minor call out would be that the outline of the pockets can be seen through the outer layer of the dress. Does not turn me off to it though. It is still so elegant and beautiful. Because of the stretch material it would look great on varying figures as it is very form fitting. Read more",
        "author": "Melody",
        "rating": 5.0,
        "date": "June 13, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71lTx2DRqfL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "4.0 out of 5 stars pretty dress! not a great shade of red for me, personally.",
        "body": "this is a really flattering dress silhouette and comfortable material and pretty well made for the price point, but this shade of red was Way too bright for me. like, a child's toy or brighter than christmas-red bright. maybe i'll order a different color in the future... Read more",
        "author": "J",
        "rating": 4.0,
        "date": "December 13, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Thick and great fit",
        "body": "This is so nice. It’s double lined with a thick material. Kind of feels like swim suit material but thicker. The fit is great and it’s so flattering. Could definitely be dressed up or down. Fits true to my size. Would definitely order in more colors! Read more",
        "author": "Mike",
        "rating": 5.0,
        "date": "November 27, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "1.0 out of 5 stars Very Disappointed – Received a Used Dress",
        "body": "I was really looking forward to wearing this dress for a wedding on Saturday, October 18th, but I was extremely disappointed when I opened my package. The dress had clearly been used there were deodorant stains under the armpits, it smelled like smoke, and the tag had already been ripped off. The packaging bag was also torn, which made the experience even more disappointing. I’ve ordered from this brand before and had a great experience my previous dress arrived in perfect condition, with the tag intact. However, this time was very upsetting. I’m not sure if I’ll be ordering from this brand again after this experience. Read more",
        "author": "Customer",
        "rating": 1.0,
        "date": "October 16, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71SYd3yt7GL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/612TYO7bO1L._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71yTeNjZU6L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "3.0 out of 5 stars pocket dress",
        "body": "ok I love the fit of the dress . its a nice dress and looks good on you buttttttttt the dress is very heavy and its polyester Read more",
        "author": "Mrs.Rivera",
        "rating": 3.0,
        "date": "May 27, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Love the V Waistline",
        "body": "Perfect dress. Stretchy material so I sized down. I bought in a few colors. Had some altered shorter for summer and kept some long for boots. Just my preference. The v waistline is very flattering and the pockets are deep. Fabric weight is not too thick, but not see through either. Read more",
        "author": "WatchCA01",
        "rating": 5.0,
        "date": "November 16, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Short Sleeve Maxi is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.",
  "about_this_item": "Womens Maxi Dress Short Sleeve Maxi is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.",
  "long_description": "Womens Maxi Dress Short Sleeve Maxi is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Red, Sky Blue, Navy, Pink, Violet, White, Black. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Short Sleeve Maxi is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Red, Sky Blue, Navy, Pink, Violet, White, Black. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "3d3b127c-db50-4992-bb8c-76096cfc8774",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3d3b127c-db50-4992-bb8c-76096cfc8774/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3d3b127c-db50-4992-bb8c-76096cfc8774/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/d91d0d6a-3361-4a08-8db3-bb5604dd06eb.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "5ae10b2a-07e7-4e08-a7b1-9e8dc9dcfc11",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5ae10b2a-07e7-4e08-a7b1-9e8dc9dcfc11/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5ae10b2a-07e7-4e08-a7b1-9e8dc9dcfc11/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/d91d0d6a-3361-4a08-8db3-bb5604dd06eb.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "fe660074-0c9d-4dc6-8bef-9c3edbbfa988",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/fe660074-0c9d-4dc6-8bef-9c3edbbfa988/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/fe660074-0c9d-4dc6-8bef-9c3edbbfa988/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/d91d0d6a-3361-4a08-8db3-bb5604dd06eb.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "81bf90c2-d716-4cba-9e99-b8d778f2359b",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/81bf90c2-d716-4cba-9e99-b8d778f2359b/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/81bf90c2-d716-4cba-9e99-b8d778f2359b/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/d91d0d6a-3361-4a08-8db3-bb5604dd06eb.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "93b4e53a-d4b4-4a46-ada9-9bfda00a7261",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/93b4e53a-d4b4-4a46-ada9-9bfda00a7261/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/93b4e53a-d4b4-4a46-ada9-9bfda00a7261/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/d91d0d6a-3361-4a08-8db3-bb5604dd06eb.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "4d16a45e-94a8-4129-997f-eeab76d55771",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4d16a45e-94a8-4129-997f-eeab76d55771/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4d16a45e-94a8-4129-997f-eeab76d55771/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/d91d0d6a-3361-4a08-8db3-bb5604dd06eb.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Red": "https://m.media-amazon.com/images/I/313RPG5r+lL._AC_SR38,50_.jpg",
    "Sky Blue": "https://m.media-amazon.com/images/I/31AmYn4WgGL._AC_SR38,50_.jpg",
    "Navy": "https://m.media-amazon.com/images/I/31ADdc-sqpL._AC_SR38,50_.jpg",
    "Pink": "https://m.media-amazon.com/images/I/31LBy9gi16L._AC_SR38,50_.jpg",
    "Violet": "https://m.media-amazon.com/images/I/31YyC1KXutL._AC_SR38,50_.jpg",
    "White": "https://m.media-amazon.com/images/I/31EeobkP4EL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31xFPKthGiL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Red": "61x7NZShcAL",
    "Sky Blue": "51YuhsyoA6L",
    "Navy": "51eEsJBTt7L",
    "Pink": "51yLiOaq1sL",
    "Violet": "51J6zsuZnTL",
    "White": "61FilSe-YBL",
    "Black": "61oiPZg7y7L"
  },
  "color_images": {
    "Red": [
      "https://m.media-amazon.com/images/I/61x7NZShcAL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81SXDNu58cL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71OClmIHujL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81UovU0OlmL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81+tQ8FMQ9L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81+hIeOPVHL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/813wcVu0x3L._SL1500_.jpg"
    ],
    "Sky Blue": [
      "https://m.media-amazon.com/images/I/51YuhsyoA6L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81TVjuiY1aL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81hvMnhPqsL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81A+6EF+yQL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/91QvuFzbTfL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71RhAbHHsZL._SL1500_.jpg"
    ],
    "Navy": [
      "https://m.media-amazon.com/images/I/51eEsJBTt7L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/810pzieosHL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81iNxkiqVAL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/8183FuspwxL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81-H8CM2yVL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71LTK9fH0oL._SL1500_.jpg"
    ],
    "Pink": [
      "https://m.media-amazon.com/images/I/51yLiOaq1sL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81Ga0BpvkyL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81Lc3j6tzPL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81Ftg0pMgsL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81OAYRImEgL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71aQD4dL2OL._SL1500_.jpg"
    ],
    "Violet": [
      "https://m.media-amazon.com/images/I/51J6zsuZnTL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81HsWZaOUZL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81uk82lqAmL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81VHN4XJP+L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/91n6oZF-DsL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71GZ0IaevbL._SL1500_.jpg"
    ],
    "White": [
      "https://m.media-amazon.com/images/I/61FilSe-YBL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81NMCnFOUAL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81EbcTmmyjL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81XxJHjOlzL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/814uOcTpNqL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/61oiPZg7y7L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81mdK0STKUL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81XdhLdHCML._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81Ek8mjZ-sL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81cvCdod+-L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/718J8u4ES6L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71aZ0HMIzLL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-evening-formal-short-sleeve-cocktail-v-neck-maxi",
      "title": "Womens Maxi Dress Evening Formal Short Sleeve Cocktail V Neck Maxi",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61AaE2eUMIL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-v-neck-cocktail-short-sleeve",
      "title": "Womens Dress V Neck Cocktail Short Sleeve",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/711HWxZc3XL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-sleeveless-long-sleeve",
      "title": "Womens Maxi Dress Sleeveless Long Sleeve",
      "price": 58.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/815j-UbhFuL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-v-neck-long-sleeve-mermaid",
      "title": "Womens Maxi Dress V Neck Long Sleeve Mermaid",
      "price": 119.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51Is1P26ZtL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-formal-maxi-bodycon",
      "title": "Womens Maxi Dress Cocktail Formal Maxi Bodycon",
      "price": 44.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/51vt49ix1lL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress-sleeveless-ruched-boat-neck",
      "title": "Womens Dress Sleeveless Ruched Boat Neck",
      "price": 24.29,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51iPeZV6KDL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-bodycon-cocktail",
      "title": "Womens Dress Bodycon Cocktail",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61HFhbQgC2L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-short-sleeve",
      "title": "Womens Dress Short Sleeve",
      "price": 36.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71mJpfJK2VL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 63.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/81lblJbx42L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-maxi-cocktail",
      "title": "Womens Maxi Dress Long Sleeve Maxi Cocktail",
      "price": 62.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71u2Xray0mL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-v-neck-long-sleeve-maxi",
      "title": "Womens Maxi Dress V Neck Long Sleeve Maxi",
      "price": 29.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/716Rhy3XMjL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 44.29,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/612i75s-RUL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-mermaid",
      "title": "Womens Dress Mermaid",
      "price": 239.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61lZaNp9s1L._SL1500_.jpg"
      ]
    }
  ]
}