{
  "id": "womens-maxi-dress-off-shoulder-long-sleeve",
  "handle": "womens-maxi-dress-off-shoulder-long-sleeve",
  "sku": "JC2385",
  "asin": "B0DCDS6D82",
  "title": "Womens Maxi Dress Off Shoulder Long Sleeve",
  "title_original": "REORIA Women Off Shoulder Long Sleeve Dress Elegant Sexy Stretch Mesh Double Lined Slim Trendy Long Dresses",
  "brand": "Visit the REORIA Store",
  "price": 46.97,
  "social_proof": {
    "bought_past_month": 1701,
    "text": "1701+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/51VI0diPJEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51PASxb1mAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/715MM+ikSZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71QvYQ+ucDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91s9vGOUuXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61NArAGf0uL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/510zoZnu+HL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51hTgYkFFmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51+A1R39SlL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51geKrottXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/519moN+IA0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/517lxqZyeML._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/51VI0diPJEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51PASxb1mAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/715MM+ikSZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71QvYQ+ucDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91s9vGOUuXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61NArAGf0uL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/510zoZnu+HL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51hTgYkFFmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51+A1R39SlL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51geKrottXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/519moN+IA0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/517lxqZyeML._SL1500_.jpg"
  ],
  "aplus_images": [
    "https://m.media-amazon.com/images/I/417beEv0PTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31w9XuhB9uL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41sW3thFuXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41L5HECZ9HL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/418aDRj4zfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/4135IJAH53L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41S4U1ZB9mL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41G41DmnIbL._SL1500_.jpg"
  ],
  "description_images": [
    "https://m.media-amazon.com/images/I/417beEv0PTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31w9XuhB9uL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41sW3thFuXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41L5HECZ9HL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/418aDRj4zfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/4135IJAH53L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41S4U1ZB9mL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41G41DmnIbL._SL1500_.jpg"
  ],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ August 6, 2024",
    "ASIN ‏": "‎ B0DCBRNQMX",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#26,681 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #49 in Women's Formal Dresses",
    "Customer Reviews": "4.0 4.0 out of 5 stars (198)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Red",
      "Neon Rose Red",
      "Khaki",
      "Deep Blue",
      "Burgundy",
      "Black",
      "Coffee"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.0,
    "count": 198,
    "customers_say": "Customers find the dress stylish, describing it as a pretty figure-hugging design that's sexy without being too revealing, and appreciate its flattering fit that accentuates the hourglass figure. Moreover, the dress receives positive feedback for its quality, comfort, and nice material, with one customer noting it's almost like spandex. However, customers disagree on the sizing, with some finding it perfect while others say it runs small. Additionally, several customers report issues with the shoulders not staying down. Select to learn more Style Quality Flattering Comfort Material quality Fit Size Roll up 36 customers mention \"Style\" 35 positive 1 negative Customers appreciate the dress's style, describing it as chic and figure-hugging, with an off-shoulder design that is sexy without being too revealing. \"...tight, thanks to the stretchy double-layer fabric, giving it an elegant yet comfortable finish....\" Read more \"...It fits like a glove, classy and sexy !\" Read more \"This dress is super cute ! My daughter wore it to homecoming and she looked gorgeous in it! It fit her well and adjusted to her body nicely....\" Read more \"It's cute but the issue is I ordered it for a wedding where I will be holding my small child and the fabric around the chest area raises up and...\" Read more 20 customers mention \"Quality\" 19 positive 1 negative Customers find the dress to be of good quality, describing it as nice and perfect. \"...If you’re looking for a dress that combines style, comfort, and great quality , this one is a total winner. Highly recommended!\" Read more \" Nice dress definitely had to size up a size i am worried the shoulder part won't stay down but we will see\" Read more \"Very cute size is perfect good quality worth the price and comfortable.\" Read more \"...I was pleasantly surprised with how nice and thick the material is....\" Read more 18 customers mention \"Flattering\" 16 positive 2 negative Customers find the dress flattering, with one mentioning it accentuates their hourglass figure and another noting it hides a baby bump nicely. \"...The combination of cut, fabric, and length makes it modern and flattering . Truly a dress that combines style, comfort, and confidence.\" Read more \"...128 lbs (58 kg), and I ordered a size M — the fit is perfect and very flattering . On me it looks exactly like in the photos....\" Read more \"This dress is so flattering , it hugs in all the right places but still looks very elegant....\" Read more \"I love this dress but it came damaged so I had to return. Super flattering .\" Read more 14 customers mention \"Comfort\" 13 positive 1 negative Customers find the dress comfortable, with one mentioning it's not itchy at all. \"...You can feel the quality as soon as you put it on: it’s comfortable , lightweight, and very flattering....\" Read more \" Very comfortable , got a bunch of compliment when wearing this! Will def wear multiple times\" Read more \"Absolutely stunning, and a very comfortable dress . I’m 5’1, 110 pounds & this fits to a TEA!...\" Read more \" Very comfy cute dress , fits wonderfully/very flattering if you have a nice shape....\" Read more 11 customers mention \"Material quality\" 8 positive 3 negative Customers like the material of the dress, with one mentioning it's almost like spandex and another noting it's soft. \"...Great travel dress. Material was very nice . Slip built in.\" Read more \"Got compliments no matter where I went. Material is so soft and almost like a spandex. I’m 3 months pregnant, 5’2” and 130 lbs....\" Read more \"Dress was okay, little snug and kind of cheap material \" Read more \"Great color and good quality fabric very clingy. I would choose a size up unless you like it form fitting.\" Read more 33 customers mention \"Fit\" 23 positive 10 negative Customers have mixed opinions about the dress's fit, with some finding it beautiful while others report it being tight in the shoulders and chest area. \"...It fits beautifully — I’m 5’6” and got a size M, and the length was just right with heels. Perfect choice for weddings or any dressed-up occasion....\" Read more \" Fits like a glove . So flattering and comfortable! I have absolutely no complaints\" Read more \"Runs small, definitely size up. The shoulders are tight and you cannot lift your arms or the top will roll up very easily\" Read more \" Fit well , material was not see through\" Read more 11 customers mention \"Size\" 5 positive 6 negative Customers have mixed opinions about the dress's size, with some finding it perfect while others report it runs small and note that the sizing is incorrect. \"Super cute but size up . Also thin.\" Read more \"Absolutely gorgeous and true to size . My daughter wore this to a fancy grown-up party and she looked stunning. Ignore the old lady next to her....\" Read more \"Very comfy, flattering, and great quality but ran a bit small . I am 5’2” and 130lbs.\" Read more \"...It fit her well and adjusted to her body nicely. The dress is true to size . I purchased a size small. She is 5’3’’ 112 lbs\" Read more 18 customers mention \"Roll up\" 3 positive 15 negative Customers report issues with the dress rolling up, particularly noting that the shoulders don't stay in place. \"...I deducted a star because the shoulders don’t stay down . I’d recommend sewing them down so they don’t annoy you.\" Read more \"The sleeves kept rolling up and just didn’t work if you move with your arms a lot.\" Read more \"...it folds over is a bit awkward because it’s not sewn down so it rises up a lot but otherwise cute. just have to readjust a lot\" Read more \"Amazinnnng dress. Only issue is the shoulder part does ride up when you move your arms a lot. Other than that, beautiful\" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Elegant, sexy, and excellent quality",
        "body": "The media could not be loaded. Elegant, sexy, and excellent quality This REORIA dress is simply beautiful. The off-shoulder design gives it a sexy yet sophisticated touch, and the stretch mesh fabric with double lining fits the body perfectly without being see-through. You can feel the quality as soon as you put it on: it’s comfortable, lightweight, and very flattering. The long sleeves make it ideal for evening events or cooler seasons, and the length is perfect for a modern, elegant look. If you’re looking for a dress that combines style, comfort, and great quality, this one is a total winner. Highly recommended! Read more",
        "author": "Celia Espinosa Ardila",
        "rating": 5.0,
        "date": "November 18, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61+8cMnoXgL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Elegant, Comfortable, and Flattering!",
        "body": "The media could not be loaded. From the very first moment I wore it, this dress made me feel incredibly confident and comfortable. It fits the body perfectly without feeling tight, thanks to the stretchy double-layer fabric, giving it an elegant yet comfortable finish. The fabric is light and breathable, ideal for all-day wear, and keeps me feeling fresh without sacrificing style. I love that it reaches the ankles, giving it a sophisticated and sexy look at the same time. The color is beautiful, and the neckline is stunning, adding a subtle and elegant touch. The combination of cut, fabric, and length makes it modern and flattering. Truly a dress that combines style, comfort, and confidence. Read more",
        "author": "arianna jimenez",
        "rating": 5.0,
        "date": "November 25, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71DVh5yaW5L._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/61LUBFDJsKL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/7188kzOYHWL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/61ZPcp-yPvL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "4.0 out of 5 stars Pretty Figure Hugging Dress",
        "body": "I purchased this dress for a communion. It definitely accentuated my hourglass figure and was very comfortable and pretty. If you have a tummy, you might need to wear some shapewear because this dress will show everything. I deducted a star because the shoulders don’t stay down. I’d recommend sewing them down so they don’t annoy you. Read more",
        "author": "Sarah",
        "rating": 4.0,
        "date": "May 29, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Tight around Arms/ Chest",
        "body": "Material is great, fit is a little tight, I am 5'1 and 120 pounds and got a small. The arms were really tight around my shoulders, and I can not lift up my arms in this dress, there is definitely a lack of mobility. If you don't need a whole lot of movement it is a beautiful dress. Read more",
        "author": "Logitech",
        "rating": 3.0,
        "date": "October 2, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars I’m in love with this dress",
        "body": "This dress is really elegant and looks great on. It’s perfect for a party or a nice dinner. The material feels high quality and it’s not itchy at all. It’s comfortable to wear and fits nicely. I definitely recommend it. Read more",
        "author": "Ana Rodriguez",
        "rating": 5.0,
        "date": "November 18, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61HsIBzMqCL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "1.0 out of 5 stars Arrived used, stained and smells awful",
        "body": "Cute dress, but was very disappointed to realize this dress had been worn and returned. There are multiple stains and the dress has terrible odor to it. I ordered this for family pictures and I’m really disappointed. Read more",
        "author": "Customer",
        "rating": 1.0,
        "date": "November 29, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Stunning",
        "body": "The media could not be loaded. Absolutely stunning, and a very comfortable dress. I’m 5’1, 110 pounds & this fits to a TEA! It fits the perfect areas, and this can be worn casual or to an elegant outing. The fabric is very soft and the quality is 10/10. Very very beautiful! Read more",
        "author": "Keala Ho",
        "rating": 5.0,
        "date": "November 27, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Fits petite women",
        "body": "I am 4’11 and weigh 100 lbs the size small fit perfectly. I didn’t need to hem the dress because with my heels the dress didn’t need it. I originally purchased this dress as a backup and didn’t think I would like it or end up using it. I was expecting the dress to look a little cheap but was surprised to see how well its made and how elegant it looked. The dress is stretchy but the dress hugs your body nice and the mesh holds up well, no rips or holes considering I have long stiletto nails. I danced all night in this dress and have no complains about it. Compared to all the other dresses that I had also purchased from a different brand (not from Amazon) all ranging from ($150-$200) I ended up wearing this one and saved myself the tailoring fee. Read more",
        "author": "CeceSeydoux",
        "rating": 5.0,
        "date": "March 4, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71uoxaji2cL._SY88._SL1500_.jpg"
        ]
      }
    ]
  },
  "short_description": "Womens Maxi Dress Off Shoulder Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.",
  "about_this_item": "Womens Maxi Dress Off Shoulder Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.",
  "long_description": "Womens Maxi Dress Off Shoulder Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Red, Neon Rose Red, Khaki, Deep Blue, Burgundy, Black, Coffee. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Off Shoulder Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/417beEv0PTL._SL1500_.jpg",
      "alt": "Womens Maxi Dress Off Shoulder Long Sleeve details image 1"
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/31w9XuhB9uL._SL1500_.jpg",
      "alt": "Womens Maxi Dress Off Shoulder Long Sleeve details image 2"
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/41sW3thFuXL._SL1500_.jpg",
      "alt": "Womens Maxi Dress Off Shoulder Long Sleeve details image 3"
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/41L5HECZ9HL._SL1500_.jpg",
      "alt": "Womens Maxi Dress Off Shoulder Long Sleeve details image 4"
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Red, Neon Rose Red, Khaki, Deep Blue, Burgundy, Black, Coffee. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/418aDRj4zfL._SL1500_.jpg",
      "alt": "Womens Maxi Dress Off Shoulder Long Sleeve details image 5"
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "f3781ade-dd7a-42bf-92c7-997b326f47dd",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f3781ade-dd7a-42bf-92c7-997b326f47dd/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f3781ade-dd7a-42bf-92c7-997b326f47dd/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/552b0439-6111-44e5-a207-24971b1cbf4a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "2b2ec238-a70c-4376-a719-d1925d884bc6",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2b2ec238-a70c-4376-a719-d1925d884bc6/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2b2ec238-a70c-4376-a719-d1925d884bc6/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/552b0439-6111-44e5-a207-24971b1cbf4a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "f63bf73c-bd92-44bb-a731-9e68e39d1f67",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f63bf73c-bd92-44bb-a731-9e68e39d1f67/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f63bf73c-bd92-44bb-a731-9e68e39d1f67/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/552b0439-6111-44e5-a207-24971b1cbf4a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "5f92c5a6-c94b-48f1-ac38-39930a07a210",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5f92c5a6-c94b-48f1-ac38-39930a07a210/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5f92c5a6-c94b-48f1-ac38-39930a07a210/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/552b0439-6111-44e5-a207-24971b1cbf4a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "4e942c31-1f42-4da6-8656-c27e2e6d7487",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4e942c31-1f42-4da6-8656-c27e2e6d7487/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4e942c31-1f42-4da6-8656-c27e2e6d7487/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/552b0439-6111-44e5-a207-24971b1cbf4a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "46119f2c-8f14-49ac-9052-db0089a63b75",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/46119f2c-8f14-49ac-9052-db0089a63b75/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/46119f2c-8f14-49ac-9052-db0089a63b75/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/552b0439-6111-44e5-a207-24971b1cbf4a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "5715ae38-14f1-4ee6-9f2e-0dcad8820594",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5715ae38-14f1-4ee6-9f2e-0dcad8820594/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5715ae38-14f1-4ee6-9f2e-0dcad8820594/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/552b0439-6111-44e5-a207-24971b1cbf4a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "a61b5ae6-e7eb-46e9-8123-0d2e354e2ed9",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a61b5ae6-e7eb-46e9-8123-0d2e354e2ed9/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a61b5ae6-e7eb-46e9-8123-0d2e354e2ed9/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/552b0439-6111-44e5-a207-24971b1cbf4a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "7cb679f3-59e5-49e5-af09-b03e94acebc5",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7cb679f3-59e5-49e5-af09-b03e94acebc5/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7cb679f3-59e5-49e5-af09-b03e94acebc5/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/552b0439-6111-44e5-a207-24971b1cbf4a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "63766465-0500-4d71-958a-a8c8e7303fd0",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/63766465-0500-4d71-958a-a8c8e7303fd0/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/63766465-0500-4d71-958a-a8c8e7303fd0/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/552b0439-6111-44e5-a207-24971b1cbf4a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "d39a5b6c-a595-485f-8872-1788edfda77b",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d39a5b6c-a595-485f-8872-1788edfda77b/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d39a5b6c-a595-485f-8872-1788edfda77b/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/552b0439-6111-44e5-a207-24971b1cbf4a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "828e8a75-ea96-4834-9760-c755245929fe",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/828e8a75-ea96-4834-9760-c755245929fe/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/828e8a75-ea96-4834-9760-c755245929fe/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/552b0439-6111-44e5-a207-24971b1cbf4a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Red": "https://m.media-amazon.com/images/I/31-Df003OOL._AC_SR38,50_.jpg",
    "Neon Rose Red": "https://m.media-amazon.com/images/I/31esybU0DhL._AC_SR38,50_.jpg",
    "Khaki": "https://m.media-amazon.com/images/I/31ZwEp9xaHL._AC_SR38,50_.jpg",
    "Deep Blue": "https://m.media-amazon.com/images/I/31WCf5YSpCL._AC_SR38,50_.jpg",
    "Burgundy": "https://m.media-amazon.com/images/I/31x+DoOoyYL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31ABcxhf6OL._AC_SR38,50_.jpg",
    "Coffee": "https://m.media-amazon.com/images/I/317KMOBKsPL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Red": "510zoZnu+HL",
    "Neon Rose Red": "51hTgYkFFmL",
    "Khaki": "51+A1R39SlL",
    "Deep Blue": "51geKrottXL",
    "Burgundy": "519moN+IA0L",
    "Black": "51VI0diPJEL",
    "Coffee": "517lxqZyeML"
  },
  "color_images": {
    "Red": [
      "https://m.media-amazon.com/images/I/510zoZnu+HL._SL1500_.jpg"
    ],
    "Neon Rose Red": [
      "https://m.media-amazon.com/images/I/51hTgYkFFmL._SL1500_.jpg"
    ],
    "Khaki": [
      "https://m.media-amazon.com/images/I/51+A1R39SlL._SL1500_.jpg"
    ],
    "Deep Blue": [
      "https://m.media-amazon.com/images/I/51geKrottXL._SL1500_.jpg"
    ],
    "Burgundy": [
      "https://m.media-amazon.com/images/I/519moN+IA0L._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/51VI0diPJEL._SL1500_.jpg"
    ],
    "Coffee": [
      "https://m.media-amazon.com/images/I/517lxqZyeML._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-cocktail-long-sleeve",
      "title": "Womens Maxi Dress Cocktail Long Sleeve",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71gBYOPR9WL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-v-neck",
      "title": "Womens Dress V Neck",
      "price": 48.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61zrW5DvIeL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-evening-one-shoulder-formal",
      "title": "Womens Dress Evening One Shoulder Formal",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61qbV99SsnL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 35.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/619iIcBchhL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-cocktail-maxi-long-sleeve",
      "title": "Womens Maxi Dress Formal Cocktail Maxi Long Sleeve",
      "price": 60.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/510LBzSeAtL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-bodycon-long-sleeve",
      "title": "Womens Maxi Dress Bodycon Long Sleeve",
      "price": 23.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/7186+Q7L6PL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 89.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61rRvmJ+FqL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 74.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51SXcBCPQVL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-maxi",
      "title": "Womens Maxi Dress Long Sleeve Maxi",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61ZkyE5mF6L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-bodycon",
      "title": "Womens Dress Bodycon",
      "price": 47.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61Kc4uQmKHL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-v-neck-long-sleeve",
      "title": "Womens Maxi Dress V Neck Long Sleeve",
      "price": 28.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71K7SViYxIL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-off-shoulder-bodycon-evening-long-sleeve-formal",
      "title": "Womens Maxi Dress Off Shoulder Bodycon Evening Long Sleeve Formal",
      "price": 55.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/61JH8Uav-aL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-v-neck",
      "title": "Womens Maxi Dress Long Sleeve V Neck",
      "price": 36.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/7185oDX5KkL._SL1500_.jpg"
      ]
    }
  ]
}