{
  "id": "womens-maxi-dress-long-sleeve-maxi",
  "handle": "womens-maxi-dress-long-sleeve-maxi",
  "sku": "JC1280",
  "asin": "B0DDT64SQX",
  "title": "Womens Maxi Dress Long Sleeve Maxi",
  "title_original": "CFLONGE Women's Fall Dresses 2025 Puff Long Sleeve Square Neck Dress High Waist Smocked A-Line Flowy Wedding Party Maxi Dress",
  "brand": "Visit the CFLONGE Store",
  "price": 34.99,
  "social_proof": {
    "bought_past_month": 942,
    "text": "942+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/71Xi-bFxfWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81f0PvUAEcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71RCZGLdCkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81WZc7tFy4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81dp3fOmILL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81PlxpxDKCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71lCu2DB8BL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71VKl8mOGML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/719MrWNTEvL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71FILd2mGCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71NPWapWdiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61nT9jUWRsL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/715TettlD4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61QGBxcB2rL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71O8GtXa4XL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71-hIVmfmIL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Uor6Vc2fL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61DQoAhCRaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71bn+DF4KHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71X7S0FYhLL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/71Xi-bFxfWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81f0PvUAEcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71RCZGLdCkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81WZc7tFy4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81dp3fOmILL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81PlxpxDKCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71lCu2DB8BL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71VKl8mOGML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/719MrWNTEvL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71FILd2mGCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71NPWapWdiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61nT9jUWRsL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/715TettlD4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61QGBxcB2rL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71O8GtXa4XL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71-hIVmfmIL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Uor6Vc2fL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61DQoAhCRaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71bn+DF4KHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71X7S0FYhLL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ August 8, 2024",
    "ASIN ‏": "‎ B0D987RF3C",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#104,292 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #1,521 in Women's Casual Dresses",
    "Customer Reviews": "4.1 4.1 out of 5 stars (243)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Brown",
      "Blue",
      "Army Green",
      "Light Green",
      "Black",
      "Dark Green",
      "Navy",
      "Wine Red",
      "Bean Paste Pink",
      "Khaki",
      "White",
      "Beige",
      "Purple",
      "Royal Blue"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.1,
    "count": 243,
    "customers_say": "Customers find the dress great-looking, comfortable, and flattering, with one noting it hugs the figure in all the right places. Moreover, the quality receives positive feedback, with one customer mentioning it's perfect for newborn/family photos. However, customers disagree on the fit, with some finding it runs large. Additionally, the fabric quality and softness receive mixed reviews, with some praising the material while others find it thin and scratchy. Generated from the text of customer reviews Select to learn more Look (21) Quality (15) Comfort (11) Flattering (10) Fit (34) Fabric quality (10) Fabric softness (7) Size (11) 21 customers mention look, 15 positive, 6 negative 21 customers mention \"Look\" 15 positive 6 negative Customers find the dress visually appealing, with one mentioning it has a fairytale vibe. \" Beautiful and simple dress . I read some reviews stating that it runs too big but it’s definitely fits as described.... \" Read more \" Cute dress just runs a bit big. \" Read more \" SAVE YOUR MONEY. Do not buy this dress. It’s not cute . Does not look like the picture \" Read more \" Very see through, it’s cute but the fabric is really thin. It’s comfortable you just can’t put your arms up.... \" Read more 15 customers mention quality, 13 positive, 2 negative 15 customers mention \"Quality\" 13 positive 2 negative Customers find the dress to be of great quality, particularly noting it works well for family pictures, newborn photos, and holiday occasions. \" ...We have a strict dress code and this dress is perfect ! Super stretchy, comfortable, soft, and it even has pockets!... \" Read more \" Beautiful! Worked as a Christmas dress, wedding guest dress , etc. very lightweight but not see through.... \" Read more \" Great loved the dress \" Read more \" Good quality and very flattering! \" Read more 11 customers mention comfort, 10 positive, 1 negative 11 customers mention \"Comfort\" 10 positive 1 negative Customers find the dress comfortable. \" ...I wear it regularly and always get compliments on it. It's comfortable and flattering for my body type. I'm plus size and curvy. \" Read more \" This dress is definitely different from my go to. I loved it, super comfortable and I got a lot of compliments. The fit was true to size. \" Read more \" Very modest and comfortable dress ! Plan on wearing this for my baby shower and even after baby comes. Love the pockets as well! \" Read more \" ...The material is comfortable and stretchy. I’m definitely buying more of this dress in different colours!! \" Read more 10 customers mention flattering, 10 positive, 0 negative 10 customers mention \"Flattering\" 10 positive 0 negative Customers find the dress flattering, with one mentioning it hugs the figure in all the right places, while another notes it hits right at the ankle. \" ...Also the shoulder kept falling off. Material is good. The dress is very flattering . I chose an olive green shade and it was not see through.... \" Read more \" ...very lightweight but not see through. Also flattering and fit well while I was pregnant (until maybe late third trimester). \" Read more \" ...I am 5’8” ands 179-175. The dress is flattering but the style itself could be dawdy if not styled properly. What a pleasant surprise this dress is.... \" Read more \" ...It's comfortable and flattering for my body type . I'm plus size and curvy. \" Read more 34 customers mention fit, 19 positive, 15 negative 34 customers mention \"Fit\" 19 positive 15 negative Customers have mixed opinions about the dress's fit, with some finding it comfortable while others report it being too loose. \" ...Fabric feels a bit stiff but might soften up after it’s washed. Fits true to size .... \" Read more \" ...It looks nothing like the picture, M truly fits like an XL . Returning and searching elsewhere for a family photos dress. \" Read more \" I love the fit of this dress . I went with my regular size of XL and I’m glad I did.... \" Read more \" Sized up because I’m pregnant and it was too big in the shoulders/arms so I returned it for my normal size and it’s still too big in the shoulders/... \" Read more 10 customers mention fabric quality, 4 positive, 6 negative 10 customers mention \"Fabric quality\" 4 positive 6 negative Customers have mixed opinions about the fabric of the dress, with some finding it good while others note that it is really thin. \" Very see through, it’s cute but the fabric is really thin . It’s comfortable you just can’t put your arms up.... \" Read more \" This dress is well made and is a heavier fabric . It does, however, run large. I’m 5’4”, 113 lbs and a small fit more like a medium. \" Read more \" Bad quality fabric , size to big for m \" Read more \" ...I had to return it. Also the shoulder kept falling off. Material is good . The dress is very flattering.... \" Read more 7 customers mention fabric softness, 3 positive, 4 negative 7 customers mention \"Fabric softness\" 3 positive 4 negative Customers have mixed opinions about the fabric of the dress, with some finding it soft while others note it feels stiff and scratchy. \" ...That’s the best part! Fabric feels a bit stiff but might soften up after it’s washed. Fits true to size.... \" Read more \" This dress was soft but I thought it made me look frumpy. Returned it. \" Read more \" Much longer. Than it looks. Fabric could be softer . But. With washing I think it might get there. Love the cut of the neck line.... \" Read more \" ...Super stretchy, comfortable, soft , and it even has pockets! It also is good for people who want more of a conservative look.... \" Read more 11 customers mention size, 3 positive, 8 negative 11 customers mention \"Size\" 3 positive 8 negative Customers report that the dress runs a bit big. \" Cute dress just runs a bit big . \" Read more \" This dress is well made and is a heavier fabric. It does, however, run large . I’m 5’4”, 113 lbs and a small fit more like a medium. \" Read more \" ...It’s pretty true to size \" Read more \" it runs pretty long and the top part runs big so it was very stretchy. i returned it. other than that the material and price of this dress is great! \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Flattering",
        "body": "Beautiful! Worked as a Christmas dress, wedding guest dress, etc. very lightweight but not see through. Also flattering and fit well while I was pregnant (until maybe late third trimester). Read more",
        "author": "Nate",
        "rating": 5.0,
        "date": "August 28, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Order your the size you normally do.",
        "body": "Amazon recommended an XL , and I wasn't sure if a Large would fit my chest so I sized up for a 36DD to an XL. The XL was WAY too large for me, I could pull the mid section out about 6\". I tried to belt it but it just looked bunchy. Great fit and length everywhere else. I am 5'2\" 165lbs. A large would be a better fit. Across widest part of chest 42\", waist 34.5\". Read more",
        "author": "TRK",
        "rating": 4.0,
        "date": "December 3, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/31qaNUyjpmL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/61ElUjzW9QL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/61SnyKcnBaL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/61L3GLwi6qL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Worth every penny",
        "body": "12 hour delivery. Ordered at 7pm, received at 7am. Can’t beat that. For under $20 this dress is a steal. Color is true. Material feels solid and quality is great. It is even lined. I love the color. Medium was recommended but I ordered the large because I like space. That being said, I could have easily went with the medium and it would have still been comfortable. I am 5’8” ands 179-175. The dress is flattering but the style itself could be dawdy if not styled properly. What a pleasant surprise this dress is. I hope toss helps. Read more",
        "author": "Kindle Customer",
        "rating": 5.0,
        "date": "August 4, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars It’s okay…",
        "body": "Very see through, it’s cute but the fabric is really thin. It’s comfortable you just can’t put your arms up. It fit me well but I don’t think I’d wear it very regularly. Read more",
        "author": "Optimistic reviewer",
        "rating": 3.0,
        "date": "July 1, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Fits perfectly",
        "body": "Love it and fits great! Read more",
        "author": "Kristy",
        "rating": 5.0,
        "date": "December 18, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "2.0 out of 5 stars Runs HUGE!! M fits like an XL!",
        "body": "I literally never write reviews but had to post to save someone from purchasing this - I’m 5’4, 140lb, larger chested, typically a size medium and sometimes large in bottoms, and I was SWIMMING in this dress in size Medium. My husband said I looked like I could be in Outlander, and my best friend said I looked like an underpaid milkmaid. The stretchy part of the sleeves made to sit at your wrist and give some form, went down to my fingertips, and the length of the dress itself went to my ankles. The waist and neckline hung off of me. It looks nothing like the picture, M truly fits like an XL. Returning and searching elsewhere for a family photos dress. Read more",
        "author": "Olivia Pooler",
        "rating": 2.0,
        "date": "November 7, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Must buy!!!",
        "body": "Beautiful and simple dress . I read some reviews stating that it runs too big but it’s definitely fits as described. For reference, I’m 5’4 and weight 135lb and got size small. I wish I had gotten the medium as the size chart suggested but I went with what the reviews suggested so just buy your size. The material is comfortable and stretchy. I’m definitely buying more of this dress in different colours!! Read more",
        "author": "Customer",
        "rating": 5.0,
        "date": "April 18, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "1.0 out of 5 stars Bad quality",
        "body": "Bad quality fabric, size to big for m Read more",
        "author": "Gricelda Gonzalez",
        "rating": 1.0,
        "date": "September 6, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Long Sleeve Maxi is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.",
  "about_this_item": "Womens Maxi Dress Long Sleeve Maxi is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.",
  "long_description": "Womens Maxi Dress Long Sleeve Maxi is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Brown, Blue, Army Green, Light Green, Black, Dark Green, Navy, Wine Red, Bean Paste Pink, Khaki, White, Beige, Purple, Royal Blue. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Long Sleeve Maxi is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Brown, Blue, Army Green, Light Green, Black, Dark Green, Navy, Wine Red, Bean Paste Pink, Khaki, White, Beige, Purple, Royal Blue. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "31b355fd-6344-4d35-943b-df195ef52af7",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/31b355fd-6344-4d35-943b-df195ef52af7/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/31b355fd-6344-4d35-943b-df195ef52af7/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/26d0ea9b-52b5-469a-a4cd-c931eca50f1d.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "c2170a3a-bf9d-4cc8-bbd2-9e6ef3314e67",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c2170a3a-bf9d-4cc8-bbd2-9e6ef3314e67/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c2170a3a-bf9d-4cc8-bbd2-9e6ef3314e67/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/26d0ea9b-52b5-469a-a4cd-c931eca50f1d.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "af137e98-6691-4c7f-b676-0808438355cb",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/af137e98-6691-4c7f-b676-0808438355cb/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/af137e98-6691-4c7f-b676-0808438355cb/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/26d0ea9b-52b5-469a-a4cd-c931eca50f1d.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "1360dc6d-30f4-48b5-9fa3-d9c065b497a6",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1360dc6d-30f4-48b5-9fa3-d9c065b497a6/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1360dc6d-30f4-48b5-9fa3-d9c065b497a6/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/26d0ea9b-52b5-469a-a4cd-c931eca50f1d.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "70eb7cf4-91be-406f-b276-b4df3d4be0ec",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/70eb7cf4-91be-406f-b276-b4df3d4be0ec/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/70eb7cf4-91be-406f-b276-b4df3d4be0ec/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/26d0ea9b-52b5-469a-a4cd-c931eca50f1d.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "25e9e924-4ca8-4db7-af80-924816722f08",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/25e9e924-4ca8-4db7-af80-924816722f08/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/25e9e924-4ca8-4db7-af80-924816722f08/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/26d0ea9b-52b5-469a-a4cd-c931eca50f1d.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "3c8a1848-20a2-4dc6-974a-7390aaedddff",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3c8a1848-20a2-4dc6-974a-7390aaedddff/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3c8a1848-20a2-4dc6-974a-7390aaedddff/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/26d0ea9b-52b5-469a-a4cd-c931eca50f1d.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "3571dc74-808b-49ac-bfbf-546eddce465f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3571dc74-808b-49ac-bfbf-546eddce465f/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3571dc74-808b-49ac-bfbf-546eddce465f/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/26d0ea9b-52b5-469a-a4cd-c931eca50f1d.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "70bfb76c-53cf-48cc-8443-0bac0f383a10",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/70bfb76c-53cf-48cc-8443-0bac0f383a10/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/70bfb76c-53cf-48cc-8443-0bac0f383a10/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/26d0ea9b-52b5-469a-a4cd-c931eca50f1d.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "f58d0a2a-3e91-48a9-b084-4afb50c6b04e",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f58d0a2a-3e91-48a9-b084-4afb50c6b04e/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f58d0a2a-3e91-48a9-b084-4afb50c6b04e/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/26d0ea9b-52b5-469a-a4cd-c931eca50f1d.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "27434ec2-3057-4f5e-8c36-f0b15229f80e",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/27434ec2-3057-4f5e-8c36-f0b15229f80e/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/27434ec2-3057-4f5e-8c36-f0b15229f80e/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/26d0ea9b-52b5-469a-a4cd-c931eca50f1d.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "6810cb6c-8d84-40dd-ab26-62ab6bf29c9a",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6810cb6c-8d84-40dd-ab26-62ab6bf29c9a/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6810cb6c-8d84-40dd-ab26-62ab6bf29c9a/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/26d0ea9b-52b5-469a-a4cd-c931eca50f1d.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Brown": "https://m.media-amazon.com/images/I/41KCMYgoU1L._AC_SR38,50_.jpg",
    "Blue": "https://m.media-amazon.com/images/I/418fnCn5o4L._AC_SR38,50_.jpg",
    "Army Green": "https://m.media-amazon.com/images/I/41hbg8WPoCL._AC_SR38,50_.jpg",
    "Light Green": "https://m.media-amazon.com/images/I/41rQEn9IvKL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/313xCxO6bSL._AC_SR38,50_.jpg",
    "Dark Green": "https://m.media-amazon.com/images/I/41UZiASAIZL._AC_SR38,50_.jpg",
    "Navy": "https://m.media-amazon.com/images/I/413ijsjfuiL._AC_SR38,50_.jpg",
    "Wine Red": "https://m.media-amazon.com/images/I/41goO6tqf6L._AC_SR38,50_.jpg",
    "Bean Paste Pink": "https://m.media-amazon.com/images/I/41v+5cfz2TL._AC_SR38,50_.jpg",
    "Khaki": "https://m.media-amazon.com/images/I/41i9qoOFeWL._AC_SR38,50_.jpg",
    "White": "https://m.media-amazon.com/images/I/31wYqbDl7XL._AC_SR38,50_.jpg",
    "Beige": "https://m.media-amazon.com/images/I/31AGCTOuRmL._AC_SR38,50_.jpg",
    "Purple": "https://m.media-amazon.com/images/I/41RyiYqyc7L._AC_SR38,50_.jpg",
    "Royal Blue": "https://m.media-amazon.com/images/I/41ybXYlOjCL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Brown": "71VKl8mOGML",
    "Blue": "719MrWNTEvL",
    "Army Green": "71FILd2mGCL",
    "Light Green": "71NPWapWdiL",
    "Black": "61nT9jUWRsL",
    "Dark Green": "715TettlD4L",
    "Navy": "61QGBxcB2rL",
    "Wine Red": "71Xi-bFxfWL",
    "Bean Paste Pink": "71O8GtXa4XL",
    "Khaki": "71-hIVmfmIL",
    "White": "61Uor6Vc2fL",
    "Beige": "61DQoAhCRaL",
    "Purple": "71bn+DF4KHL",
    "Royal Blue": "71X7S0FYhLL"
  },
  "color_images": {
    "Brown": [
      "https://m.media-amazon.com/images/I/71VKl8mOGML._SL1500_.jpg"
    ],
    "Blue": [
      "https://m.media-amazon.com/images/I/719MrWNTEvL._SL1500_.jpg"
    ],
    "Army Green": [
      "https://m.media-amazon.com/images/I/71FILd2mGCL._SL1500_.jpg"
    ],
    "Light Green": [
      "https://m.media-amazon.com/images/I/71NPWapWdiL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/61nT9jUWRsL._SL1500_.jpg"
    ],
    "Dark Green": [
      "https://m.media-amazon.com/images/I/715TettlD4L._SL1500_.jpg"
    ],
    "Navy": [
      "https://m.media-amazon.com/images/I/61QGBxcB2rL._SL1500_.jpg"
    ],
    "Wine Red": [
      "https://m.media-amazon.com/images/I/71Xi-bFxfWL._SL1500_.jpg"
    ],
    "Bean Paste Pink": [
      "https://m.media-amazon.com/images/I/71O8GtXa4XL._SL1500_.jpg"
    ],
    "Khaki": [
      "https://m.media-amazon.com/images/I/71-hIVmfmIL._SL1500_.jpg"
    ],
    "White": [
      "https://m.media-amazon.com/images/I/61Uor6Vc2fL._SL1500_.jpg"
    ],
    "Beige": [
      "https://m.media-amazon.com/images/I/61DQoAhCRaL._SL1500_.jpg"
    ],
    "Purple": [
      "https://m.media-amazon.com/images/I/71bn+DF4KHL._SL1500_.jpg"
    ],
    "Royal Blue": [
      "https://m.media-amazon.com/images/I/71X7S0FYhLL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 210.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71gHGMr--UL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 36.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61gUSDNnB3L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-short-sleeve",
      "title": "Womens Dress Short Sleeve",
      "price": 75.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61XTYDFxLML._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-formal-bodycon",
      "title": "Womens Maxi Dress Long Sleeve Formal Bodycon",
      "price": 36.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61GBgs5yftL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 35.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/61ueGd5J5HL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-boat-neck-bodycon-long-sleeve",
      "title": "Womens Maxi Dress Boat Neck Bodycon Long Sleeve",
      "price": 36.89,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61g-xMLK3CL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-short-sleeve",
      "title": "Womens Dress Short Sleeve",
      "price": 139.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61DGsPsr6EL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-formal-evening",
      "title": "Womens Dress Formal Evening",
      "price": 85.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51DBpbbgqCL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-boat-neck",
      "title": "Womens Maxi Dress Boat Neck",
      "price": 34.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61X0az+gtqL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 41.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61jHeV88bYL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-long-sleeve",
      "title": "Womens Maxi Dress Bodycon Long Sleeve",
      "price": 27.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/419lpifTakL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-v-neck-split",
      "title": "Womens Maxi Dress Long Sleeve V Neck Split",
      "price": 9.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61rDQSA6d3L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-short-sleeve",
      "title": "Womens Dress Short Sleeve",
      "price": 36.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71mJpfJK2VL._SL1500_.jpg"
      ]
    }
  ]
}