{
  "id": "womens-maxi-dress-maxi-bodycon-long-sleeve",
  "handle": "womens-maxi-dress-maxi-bodycon-long-sleeve",
  "sku": "JC1981",
  "asin": "B0DFB99F65",
  "title": "Womens Maxi Dress Maxi Bodycon Long Sleeve",
  "title_original": "MEROKEETY Women's 2025 Long Sleeve Bodycon Sweater Dress Fall Winter Crew Neck Ribbed Knit Maxi Dresses",
  "brand": "Visit the MEROKEETY Store",
  "price": 59.99,
  "social_proof": {
    "bought_past_month": 1610,
    "text": "1610+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/51xY-nVpN9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61TUwjc8XtL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61h9fGSqOrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/614dVzqZeOL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/718HcOCRUYL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71oaip1incL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71+xkZmY9sL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81VmITCIYxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/510g0LFQe7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61q57kjxscL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61pIbwCpaiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61rYDjeFBNL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61jNDJ9DJAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Irb48LxTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/613jw2dRelL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61esTSxWnQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61r7qw5G7+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/612XxZN2rXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Iwsuoo5mL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61huNbrU9eL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51mluuj2fbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61VvwZpygkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/613uNWe4bEL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/51xY-nVpN9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61TUwjc8XtL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61h9fGSqOrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/614dVzqZeOL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/718HcOCRUYL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71oaip1incL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71+xkZmY9sL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81VmITCIYxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/510g0LFQe7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61q57kjxscL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61pIbwCpaiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61rYDjeFBNL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61jNDJ9DJAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Irb48LxTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/613jw2dRelL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61esTSxWnQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61r7qw5G7+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/612XxZN2rXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Iwsuoo5mL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61huNbrU9eL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51mluuj2fbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61VvwZpygkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/613uNWe4bEL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Item model number ‏": "‎ Long Sleeve Bodycon Sweater Dress",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ August 8, 2024",
    "ASIN ‏": "‎ B0D9BQC4KT",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#24,670 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #205 in Women's Casual Dresses",
    "Customer Reviews": "4.4 4.4 out of 5 stars (214)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Burgundy",
      "Lightblue",
      "Apricot",
      "Chocolate",
      "Rose",
      "Army Green",
      "Black",
      "Coffee",
      "Gray Blue",
      "Lightpurple",
      "Navy",
      "Plum",
      "Khaki",
      "Beige",
      "Light Pink",
      "Lightgreen"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.4,
    "count": 214,
    "customers_say": "Customers find the dress well-made, comfortable, and elegant, describing it as a beautiful maxi gown. The material is nice and thick, and customers appreciate its stretchiness and softness. The length receives mixed feedback - while some find it perfect, others note it runs long. Select to learn more Fit Quality Comfort Material quality Elegance Stretchiness Fabric softness Length 35 customers mention \"Fit\" 28 positive 7 negative Customers like how the dress fits, with one mentioning it's form-fitting and another noting it's not too roomy. \"This fits perfectly ! I’ve been looking to dress more feminine and modest, this is perfect for going to temple as well as wearing casually!...\" Read more \"WOW, what can I say. I love this dress. Form fitting without showing any underwear lines. Material is awesome and very slimming....\" Read more \"Loved this dress, I purchased it for my baby shower! It fit great , im 5’2 and it didn’t fit long at all it was the perfect length!...\" Read more \"... Sleeves were a little big and long.\" Read more 31 customers mention \"Quality\" 30 positive 1 negative Customers find the dress beautiful and well-made, describing it as a great basic piece. \"Such great quality , I’m 32 weeks pregnant and have been wearing for several weeks now to work and other events....\" Read more \"Soft cotton like material. Stretches and is good quality . The color was perfect on my skin tone. I'm 5'4\" and it went down to my ankles....\" Read more \" Love this dress , love the way it fits, love the color, will order another color in the future.\" Read more \"... Super cute and comfortable!\" Read more 22 customers mention \"Comfort\" 22 positive 0 negative Customers find the dress comfortable and warm. \"Wore this dress to a winter baby shower. Comfortable , and form fitting. Material is thicker than what I thought....\" Read more \"I really like this dress. It’s thick and soft and stretchy. Very comfortable . I like the neckline and the style and pattern....\" Read more \"...It works as a dress or I wear it instead of a robe. Comfy , doesn’t wrinkle, and is cozy. Waiting for my second one now....\" Read more \"Size small I am 5’5” and 140 for reference. It’s very comfy , stretchy,, and flattering\" Read more 19 customers mention \"Material quality\" 17 positive 2 negative Customers appreciate the dress's material, describing it as nice and thick with great quality fabric. \"...The fabric is soft and has the right amount of stretch. It’s thick but not too heavy. My only complaint is that it isn’t as long as depicted....\" Read more \" Great quality fabric and fits perfectly!\" Read more \"Beautiful dress. The fabric is high quality , it's a thick sweater material so it's not see through....\" Read more \"...It’s a beautiful dress and is good fabric I will still be returning it.\" Read more 18 customers mention \"Elegance\" 16 positive 2 negative Customers find the dress elegant, describing it as a beautiful maxi gown, with one customer mentioning it pairs well with a cute jacket. \"...Especially having paid full price for it. It’s a beautiful dress and is good fabric I will still be returning it.\" Read more \"Comfortable, fabric weight was perfect and has a nice stretch. Beautiful ! I received a lot of compliments....\" Read more \"Great quality, wore with a concho belt and it was gorgeous .\" Read more \"...the material is soft and elegant . not cheap feeling at all\" Read more 17 customers mention \"Stretchiness\" 17 positive 0 negative Customers appreciate the dress's stretchiness. \"The material is thick and stretchy I am happy with the dress however i would say that it runs quite large, I am a medium which I ordered but it’s a...\" Read more \"This dress is very stretchy so size down if you want a tighter fit. Perfect for winter or colder events. I could wear this all day it’s very comfy\" Read more \"...There’s plenty of stretch in the dress .\" Read more \"...The material is stretchy but not clingy at all, and it's thick so it it doesn't go see-thru int he tighter fitting areas...\" Read more 11 customers mention \"Fabric softness\" 11 positive 0 negative Customers find the fabric of the dress very soft, with one customer noting its good texture. \"I really like this dress. It’s thick and soft and stretchy. Very comfortable. I like the neckline and the style and pattern....\" Read more \"Love this basic dress to wear under jackets etc.., very soft ! Runs a little big . Quality is very good!\" Read more \"It’s a good little dress. The fabric is soft and has the right amount of stretch. It’s thick but not too heavy....\" Read more \"This dress is exactly what I hoped for! The knit fabric is soft , stretchy, and warm without feeling heavy....\" Read more 12 customers mention \"Length\" 6 positive 6 negative Customers have mixed opinions about the dress's length, with some finding it great for tall ladies while others note it runs long. \"Very comfortable stretchy dress! The length is perfect for me , I’m 5’5, not too long at all. It’s great for colder temps\" Read more \"...Material is thicker than what I thought. The sleeves are long , but I just rolled them and made it work!\" Read more \"Soft and good quality! Does run long , but still fit good\" Read more \"I love it, but it is shorter than I thought . I’m 5’8. I still wear it.\" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Love love love",
        "body": "Absolutely love this dress. It fits perfectly. The color is exactly what was presented and the quality is great. I love the details in the stretchy parts. It is worth giving it a try. Read more",
        "author": "Ashley",
        "rating": 5.0,
        "date": "December 5, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars True to size",
        "body": "I bought this dress in multiple colors! Wore it for Christmas. I ordered a small and it was true to size, very comfortable. I am now 15 weeks pregnant and have worn it to work and it still fits and stretchy. Read more",
        "author": "Taylor Varela",
        "rating": 5.0,
        "date": "December 15, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71EGz+8+EmL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "4.0 out of 5 stars Good dress",
        "body": "It’s a good little dress. The fabric is soft and has the right amount of stretch. It’s thick but not too heavy. My only complaint is that it isn’t as long as depicted. I ordered two, once in black and another in blue. Read more",
        "author": "Customer",
        "rating": 4.0,
        "date": "November 30, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Nice cozy dress, not ankle length...",
        "body": "I wear a size 14, ordered the largest size and found this warm and cozy dress very nice, I order two colors. Not too roomy, but not too \"hugging\". Goes well with tall dress boots, but does Not fall at your ankles without rising up a few inches as you walk. I am 5'3\". This is why I like wearing with tall suede boots. The fabric stays in place. Wear a thigh length, or better yet capris length half or full length smoothing lingerie underneath for a nice smooth silhouette. Otherwise, panty lines, and any possible cellulite \"dimple\" on your beautiful body will be emphasized. If you wear with tall sleek leather boots instead of suede, with each step, you will hear a \"hissing\" sound as the dress comes into contact with your boot surface. This creates a nice static electricity charge unfortunately. Looks great with a big chunky belt to match boots if you choose to wear them. If you wear oxfords or pumps your ankles will show if your are 5'3\" or taller. Read more",
        "author": "Reba",
        "rating": 5.0,
        "date": "December 25, 2024",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Good quality",
        "body": "Perfect maternity dress. It was very un-flattering when my stomach was smaller. However, once I was 37 weeks and very large, it was more flattering! Sleeves were a little big and long. Read more",
        "author": "KM",
        "rating": 5.0,
        "date": "November 20, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/81pN4LkFQlL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Elegant maxi dress",
        "body": "Soft cotton like material. Stretches and is good quality. The color was perfect on my skin tone. I'm 5'4\" and it went down to my ankles. It's a good length. I got a size M so it's a little bit lose fit. Size down if you want it tight. This is an elegant looking maxi dress. Read more",
        "author": "Murielle",
        "rating": 5.0,
        "date": "June 14, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Flattering and Cozy",
        "body": "The media could not be loaded. This dress is exactly what I hoped for! The knit fabric is soft, stretchy, and warm without feeling heavy. The slim fit is very flattering, and the maxi length makes it easy to dress up or keep casual. I wore it with heels for a dinner out and got so many compliments. Fits true to size and feels really comfortable—I’ll definitely be ordering another color! Read more",
        "author": "Peach State Chic",
        "rating": 5.0,
        "date": "August 28, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71uc+8CzE4L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "1.0 out of 5 stars REALLY BAD QUALITY",
        "body": "Look its thick, its not see through, but oh mannnnn is it cheap. The shape is all wrong and the cut is all over the place. The underarms were really baggy and the neckline looked like someone cut it with scissors. If you are maybe on the curvy side this could be super cute, but Im 5'3 and 115ibs and it just drowned me. For the price and the right body this could be a score, but if youre on the smaller side the material and the cut just did not work. Read more",
        "author": "mia pernice",
        "rating": 1.0,
        "date": "October 1, 2024",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Maxi Bodycon Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.",
  "about_this_item": "Womens Maxi Dress Maxi Bodycon Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.",
  "long_description": "Womens Maxi Dress Maxi Bodycon Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Burgundy, Lightblue, Apricot, Chocolate, Rose, Army Green, Black, Coffee, Gray Blue, Lightpurple, Navy, Plum, Khaki, Beige. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Maxi Bodycon Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Burgundy, Lightblue, Apricot, Chocolate, Rose, Army Green, Black, Coffee, Gray Blue, Lightpurple, Navy, Plum, Khaki, Beige. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "4633e40c-1934-4a97-83dd-c1c812bb8f70",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4633e40c-1934-4a97-83dd-c1c812bb8f70/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4633e40c-1934-4a97-83dd-c1c812bb8f70/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "3cb6bc2f-db00-4406-aa97-7e5797a4bf12",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3cb6bc2f-db00-4406-aa97-7e5797a4bf12/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3cb6bc2f-db00-4406-aa97-7e5797a4bf12/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "0694580a-a069-44dc-b45a-9c02a5cb7c01",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0694580a-a069-44dc-b45a-9c02a5cb7c01/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0694580a-a069-44dc-b45a-9c02a5cb7c01/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "ce4a2564-ad17-41fe-9b0e-80cce425e4a3",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ce4a2564-ad17-41fe-9b0e-80cce425e4a3/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ce4a2564-ad17-41fe-9b0e-80cce425e4a3/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "620a970f-326e-48a7-a916-d0baeff86e18",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/620a970f-326e-48a7-a916-d0baeff86e18/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/620a970f-326e-48a7-a916-d0baeff86e18/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "edc5883d-124f-4251-aed2-b1cfcc2283cc",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/edc5883d-124f-4251-aed2-b1cfcc2283cc/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/edc5883d-124f-4251-aed2-b1cfcc2283cc/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "c3ed35c4-86d6-4a11-af75-5aa677bc844f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c3ed35c4-86d6-4a11-af75-5aa677bc844f/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c3ed35c4-86d6-4a11-af75-5aa677bc844f/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "c631e54d-b2a7-4462-9f5e-526b8b95fb16",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c631e54d-b2a7-4462-9f5e-526b8b95fb16/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c631e54d-b2a7-4462-9f5e-526b8b95fb16/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "650fdd3f-fe81-4053-9296-cb25503dafd9",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/650fdd3f-fe81-4053-9296-cb25503dafd9/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/650fdd3f-fe81-4053-9296-cb25503dafd9/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "b36e609b-5899-498b-ac50-3573105a778a",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b36e609b-5899-498b-ac50-3573105a778a/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b36e609b-5899-498b-ac50-3573105a778a/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "5977f8e1-8440-4c17-8f8f-ab6ac0bd7037",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5977f8e1-8440-4c17-8f8f-ab6ac0bd7037/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5977f8e1-8440-4c17-8f8f-ab6ac0bd7037/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "3842b33e-4dfe-4af1-8317-444e97cf1389",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3842b33e-4dfe-4af1-8317-444e97cf1389/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3842b33e-4dfe-4af1-8317-444e97cf1389/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Burgundy": "https://m.media-amazon.com/images/I/31ei0qnCFfL._AC_SR38,50_.jpg",
    "Lightblue": "https://m.media-amazon.com/images/I/31YuREvc-iL._AC_SR38,50_.jpg",
    "Apricot": "https://m.media-amazon.com/images/I/31Dl4CxjAoL._AC_SR38,50_.jpg",
    "Chocolate": "https://m.media-amazon.com/images/I/31ho0K0m-aL._AC_SR38,50_.jpg",
    "Rose": "https://m.media-amazon.com/images/I/31fOCfSvIvL._AC_SR38,50_.jpg",
    "Army Green": "https://m.media-amazon.com/images/I/31EE30VNkJL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31o-LyDdXOL._AC_SR38,50_.jpg",
    "Coffee": "https://m.media-amazon.com/images/I/31l4HKuJGGL._AC_SR38,50_.jpg",
    "Gray Blue": "https://m.media-amazon.com/images/I/31zubTUU9lL._AC_SR38,50_.jpg",
    "Lightpurple": "https://m.media-amazon.com/images/I/31J8RjFjvPL._AC_SR38,50_.jpg",
    "Navy": "https://m.media-amazon.com/images/I/31D+obMcMoL._AC_SR38,50_.jpg",
    "Plum": "https://m.media-amazon.com/images/I/31dUUF+i9HL._AC_SR38,50_.jpg",
    "Khaki": "https://m.media-amazon.com/images/I/31TpVWPZx-L._AC_SR38,50_.jpg",
    "Beige": "https://m.media-amazon.com/images/I/21TTlJiWFtL._AC_SR38,50_.jpg",
    "Light Pink": "https://m.media-amazon.com/images/I/31gTq9JbjzL._AC_SR38,50_.jpg",
    "Lightgreen": "https://m.media-amazon.com/images/I/31HEFORZtaL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Burgundy": "510g0LFQe7L",
    "Lightblue": "61q57kjxscL",
    "Apricot": "61pIbwCpaiL",
    "Chocolate": "61rYDjeFBNL",
    "Rose": "61jNDJ9DJAL",
    "Army Green": "61Irb48LxTL",
    "Black": "51xY-nVpN9L",
    "Coffee": "613jw2dRelL",
    "Gray Blue": "61esTSxWnQL",
    "Lightpurple": "61r7qw5G7+L",
    "Navy": "612XxZN2rXL",
    "Plum": "61Iwsuoo5mL",
    "Khaki": "61huNbrU9eL",
    "Beige": "51mluuj2fbL",
    "Light Pink": "61VvwZpygkL",
    "Lightgreen": "613uNWe4bEL"
  },
  "color_images": {
    "Burgundy": [
      "https://m.media-amazon.com/images/I/510g0LFQe7L._SL1500_.jpg"
    ],
    "Lightblue": [
      "https://m.media-amazon.com/images/I/61q57kjxscL._SL1500_.jpg"
    ],
    "Apricot": [
      "https://m.media-amazon.com/images/I/61pIbwCpaiL._SL1500_.jpg"
    ],
    "Chocolate": [
      "https://m.media-amazon.com/images/I/61rYDjeFBNL._SL1500_.jpg"
    ],
    "Rose": [
      "https://m.media-amazon.com/images/I/61jNDJ9DJAL._SL1500_.jpg"
    ],
    "Army Green": [
      "https://m.media-amazon.com/images/I/61Irb48LxTL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/51xY-nVpN9L._SL1500_.jpg"
    ],
    "Coffee": [
      "https://m.media-amazon.com/images/I/613jw2dRelL._SL1500_.jpg"
    ],
    "Gray Blue": [
      "https://m.media-amazon.com/images/I/61esTSxWnQL._SL1500_.jpg"
    ],
    "Lightpurple": [
      "https://m.media-amazon.com/images/I/61r7qw5G7+L._SL1500_.jpg"
    ],
    "Navy": [
      "https://m.media-amazon.com/images/I/612XxZN2rXL._SL1500_.jpg"
    ],
    "Plum": [
      "https://m.media-amazon.com/images/I/61Iwsuoo5mL._SL1500_.jpg"
    ],
    "Khaki": [
      "https://m.media-amazon.com/images/I/61huNbrU9eL._SL1500_.jpg"
    ],
    "Beige": [
      "https://m.media-amazon.com/images/I/51mluuj2fbL._SL1500_.jpg"
    ],
    "Light Pink": [
      "https://m.media-amazon.com/images/I/61VvwZpygkL._SL1500_.jpg"
    ],
    "Lightgreen": [
      "https://m.media-amazon.com/images/I/613uNWe4bEL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-long-sleeve-ruched",
      "title": "Womens Maxi Dress Long Sleeve Ruched",
      "price": 280.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/81mFmdsuC+L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-v-neck",
      "title": "Womens Maxi Dress Formal V Neck",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51cMfA7Z9XL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 89.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/81jmd7L2fXL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-v-neck-bodycon-ruched",
      "title": "Womens Maxi Dress V Neck Bodycon Ruched",
      "price": 35.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71Qsmd8MgnL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi",
      "title": "Womens Maxi Dress Maxi",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51DHJaoUhmL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 42.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Work",
      "images": [
        "https://m.media-amazon.com/images/I/610ibAREFTL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-long-sleeve",
      "title": "Womens Maxi Dress Bodycon Long Sleeve",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71eDrn5syuL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-sleeveless-v-neck-split-maxi-cocktail",
      "title": "Womens Maxi Dress Sleeveless V Neck Split Maxi Cocktail",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/61YT6HmofvL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 78.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/611Z2H2pIPL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-mermaid",
      "title": "Womens Maxi Dress Mermaid",
      "price": 169.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71XYPHhe+uL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-sleeveless-bodycon-maxi",
      "title": "Womens Maxi Dress Cocktail Sleeveless Bodycon Maxi",
      "price": 37.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51FUujLrYsL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-formal-maxi",
      "title": "Womens Maxi Dress Evening Formal Maxi",
      "price": 69.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61XpYmQl2ZL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 590.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/71CT2AtRKzL._SL1500_.jpg"
      ]
    }
  ]
}