{
  "id": "womens-maxi-dress-maxi-ruched-long-sleeve",
  "handle": "womens-maxi-dress-maxi-ruched-long-sleeve",
  "sku": "JC1406",
  "asin": "B0DG7Y4C2M",
  "title": "Womens Maxi Dress Maxi Ruched Long Sleeve",
  "title_original": "Dokotoo Womens 2024 Wrap V-Neck Twist Knot Long Sleeve Empire Waist Midi Maxi Dress A-Line Ruched Flowy Dress with Pockets",
  "brand": "Visit the Dokotoo Store",
  "price": 44.99,
  "social_proof": {
    "bought_past_month": 906,
    "text": "906+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/61X8e51a0bL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71mHROVuw+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71OGLeRsZlL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71-0UBEMEjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/718U9pIAXdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/711iq1PEiML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61H6+DIExtL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71+vDcb-9kL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/717RO02o-wL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Z4TavB91L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41U8oikbm8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51gpj81KzWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51FNHusc19L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51vS7VSGpaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61e4cPubeHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71L62vGicCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71nFpl0UdUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71md0OdJXfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/618Z7Bu4MRL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71snwpRyIlL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71NnEIEGxzL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51oCG9PmjrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71-tisWN92L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61TYrJpCJbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71YJupChMEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71UsSS+3kFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71xRXWEcphL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Gjkc+nRPL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71AKbNlavqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ziZiSCp8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/711speJI+lL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/61X8e51a0bL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71mHROVuw+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71OGLeRsZlL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71-0UBEMEjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/718U9pIAXdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/711iq1PEiML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61H6+DIExtL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71+vDcb-9kL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/717RO02o-wL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Z4TavB91L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41U8oikbm8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51gpj81KzWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51FNHusc19L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51vS7VSGpaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61e4cPubeHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71L62vGicCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71nFpl0UdUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71md0OdJXfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/618Z7Bu4MRL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71snwpRyIlL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71NnEIEGxzL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51oCG9PmjrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71-tisWN92L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61TYrJpCJbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71YJupChMEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71UsSS+3kFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71xRXWEcphL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Gjkc+nRPL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71AKbNlavqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ziZiSCp8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/711speJI+lL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Item model number ‏": "‎ WGJW6121363",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ July 1, 2024",
    "ASIN ‏": "‎ B0D53SBM7H",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#96,088 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #4,658 in Women's Casual Dresses",
    "Customer Reviews": "4.0 4.0 out of 5 stars (259)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Wine",
      "Brown",
      "Pink",
      "Beige",
      "Blue",
      "Black",
      "Green"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.0,
    "count": 259,
    "customers_say": "Customers find the dress stylish, comfortable, and flattering, particularly noting how it shows off curves without being too revealing. Moreover, the color matches the product pictures, and customers like its quality, with one mentioning it's perfect for fall/winter. However, the fit receives mixed feedback, with some finding it great while others say it doesn't match the description. The fabric quality and weight also get mixed reviews, with some praising the thick material while others express disappointment. Generated from the text of customer reviews Select to learn more Style (43) Flattering (25) Comfort (19) Color (13) Dress quality (13) Fit (36) Fabric quality (18) Fabric weight (18) 43 customers mention style, 38 positive, 5 negative 43 customers mention \"Style\" 38 positive 5 negative Customers find the dress pretty and of great quality, with one customer noting its unique details. \" ...This little piece is super cute and classy! I got a large and it is perfect to cover the momma bump but yet show the curves in all the right places.... \" Read more \" Cute , I feel like could fit a little weird. Seems to be a heavier dress. The color is great for fall. \" Read more \" This is such a cute dress ! The wrap style is so flattering and comfortable.... \" Read more \" Classy but heavier fabric than expected... \" Read more 25 customers mention flattering, 20 positive, 5 negative 25 customers mention \"Flattering\" 20 positive 5 negative Customers find the dress flattering, particularly noting how it shows off curves without being too revealing, and one customer mentions it effectively hides their waist in the front. \" I didn’t take the best picture, but this dress is very flattering . It’s forgiving as as well as good at emphasizing an hourglass silhouette.... \" Read more \" This dress fits nicely and is flattering . The material is heavier than I expected.... \" Read more \" Love it! Flattering cut ! \" Read more \" ... Made me look pregnant . Didn’t flatter my figure. Almost looked like a nightgown on me.... \" Read more 19 customers mention comfort, 18 positive, 1 negative 19 customers mention \"Comfort\" 18 positive 1 negative Customers find the dress comfortable, with one mentioning they don't feel any scratching. \" ...For being 5’4”, the length was also very awkward. It was comfortable , but offered no lining and didn’t suit the wedding guest look. \" Read more \" Super cute and comfy but had a horrible chemical smell out of the bag. Ive washed it 3 times and it still reeks. \" Read more \" Great fit and quality for a very reasonable price. Extremely comfortable dress . \" Read more \" Love this dress! Very flattering. Super comfortable to wear . Lots of colors to pick from. Purchased the brown. True to size, fit perfectly.... \" Read more 13 customers mention color, 11 positive, 2 negative 13 customers mention \"Color\" 11 positive 2 negative Customers are satisfied with the dress's color, noting that it matches the pictures accurately, and one customer mentions there are multiple color options to choose from. \" ...Seems to be a heavier dress. The color is great for fall . \" Read more \" Beautiful dress. This is a very nice dress. Nice thick material. Beautiful rich color . I got a size Large.... \" Read more \" ...The color is deep and it would pack well without wrinkles. \" Read more \" ...The burgundy was OK but I didn't feel like it was terribly flattering. Looked a little baggy even though it technically flowed well.... \" Read more 13 customers mention dress quality, 12 positive, 1 negative 13 customers mention \"Dress quality\" 12 positive 1 negative Customers find the dress to be of good quality, with one mentioning it works well for November weddings and another noting it's perfect for fall and winter. \" Great dress ! I’m 46 years old, and this dress was perfect! I wore it to a fancy dinner and received many compliments.... \" Read more \" The dress is a heavier fabric, perfect for fall/winter . The bodice is cute and the fit it perfect to accommodate a growing baby bump.... \" Read more \" Very flattering, it covers menobelly. Wear a good bra and if you want, a camisole for cleavage. The fabric is nice weight jersey type.... \" Read more \" This festive red color was perfect for the holidays .... \" Read more 36 customers mention fit, 24 positive, 12 negative 36 customers mention \"Fit\" 24 positive 12 negative Customers have mixed opinions about the dress's fit, with some finding it great while others say it feels weird. \" ...is very soft and has a good weight to it, quality fabric and fits well . \" Read more \" Cute dress but kinda baggy and material is heavy \" Read more \" ...Lots of colors to pick from. Purchased the brown. True to size, fit perfectly . Very versatile. Breathable. \" Read more \" I am tall and more plus size by this is a flattering fit . Paired with heels it looks very nice.... \" Read more 18 customers mention fabric quality, 9 positive, 9 negative 18 customers mention \"Fabric quality\" 9 positive 9 negative Customers have mixed opinions about the fabric quality of the dress, with some praising its thick construction while others express disappointment. \" Thin cotton … shows every curve and bulge \" Read more \" I recently purchased a dress and was thoroughly disappointed. The fabric felt cheap and scratchy, completely contrary to the description that... \" Read more \" ...Its very flattering and the color was justvas pictured. The fabric was thick and soft and overall a great quality dress. \" Read more \" Fabric is not at all what i expected. Super wrinkly. Ivory dress is SEE THROUGH. Cut is not flattering. Looks like a flour sack. Very disappointing. \" Read more 18 customers mention fabric weight, 9 positive, 9 negative 18 customers mention \"Fabric weight\" 9 positive 9 negative Customers have mixed opinions about the fabric weight of the dress, with some finding it average and not heavy or slinky, while others describe it as heavy. \" The dress is a heavier fabric , perfect for fall/winter. The bodice is cute and the fit it perfect to accommodate a growing baby bump.... \" Read more \" The design of the dress is a good one, but the fabric is heavy and makes the overall appearance frumpy like a nightgown.... \" Read more \" ...It is made of a very durable, thick, heavy material . The stretch gives just enough and the pockets are a huge bonus! I got black, for a funeral. \" Read more \" The dress is heavy and stretchy. Doesn’t hang evenly. \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Flattering fit",
        "body": "Very flattering, it covers menobelly. Wear a good bra and if you want, a camisole for cleavage. The fabric is nice weight jersey type. The skirt has pockets, but they don't add bulk. I am 5'4\" and it is a little long, but will look great with boots in the fall. Or heels, although then I would have to stand still and just look pretty in the dress,lol. I am over 60, look in early to mid 50s, and I don't feel that this is too youthful. I may have to order another color. I got the black \" in case\" since I ate my way out of my other black dress for fall. For the record, I am a large 6 or a small 8 and this is a medium. Read more",
        "author": "LAS",
        "rating": 5.0,
        "date": "April 8, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Very nice beautiful dress",
        "body": "Beautiful dress. This is a very nice dress. Nice thick material. Beautiful rich color. I got a size Large. I have a fairly large top area and the dress hung straight down in the front and I didn’t like the look. Made me look pregnant. Didn’t flatter my figure. Almost looked like a nightgown on me. Also I think I have fairly average length of arms and the sleeves were about 2” too long. Made the sleeves way too blousy. Sad bc I really wanted to keep this dress. I’ve found that many of the tops I order have sleeves that are way too long. I have to cuff them. Don’t know if that’s a “China” thing or what. I would say to definitely “try” this dress! It might look amazing on you! Read more",
        "author": "Lori Y",
        "rating": 4.0,
        "date": "March 6, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Classy!",
        "body": "I looked for a dress for my daughter’s dedication at church for weeks. I could not for the life of me find anything that was appealing with my hour glass shape and past my knees. This little piece is super cute and classy! I got a large and it is perfect to cover the momma bump but yet show the curves in all the right places. The sleeves at the wrist and up at the shoulders are so cute; as well as the bottom. The detail is just so unique. I was looking for a blue to match my daughter and the dark blue was perfect! The material is a nice light and not heavy or slinky material too; those are never appealing on me and this is the total opposite. I love the fit and design of this dress and highly recommend for a date night, graduation, church occasion, dinner dance, holiday, etc. you won’t regret it! Also, the neck line is so cute; isn’t too revealing but like I said classy! Read more",
        "author": "Hope Garlena",
        "rating": 5.0,
        "date": "January 23, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Super Cute",
        "body": "I LOVE THIS DRESS!!! It’s pretty. It’s warm, it goes with most styles! It fir me very well! If I didn’t already have one, I’d buy another. Read more",
        "author": "Tabitha J.",
        "rating": 5.0,
        "date": "November 19, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Sleeves were oversized!",
        "body": "The dress is a heavier fabric, perfect for fall/winter. The bodice is cute and the fit it perfect to accommodate a growing baby bump. Sadly, the sleeves were huge. The were both too long and too big— it felt like the sewed the sleeves of a L or XL onto a small bodice. I was very disappointed, otherwise this would have been a lovely seasonal dress that could be casual and comfy or dressed up. If you have large shoulders and arms, this would probably be a very good fit for you! Read more",
        "author": "Bailey",
        "rating": 3.0,
        "date": "October 9, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "1.0 out of 5 stars Not very formal",
        "body": "I bought this in hopes of wearing it for a fall wedding, but the material was like a thick knit t-shirt material. For being 5’4”, the length was also very awkward. It was comfortable, but offered no lining and didn’t suit the wedding guest look. Read more",
        "author": "J1234P",
        "rating": 1.0,
        "date": "November 3, 2024",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars 5 stars",
        "body": "I didn’t take the best picture, but this dress is very flattering. It’s forgiving as as well as good at emphasizing an hourglass silhouette. It’s a warmer dress, which is great for winter. I love the deep color for the holidays. While it is a warmer dress it doesn’t feel like it’s too much. It did come kind of wadded in the package and incredibly wrinkled as you can see in the photo. The fabric is very soft, the length is good and the fabric weight is nice for winter, fall, and early spring. Read more",
        "author": "Tim C.",
        "rating": 5.0,
        "date": "November 29, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71nN4q6zrLL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "2.0 out of 5 stars Fancy nightgown",
        "body": "Looks like a nightgown. The material is thick, but not what I was expecting based on the pictures and descriptions. Read more",
        "author": "Tor",
        "rating": 2.0,
        "date": "December 21, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Maxi Ruched Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.",
  "about_this_item": "Womens Maxi Dress Maxi Ruched Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.",
  "long_description": "Womens Maxi Dress Maxi Ruched Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Wine, Brown, Pink, Beige, Blue, Black, Green. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Maxi Ruched Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Wine, Brown, Pink, Beige, Blue, Black, Green. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "b35d9c54-5681-4a16-9ad1-397b3d6bcd88",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b35d9c54-5681-4a16-9ad1-397b3d6bcd88/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b35d9c54-5681-4a16-9ad1-397b3d6bcd88/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/b8f7948e-390e-4aa7-bca4-0652af984e25.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "9853bc0d-ba28-4473-b9bd-74c927d3a452",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9853bc0d-ba28-4473-b9bd-74c927d3a452/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9853bc0d-ba28-4473-b9bd-74c927d3a452/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/b8f7948e-390e-4aa7-bca4-0652af984e25.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "58ad8fbf-fa25-4bd7-b664-fa59a711d079",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/58ad8fbf-fa25-4bd7-b664-fa59a711d079/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/58ad8fbf-fa25-4bd7-b664-fa59a711d079/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/b8f7948e-390e-4aa7-bca4-0652af984e25.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "5e1045ef-a345-442b-870a-e6220a863770",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5e1045ef-a345-442b-870a-e6220a863770/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5e1045ef-a345-442b-870a-e6220a863770/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/b8f7948e-390e-4aa7-bca4-0652af984e25.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "0909342c-62b1-4103-acbe-40a9e46ed086",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0909342c-62b1-4103-acbe-40a9e46ed086/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0909342c-62b1-4103-acbe-40a9e46ed086/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/b8f7948e-390e-4aa7-bca4-0652af984e25.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "c73807b4-06b1-4151-a599-aa0359e1c4ce",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c73807b4-06b1-4151-a599-aa0359e1c4ce/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c73807b4-06b1-4151-a599-aa0359e1c4ce/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/b8f7948e-390e-4aa7-bca4-0652af984e25.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "5881be66-635f-4b6f-8821-77073f990e7e",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5881be66-635f-4b6f-8821-77073f990e7e/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5881be66-635f-4b6f-8821-77073f990e7e/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/b8f7948e-390e-4aa7-bca4-0652af984e25.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "542c7aba-583c-4933-ba44-595ffa77b501",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/542c7aba-583c-4933-ba44-595ffa77b501/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/542c7aba-583c-4933-ba44-595ffa77b501/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/b8f7948e-390e-4aa7-bca4-0652af984e25.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "c6904504-8863-47fc-b722-bf396f806f33",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c6904504-8863-47fc-b722-bf396f806f33/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c6904504-8863-47fc-b722-bf396f806f33/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/b8f7948e-390e-4aa7-bca4-0652af984e25.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "78948bb5-88cc-4dce-98fa-d4597ca04adf",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/78948bb5-88cc-4dce-98fa-d4597ca04adf/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/78948bb5-88cc-4dce-98fa-d4597ca04adf/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/b8f7948e-390e-4aa7-bca4-0652af984e25.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "1fed8c3c-4ba5-4218-a0d9-d08e2610fbaf",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1fed8c3c-4ba5-4218-a0d9-d08e2610fbaf/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1fed8c3c-4ba5-4218-a0d9-d08e2610fbaf/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/b8f7948e-390e-4aa7-bca4-0652af984e25.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "45d02efb-0c62-4b11-86b9-2ba6d9a904d8",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/45d02efb-0c62-4b11-86b9-2ba6d9a904d8/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/45d02efb-0c62-4b11-86b9-2ba6d9a904d8/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/b8f7948e-390e-4aa7-bca4-0652af984e25.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Wine": "https://m.media-amazon.com/images/I/31Cl3c84H7L._AC_SR38,50_.jpg",
    "Brown": "https://m.media-amazon.com/images/I/41EUhOt0-wL._AC_SR38,50_.jpg",
    "Pink": "https://m.media-amazon.com/images/I/41U8oikbm8L._AC_SR38,50_.jpg",
    "Beige": "https://m.media-amazon.com/images/I/31O0wVqVRXL._AC_SR38,50_.jpg",
    "Blue": "https://m.media-amazon.com/images/I/41cIFTDPgCL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31WmvYN9ZlL._AC_SR38,50_.jpg",
    "Green": "https://m.media-amazon.com/images/I/41m4UQyAs1L._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Wine": "61X8e51a0bL",
    "Brown": "61H6+DIExtL",
    "Pink": "41U8oikbm8L",
    "Beige": "61e4cPubeHL",
    "Blue": "618Z7Bu4MRL",
    "Black": "61TYrJpCJbL",
    "Green": "61Gjkc+nRPL"
  },
  "color_images": {
    "Wine": [
      "https://m.media-amazon.com/images/I/61X8e51a0bL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71mHROVuw+L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71OGLeRsZlL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71-0UBEMEjL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/718U9pIAXdL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/711iq1PEiML._SL1500_.jpg"
    ],
    "Brown": [
      "https://m.media-amazon.com/images/I/61H6+DIExtL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71+vDcb-9kL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/717RO02o-wL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71Z4TavB91L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/711iq1PEiML._SL1500_.jpg"
    ],
    "Pink": [
      "https://m.media-amazon.com/images/I/41U8oikbm8L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/51gpj81KzWL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/51FNHusc19L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/51vS7VSGpaL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/711iq1PEiML._SL1500_.jpg"
    ],
    "Beige": [
      "https://m.media-amazon.com/images/I/61e4cPubeHL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71L62vGicCL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71nFpl0UdUL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71md0OdJXfL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/711iq1PEiML._SL1500_.jpg"
    ],
    "Blue": [
      "https://m.media-amazon.com/images/I/618Z7Bu4MRL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71snwpRyIlL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71NnEIEGxzL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/51oCG9PmjrL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71-tisWN92L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/711iq1PEiML._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/61TYrJpCJbL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71YJupChMEL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71UsSS+3kFL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71xRXWEcphL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/711iq1PEiML._SL1500_.jpg"
    ],
    "Green": [
      "https://m.media-amazon.com/images/I/61Gjkc+nRPL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71AKbNlavqL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71ziZiSCp8L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/711speJI+lL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/711iq1PEiML._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress-ruched-cocktail",
      "title": "Womens Dress Ruched Cocktail",
      "price": 36.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/617Qr1lS0qL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-sleeveless-bodycon-ruched",
      "title": "Womens Dress Sleeveless Bodycon Ruched",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51EWsjCbSKL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 255.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/715l5TiICDL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 47.49,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71Rc0Nk4IdL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-sleeveless-bodycon-cocktail",
      "title": "Womens Dress Sleeveless Bodycon Cocktail",
      "price": 56.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61YgtRC0RkL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 345.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71+iIZQZYxL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-off-shoulder-formal-sleeveless-cocktail",
      "title": "Womens Maxi Dress Off Shoulder Formal Sleeveless Cocktail",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61ML72R5uSL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 389.55,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/717dKlwUK-L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-maxi",
      "title": "Womens Maxi Dress Cocktail Maxi",
      "price": 40.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71zhmeSQkaL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-cocktail-mermaid-evening-split-maxi",
      "title": "Womens Maxi Dress Formal Cocktail Mermaid Evening Split Maxi",
      "price": 72.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71CJS69x3xL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-formal",
      "title": "Womens Maxi Dress Evening Formal",
      "price": 81.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51hiWK+lNdL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 14.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/613okEvjDbL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-short-sleeve",
      "title": "Womens Dress Short Sleeve",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/81Kei2pEPGL._SL1500_.jpg"
      ]
    }
  ]
}