{
  "id": "womens-maxi-dress-long-sleeve",
  "handle": "womens-maxi-dress-long-sleeve",
  "sku": "JC2268",
  "asin": "B0DG59LG1H",
  "title": "Womens Maxi Dress Long Sleeve",
  "title_original": "PRETTYGARDEN Long Sleeve Dress for Women 2026 Fall Elegant Modest Floral Boho Smocked Flowy Wedding Guest Midi Dresses",
  "brand": "Visit the PRETTYGARDEN Store",
  "price": 57.99,
  "social_proof": {
    "bought_past_month": 1338,
    "text": "1338+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/71BYO6+51aL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81eR0770UYL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81LafH6kg8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81J4x0wXG8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81-Ndfv7EpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81702mLavEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81cpZCmdPgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81aOTccFq+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81uu5OKONEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81BL55-JZnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81Cu9hbwEkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81h7jzt2XVL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/811UGlf9pGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71dkHgC03EL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81G8arfd7vL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/71BYO6+51aL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81eR0770UYL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81LafH6kg8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81J4x0wXG8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81-Ndfv7EpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81702mLavEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81cpZCmdPgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81aOTccFq+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81uu5OKONEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81BL55-JZnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81Cu9hbwEkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81h7jzt2XVL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/811UGlf9pGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71dkHgC03EL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81G8arfd7vL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Package Dimensions ‏": "‎ 8 x 5 x 2 inches; 4.8 ounces",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ November 8, 2024",
    "ASIN ‏": "‎ B0DG5CYLK3",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#95,509 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #1,047 in Women's Casual Dresses",
    "Customer Reviews": "4.3 4.3 out of 5 stars (277)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Dark Green",
      "Light Blue",
      "Navy",
      "Wine Red",
      "Bean Paste Pink",
      "Apricot",
      "Black",
      "Brick Red"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.3,
    "count": 277,
    "customers_say": "Customers find the dress comfortable and flattering, with one mentioning it hides tummy and cellulite. The fabric receives positive feedback for being thick and nice, and customers consider it must-have for fall wardrobes. They like the style, with one noting it looks more expensive than it is, and appreciate the fit, with one describing how it hugs the right curves without being too tight. Opinions about sizing are mixed, with some finding it true to size while others say it runs larger than stated. Generated from the text of customer reviews Select to learn more Fit (36) Style (26) Dress quality (17) Comfort (16) Fabric quality (13) Color (8) Flattering (8) Size (9) 36 customers mention fit, 26 positive, 10 negative 36 customers mention \"Fit\" 26 positive 10 negative Customers like how the dress fits, with one mentioning it hugs the right curves without being too tight. \" Easy care and great fit . Just right for my needs. \" Read more \" ...So comfortable and soft fabric. Nicely stitched also. The fit was perfect . Medium fits size 8-10 Miss. I am very pleased. \" Read more \" The dress is very pretty, but I returned it because the bodice was so tight it was hard to breathe. I have two other... \" Read more \" Love this brand. Well-made and nice Fabrics. It fits nicely . \" Read more 26 customers mention style, 26 positive, 0 negative 26 customers mention \"Style\" 26 positive 0 negative Customers find the dress attractive, with one customer noting its gorgeous color and another mentioning it looks more expensive than it is. \" Beautiful dress and so easy to launder. Just hang dry! I got oodles of complements on it. So comfortable and soft fabric. Nicely stitched also.... \" Read more \" I love it ! Very pretty and true to size and it has Pockets , very nice material \" Read more \" ...felt like and thought when I first tried on this dress is that it very feminine and beautiful.... \" Read more \" Beautiful and classy and fit really well \" Read more 17 customers mention dress quality, 17 positive, 0 negative 17 customers mention \"Dress quality\" 17 positive 0 negative Customers find this dress to be of good quality and suitable for fall wardrobes, with one customer mentioning it's perfect for weddings. \" Lovely dress runs a bit smaller than most dressed. I’m 5 feet 110- 20 pounds Wear an ex small/small depending on the stretch.... \" Read more \" Great dress ! I was worried the material might be rough but it is very pleasant \" Read more \" Love this dress . The fit was perfect and I did receive compliments while wearing. \" Read more \" This dress is a must for your fall wardrobe . Pair it with boots and a jean jacket and you are good to go!! \" Read more 16 customers mention comfort, 15 positive, 1 negative 16 customers mention \"Comfort\" 15 positive 1 negative Customers find the dress comfortable. \" ...The fabric was thick but comfortable . I liked the stretchiness of the outfit and it was the first time I had a flattering dress fit.... \" Read more \" ...It is a perfect fit and very attractive. Very comfortable and has pockets which is always a plus. Great length. Highly recommend the dress! \" Read more \" ...Just hang dry! I got oodles of complements on it. So comfortable and soft fabric. Nicely stitched also. The fit was perfect.... \" Read more \" ...The dress was incredibly well made, fit like a glove and super comfortable .... \" Read more 13 customers mention fabric quality, 10 positive, 3 negative 13 customers mention \"Fabric quality\" 10 positive 3 negative Customers appreciate the fabric quality of the dress, noting it is thick and nice, with one customer mentioning it has a nice flow. \" I loved the sleeve and skirt length of this dress. The fabric was thick but comfortable.... \" Read more \" ...— it hugs the right curves without being too tight, and the fabric has a nice flow that makes it feel really feminine.... \" Read more \" ...This fabric is really nice both in looks and texture, although I am so past the flounces -- but the sizing of my dress is as if it is a Medium. \" Read more \" ...the fact that the lace is very white against the fabric, and the fabric looks cheap . Very disappointed. \" Read more 8 customers mention color, 6 positive, 2 negative 8 customers mention \"Color\" 6 positive 2 negative Customers like the dress's color. \" It’s a beautiful dress with beautiful color but It runs big. I normally wear large and large in this outfit was too lose \" Read more \" ...I AM OBSESSED WITH THIS DRESS!!!! The color is gorgeous . The fit is classy, yet fitted, to show your waist.... \" Read more \" I agree with the fact that the lace is very white against the fabric , and the fabric looks cheap. Very disappointed. \" Read more \" The dress is quite pretty. Good quality and true to color ...true to size also. I was complimented more than once the first time I wore it. \" Read more 8 customers mention flattering, 7 positive, 1 negative 8 customers mention \"Flattering\" 7 positive 1 negative Customers find the dress flattering, with one mentioning it hides tummy and cellulite, while another notes its full coverage. \" ...The bodice is a stretchy material but still flattering . \" Read more \" ...The style is gorgeous and I think would be flattering for everyone .... \" Read more \" ...Due to the high neckline and full coverage , I did look very homely and right out of the Handmaid Tale series. It was gutting having to send it back.... \" Read more \" ...The fit is classy, yet fitted, to show your waist. It hides everythinggggg , I didn’t even need to wear shapewear with this, and it still hides my... \" Read more 9 customers mention size, 6 positive, 3 negative 9 customers mention \"Size\" 6 positive 3 negative Customers have mixed experiences with the dress's sizing, with some finding it true to size while others report it being much larger than stated. \" I love it ! Very pretty and true to size and it has Pockets , very nice material \" Read more \" It’s a beautiful dress with beautiful color but It runs big . I normally wear large and large in this outfit was too lose \" Read more \" The dress is quite pretty. Good quality and true to color... true to size also . I was complimented more than once the first time I wore it. \" Read more \" ...The length is perfect for showing off your dress shoes! The size is accurate ! Recommend! \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Flattering!",
        "body": "Fit is quite flattering. For reference, I am in a size large, 5'5\" and 180 lbs and wearing a compression garment underneath. Fit is a bit snug around the upper waist but not uncomfortable for me. Read more",
        "author": "Misti",
        "rating": 5.0,
        "date": "December 8, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71WVSlQ0MgL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Elegant, Comfortable, and Flattering!",
        "body": "This dress is a total win! The fit is so flattering — it hugs the right curves without being too tight, and the fabric has a nice flow that makes it feel really feminine. I wore it to a wedding and got so many compliments throughout the night! The material feels high-quality and breathable, which kept me comfortable even after hours of dancing. I also love the little details like the stitching and the way it drapes — it looks much more expensive than it is. Whether you're dressing it up with heels or keeping it casual with sandals, it’s super versatile. I’m already eyeing it in another color! Read more",
        "author": "Sydnee",
        "rating": 5.0,
        "date": "April 30, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Very feminine...",
        "body": "The first thing I felt like and thought when I first tried on this dress is that it very feminine and beautiful. The style is gorgeous and I think would be flattering for everyone. The white detail around the bottom part of the dress adds an extra special uniqueness. The material is lightweight and comfortable and the fit is true to size. Read more",
        "author": "Doodleartlover",
        "rating": 5.0,
        "date": "August 25, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Nice church or dressy occasion dress.",
        "body": "lovely dress, heavy material so it’s great for fall. my only negative it was longer than i expected. i thought it would be a mid calf length but more of an ankle length on me. im 5’5. Read more",
        "author": "Tinksmom",
        "rating": 4.0,
        "date": "September 8, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Tight fit",
        "body": "Beautiful dress but runs tight across abdomen. I'd like to exchange it for an XXL but the price us up too high. Too bad Read more",
        "author": "Susan Livingood",
        "rating": 3.0,
        "date": "October 10, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Pretty dress",
        "body": "The dress is quite pretty. Good quality and true to color...true to size also. I was complimented more than once the first time I wore it. Read more",
        "author": "Patti Christensen",
        "rating": 5.0,
        "date": "September 20, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Well worth the money dress",
        "body": "Love this brand. Well-made and nice Fabrics. It fits nicely. Read more",
        "author": "Randall L Colwell",
        "rating": 5.0,
        "date": "December 7, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Pretty garden long sleeve dress",
        "body": "Lovely dress runs a bit smaller than most dressed. I’m 5 feet 110- 20 pounds Wear an ex small/small depending on the stretch. This small is wearable but will upsize when ordering another color. Read more",
        "author": "Joanne",
        "rating": 5.0,
        "date": "September 6, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.",
  "about_this_item": "Womens Maxi Dress Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.",
  "long_description": "Womens Maxi Dress Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Dark Green, Light Blue, Navy, Wine Red, Bean Paste Pink, Apricot, Black, Brick Red. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Dark Green, Light Blue, Navy, Wine Red, Bean Paste Pink, Apricot, Black, Brick Red. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "705eb2bd-aec4-40f7-9d51-9fe9cd13205c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/705eb2bd-aec4-40f7-9d51-9fe9cd13205c/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/705eb2bd-aec4-40f7-9d51-9fe9cd13205c/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/89da5ace-4ec8-473c-b918-b738bffd4323.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "c500c2af-fcfa-420c-acfc-0df4ac7a117a",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c500c2af-fcfa-420c-acfc-0df4ac7a117a/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c500c2af-fcfa-420c-acfc-0df4ac7a117a/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/89da5ace-4ec8-473c-b918-b738bffd4323.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "96cb72d7-6987-4425-a16b-f0e3e664c7b4",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/96cb72d7-6987-4425-a16b-f0e3e664c7b4/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/96cb72d7-6987-4425-a16b-f0e3e664c7b4/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/89da5ace-4ec8-473c-b918-b738bffd4323.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "e0a33216-8699-41ea-8153-70e9e0f302fe",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e0a33216-8699-41ea-8153-70e9e0f302fe/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e0a33216-8699-41ea-8153-70e9e0f302fe/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/89da5ace-4ec8-473c-b918-b738bffd4323.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "9c0be76f-ee46-498b-9ca5-b2973e1ebd44",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9c0be76f-ee46-498b-9ca5-b2973e1ebd44/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9c0be76f-ee46-498b-9ca5-b2973e1ebd44/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/89da5ace-4ec8-473c-b918-b738bffd4323.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "0f7a8dbe-8249-46b2-b34f-5a8af8937dce",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0f7a8dbe-8249-46b2-b34f-5a8af8937dce/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0f7a8dbe-8249-46b2-b34f-5a8af8937dce/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/89da5ace-4ec8-473c-b918-b738bffd4323.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "85b4688b-4221-4beb-a704-7944b5304821",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/85b4688b-4221-4beb-a704-7944b5304821/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/85b4688b-4221-4beb-a704-7944b5304821/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/89da5ace-4ec8-473c-b918-b738bffd4323.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "0a01f239-0a2c-43c9-a552-36a8ab1f7e77",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0a01f239-0a2c-43c9-a552-36a8ab1f7e77/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0a01f239-0a2c-43c9-a552-36a8ab1f7e77/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/89da5ace-4ec8-473c-b918-b738bffd4323.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "31e3da3a-aa12-4e7c-84ff-d145cd8c3535",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/31e3da3a-aa12-4e7c-84ff-d145cd8c3535/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/31e3da3a-aa12-4e7c-84ff-d145cd8c3535/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/89da5ace-4ec8-473c-b918-b738bffd4323.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "abbb0f52-8536-454a-ae22-f986bc9c10cb",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/abbb0f52-8536-454a-ae22-f986bc9c10cb/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/abbb0f52-8536-454a-ae22-f986bc9c10cb/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/89da5ace-4ec8-473c-b918-b738bffd4323.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "4a182ab7-8aea-4857-9b36-67a6d7ad1352",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4a182ab7-8aea-4857-9b36-67a6d7ad1352/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4a182ab7-8aea-4857-9b36-67a6d7ad1352/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/89da5ace-4ec8-473c-b918-b738bffd4323.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "56a002b0-1d0f-4d98-873e-214a144ea0d1",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/56a002b0-1d0f-4d98-873e-214a144ea0d1/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/56a002b0-1d0f-4d98-873e-214a144ea0d1/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/89da5ace-4ec8-473c-b918-b738bffd4323.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Dark Green": "https://m.media-amazon.com/images/I/41kOiu5nmrL._AC_SR38,50_.jpg",
    "Light Blue": "https://m.media-amazon.com/images/I/317nthg2uwL._AC_SR38,50_.jpg",
    "Navy": "https://m.media-amazon.com/images/I/31aQYoNclEL._AC_SR38,50_.jpg",
    "Wine Red": "https://m.media-amazon.com/images/I/31u5BQRsmIL._AC_SR38,50_.jpg",
    "Bean Paste Pink": "https://m.media-amazon.com/images/I/31g0Hij99jL._AC_SR38,50_.jpg",
    "Apricot": "https://m.media-amazon.com/images/I/31mWTRkwGfL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/3104tjFc97L._AC_SR38,50_.jpg",
    "Brick Red": "https://m.media-amazon.com/images/I/413-gF6jIOL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Dark Green": "81uu5OKONEL",
    "Light Blue": "81BL55-JZnL",
    "Navy": "71BYO6+51aL",
    "Wine Red": "81Cu9hbwEkL",
    "Bean Paste Pink": "81h7jzt2XVL",
    "Apricot": "811UGlf9pGL",
    "Black": "71dkHgC03EL",
    "Brick Red": "81G8arfd7vL"
  },
  "color_images": {
    "Dark Green": [
      "https://m.media-amazon.com/images/I/81uu5OKONEL._SL1500_.jpg"
    ],
    "Light Blue": [
      "https://m.media-amazon.com/images/I/81BL55-JZnL._SL1500_.jpg"
    ],
    "Navy": [
      "https://m.media-amazon.com/images/I/71BYO6+51aL._SL1500_.jpg"
    ],
    "Wine Red": [
      "https://m.media-amazon.com/images/I/81Cu9hbwEkL._SL1500_.jpg"
    ],
    "Bean Paste Pink": [
      "https://m.media-amazon.com/images/I/81h7jzt2XVL._SL1500_.jpg"
    ],
    "Apricot": [
      "https://m.media-amazon.com/images/I/811UGlf9pGL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/71dkHgC03EL._SL1500_.jpg"
    ],
    "Brick Red": [
      "https://m.media-amazon.com/images/I/81G8arfd7vL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress-cocktail-bodycon",
      "title": "Womens Dress Cocktail Bodycon",
      "price": 47.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61NfEwzl3xL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-one-shoulder-maxi-formal",
      "title": "Womens Maxi Dress Evening One Shoulder Maxi Formal",
      "price": 69.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/5150AIQL4eL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail",
      "title": "Womens Dress Cocktail",
      "price": 103.54,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61JApwce25L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-formal-bodycon-evening-sleeveless",
      "title": "Womens Maxi Dress Maxi Formal Bodycon Evening Sleeveless",
      "price": 61.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61s8qg6u1VL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 158.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71PmRANW40L._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress-bodycon-split-ruched-off-shoulder",
      "title": "Womens Dress Bodycon Split Ruched Off Shoulder",
      "price": 38.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/41JjYcPgcpL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 95.61,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Work",
      "images": [
        "https://m.media-amazon.com/images/I/71hVgSIB1jL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 138.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51PZNrlyY9L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-split-evening-formal",
      "title": "Womens Maxi Dress Split Evening Formal",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51BZ1BqPx8L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 65.97,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/81wr8PDg55L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-v-neck",
      "title": "Womens Dress V Neck",
      "price": 82.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/710bSTpZ9hL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 278.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/91YXeyW506L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening-long-sleeve",
      "title": "Womens Maxi Dress Formal Evening Long Sleeve",
      "price": 87.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61nnk+flvaL._SL1500_.jpg"
      ]
    }
  ]
}