{
  "id": "womens-maxi-dress-long-sleeve",
  "handle": "womens-maxi-dress-long-sleeve",
  "sku": "JC2013",
  "asin": "B0DHZ21CVQ",
  "title": "Womens Maxi Dress Long Sleeve",
  "title_original": "Milumia Women's Leopard Print Mini Dress Y2k Bell Long Sleeve Cheetah Short Dresses Going Out Fall 2025",
  "brand": "Visit the Milumia Store",
  "price": 36.99,
  "social_proof": {
    "bought_past_month": 133,
    "text": "133+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/71y2lFeHWNL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71tdecrSVpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71NUwT0DRJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71JInVrRsqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71hRoDNX7RL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71om4fjlOfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71+RXSR9cNL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71R6szL4i9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81S6BzlLb0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/716kSRi8OXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/715EdmVqnvL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/714rRx7XWuL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71X+1TMs3mL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Y6MhqfbaL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/71y2lFeHWNL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71tdecrSVpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71NUwT0DRJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71JInVrRsqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71hRoDNX7RL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71om4fjlOfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71+RXSR9cNL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71R6szL4i9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81S6BzlLb0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/716kSRi8OXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/715EdmVqnvL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/714rRx7XWuL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71X+1TMs3mL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Y6MhqfbaL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ September 26, 2024",
    "ASIN ‏": "‎ B0DX1Z6TZY",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#8,164 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #37 in Women's Casual Dresses #43 in Women's Club & Night Out Dresses",
    "Customer Reviews": "4.4 4.4 out of 5 stars (161)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "All Red",
      "Brown and Grey",
      "All Rust Brown",
      "Brown Multi",
      "All Grey",
      "Pink",
      "All Brown",
      "Dark Black",
      "Purple",
      "Brown and Pink"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.4,
    "count": 161,
    "customers_say": "Customers find the dress cute and comfortable, with a great fit and perfect length. They appreciate its quality, with one customer noting it's perfect for a date night or club scene, and another mentioning it's ideal for a Vegas trip. The dress is flattering and true to size, though opinions about the fabric quality are mixed, with some finding it nice while one customer describes it as cheap. Select to learn more Cute Comfort Fit Quality Length Flattering Size Fabric quality 34 customers mention \"Cute\" 32 positive 2 negative Customers find the dress cute, with one noting its good quality. \"Honestly so cute , didn’t see much reviews on this cheetah print dress so decided to take a chance on it & im so impressed it’s so comfortable and...\" Read more \"Such a cute dress !!! Bought it bc I needed something for the Sabrina carpenter concert and it fit perfectly. True to size and great quality\" Read more \"This aught to rev his engine. Short, slinky, sexy ....\" Read more \"love this thang! so cute and comfortable. fits well and true to size. get many compliments while wearing :)\" Read more 21 customers mention \"Comfort\" 21 positive 0 negative Customers find the dress comfortable. \"Loved! I wore it for a birthday dinner and it was super flattering, comfortable and received a lot of compliments. I paired it with a belt....\" Read more \"I love this dress!! It’s so comfy and flowy and fits to my body well without it being tight in a way that I have to worry about bloating after...\" Read more \"LOVE THIS DRESS. So breathable, so flattering, so comfortable . Not too short. 155 lbs pretty muscular build 5’1, dress fit very well got medium\" Read more \"...I returned and bought the small which is perfect. Very comfortable and light weight. Would say it runs slightly large....\" Read more 20 customers mention \"Fit\" 19 positive 1 negative Customers like how the dress fits. \"This cheetah dress is so cute! It fits true to size , and the length is perfect. I am 5’6” 180lb and chose a Large.\" Read more \"...it bc I needed something for the Sabrina carpenter concert and it fit perfectly . True to size and great quality\" Read more \"...Not too short. 155 lbs pretty muscular build 5’1, dress fit very well got medium\" Read more \"This dress fit perfectly !!! It’s super flattering...\" Read more 15 customers mention \"Quality\" 15 positive 0 negative Customers find the dress to be of great quality, with one mentioning it's perfect for a date night or club scene, while another notes it's ideal for a Vegas trip. \"It is great quality and super comfortable to wear. I didn’t feel like it was too short either. I’m telling you, you won’t regret this purchase!!...\" Read more \" LOVE THIS DRESS . So breathable, so flattering, so comfortable. Not too short. 155 lbs pretty muscular build 5’1, dress fit very well got medium\" Read more \"A good dress . I’m 5’7” 130lb and a medium was just perfect. Not see through, double lined fabric quality.\" Read more \" Loved this dress .\" Read more 10 customers mention \"Length\" 7 positive 3 negative Customers like the dress's length. \"LOVE THIS DRESS. So breathable, so flattering, so comfortable. Not too short . 155 lbs pretty muscular build 5’1, dress fit very well got medium\" Read more \"...more on the curvy side so I was worried about the length but the length was perfect !\" Read more \"Loved the dress! Taking off one star since its a bit longer than depicted (may just be a me problem)....\" Read more \"This cheetah dress is so cute! It fits true to size, and the length is perfect . I am 5’6” 180lb and chose a Large.\" Read more 9 customers mention \"Flattering\" 9 positive 0 negative Customers find the dress flattering. \"Cuuuuute. Flirty and flattering . I purchased this for a date night and wore it with suede knee high boots and a matching handbag....\" Read more \"This dress fit perfectly!!! It’s super flattering ...\" Read more \"LOVE THIS DRESS. So breathable, so flattering , so comfortable. Not too short. 155 lbs pretty muscular build 5’1, dress fit very well got medium\" Read more \"I love this dress. So comfortable and breathable. Very flattering . Perfect stretch and length. I got a small and I'm 5'2 125lbs.\" Read more 9 customers mention \"Size\" 8 positive 1 negative Customers find the dress runs true to size. \"love this thang! so cute and comfortable. fits well and true to size . get many compliments while wearing :)\" Read more \" Runs big .\" Read more \" Cuuuuute . Flirty and flattering. I purchased this for a date night and wore it with suede knee high boots and a matching handbag....\" Read more \"...I didn’t end up wearing it. Size and color were pretty on point but it’s longer than what I was expecting g\" Read more 7 customers mention \"Fabric quality\" 4 positive 3 negative Customers have mixed opinions about the fabric quality of the dress, with some finding it nice while one customer describes it as cheap. \"I’m 5’0 and it did not fit as a midi dress at all. But nice material \" Read more \"Super cute of course it’s cheap fabric , but that’s what you get for the price\" Read more \"Very cute dress, good material , not see-through. True to size - plenty of room to breathe\" Read more \"Not a dress. Sent a shirt. Cheap material .\" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Worth buying ❤️",
        "body": "Cuuuuute. Flirty and flattering. I purchased this for a date night and wore it with suede knee high boots and a matching handbag. It’s the perfect balance of sexy without being immodest. Additionally, the material is stretchy and comfortable, but not very warm despite the long sleeves as they are mesh. But don’t let that deter you from buying the dress! A cute jacket or vest will fix that. Also if you have bigger hips and glutes this dress will be more of a mini dress so that is something to be mindful of. I bought my normal size and I’m very happy with my purchase overall. Read more",
        "author": "BoyMom2",
        "rating": 5.0,
        "date": "December 22, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars So so cute LOVE this dress",
        "body": "Wore this to a surprise party of about 40 ppl and I think everyone there complimented me on the dress atleast 2x. So flattering and so so comfortable. Theres a slip on the inside so not see through at all but the sleeves are sheer and so adorable. I’m 5’3 125 lbs and got a small and it fit so well not too short. Love it Read more",
        "author": "Kassidy",
        "rating": 5.0,
        "date": "October 19, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71M6ocM3XXL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71GuV4IUknL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars so cute and comfy",
        "body": "love this thang! so cute and comfortable. fits well and true to size. get many compliments while wearing :) Read more",
        "author": "P. T.",
        "rating": 5.0,
        "date": "December 15, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Curvy/Girls with booty beware!",
        "body": "I am 5ft 4in tall, weigh 209 pounds and am curvy. I purchased a medium. It fits just fine but wow! If you have even the slightest thigh and butt, you will be wearing this as a shirt. I’m not sure if I want to return yet because it’s still cute asa shirt but the only way I could see myself wearing it as a dress is if I were to buy like maybe an XXL and then it’d actually be a mini dress. Right now, the bottom sliver of my butt cheeks hangs out. So… I mean ..? lol also I do feel it’s slightly different than the picture the way the material presents. I got the red one. Read more",
        "author": "Darnisha",
        "rating": 3.0,
        "date": "October 23, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Cute going dress!",
        "body": "Loved the dress! Taking off one star since its a bit longer than depicted (may just be a me problem). Fabric was breathable enough that I didn't feel too hot in a crowded bar. The material has a black lining for the torso portion into the skirt, but the sleeves are not lined. Read more",
        "author": "Hien Nguyen",
        "rating": 4.0,
        "date": "October 12, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Cute and comfy",
        "body": "Must have in your closet! I ordered a small. I’m 5’5 - 150lbs. Nice dress for date night Read more",
        "author": "Nancy Ruiz",
        "rating": 5.0,
        "date": "December 7, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/81Ayl1VpfHL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Sexy, comfortable, great fit!",
        "body": "This aught to rev his engine. Short, slinky, sexy. Pairing this sex kitten dress with some high heel, over the knee boots That look says \"Come n get it!\" Read more",
        "author": "Psychomaven",
        "rating": 5.0,
        "date": "November 21, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Room to Breathe",
        "body": "Very cute dress, good material, not see-through. True to size - plenty of room to breathe Read more",
        "author": "Cailyn H",
        "rating": 5.0,
        "date": "December 2, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71TW0VXcXjL._SY88._SL1500_.jpg"
        ]
      }
    ]
  },
  "short_description": "Womens Maxi Dress Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.",
  "about_this_item": "Womens Maxi Dress Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.",
  "long_description": "Womens Maxi Dress Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: All Red, Brown and Grey, All Rust Brown, Brown Multi, All Grey, Pink, All Brown, Dark Black, Purple, Brown and Pink. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: All Red, Brown and Grey, All Rust Brown, Brown Multi, All Grey, Pink, All Brown, Dark Black, Purple, Brown and Pink. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "446f8970-fab9-454e-b584-aab44d83b69d",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/446f8970-fab9-454e-b584-aab44d83b69d/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/446f8970-fab9-454e-b584-aab44d83b69d/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/bfdf6284-aa37-4f48-954b-701ad54b2c37.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "d26b7248-53a1-4464-a82c-0338ae2eca3e",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d26b7248-53a1-4464-a82c-0338ae2eca3e/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d26b7248-53a1-4464-a82c-0338ae2eca3e/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/bfdf6284-aa37-4f48-954b-701ad54b2c37.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "9fda2a66-fe25-4393-9806-5a964c79a949",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9fda2a66-fe25-4393-9806-5a964c79a949/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9fda2a66-fe25-4393-9806-5a964c79a949/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/bfdf6284-aa37-4f48-954b-701ad54b2c37.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "40c56ff0-bf7a-4d8b-a463-7dad6e2ff734",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/40c56ff0-bf7a-4d8b-a463-7dad6e2ff734/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/40c56ff0-bf7a-4d8b-a463-7dad6e2ff734/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/bfdf6284-aa37-4f48-954b-701ad54b2c37.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "bc87b563-b984-487a-9613-16ed89740cfd",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bc87b563-b984-487a-9613-16ed89740cfd/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bc87b563-b984-487a-9613-16ed89740cfd/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/bfdf6284-aa37-4f48-954b-701ad54b2c37.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "4dafd551-1ea1-4a1f-9e8d-4a18ca58ac59",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4dafd551-1ea1-4a1f-9e8d-4a18ca58ac59/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4dafd551-1ea1-4a1f-9e8d-4a18ca58ac59/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/bfdf6284-aa37-4f48-954b-701ad54b2c37.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "ff8fc801-91b1-491b-b181-a432b0f9ff21",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ff8fc801-91b1-491b-b181-a432b0f9ff21/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ff8fc801-91b1-491b-b181-a432b0f9ff21/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/bfdf6284-aa37-4f48-954b-701ad54b2c37.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "77dd2d3d-f939-4dc8-963f-0e52562ad794",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/77dd2d3d-f939-4dc8-963f-0e52562ad794/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/77dd2d3d-f939-4dc8-963f-0e52562ad794/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/bfdf6284-aa37-4f48-954b-701ad54b2c37.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "All Red": "https://m.media-amazon.com/images/I/41oDs3dIRsL._AC_SR38,50_.jpg",
    "Brown and Grey": "https://m.media-amazon.com/images/I/41q0bO9kTUL._AC_SR38,50_.jpg",
    "All Rust Brown": "https://m.media-amazon.com/images/I/41qCV2wG57L._AC_SR38,50_.jpg",
    "Brown Multi": "https://m.media-amazon.com/images/I/51nyCWWgtdL._AC_SR38,50_.jpg",
    "All Grey": "https://m.media-amazon.com/images/I/41mzFvF7+cL._AC_SR38,50_.jpg",
    "Pink": "https://m.media-amazon.com/images/I/41-J-+3CJIL._AC_SR38,50_.jpg",
    "All Brown": "https://m.media-amazon.com/images/I/41SiLuzjj-L._AC_SR38,50_.jpg",
    "Dark Black": "https://m.media-amazon.com/images/I/41Ty8a0JFwL._AC_SR38,50_.jpg",
    "Purple": "https://m.media-amazon.com/images/I/41NQ6IgotCL._AC_SR38,50_.jpg",
    "Brown and Pink": "https://m.media-amazon.com/images/I/41X+gogGtwL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "All Red": "71om4fjlOfL",
    "Brown and Grey": "71+RXSR9cNL",
    "All Rust Brown": "71R6szL4i9L",
    "Brown Multi": "81S6BzlLb0L",
    "All Grey": "716kSRi8OXL",
    "Pink": "715EdmVqnvL",
    "All Brown": "71y2lFeHWNL",
    "Dark Black": "714rRx7XWuL",
    "Purple": "71X+1TMs3mL",
    "Brown and Pink": "71Y6MhqfbaL"
  },
  "color_images": {
    "All Red": [
      "https://m.media-amazon.com/images/I/71om4fjlOfL._SL1500_.jpg"
    ],
    "Brown and Grey": [
      "https://m.media-amazon.com/images/I/71+RXSR9cNL._SL1500_.jpg"
    ],
    "All Rust Brown": [
      "https://m.media-amazon.com/images/I/71R6szL4i9L._SL1500_.jpg"
    ],
    "Brown Multi": [
      "https://m.media-amazon.com/images/I/81S6BzlLb0L._SL1500_.jpg"
    ],
    "All Grey": [
      "https://m.media-amazon.com/images/I/716kSRi8OXL._SL1500_.jpg"
    ],
    "Pink": [
      "https://m.media-amazon.com/images/I/715EdmVqnvL._SL1500_.jpg"
    ],
    "All Brown": [
      "https://m.media-amazon.com/images/I/71y2lFeHWNL._SL1500_.jpg"
    ],
    "Dark Black": [
      "https://m.media-amazon.com/images/I/714rRx7XWuL._SL1500_.jpg"
    ],
    "Purple": [
      "https://m.media-amazon.com/images/I/71X+1TMs3mL._SL1500_.jpg"
    ],
    "Brown and Pink": [
      "https://m.media-amazon.com/images/I/71Y6MhqfbaL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress-cocktail-bodycon",
      "title": "Womens Dress Cocktail Bodycon",
      "price": 47.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61NfEwzl3xL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-one-shoulder-maxi-formal",
      "title": "Womens Maxi Dress Evening One Shoulder Maxi Formal",
      "price": 69.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/5150AIQL4eL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail",
      "title": "Womens Dress Cocktail",
      "price": 103.54,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61JApwce25L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-formal-bodycon-evening-sleeveless",
      "title": "Womens Maxi Dress Maxi Formal Bodycon Evening Sleeveless",
      "price": 61.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61s8qg6u1VL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 158.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71PmRANW40L._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress-bodycon-split-ruched-off-shoulder",
      "title": "Womens Dress Bodycon Split Ruched Off Shoulder",
      "price": 38.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/41JjYcPgcpL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 95.61,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Work",
      "images": [
        "https://m.media-amazon.com/images/I/71hVgSIB1jL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 138.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51PZNrlyY9L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-split-evening-formal",
      "title": "Womens Maxi Dress Split Evening Formal",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51BZ1BqPx8L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 65.97,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/81wr8PDg55L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-v-neck",
      "title": "Womens Dress V Neck",
      "price": 82.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/710bSTpZ9hL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 278.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/91YXeyW506L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening-long-sleeve",
      "title": "Womens Maxi Dress Formal Evening Long Sleeve",
      "price": 87.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61nnk+flvaL._SL1500_.jpg"
      ]
    }
  ]
}