{
  "id": "womens-maxi-dress-bodycon-long-sleeve-ruched-cocktail",
  "handle": "womens-maxi-dress-bodycon-long-sleeve-ruched-cocktail",
  "sku": "JC1200",
  "asin": "B0DHJFP5GR",
  "title": "Womens Maxi Dress Bodycon Long Sleeve Ruched Cocktail",
  "title_original": "BORIFLORS Women's Sexy Ruched Bodycon Midi Dresses Elegant Mesh Long Sleeve Square Neck Ruffle Hem Cocktail Party Dress",
  "brand": "Visit the BORIFLORS Store",
  "price": 38.99,
  "social_proof": {
    "bought_past_month": 1589,
    "text": "1589+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/61JSKJJKTeL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51pefhm8wrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/718DMdZx7HL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71OjVPmLnkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/7106dvOWMmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/616do4TyisL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61XvwAyQ4DL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61iLk-NB6KL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/615yStWEVuL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61oarwaqq-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61UzzPM9cYL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61P4r-MoVKL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/61JSKJJKTeL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51pefhm8wrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/718DMdZx7HL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71OjVPmLnkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/7106dvOWMmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/616do4TyisL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61XvwAyQ4DL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61iLk-NB6KL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/615yStWEVuL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61oarwaqq-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61UzzPM9cYL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61P4r-MoVKL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Item model number ‏": "‎ BF769",
    "Date First Available ‏": "‎ September 20, 2024",
    "ASIN ‏": "‎ B0DHJF9SCT",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#5,565 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #145 in Women's Club & Night Out Dresses",
    "Customer Reviews": "4.3 4.3 out of 5 stars (1,239)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Dark Green",
      "Red",
      "Winered",
      "White",
      "Royal Blue",
      "Black",
      "Coffee",
      "Dark Purple"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.3,
    "count": 1239,
    "customers_say": "Customers find the dress sexy and flattering, with a flattering fit that accentuates curves in all the right places. The dress is comfortable with non-itchy material, and customers appreciate its stretchiness and form-shaping properties. The material quality receives mixed feedback - while some find it lovely, others say it feels cheap. The see-through aspect is also mixed, with some loving the see-through sleeves while others find it completely see-through. Select to learn more Style Fit Quality Comfort Stretchiness Flattering Material quality See through 167 customers mention \"Style\" 159 positive 8 negative Customers find the dress gorgeous and say it makes them feel sexy, with one customer noting its super sexy split design. \" Beautiful dress very comfy and stretchy! Perfect for a wedding guest I’m 5’9 225lbs ordered xl feel like I could of done a large from the stretch\" Read more \"This dress was sexy comfy and classy my husband could not keep his hands off of me on our date OKAY ! And it fit me perfectly it’s stretchy\" Read more \"this dress is so beautiful even got complimented on it i ordered an XL and fit me perfectly it was so comfortable definitely would recommend it’s...\" Read more \"...It is perfect, great fabric, comfy, cute . I had tons of compliments when I wore it. I will by one of each color.\" Read more 127 customers mention \"Fit\" 113 positive 14 negative Customers like how the dress fits, finding it flattering and not too loose or tight, with one customer noting it provides enough room to move around in. \"Beautiful, stretchy, and fits perfectly ! It’s absolutely gorgeous! The fabric is very elastic and molds to the body beautifully. I loved it!\" Read more \"Super sexy dress! It fit perfectly and I am 36DD. The only complaint is that it’s very see through from behind.\" Read more \"...I’m 5’4 , 125 pounds and I got a small and it fit perfect , it showed off my curves in a lovely way because even though I’m petite I still have body...\" Read more \"Very nice! Great fit and soft material\" Read more 92 customers mention \"Quality\" 78 positive 14 negative Customers find the dress to be of good quality, describing it as perfect for special occasions like birthdays, and one customer mentions it works well as a Fairy Godmother costume. \" Nice dress ! Looks just like the photo. Looks tight, but is not. It has stretchy material to shape your body! It comes really wrinkled though....\" Read more \" Great dress . Super comfortable. Fit great.\" Read more \" Perfect dress !\" Read more \" Love this dress !! I’m wearing a sz small☺️\" Read more 69 customers mention \"Comfort\" 67 positive 2 negative Customers find the dress comfortable, noting that the material isn't itchy. \"This dress is fun, flirty and comfortable all in one. The fabric is quality. I’m so surprised how form fitting yet comfortably this dress was....\" Read more \"I love the color and it was stretchy and comfy just was not the most flattering on my body but still got compliments and liked the quality and...\" Read more \"...tight and that’s exactly what the medium did it was a perfect and very comfortable . The material is very nice I love the see through sleeves....\" Read more \"...perfectly to the body and didn’t show my stomach much and it was super comfortable and length was also pretty good\" Read more 58 customers mention \"Stretchiness\" 57 positive 1 negative Customers appreciate the dress's stretchiness, noting that the fabric is elastic and provides good form shaping. \"Beautiful dress very comfy and stretchy ! Perfect for a wedding guest I’m 5’9 225lbs ordered xl feel like I could of done a large from the stretch\" Read more \"Fits great and very flattering. Very stretchy . I am a medium or a large size usually and the medium fit great.\" Read more \"...The material is stretchy and comfortable, making it easy to move in. Plus, for the price, it’s a great deal!...\" Read more \"Love the dress I wished I would have size down the fabric is stretchy for reference I weight 165 ove all will be getting other colors\" Read more 53 customers mention \"Flattering\" 49 positive 4 negative Customers find the dress flattering, showing off their curves in a lovely way and hugging them in all the right places. \"...But to my surprise it fit perfect. It has a good stretch and very flattering . I decided to add an accent piece.The last photo is a size small.\" Read more \"...Title: Flattering , stretchy, and perfect for any occasion! Review: I was honestly surprised by how good this dress looks on!...\" Read more \"Omg, so flattering ! True to size. Great for a night out to dinner. Good stretch, ruffled in all the right areas to cover problem areas.\" Read more \" Super flattering even with a mom pouch. As others have said the side dangling piece is odd so I just cut it off\" Read more 57 customers mention \"Material quality\" 32 positive 25 negative Customers have mixed opinions about the dress's material quality, with some finding it nice and not too thin, while others mention it feels cheap and extremely thin. \"Fits great and great material and true to color you can wear it to any event\" Read more \" Material was not as expected and very flimsy. Size was not as stated I could have used a larger size.\" Read more \" Nice fabric feels good on the skin, gorgeous color, fitted, I went back and bought the black one, lots of stretch in the fabric, 128 lb 38 dd, and I...\" Read more \"...No tag. Used item been shipped. Low quality fabric \" Read more 45 customers mention \"See through\" 27 positive 18 negative Customers have mixed opinions about the dress's transparency, with several noting that it is super see-through and the sleeves are sheer. \"...Im obsessed with it definitely good to have in other colors. Its NOT see through thankfully\" Read more \"The material is good quality, the lining is soft but very see-through , you’ll need nude underwear for this dress....\" Read more \"...This dress stretches and is light weight. The dress is not transparent as some dresses can be. I purchased a medium. I am 5’7, 150lbs....\" Read more \"The dress was nice but it was see through and I could not wear it unfortunately:...\" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Perfect black dress",
        "body": "Such an elegant dress for an affordable price. I loved everything about it. The way it fit down to the touch of it. It fit like a glove. I am 5’1, 130lbs and dd for reference. I got a size small. It have a good amount of stretch and gives you an amazing hourglass shape. The long sheer arm sleeves add a good touch. Read more",
        "author": "Diana",
        "rating": 5.0,
        "date": "December 2, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/719JyZ5-RTL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Fitted Dress",
        "body": "I got this dress for my 20 yr old daughter and it is absolutely stunning! The royal blue color is bold and elegant, and the ruched design gives such a flattering, figure-hugging fit. The material feels soft with just the right amount of stretch, making it comfortable to wear while still looking chic. Perfect for a night out, a date, or even a special event. It makes her feel confident and glamorous. Read more",
        "author": "A. S.",
        "rating": 5.0,
        "date": "October 5, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/712hYiTXhyL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Flattering, stretchy, and perfect for any occasion",
        "body": "Here’s a polished Amazon review you can copy and paste: Title: Flattering, stretchy, and perfect for any occasion! Review: I was honestly surprised by how good this dress looks on! The material is stretchy, comfortable, and really flattering thanks to the ruching. It hugs the body in all the right places without feeling too tight. The length is perfect and the quality feels great for the price. I’ve already worn it out and got so many compliments. If you’re thinking about it—just get it! Read more",
        "author": "Monica",
        "rating": 5.0,
        "date": "December 5, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61zQJYfiPuL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "4.0 out of 5 stars Beautiful Dress",
        "body": "I am 5'2, 120 pounds and got a size small. The dress fits perfect and is very comfortable. The material is thinner around the arms so you'd definitely need a jacket if you're wearing during the colder months. Read more",
        "author": "Jas",
        "rating": 4.0,
        "date": "December 17, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Just like the picture",
        "body": "This dress was so perfect. It was true to size. And it looked amazing. The material is great. Read more",
        "author": "Vanessa perez",
        "rating": 5.0,
        "date": "December 4, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "1.0 out of 5 stars Unflattering style on me. Arrived in poor condition",
        "body": "As far as the dress itself, it was not flattering to my body type, but it might be to others. At best, It made me look like I had no waist at all, and a flat butt, As the ruching, actually added a bunch of bulk and made me look thicker, pretty much obscured my waist and the arch of my low back. At best, it made me look like I had no curves, but from some angles it actually made me look sort of like a pear shape, which I am definitely not. I'm 5'7\" and 110lbs ,and ordered a size small. The bust line was too low for me, too. Fabric looked kind of cheap, was so wrinkly it was hard to even appreciate it. The zipper was firmly jammed, I didn't try to make it work. Thankfully the fabric was stretchy so I was able to slip into it despite the jammed zipper. The other issue is prob an Amazon warehouse Quality Control issue (I'm assuming it was sent from an Amazon warehouse, and not the seller, so then it wouldn't be the seller's fault), but the dress arrived wadded up in one of Amazon clear return bags with the telltale green print, dirty and smelling. It was very obvious used, with no product tags on it, was thoroughly wrinkled, and there was random tufts of animal fur accessorizing it, and what appears to be either grass or hay and other mystery dirty bits (food?) on the both the outside and inside of the dress. The zipper was jammed about 8 inches down, and I didn't try to force it, but it obviously was not working. The dress smelled strongly of either perfume or fabric softener. I imagine someone wore the dress out for an occasion, left it in a crumpled dirty heap on the floor for a while, and then decided to return it, and Amazon didn't even bother to clean it up, just passed it off to me at full price. It's too bad that some people have such low character that they would do such a thing, but it is even more disturbing to me that Amazon would charge me full price and send it out in such a condition. Even Goodwill has higher standards. The whole experience was disturbing, strong ick factor. I think I will be shopping locally for clothes for a while after having several similar experiences with Amazon in the past eight months. Read more",
        "author": "Kate's Got Ideas",
        "rating": 1.0,
        "date": "February 23, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61fd0cri6AL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/61f8FPUsiwL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71AiQuDWBZL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Fits body like a glove",
        "body": "Fits beautifully and so sexy. I am a curvy petite and 5’2 and 137 lbs. I normally fit size 4P and ordered the small which fit my body perfectly. The material is lightweight and stretchy. The sleeves are sheer and were perfect for dancing and kept me comfortable throughout the night. The price was reasonable and I hit this the next day to wear for a bachelorette party. Love love love Read more",
        "author": "ruby medrano",
        "rating": 5.0,
        "date": "October 18, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71CqC2xItoL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/6119Wtz8mkL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71QmBfjbIUL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "3.0 out of 5 stars Nice dress but hard to pull off with small chest",
        "body": "Overall, the dress isn’t too bad but I thought it would look different in person based on the pictures. The color is a bit darker and more opaque than pictured. Quality of material isn’t too good but worth the price… and the top part is just not it. Very uncomfortable to wear if you (like me) have small boobs. It has a big space for boobs to fill and wearing a push up bra didn’t solve it for me. I did like the see through sleeves and it is pretty, but the space designated for your chest is pretty big. Read more",
        "author": "Vanessa",
        "rating": 3.0,
        "date": "July 25, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Bodycon Long Sleeve Ruched Cocktail is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.",
  "about_this_item": "Womens Maxi Dress Bodycon Long Sleeve Ruched Cocktail is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.",
  "long_description": "Womens Maxi Dress Bodycon Long Sleeve Ruched Cocktail is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Dark Green, Red, Winered, White, Royal Blue, Black, Coffee, Dark Purple. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Bodycon Long Sleeve Ruched Cocktail is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Dark Green, Red, Winered, White, Royal Blue, Black, Coffee, Dark Purple. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "37158b4a-51fe-474c-b425-ea9f3976824a",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/37158b4a-51fe-474c-b425-ea9f3976824a/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/37158b4a-51fe-474c-b425-ea9f3976824a/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "301d2184-e40d-4e8d-8685-e3569cc10f43",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/301d2184-e40d-4e8d-8685-e3569cc10f43/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/301d2184-e40d-4e8d-8685-e3569cc10f43/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "d0591906-66fc-48a1-a996-1a1dc88fd152",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d0591906-66fc-48a1-a996-1a1dc88fd152/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d0591906-66fc-48a1-a996-1a1dc88fd152/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "c80b6f76-65aa-4f9b-8c77-ca19d15e3065",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c80b6f76-65aa-4f9b-8c77-ca19d15e3065/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c80b6f76-65aa-4f9b-8c77-ca19d15e3065/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "398b7b5e-90be-4797-99c6-bbd1326dfb09",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/398b7b5e-90be-4797-99c6-bbd1326dfb09/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/398b7b5e-90be-4797-99c6-bbd1326dfb09/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "356bb177-2f25-49f8-b894-221e6bf1f64f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/356bb177-2f25-49f8-b894-221e6bf1f64f/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/356bb177-2f25-49f8-b894-221e6bf1f64f/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "7e1e6dc8-0e25-417b-a219-5f0ef21d0ad7",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7e1e6dc8-0e25-417b-a219-5f0ef21d0ad7/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7e1e6dc8-0e25-417b-a219-5f0ef21d0ad7/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "3b081c3a-65a3-430b-b3e5-be8c4fb1f81b",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3b081c3a-65a3-430b-b3e5-be8c4fb1f81b/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3b081c3a-65a3-430b-b3e5-be8c4fb1f81b/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "035bb3e4-4019-45e3-a410-047213b2014c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/035bb3e4-4019-45e3-a410-047213b2014c/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/035bb3e4-4019-45e3-a410-047213b2014c/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "a5554662-e2cc-487f-9f6a-767dba391021",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a5554662-e2cc-487f-9f6a-767dba391021/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a5554662-e2cc-487f-9f6a-767dba391021/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "25f3c4e9-9c34-4853-b025-a40dcb7f2317",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/25f3c4e9-9c34-4853-b025-a40dcb7f2317/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/25f3c4e9-9c34-4853-b025-a40dcb7f2317/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "bb777594-5c08-4eee-b17d-69ea0c1fe5d3",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bb777594-5c08-4eee-b17d-69ea0c1fe5d3/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bb777594-5c08-4eee-b17d-69ea0c1fe5d3/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Dark Green": "https://m.media-amazon.com/images/I/31f8IOhSG8L._AC_SR38,50_.jpg",
    "Red": "https://m.media-amazon.com/images/I/31bYovccN8L._AC_SR38,50_.jpg",
    "Winered": "https://m.media-amazon.com/images/I/31nrAbwjVqL._AC_SR38,50_.jpg",
    "White": "https://m.media-amazon.com/images/I/31EkDrVgFlL._AC_SR38,50_.jpg",
    "Royal Blue": "https://m.media-amazon.com/images/I/3179rjP7AHL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31bs5HrXozL._AC_SR38,50_.jpg",
    "Coffee": "https://m.media-amazon.com/images/I/31rgP-LOyzL._AC_SR38,50_.jpg",
    "Dark Purple": "https://m.media-amazon.com/images/I/31ALRYltN6L._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Dark Green": "616do4TyisL",
    "Red": "61XvwAyQ4DL",
    "Winered": "61iLk-NB6KL",
    "White": "615yStWEVuL",
    "Royal Blue": "61oarwaqq-L",
    "Black": "61JSKJJKTeL",
    "Coffee": "61UzzPM9cYL",
    "Dark Purple": "61P4r-MoVKL"
  },
  "color_images": {
    "Dark Green": [
      "https://m.media-amazon.com/images/I/616do4TyisL._SL1500_.jpg"
    ],
    "Red": [
      "https://m.media-amazon.com/images/I/61XvwAyQ4DL._SL1500_.jpg"
    ],
    "Winered": [
      "https://m.media-amazon.com/images/I/61iLk-NB6KL._SL1500_.jpg"
    ],
    "White": [
      "https://m.media-amazon.com/images/I/615yStWEVuL._SL1500_.jpg"
    ],
    "Royal Blue": [
      "https://m.media-amazon.com/images/I/61oarwaqq-L._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/61JSKJJKTeL._SL1500_.jpg"
    ],
    "Coffee": [
      "https://m.media-amazon.com/images/I/61UzzPM9cYL._SL1500_.jpg"
    ],
    "Dark Purple": [
      "https://m.media-amazon.com/images/I/61P4r-MoVKL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 210.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71gHGMr--UL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 46.88,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51e7KIifeZL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 29.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/714NKRHRX2L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-one-shoulder-formal-mermaid-bodycon-evening-maxi",
      "title": "Womens Maxi Dress One Shoulder Formal Mermaid Bodycon Evening Maxi",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71mgUBuGwhL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 42.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71bqoI3Xa8L._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-v-neck-long-sleeve-bodycon",
      "title": "Womens Maxi Dress V Neck Long Sleeve Bodycon",
      "price": 30.59,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Sweaters > Pullovers",
      "images": [
        "https://m.media-amazon.com/images/I/71a0x4LTzmL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-ruched-one-shoulder-formal-cocktail-bodycon-maxi",
      "title": "Womens Maxi Dress Ruched One Shoulder Formal Cocktail Bodycon Maxi",
      "price": 47.89,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/612sxL+Ey-L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-sleeveless-off-shoulder",
      "title": "Womens Dress Sleeveless Off Shoulder",
      "price": 37.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61dMM-S4qXL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61udjSNVNzL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 57.86,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/61iiBGgPChL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 27.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/615JfwLyTTL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 38.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61im2oIlu6L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-ruched-long-sleeve-bodycon",
      "title": "Womens Maxi Dress Ruched Long Sleeve Bodycon",
      "price": 31.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51zwWMjriiL._SL1500_.jpg"
      ]
    }
  ]
}