{
  "id": "womens-dress-sleeveless-formal",
  "handle": "womens-dress-sleeveless-formal",
  "sku": "JC1360",
  "asin": "B0DJGYNYWL",
  "title": "Womens Dress Sleeveless Formal",
  "title_original": "CUPSHE Midi Dress for Women 2025 Party Spaghetti Straps Sleeveless Pleated Cutout Formal Dress",
  "brand": "Visit the CUPSHE Store",
  "price": 59.99,
  "social_proof": {
    "bought_past_month": 123,
    "text": "123+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/61-zfl0UV6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71lzgDBddJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71QBgCveH+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/719-ngeufVL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/712AnNcqq-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ULD-ydTZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ItlECaWlL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71INp2waMiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71yj5a1kmnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61J8RnKKvCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71XdyRhsZTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71OCj19xxSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71NA0qKaj4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71FLBNrWmnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71W15BVyuiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61VnXCSoIeL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71P4cOVq5TL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71b0Wo6GfOL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61GlXx8sCWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/611Km0RirzL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71PuArRXuAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/719jQ0AaieL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71qWoeScbuL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71WTaFX8K8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71BN+dC3NFL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/61-zfl0UV6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71lzgDBddJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71QBgCveH+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/719-ngeufVL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/712AnNcqq-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ULD-ydTZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ItlECaWlL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71INp2waMiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71yj5a1kmnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61J8RnKKvCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71XdyRhsZTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71OCj19xxSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71NA0qKaj4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71FLBNrWmnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71W15BVyuiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61VnXCSoIeL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71P4cOVq5TL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71b0Wo6GfOL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61GlXx8sCWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/611Km0RirzL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71PuArRXuAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/719jQ0AaieL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71qWoeScbuL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71WTaFX8K8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71BN+dC3NFL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Package Dimensions ‏": "‎ 5 x 4 x 3 inches; 7.04 ounces",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ October 4, 2024",
    "ASIN ‏": "‎ B0DJGYFY2L",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#170,436 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #645 in Women's Cocktail Dresses #858 in Women's Formal Dresses",
    "Customer Reviews": "4.0 4.0 out of 5 stars (172)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Pink",
      "Burgundy",
      "Black",
      "Navy Blue",
      "Green"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.0,
    "count": 172,
    "customers_say": "Customers find this dress to be of great quality, with soft, comfortable fabric that fits beautifully and is perfect for weddings. They describe it as flattering, with one customer noting it flatters all curves, and appreciate its beautiful color. However, several customers report sizing issues with the dress. Generated from the text of customer reviews Select to learn more Quality (41) Fit (27) Fabric quality (20) Dress fit (12) Flattering (11) Color (10) Comfort (9) Size (8) 41 customers mention quality, 36 positive, 5 negative 41 customers mention \"Quality\" 36 positive 5 negative Customers find the dress beautiful and of great quality, with one customer noting it doesn't feel cheap at all. \" It’s a beautiful dress . I’m 4’11” though and it’s sits almost to the floor lol I guess it’s ok with tall enough heels.... \" Read more \" ...It's beautiful , the color (dark teal/green) rich and luxurious, the material thick and not cheap looking, and it fit beautifully... \" Read more \" ...Second one I oredered fit and is cute ! \" Read more \" This dress is very cute but runs small/ tight at the waist. The quality is great, I really wanted to wear it to a wedding.... \" Read more 27 customers mention fit, 21 positive, 6 negative 27 customers mention \"Fit\" 21 positive 6 negative Customers find that the dress fits beautifully, with one mentioning that the waist has no give. \" Comfortable, elegant, classy. Great fit . It does bleed color so just make sure to wash it with like colors only. \" Read more \" ... Fit well ! I love that it has adjustable straps for extra sure fit. It is stretchy around the bra line but the waist has no give. Measure accordingly.... \" Read more \" This dress fit perfectly , I received so many compliments on how beautiful it was. I'm 5-1 and about 150 lbs. Am buster up top and have hips.... \" Read more \" This dress is very cute but runs small/ tight at the waist . The quality is great, I really wanted to wear it to a wedding.... \" Read more 20 customers mention fabric quality, 17 positive, 3 negative 20 customers mention \"Fabric quality\" 17 positive 3 negative Customers appreciate the dress's fabric, describing it as soft and nice, with one customer noting its satin-like sheen. \" ...Everything is perfect about the dress but the length. Great material and looks expensive. \" Read more \" ...The material was comfortable and breathable. It was worth the money. \" Read more \" This dress was really pretty, the color was deep and the fabric was soft , but it did not look flattering on me.... \" Read more \" ...Literally obsessed! The fit is so good, true to size, the material is cool and perfect for spring. The emerald color is so pretty. \" Read more 12 customers mention dress fit, 12 positive, 0 negative 12 customers mention \"Dress fit\" 12 positive 0 negative Customers find the dress fits well for formal occasions, with several mentioning it's perfect for weddings, and one customer noting it's suitable for both summer and spring events. \" ...I ordered the blush pink color and it was perfect for the wedding . The material is really nice and it has some weight to the dress.... \" Read more \" ...Bought for a cruise and it was perfect for formal night !!! Fits perfectly and was giving with material! the color was beautiful! \" Read more \" ...The fit is so good, true to size, the material is cool and perfect for spring . The emerald color is so pretty. \" Read more \" Super flattering, wore it to an engagement party and it was a great find for the price. Great material, good fit, and support the \"girls\" \" Read more 11 customers mention flattering, 10 positive, 1 negative 11 customers mention \"Flattering\" 10 positive 1 negative Customers find the dress flattering, with one mentioning it works well for curves and another noting it provides good support. \" such a flattering & cute dress! such good quality! only thing i would change was the band around bottom of boobs, needed to be a tad looser.... \" Read more \" Super flattering , wore it to an engagement party and it was a great find for the price. Great material, good fit, and support the \"girls\" \" Read more \" ...Fits according to size. I am pear shaped and it was very flattering . \" Read more \" ...This dress flatters all her best curves and with her olive complexion, the color was flattering as well. \" Read more 10 customers mention color, 9 positive, 1 negative 10 customers mention \"Color\" 9 positive 1 negative Customers like the dress's color. \" Beautiful dress. Beautiful color . Beautiful fit. I had to have it shortened quite a bit to make it tea length. \" Read more \" ...Fits perfectly and was giving with material! the color was beautiful ! \" Read more \" This dress was really pretty, the color was deep and the fabric was soft, but it did not look flattering on me.... \" Read more \" I loved the color and the length of the dress! It was perfect for the wedding I was attending.... \" Read more 9 customers mention comfort, 9 positive, 0 negative 9 customers mention \"Comfort\" 9 positive 0 negative Customers find the dress comfortable. \" I wore this for a wedding it was amazing it fit great and comfortable great value and style I got many compliments on it can’t wait to wear it again \" Read more \" ...It fits well, and is super flattering. It’s also super comfortable . I’ve worn it to two weddings so far and it was been awesome \" Read more \" ...It was easy to wear and I was comfortable all evening . Highly recommend. Wish I got it in black! \" Read more \" Perfect for Christmas Gala! Very comfortable and true to size \" Read more 8 customers mention size, 2 positive, 6 negative 8 customers mention \"Size\" 2 positive 6 negative Customers report sizing issues with the dress, noting that it doesn't match their measurements and one customer mentions it makes their chest look small. \" Very cute - just not for larger busts . I loved this dress, but the cutout in the bust makes it impossible to wear a bra.... \" Read more \" Overall the dress is gorgeous; however, it’s not petite friendly . I’m 5’2 and ordered a medium. Everything is perfect about the dress but the length.... \" Read more \" ...Literally obsessed! The fit is so good, true to size , the material is cool and perfect for spring. The emerald color is so pretty. \" Read more \" This dress is very cute but runs small / tight at the waist. The quality is great, I really wanted to wear it to a wedding.... \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Love! Perfect for a party",
        "body": "I bought a medium in navy. I am 5’5”, 170lb, and usually where M/L. I am very small chested and have wider hips. Fit well! I love that it has adjustable straps for extra sure fit. It is stretchy around the bra line but the waist has no give. Measure accordingly. The fabric was very very nice thick satin and looks well made and high quality. I fabric was a big hot but not bad. This was worn for a Christmas party but is great for summer too. It was easy to wear and I was comfortable all evening. Highly recommend. Wish I got it in black! Read more",
        "author": "Cbp11",
        "rating": 5.0,
        "date": "December 17, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/714ZP1StA2L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Loved this dress",
        "body": "I wore this for a wedding it was amazing it fit great and comfortable great value and style I got many compliments on it can’t wait to wear it again Read more",
        "author": "yessica",
        "rating": 5.0,
        "date": "December 7, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars A beautiful dress",
        "body": "Bought this dress last minute for an anniversary banquet and was not disappointed. It's beautiful, the color (dark teal/green) rich and luxurious, the material thick and not cheap looking, and it fit beautifully (i got a size small, I'm 5'4, 140 lb 32C, 27/28 in waist, 4-6 dress). It was flattering and sexy sophisticated. I literally dropped a cake on my lap with white icing all over it. I was able to wipe it off and you couldn't tell. Loved it Read more",
        "author": "JLQ",
        "rating": 5.0,
        "date": "June 23, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "1.0 out of 5 stars Disappointed",
        "body": "This dress is not how it looks in the picture. I returned it sadly. Very heavy and thick and kind of a difficult material. I have no boobs really but I have an athletic body so finding clothing is really difficult. This dress didn’t fit me anywhere. The chest was so big too and I got a medium! It might have been comfortable. I liked the color so much too. More money than what it’s worth tho sadly. The value for money isn’t there with this dress. Read more",
        "author": "Leslie",
        "rating": 1.0,
        "date": "October 24, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Soft, pretty, but not for curvy girls",
        "body": "This dress was really pretty, the color was deep and the fabric was soft, but it did not look flattering on me. I have a short torso, so it was hard to figure out where the top part should sit. It ended up making my chest look small and my hips boxy. For a more petite person I bet it would look great! Read more",
        "author": "Lo",
        "rating": 3.0,
        "date": "May 23, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Good wedding guest dress",
        "body": "Good dress, the first one I ordered had a stuck zipper. Second one I oredered fit and is cute! Read more",
        "author": "Amy",
        "rating": 4.0,
        "date": "October 10, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Beautiful dress",
        "body": "It’s a beautiful dress. I’m 4’11” though and it’s sits almost to the floor lol I guess it’s ok with tall enough heels. It has a nice satin feel and weight to it. Doesn’t feel cheap at all. I feel it’s worth the money. Adjustable straps. I only returned it because I found a dress at the mall and I liked it better for the occasion. (Wedding) I was hesitant on what sizing to get. I’m 137lbs, 34” waist and I’m usually a between size M-L. Amazon recommended a L and it fit perfectly. It has some stretch to it. Read more",
        "author": "Jharline",
        "rating": 5.0,
        "date": "June 8, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Beautiful Dress!",
        "body": "This dress is beautiful. I ordered the blush pink color and it was perfect for the wedding. The material is really nice and it has some weight to the dress. It’s not a thin shiny material. I let my bathroom steam up to get the wrinkles out of the bottom because I didn’t want to iron it. The steamer probably would’ve worked as well as long as you don’t get the steam too close to the dress. Also know this is not addressed that you can dry clean or put in the dryer. Your hand wash and hang to dry according to the label. I ordered the XL and I’m usually a 14/16. I really want to order the green and the black. This is the dress you want in your closet. This dress will get a lot of wear. You won’t regret ordering. I’ve paid way more for dress that I didn’t like as much as this one. Read more",
        "author": "Gabrielle Whitfield",
        "rating": 5.0,
        "date": "May 5, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71-V0OaBK0L._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/611nV0uPxXL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71Pi0IDMC0L._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/61BCYYUyIML._SY88._SL1500_.jpg"
        ]
      }
    ]
  },
  "short_description": "Womens Dress Sleeveless Formal is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.",
  "about_this_item": "Womens Dress Sleeveless Formal is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.",
  "long_description": "Womens Dress Sleeveless Formal is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Pink, Burgundy, Black, Navy Blue, Green. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Dress Sleeveless Formal is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Pink, Burgundy, Black, Navy Blue, Green. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "04253db7-e3b4-469a-8270-3843552dbc4c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/04253db7-e3b4-469a-8270-3843552dbc4c/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/04253db7-e3b4-469a-8270-3843552dbc4c/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/82c43e56-058b-4c06-b43b-c9d03525c489.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "a92497bd-b52d-44aa-9432-95318df91e98",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a92497bd-b52d-44aa-9432-95318df91e98/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a92497bd-b52d-44aa-9432-95318df91e98/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/82c43e56-058b-4c06-b43b-c9d03525c489.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "3781ba5f-da35-45c8-a014-890e8218f965",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3781ba5f-da35-45c8-a014-890e8218f965/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3781ba5f-da35-45c8-a014-890e8218f965/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/82c43e56-058b-4c06-b43b-c9d03525c489.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "5df95119-8fa8-4c05-8f24-6d8c3e0b04ad",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5df95119-8fa8-4c05-8f24-6d8c3e0b04ad/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5df95119-8fa8-4c05-8f24-6d8c3e0b04ad/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/82c43e56-058b-4c06-b43b-c9d03525c489.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "49e19505-15b4-4de4-8358-cbad4ce51d4e",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/49e19505-15b4-4de4-8358-cbad4ce51d4e/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/49e19505-15b4-4de4-8358-cbad4ce51d4e/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/82c43e56-058b-4c06-b43b-c9d03525c489.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "e99e849b-27c6-4002-a586-2975bfda166a",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e99e849b-27c6-4002-a586-2975bfda166a/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e99e849b-27c6-4002-a586-2975bfda166a/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/82c43e56-058b-4c06-b43b-c9d03525c489.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "ab80e3ca-089c-4c2a-b65e-c6b1f257526f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ab80e3ca-089c-4c2a-b65e-c6b1f257526f/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ab80e3ca-089c-4c2a-b65e-c6b1f257526f/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/82c43e56-058b-4c06-b43b-c9d03525c489.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "c10c63b8-b78a-4e91-8cb3-aa13717c77c7",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c10c63b8-b78a-4e91-8cb3-aa13717c77c7/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c10c63b8-b78a-4e91-8cb3-aa13717c77c7/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/82c43e56-058b-4c06-b43b-c9d03525c489.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Pink": "https://m.media-amazon.com/images/I/41rh8TPCZ0L._AC_SR38,50_.jpg",
    "Burgundy": "https://m.media-amazon.com/images/I/31pFVuzXtTL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/311G-lD2F7L._AC_SR38,50_.jpg",
    "Navy Blue": "https://m.media-amazon.com/images/I/31CrkPkw2PL._AC_SR38,50_.jpg",
    "Green": "https://m.media-amazon.com/images/I/31VfWVXIxyL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Pink": "71ULD-ydTZL",
    "Burgundy": "61J8RnKKvCL",
    "Black": "61VnXCSoIeL",
    "Navy Blue": "611Km0RirzL",
    "Green": "61-zfl0UV6L"
  },
  "color_images": {
    "Pink": [
      "https://m.media-amazon.com/images/I/71ULD-ydTZL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71ItlECaWlL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71INp2waMiL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71yj5a1kmnL._SL1500_.jpg"
    ],
    "Burgundy": [
      "https://m.media-amazon.com/images/I/61J8RnKKvCL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71XdyRhsZTL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71OCj19xxSL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71NA0qKaj4L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71FLBNrWmnL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71W15BVyuiL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/61VnXCSoIeL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71P4cOVq5TL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71b0Wo6GfOL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61GlXx8sCWL._SL1500_.jpg"
    ],
    "Navy Blue": [
      "https://m.media-amazon.com/images/I/611Km0RirzL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71PuArRXuAL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/719jQ0AaieL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71qWoeScbuL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71WTaFX8K8L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71BN+dC3NFL._SL1500_.jpg"
    ],
    "Green": [
      "https://m.media-amazon.com/images/I/61-zfl0UV6L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71lzgDBddJL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71QBgCveH+L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/719-ngeufVL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/712AnNcqq-L._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-sleeveless-v-neck-split-maxi-cocktail",
      "title": "Womens Maxi Dress Sleeveless V Neck Split Maxi Cocktail",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/61YT6HmofvL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-sleeveless-maxi-v-neck",
      "title": "Womens Maxi Dress Sleeveless Maxi V Neck",
      "price": 42.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/6152O0FEYiL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-bodycon",
      "title": "Womens Maxi Dress Long Sleeve Bodycon",
      "price": 42.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51WYC8TquDL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-ruched-bodycon-formal-cocktail-long-sleeve",
      "title": "Womens Maxi Dress Maxi Ruched Bodycon Formal Cocktail Long Sleeve",
      "price": 56.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/51HFt7oTd4L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 42.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61RUb2Rhb2L._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-cocktail-formal-maxi-long-sleeve",
      "title": "Womens Maxi Dress Cocktail Formal Maxi Long Sleeve",
      "price": 45.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61NXa9j1ztL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-bodycon-long-sleeve",
      "title": "Womens Maxi Dress Maxi Bodycon Long Sleeve",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51xY-nVpN9L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-bodycon-cocktail",
      "title": "Womens Maxi Dress Long Sleeve Bodycon Cocktail",
      "price": 29.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71uLDl8TnLL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-formal-one-shoulder",
      "title": "Womens Maxi Dress Evening Formal One Shoulder",
      "price": 69.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/619Po5TvLvL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-v-neck-long-sleeve-ruched",
      "title": "Womens Maxi Dress Bodycon V Neck Long Sleeve Ruched",
      "price": 29.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61ljVFmZp3L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening-v-neck",
      "title": "Womens Maxi Dress Formal Evening V Neck",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Wedding Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/51N19olLrFL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail-formal-bodycon-ruched-evening",
      "title": "Womens Dress Cocktail Formal Bodycon Ruched Evening",
      "price": 55.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/51qWSPFqHRL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-off-shoulder-v-neck-formal",
      "title": "Womens Maxi Dress Evening Off Shoulder V Neck Formal",
      "price": 89.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71H1Q7tFSyL._SL1500_.jpg"
      ]
    }
  ]
}