{
  "id": "womens-maxi-dress-long-sleeve",
  "handle": "womens-maxi-dress-long-sleeve",
  "sku": "JC2917",
  "asin": "B0DJS9TRD3",
  "title": "Womens Maxi Dress Long Sleeve",
  "title_original": "Women's Long Sleeve Mini Dress Pearl Square Neck Ruffle Hem Short Dress Bride Party Club Elegant Dresses",
  "brand": "Visit the YEXPINE Store",
  "price": 74.98,
  "social_proof": {
    "bought_past_month": 1856,
    "text": "1856+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/51SXcBCPQVL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51QW4j6HNCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51OnfftAXzL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51jmVxgrKoL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51Et-JbaUTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71CqfGZ+q2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51PL7wRMd7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61XTzzmx2TL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/615DNZJu04L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61tnMwdujLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/611ZmMXFTwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ZGyJd1IuL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Qvww9J-zL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51t3QKVua5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51-UWh8r08L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61rv4b2756L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51OmsEinqFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51AbZP9veiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/5111r-j2INL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/51SXcBCPQVL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51QW4j6HNCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51OnfftAXzL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51jmVxgrKoL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51Et-JbaUTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71CqfGZ+q2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51PL7wRMd7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61XTzzmx2TL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/615DNZJu04L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61tnMwdujLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/611ZmMXFTwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ZGyJd1IuL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Qvww9J-zL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51t3QKVua5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51-UWh8r08L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61rv4b2756L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51OmsEinqFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51AbZP9veiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/5111r-j2INL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ October 10, 2024",
    "ASIN ‏": "‎ B0DJS99VZ5",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#149,409 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #1,035 in Women's Club & Night Out Dresses",
    "Customer Reviews": "3.8 3.8 out of 5 stars (74)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Red",
      "White",
      "Black"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 3.8,
    "count": 74,
    "customers_say": "Customers find the dress flattering and well-made, with thick fabric and a high neckline that helps maintain its shape. Moreover, they appreciate its stretchiness and sturdy construction, with one customer noting it doesn't cling to the body. However, the fit receives mixed feedback, with some finding it as expected while others say it's not flattering. Generated from the text of customer reviews Select to learn more Quality (15) Material quality (8) Neckline (7) Dress quality (5) Stretchiness (5) Flattering (4) Sturdiness (4) Fit (16) 15 customers mention quality, 13 positive, 2 negative 15 customers mention \"Quality\" 13 positive 2 negative Customers find the dress to be of good quality. \" cute dress but the smell omgggg it stinked sooo bad \" Read more \" ...I wore it on a date night in the winter and it was so cute . Very comfortable and fit well. Also stretched which was nice. \" Read more \" Super cute ... \" Read more \" Super cute dress and true to size. The shoulders were a little loose but the rubber on the inside held up great!... \" Read more 8 customers mention material quality, 8 positive, 0 negative 8 customers mention \"Material quality\" 8 positive 0 negative Customers like the material of the dress, noting that it is nice and thick, with one customer mentioning that it provides good support. \" Great material super beautiful and hides your belly if thats what your looking for. Received tons of compliments \" Read more \" Amazing quality. Absolutely worth the money. The fabric is thick and not see through what so ever. The cut and shape is very flattering.... \" Read more \" ...I do love the quality of the dress, the material is very nice . Did not feel cheap. I think the fit is just very weird.... \" Read more \" Thick material so it doesn’t cling, nice length (I’m 5’5”), but the shoulder area was just too wide for me. Cute dress though \" Read more 7 customers mention neckline, 5 positive, 2 negative 7 customers mention \"Neckline\" 5 positive 2 negative Customers like the neckline of the dress, with one mentioning its high neckline and another noting its slight poof shape. \" Very straight dress . No volume in the skirt like the pic shows \" Read more \" I LOVE this dress! The slight poof shape is unexpected and a classy and polished touch to the design… I LOVE LOVE LOVE this dress!! \" Read more \" ...I just wish it looked more like the picture. The neckline is a lot higher , full coverage, and the skirt is a lot longer. Knee length.... \" Read more \" ...The bottom half of the dress had some structure to it which helps keep the rounded shape that I liked.... \" Read more 5 customers mention dress quality, 5 positive, 0 negative 5 customers mention \"Dress quality\" 5 positive 0 negative Customers find this dress to be of excellent quality, describing it as a fun cocktail dress, with one customer mentioning it's great for holiday parties. \" Fun cocktail dress Neckline is very flattering and has some stretch for a comfy fit. Thick fabric held me in.... \" Read more \" This dress is prefect . I wore it on a date night in the winter and it was so cute. Very comfortable and fit well. Also stretched which was nice. \" Read more \" ...Runs true to size! Great for a holiday party ! \" Read more \" Amazing quality . Absolutely worth the money. The fabric is thick and not see through what so ever. The cut and shape is very flattering.... \" Read more 5 customers mention stretchiness, 4 positive, 1 negative 5 customers mention \"Stretchiness\" 4 positive 1 negative Customers appreciate the dress's stretchiness, with one mentioning it provides a comfortable fit. \" I love this dress! It has a stretchy comfy material , the pearls feel secure, and the pleating is great! Runs true to size! Great for a holiday party! \" Read more \" ...Very comfortable and fit well. Also stretched which was nice . \" Read more \" I loved this dress. The marital was very stretchy but still thick and sturdy.... \" Read more \" ...it’s because I got a bigger size (I’m plus size), but the pleats were very stretched out and made the dress look off. \" Read more 4 customers mention flattering, 4 positive, 0 negative 4 customers mention \"Flattering\" 4 positive 0 negative Customers find the dress flattering, with one mentioning that the cut and shape are particularly appealing. \" Fun cocktail dress Neckline is very flattering and has some stretch for a comfy fit. Thick fabric held me in.... \" Read more \" ...That said, the dress is very flattering , and the quality isn’t bad at all, it’s just not practical for me. \" Read more \" Super cute & flattering , but fair warning - if you have long hair, your hair will get stuck in the pearls & get pulled out so I’d advise wearing... \" Read more \" ...The fabric is thick and not see through what so ever. The cut and shape is very flattering . Size fits just as expected.... \" Read more 4 customers mention sturdiness, 3 positive, 1 negative 4 customers mention \"Sturdiness\" 3 positive 1 negative Customers appreciate the dress's sturdiness, with one mentioning that the pearls feel secure and another noting that it doesn't cling to the body. \" Thick material so it doesn’t cling , nice length (I’m 5’5”), but the shoulder area was just too wide for me. Cute dress though \" Read more \" I love this dress! It has a stretchy comfy material, the pearls feel secure , and the pleating is great! Runs true to size! Great for a holiday party! \" Read more \" ...It was so wide to the point where it felt off the shoulder almost . Also I’m not big on the bust so there was lots of space in that area.... \" Read more \" ...The pearls seem to be well fastened into the dress so I’m not worried about losing any.... \" Read more 16 customers mention fit, 9 positive, 7 negative 16 customers mention \"Fit\" 9 positive 7 negative Customers have mixed opinions about the dress's fit, with some finding it true to size while others say it's not flattering. \" Super cute dress and true to size . The shoulders were a little loose but the rubber on the inside held up great!... \" Read more \" Unfortunately not a good fit , pearls are sawed unevenly and dress shape and stand is not good, very sad i was hoping to wear it at the concert now... \" Read more \" ... Runs true to size ! Great for a holiday party! \" Read more \" ...Thick fabric held me in. i am 5foot so the sleeves were a bit long but i just rolled them under and you could not tell. \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Best purchase",
        "body": "Great quality and fit very nice. Versatile wear, boots or heels. Loved Read more",
        "author": "Hanaly Suarez",
        "rating": 5.0,
        "date": "December 7, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Fun cocktail dress",
        "body": "Fun cocktail dress Neckline is very flattering and has some stretch for a comfy fit. Thick fabric held me in. i am 5foot so the sleeves were a bit long but i just rolled them under and you could not tell. Read more",
        "author": "Lindsay Nemec",
        "rating": 5.0,
        "date": "September 2, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Cute dress but wide shoulders",
        "body": "Thick material so it doesn’t cling, nice length (I’m 5’5”), but the shoulder area was just too wide for me. Cute dress though Read more",
        "author": "Linds",
        "rating": 4.0,
        "date": "December 9, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "1.0 out of 5 stars Cute but weird for plus sized girlies",
        "body": "I ended up returning this dress. I bought it for my nursing school pinning ceremony and it fit perfect and was really cute on BUT the pleats in the skirt looked weird. I don’t know if it’s because I got a bigger size (I’m plus size), but the pleats were very stretched out and made the dress look off. Read more",
        "author": "Elizabeth",
        "rating": 1.0,
        "date": "October 21, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Knee length; high neckline",
        "body": "It was almost perfect. The material and quality is great. I just wish it looked more like the picture. The neckline is a lot higher, full coverage, and the skirt is a lot longer. Knee length. It def runs big. I am glad I ordered a L. Im normally an XL. Read more",
        "author": "Carolina Martinez",
        "rating": 3.0,
        "date": "October 8, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Love it!",
        "body": "I love this dress! It has a stretchy comfy material, the pearls feel secure, and the pleating is great! Runs true to size! Great for a holiday party! Read more",
        "author": "Julie Frierson",
        "rating": 5.0,
        "date": "December 11, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71JO3HoqGxL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Formal and gorgeous",
        "body": "Pretty for formal occasions. Read more",
        "author": "Elena",
        "rating": 5.0,
        "date": "November 30, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Absolutely recommend",
        "body": "Amazing quality. Absolutely worth the money. The fabric is thick and not see through what so ever. The cut and shape is very flattering. Size fits just as expected. Also like that it is not too short. Very comfortable as well. Read more",
        "author": "Customer",
        "rating": 5.0,
        "date": "July 19, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.",
  "about_this_item": "Womens Maxi Dress Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.",
  "long_description": "Womens Maxi Dress Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Red, White, Black. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Red, White, Black. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "13d9d752-daf7-440d-824d-b85beb7f5655",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/13d9d752-daf7-440d-824d-b85beb7f5655/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/13d9d752-daf7-440d-824d-b85beb7f5655/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "417c950b-dc2d-4f3e-b209-6f111c7e406f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/417c950b-dc2d-4f3e-b209-6f111c7e406f/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/417c950b-dc2d-4f3e-b209-6f111c7e406f/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "9534f209-00da-4058-bd60-5e3a09841dd9",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9534f209-00da-4058-bd60-5e3a09841dd9/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9534f209-00da-4058-bd60-5e3a09841dd9/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "f086f5a3-c4d8-4268-bf8d-5cd76be4a631",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f086f5a3-c4d8-4268-bf8d-5cd76be4a631/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f086f5a3-c4d8-4268-bf8d-5cd76be4a631/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "d30661fc-5ae6-4fe7-988b-07e484318af6",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d30661fc-5ae6-4fe7-988b-07e484318af6/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d30661fc-5ae6-4fe7-988b-07e484318af6/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "803cae7f-b4dd-45d7-b70f-f91f05d4fd5f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/803cae7f-b4dd-45d7-b70f-f91f05d4fd5f/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/803cae7f-b4dd-45d7-b70f-f91f05d4fd5f/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Red": "https://m.media-amazon.com/images/I/313UuKv7EJL._AC_SR38,50_.jpg",
    "White": "https://m.media-amazon.com/images/I/31+9HuQx+rL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31xVN2vVGKL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Red": "61XTzzmx2TL",
    "White": "51t3QKVua5L",
    "Black": "51SXcBCPQVL"
  },
  "color_images": {
    "Red": [
      "https://m.media-amazon.com/images/I/61XTzzmx2TL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/615DNZJu04L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61tnMwdujLL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/611ZmMXFTwL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61ZGyJd1IuL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61Qvww9J-zL._SL1500_.jpg"
    ],
    "White": [
      "https://m.media-amazon.com/images/I/51t3QKVua5L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/51-UWh8r08L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61rv4b2756L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/51OmsEinqFL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/51AbZP9veiL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71CqfGZ+q2L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/5111r-j2INL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/51SXcBCPQVL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/51QW4j6HNCL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/51OnfftAXzL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/51jmVxgrKoL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/51Et-JbaUTL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71CqfGZ+q2L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/51PL7wRMd7L._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress-cocktail-bodycon",
      "title": "Womens Dress Cocktail Bodycon",
      "price": 47.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61NfEwzl3xL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-one-shoulder-maxi-formal",
      "title": "Womens Maxi Dress Evening One Shoulder Maxi Formal",
      "price": 69.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/5150AIQL4eL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail",
      "title": "Womens Dress Cocktail",
      "price": 103.54,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61JApwce25L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-formal-bodycon-evening-sleeveless",
      "title": "Womens Maxi Dress Maxi Formal Bodycon Evening Sleeveless",
      "price": 61.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61s8qg6u1VL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 158.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71PmRANW40L._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress-bodycon-split-ruched-off-shoulder",
      "title": "Womens Dress Bodycon Split Ruched Off Shoulder",
      "price": 38.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/41JjYcPgcpL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 95.61,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Work",
      "images": [
        "https://m.media-amazon.com/images/I/71hVgSIB1jL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 138.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51PZNrlyY9L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-split-evening-formal",
      "title": "Womens Maxi Dress Split Evening Formal",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51BZ1BqPx8L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 65.97,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/81wr8PDg55L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-v-neck",
      "title": "Womens Dress V Neck",
      "price": 82.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/710bSTpZ9hL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 278.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/91YXeyW506L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening-long-sleeve",
      "title": "Womens Maxi Dress Formal Evening Long Sleeve",
      "price": 87.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61nnk+flvaL._SL1500_.jpg"
      ]
    }
  ]
}