{
  "id": "womens-maxi-dress-v-neck-long-sleeve",
  "handle": "womens-maxi-dress-v-neck-long-sleeve",
  "sku": "JC2833",
  "asin": "B0DJVHVFM8",
  "title": "Womens Maxi Dress V Neck Long Sleeve",
  "title_original": "Women Corduroy Dress V Neck Long Sleeve Casual Vintage Retro A Line Mini Dresses",
  "brand": "Visit the EZAPINE Store",
  "price": 46.98,
  "social_proof": {
    "bought_past_month": 398,
    "text": "398+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/612+YFySbyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/811bPHmLtyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Go15LGvPL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71kOYCmL9dL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61skWtPYNiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61O2MnYp-IL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81P2h6pE8DL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61C+XtnDddL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/610HqA8fu+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/7128eFUJ5+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/715-k644vKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71faBs2JLqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81OCH5aTdTL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/612+YFySbyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/811bPHmLtyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Go15LGvPL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71kOYCmL9dL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61skWtPYNiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61O2MnYp-IL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81P2h6pE8DL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61C+XtnDddL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/610HqA8fu+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/7128eFUJ5+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/715-k644vKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71faBs2JLqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81OCH5aTdTL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Date First Available ‏": "‎ October 11, 2024",
    "ASIN ‏": "‎ B0DJVJHYQ4",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#23,531 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #211 in Women's Casual Dresses",
    "Customer Reviews": "4.2 4.2 out of 5 stars (109)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Red",
      "Brown",
      "Pink",
      "Beige",
      "Blue",
      "Black",
      "Navy Blue",
      "Green"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.2,
    "count": 109,
    "customers_say": "Customers find the dress well-made with good fabric quality and appreciate its bright green color and lovely weight. The style receives positive feedback, with one customer noting it gives \"all the Fall vibes.\" The fit and sleeve shape receive mixed reviews - while some find it true to size, others say it's pretty short, and one customer mentions the sleeves are a little weird. The flattering aspect also gets mixed reactions. Generated from the text of customer reviews Select to learn more Style (17) Quality (15) Fabric quality (10) Color (9) Weight (5) Fit (27) Sleeve shape (5) Flattering (4) 17 customers mention style, 17 positive, 0 negative 17 customers mention \"Style\" 17 positive 0 negative Customers find the dress cute, with one mentioning it gives them all the Fall vibes. \" Adorable! Love, love, love this dress. So cute and is true to size. Going to order the brown one too! \" Read more \" Super cute , soft, and I love the green. The sleeves are a little weird and it feels a little tight in the chest area. It’s pretty short on me.... \" Read more \" This dress is cute but-- it is a little boxy and longer than I wanted. I have kept it and will wear it, just not quite the fit I had hoped. \" Read more \" The dress is so cute ! The fabric is good quality and I got a ton of compliments! \" Read more 15 customers mention quality, 14 positive, 1 negative 15 customers mention \"Quality\" 14 positive 1 negative Customers find the dress well made. \" This is a nice dress- looks exactly like the pictures. Good quality too; however, there is not much shape to it.... \" Read more \" Lovely dress \" Read more \" This is a great dress , it runs a little short for me but perfect for someone younger. \" Read more \" This dress is fantastic! Great quality .... \" Read more 10 customers mention fabric quality, 9 positive, 1 negative 10 customers mention \"Fabric quality\" 9 positive 1 negative Customers like the fabric quality of the dress, with one mentioning it's suitable for autumn 2025 and another noting it has the correct amount. \" The dress is so cute! The fabric is good quality and I got a ton of compliments! \" Read more \" Fabric is good . Style works really well for me. I think the product is about a 9 out of 10. Fits as per size. The color is as advertised. \" Read more \" ...There is no flare near the wrist. It’s a straight narrow sleeve. I like the material though. Light weight corduroy. \" Read more \" Quality material , fitting is great \" Read more 9 customers mention color, 9 positive, 0 negative 9 customers mention \"Color\" 9 positive 0 negative Customers like the dress's color, particularly its bright shade of green. \" Gorgeous color and quality while it fit Worried when cleaned maybe shrinkage so i sent it back... \" Read more \" ...Fits as per size. The color is as advertised . \" Read more \" Super cute, soft, and I love the green . The sleeves are a little weird and it feels a little tight in the chest area. It’s pretty short on me.... \" Read more \" I received numerous compliment on this dress. The color is perfect . The neckline is fun and the material looks very high quality.... \" Read more 5 customers mention weight, 5 positive, 0 negative 5 customers mention \"Weight\" 5 positive 0 negative Customers like the dress's weight, with one mentioning that the material is on the heavier side. \" Loved this dress so much! Material is on the heavier side and it is fitted at the top as described. My only issue is that it came with a weird smell.... \" Read more \" ...It’s a straight narrow sleeve. I like the material though. Light weight corduroy . \" Read more \" ...That's not a common feeling for me! It's a lovely weight , structured, and so soft. I got the brown and think it's a great, rich brown.... \" Read more \" ...The fabric was a great quality, especially given the price. It was a nice weight and not too thin. \" Read more 27 customers mention fit, 16 positive, 11 negative 27 customers mention \"Fit\" 16 positive 11 negative Customers have mixed opinions about the dress's fit, with some finding it true to size and not too short, while others report it runs small. \" ...I also really appreciated the length of the dress - not too short and not too long. The fabric was a great quality, especially given the price.... \" Read more \" ... Runs small . Order up. \" Read more \" ...Do size up, 140 lbs, 5'2 and I ordered a large and it fits great ! The corduroy has a stretch which I love, it doesn't feel confined. Def. order! \" Read more \" This dress is cute but-- it is a little boxy and longer than I wanted . I have kept it and will wear it, just not quite the fit I had hoped. \" Read more 5 customers mention sleeve shape, 2 positive, 3 negative 5 customers mention \"Sleeve shape\" 2 positive 3 negative Customers have mixed opinions about the sleeve shape of the dress. \" Super cute, soft, and I love the green. The sleeves are a little weird and it feels a little tight in the chest area. It’s pretty short on me.... \" Read more \" ...That's not a common feeling for me! It's a lovely weight, structured , and so soft. I got the brown and think it's a great, rich brown.... \" Read more \" ...Good quality too; however, there is not much shape to it . It’s a little on the longer side, but when you lift your arms the dress rides up a lot.... \" Read more \" ...hips; sleeves are a wee bit long but not past my wrists and they are straight , not flared, and easy to push up if I want; dress is a very slight a-... \" Read more 4 customers mention flattering, 2 positive, 2 negative 4 customers mention \"Flattering\" 2 positive 2 negative Customers have mixed opinions about how flattering the dress is. \" I really liked this dress. It is a perfect A-line dress that is very flattering and has just the correct amount of fabric.... \" Read more \" Oversized! Not very flattering . \" Read more \" Fabric is good. Style works really well for me . I think the product is about a 9 out of 10. Fits as per size. The color is as advertised. \" Read more \" ...It is lovely. Nice color. It did not work for me though. I went by the measurements given, and the dress came way too huge on me.... \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Very cute but different than the model version",
        "body": "This dress runs TTS and is a great work-dress length for petites, a few inches above the knee. The corduroy is the weight I expected and I believe will hold up well. I'll likely have it dry cleaned though to preserve the sizing and bc I don't iron. LOL Things to keep in mind: no pockets so no extra fabric at the hips; sleeves are a wee bit long but not past my wrists and they are straight, not flared, and easy to push up if I want; dress is a very slight a-line but cut much more straight silhouette than shown on the model. If you are looking for a flared dress (a la Anthro), this is not a dupe and the model picture is misleading. But it's giving me all the Fall vibes, and I look forward to wearing it with black tights and boots. Read more",
        "author": "JDub",
        "rating": 5.0,
        "date": "September 2, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Brown corduroy a-line dress perfect for Autumn 2025",
        "body": "Love this super comfy corduroy dress in brown so much. It’s made of an unlined thin wale, not wide wale, corduroy and runs true to the accompanying size guide. Also, the collar did need adjusting so the serged edge doesn’t pop out. (The long necklace I wore held it down so it wasn’t an issue. A piece of fashion tape would also work if you run into the same issue.) Great color and fabric for Autumn 2025, cute style and excellent value imo! Read more",
        "author": "Marylander",
        "rating": 5.0,
        "date": "September 26, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Well made",
        "body": "This dress is fantastic! Great quality. I did have to have it altered because it was too big on the back area and I wanted it more fitted but that was a personal preference. Length and quality of fabric is high end. Very well made. Read more",
        "author": "Dee",
        "rating": 4.0,
        "date": "November 26, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars LOVE this dress so much",
        "body": "ALL the stars for this dress. I've worn this to work and church several times. I feel *so chic* whenever I wear it. That's not a common feeling for me! It's a lovely weight, structured, and so soft. I got the brown and think it's a great, rich brown. As for fit - it was true to size for me. I still expect clothes from amazon to be 1-2 sizes too small, so I first ordered a size up (xxl) but had to return for my normal size (xl). I carry my weight in my middle and as I said, this fit true to size for me. I can see how if you have an hourglass shape, sizing down may work for you. Read more",
        "author": "Katie McKenzie",
        "rating": 5.0,
        "date": "April 18, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "1.0 out of 5 stars Previously worn upon arrival",
        "body": "Product arrived used, inside out in the bag and with make up on the garnet. Read more",
        "author": "Martin L. Wood",
        "rating": 1.0,
        "date": "December 4, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Cute dress",
        "body": "Really cute dress. I normally order small but for some reason I thought medium (because corduroy doesn’t stretch) might be better. It’s a little snug even though it’s a medium. Read more",
        "author": "C. S. Carr",
        "rating": 3.0,
        "date": "November 17, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Good quality",
        "body": "Quality material, fitting is great Read more",
        "author": "Nadine",
        "rating": 5.0,
        "date": "December 2, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Great quality!",
        "body": "Adorable dress for fall! Very comfortable and a perfect fit. Received lots of compliments! Read more",
        "author": "Heather Fleming",
        "rating": 5.0,
        "date": "October 24, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress V Neck Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.",
  "about_this_item": "Womens Maxi Dress V Neck Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.",
  "long_description": "Womens Maxi Dress V Neck Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Red, Brown, Pink, Beige, Blue, Black, Navy Blue, Green. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress V Neck Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Red, Brown, Pink, Beige, Blue, Black, Navy Blue, Green. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "8a6e4819-bf3c-432e-b4f7-2249a60391ca",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8a6e4819-bf3c-432e-b4f7-2249a60391ca/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8a6e4819-bf3c-432e-b4f7-2249a60391ca/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "1d7f032c-c119-4fd9-80f8-4dbb74141170",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1d7f032c-c119-4fd9-80f8-4dbb74141170/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1d7f032c-c119-4fd9-80f8-4dbb74141170/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "e48afcf5-4cf5-44ea-819b-61bf0310674d",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e48afcf5-4cf5-44ea-819b-61bf0310674d/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e48afcf5-4cf5-44ea-819b-61bf0310674d/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "072d86f7-89f8-4b82-84c0-65fd2e2ad08f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/072d86f7-89f8-4b82-84c0-65fd2e2ad08f/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/072d86f7-89f8-4b82-84c0-65fd2e2ad08f/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "4e1e8654-6625-41e7-99b6-7f4ead2adf64",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4e1e8654-6625-41e7-99b6-7f4ead2adf64/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4e1e8654-6625-41e7-99b6-7f4ead2adf64/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "713fb1f5-460b-4458-ae92-a84517505ff7",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/713fb1f5-460b-4458-ae92-a84517505ff7/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/713fb1f5-460b-4458-ae92-a84517505ff7/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "e4de4a0f-fb25-45b1-9e62-d9683156775e",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e4de4a0f-fb25-45b1-9e62-d9683156775e/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e4de4a0f-fb25-45b1-9e62-d9683156775e/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "5981557a-c3ac-4f9f-ac0d-1405e350018e",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5981557a-c3ac-4f9f-ac0d-1405e350018e/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5981557a-c3ac-4f9f-ac0d-1405e350018e/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Red": "https://m.media-amazon.com/images/I/314H3IOcevL._AC_SR38,50_.jpg",
    "Brown": "https://m.media-amazon.com/images/I/318EHWiPZYL._AC_SR38,50_.jpg",
    "Pink": "https://m.media-amazon.com/images/I/31WO-kA7HZL._AC_SR38,50_.jpg",
    "Beige": "https://m.media-amazon.com/images/I/31RayNqPqxL._AC_SR38,50_.jpg",
    "Blue": "https://m.media-amazon.com/images/I/41r6fYqecwL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31DtJ8l+QWL._AC_SR38,50_.jpg",
    "Navy Blue": "https://m.media-amazon.com/images/I/31harsfNxJL._AC_SR38,50_.jpg",
    "Green": "https://m.media-amazon.com/images/I/41S1-suum7L._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Red": "81P2h6pE8DL",
    "Brown": "61C+XtnDddL",
    "Pink": "610HqA8fu+L",
    "Beige": "7128eFUJ5+L",
    "Blue": "715-k644vKL",
    "Black": "71faBs2JLqL",
    "Navy Blue": "81OCH5aTdTL",
    "Green": "612+YFySbyL"
  },
  "color_images": {
    "Red": [
      "https://m.media-amazon.com/images/I/81P2h6pE8DL._SL1500_.jpg"
    ],
    "Brown": [
      "https://m.media-amazon.com/images/I/61C+XtnDddL._SL1500_.jpg"
    ],
    "Pink": [
      "https://m.media-amazon.com/images/I/610HqA8fu+L._SL1500_.jpg"
    ],
    "Beige": [
      "https://m.media-amazon.com/images/I/7128eFUJ5+L._SL1500_.jpg"
    ],
    "Blue": [
      "https://m.media-amazon.com/images/I/715-k644vKL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/71faBs2JLqL._SL1500_.jpg"
    ],
    "Navy Blue": [
      "https://m.media-amazon.com/images/I/81OCH5aTdTL._SL1500_.jpg"
    ],
    "Green": [
      "https://m.media-amazon.com/images/I/612+YFySbyL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress-v-neck-sleeveless",
      "title": "Womens Dress V Neck Sleeveless",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/81T7G18uRnL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-boat-neck-sleeveless",
      "title": "Womens Dress Boat Neck Sleeveless",
      "price": 19.79,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/518oJldZIfL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-formal",
      "title": "Womens Dress Formal",
      "price": 69.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51vneqmjy1L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-bodycon-sleeveless",
      "title": "Womens Dress Bodycon Sleeveless",
      "price": 40.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61nnB4TWroL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 324.43,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/41gTuGV5SBL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-formal-evening",
      "title": "Womens Maxi Dress Formal Evening",
      "price": 94.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61fzKHOQJGL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-ruched-v-neck-cocktail-maxi-formal",
      "title": "Womens Maxi Dress Ruched V Neck Cocktail Maxi Formal",
      "price": 129.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71i8AuwBqUL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-off-shoulder-maxi",
      "title": "Womens Maxi Dress Bodycon Off Shoulder Maxi",
      "price": 36.89,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61DDKd5ehZL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-v-neck-bodycon",
      "title": "Womens Maxi Dress Long Sleeve V Neck Bodycon",
      "price": 47.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61QbwpUJEwL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 76.9,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Wedding Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/514+blcsiGL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening",
      "title": "Womens Maxi Dress Formal Evening",
      "price": 77.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61Hj4-S+4eL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-cocktail-ruched",
      "title": "Womens Maxi Dress Bodycon Cocktail Ruched",
      "price": 37.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/91HL3aBO+gL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-v-neck-cocktail-evening-long-sleeve",
      "title": "Womens Maxi Dress V Neck Cocktail Evening Long Sleeve",
      "price": 64.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/71jdGTmoWkL._SL1500_.jpg"
      ]
    }
  ]
}