{
  "id": "womens-maxi-dress-long-sleeve",
  "handle": "womens-maxi-dress-long-sleeve",
  "sku": "JC1713",
  "asin": "B0DK38FMZM",
  "title": "Womens Maxi Dress Long Sleeve",
  "title_original": "Kedera Women's Fall Bow Tie Dress Casual Mini Dress Ruffle Mock Neck Long Sleeve Dress Swing Elegant Shift Dress",
  "brand": "Visit the Kedera Store",
  "price": 45.98,
  "social_proof": {
    "bought_past_month": 201,
    "text": "201+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/81K7UccWN3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81fcGpq+-xL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81fiIiG9pSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81TQ8gMTfKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81AMsyApWzL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81M5D7ezNkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61OMAdH6U4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51ogu7AsjHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51PpHkzG7uL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51gRtGN3+pL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51-Nivd0xCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81rRcvqWWnL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/81K7UccWN3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81fcGpq+-xL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81fiIiG9pSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81TQ8gMTfKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81AMsyApWzL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81M5D7ezNkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61OMAdH6U4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51ogu7AsjHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51PpHkzG7uL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51gRtGN3+pL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51-Nivd0xCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81rRcvqWWnL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ April 15, 2024",
    "ASIN ‏": "‎ B0D1QWQ81P",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#128,738 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #1,449 in Women's Casual Dresses",
    "Customer Reviews": "3.9 3.9 out of 5 stars (107)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Red",
      "Navy",
      "White",
      "Red Plaid",
      "Dark Blue",
      "Black",
      "Green"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 3.9,
    "count": 107,
    "customers_say": "Customers find the dress to be of good quality with thick fabric, and one customer notes it's made of high-quality lined red plaid. The neck ruffle receives positive feedback, with one customer describing it as flattering. Customers disagree on whether the dress runs true to size, with some finding it runs small. The dress receives mixed feedback regarding fit, with some finding it good while others say it's too oversized for petite frames. The material weight is criticized for being extremely heavy, and customers find it hard to tie. Generated from the text of customer reviews Select to learn more Quality (26) Fabric quality (22) Dress quality (11) Neck ruffle (6) Fit (22) Size (8) Material weight (9) Tie difficulty (6) 26 customers mention quality, 24 positive, 2 negative 26 customers mention \"Quality\" 24 positive 2 negative Customers find the dress to be of nice quality and adorable. \" ...But for $40? Totally worth it. This is super cute - wore it for a nice dinner out and it was great.... \" Read more \" ...It’s nice quality , thick fabric, but if you’re not willing to eat the cost of the dress and initial shipping don’t risk it because the difficulty... \" Read more \" The dress is high quality , comfortable and the perfect dress for Christmas or Valentine’s Day! It fits true to size \" Read more \" Love this dress . A-line, fully lined and a perfect red plaid. I purchased a green cardigan from Amazon to wear with it if the weather turns colder.... \" Read more 22 customers mention fabric quality, 17 positive, 5 negative 22 customers mention \"Fabric quality\" 17 positive 5 negative Customers like the fabric of the dress, describing it as great and thick, with one customer noting it's soft. \" Good and bad. The dress itself is great!! Love the fabric and neck ruffle, however the bow is too heavy and stiff -can’t tie it easily-cute idea... \" Read more \" The dress is a nice color the fabric has no give . Wasn’t able to get it over my head \" Read more \" I received so many compliments on this dress. It has a nice thick fabric . It has pockets \" Read more \" ...It’s also VERY wrinkle prone because 100% polyester .... \" Read more 11 customers mention dress quality, 11 positive, 0 negative 11 customers mention \"Dress quality\" 11 positive 0 negative Customers describe the dress as great, with one mentioning it's perfect for Galantines or date night. \" ...But otherwise it is a great dress ...just can't wear due to the bow being too heavy. \" Read more \" This was the perfect dress . The bobbin the back added just the right touch. \" Read more \" Dress is great \" Read more \" This dress is perfect !! The fabric is out of this world soft and substantial .. think scuba fabric.... \" Read more 6 customers mention neck ruffle, 5 positive, 1 negative 6 customers mention \"Neck ruffle\" 5 positive 1 negative Customers like the neck ruffle of the dress, with one mentioning it's flattering and another noting how the bobbin detail in the back adds the right touch. \" I love this dress!! Comfortable and even the ruffle around the neck is flattering and not annoying.... \" Read more \" Good and bad. The dress itself is great!! Love the fabric and neck ruffle , however the bow is too heavy and stiff -can’t tie it easily-cute idea... \" Read more \" ...The neck ruffle is perfect on my petite neck and doesn't overconsume me and look comically large. 1000% recommend.... \" Read more \" This was the perfect dress. The bobbin the back added just the right touch . \" Read more 22 customers mention fit, 14 positive, 8 negative 22 customers mention \"Fit\" 14 positive 8 negative Customers have mixed opinions about the dress's fit, with some finding it true to size and appreciating the fabric quality, while others report it being oversized for petite frames and too short. \" Fits true to size and is a nice thick material. Haven’t washed so not sure about that but really nice classic dress. \" Read more \" Too tight in the bust . \" Read more \" Wins: medium was suggested and fit . 5 for 6. 167lbs. Above knee but not too short.... \" Read more \" Perfect fit for my body . Loved the fit, Unfortunately a bit see- thu. Be sure to wear a slip. \" Read more 8 customers mention size, 4 positive, 4 negative 8 customers mention \"Size\" 4 positive 4 negative Customers have mixed opinions about the dress's sizing, with some finding it true to size while others report that it runs small. \" Fit well and true to size ! \" Read more \" ...It also runs very large and look like a huge sack on me. I’m sure it looks lovely on some other body types, but definitely not for me.... \" Read more \" Wins: medium was suggested and fit. 5 for 6. 167lbs. Above knee but not too short.... \" Read more \" Cute but size up. Runs small . \" Read more 9 customers mention material weight, 1 positive, 8 negative 9 customers mention \"Material weight\" 1 positive 8 negative Customers find the dress's material extremely heavy, with one customer noting that the back tie is particularly burdensome. \" ...Love the fabric and neck ruffle, however the bow is too heavy and stiff -can’t tie it easily-cute idea but not workable. Would not buy again! \" Read more \" This is a very heavy thick material , so definitely not something for an outdoorsy or warm weather event.... \" Read more \" Fabric was quality but the bow was so much fabric, it was too heavy and looked terrible. \" Read more \" The back tie is too heavy for the dress and very impractical. I didn't have time to return the dress because I needed it for an event.... \" Read more 6 customers mention tie difficulty, 1 positive, 5 negative 6 customers mention \"Tie difficulty\" 1 positive 5 negative Customers find the dress difficult to tie, particularly noting issues with pulling at the neck. \" ...Only complaint, the bow in the back is very stif. Hard to tie . \" Read more \" ...It pulled at the neck and made it pucker. Returned. \" Read more \" Bow is too heavy and very hard to tie . No reasonable way to return - it’s more than the dress cost! \" Read more \" ...The ribbon closure in the back is way too clumsy and not easy to work with and makes the neck detail look stretched and weird.... \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars High quality lined red plaid A-line dress",
        "body": "Love this dress. A-line, fully lined and a perfect red plaid. I purchased a green cardigan from Amazon to wear with it if the weather turns colder. I purchased a XXL size that falls in soft folds around my body. I am 5’3” and 210 lbs. Read more",
        "author": "PS",
        "rating": 5.0,
        "date": "December 19, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/81tpeawNS0L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Nice dress!",
        "body": "Beautiful, love the fabric, but a lil short for me, but it’s a great length for younger ladies! Read more",
        "author": "kay young",
        "rating": 5.0,
        "date": "April 6, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Runs very large and is a heavy material",
        "body": "This is a very heavy thick material, so definitely not something for an outdoorsy or warm weather event. It also runs very large and look like a huge sack on me. I’m sure it looks lovely on some other body types, but definitely not for me. Also, if you’re doing pictures, this may not be a good option as you cannot see the bow from the front at all. Read more",
        "author": "Gesh",
        "rating": 3.0,
        "date": "November 26, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars All polyester, stains come out easily",
        "body": "Bought this for a Halloween costume. Perfect for the occasion. Fit comfortably. Stains came out in the wash. Read more",
        "author": "Desiree V",
        "rating": 4.0,
        "date": "February 23, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "1.0 out of 5 stars Might as well be non refundable",
        "body": "Shouldn’t have purchased. Too oversized for my petite frame. 125 lbs 5’7” don’t make my mistake because you literally can’t return for more than like 10x the cost of the dress. It’s nice quality, thick fabric, but if you’re not willing to eat the cost of the dress and initial shipping don’t risk it because the difficulty and expense of shipping back to China is ridiculous. Read more",
        "author": "Tori",
        "rating": 1.0,
        "date": "December 17, 2024",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Great quality",
        "body": "I enjoyed the quality of the fabric and the fact that it wasn’t thin or see through. Perfect for Galantines or date night. Paired it with a pearl clutch and sparkly shoes. For reference I am 5’1 | 150lbs. | size medium Read more",
        "author": "Peter",
        "rating": 5.0,
        "date": "February 14, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61j7WCH+5vL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "2.0 out of 5 stars Sizing",
        "body": "Too tight in the bust . Read more",
        "author": "Jessie R.",
        "rating": 2.0,
        "date": "December 21, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Tuckernuck Dupe",
        "body": "Great quality for the price! Thick heavy material. Fits true to size. Deep navy color as pictured! Read more",
        "author": "Nicole Bryson",
        "rating": 5.0,
        "date": "June 9, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.",
  "about_this_item": "Womens Maxi Dress Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.",
  "long_description": "Womens Maxi Dress Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Red, Navy, White, Red Plaid, Dark Blue, Black, Green. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Red, Navy, White, Red Plaid, Dark Blue, Black, Green. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "e0e3e7e3-3591-4717-9ace-019fc4f8bd29",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e0e3e7e3-3591-4717-9ace-019fc4f8bd29/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e0e3e7e3-3591-4717-9ace-019fc4f8bd29/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "8b9fced3-bfdc-4093-9ca7-f98d833be0c7",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8b9fced3-bfdc-4093-9ca7-f98d833be0c7/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8b9fced3-bfdc-4093-9ca7-f98d833be0c7/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "1737b356-8fff-4016-af09-75b19ab97666",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1737b356-8fff-4016-af09-75b19ab97666/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1737b356-8fff-4016-af09-75b19ab97666/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "b1d2279b-60fa-4768-b4de-d0d266196234",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b1d2279b-60fa-4768-b4de-d0d266196234/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b1d2279b-60fa-4768-b4de-d0d266196234/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "209cb8a4-66e0-4205-b695-c46d8ca07494",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/209cb8a4-66e0-4205-b695-c46d8ca07494/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/209cb8a4-66e0-4205-b695-c46d8ca07494/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "0d0fa41c-4ee5-451c-a3d4-761b5b469812",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0d0fa41c-4ee5-451c-a3d4-761b5b469812/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0d0fa41c-4ee5-451c-a3d4-761b5b469812/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "e550eeb5-0357-4eae-a0d9-5c5929ded1bb",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e550eeb5-0357-4eae-a0d9-5c5929ded1bb/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e550eeb5-0357-4eae-a0d9-5c5929ded1bb/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "54b365eb-8063-4ab9-a6ba-b8e8bd1a23df",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/54b365eb-8063-4ab9-a6ba-b8e8bd1a23df/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/54b365eb-8063-4ab9-a6ba-b8e8bd1a23df/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "76d69e73-f54e-4682-9823-43a2a4c2f85d",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/76d69e73-f54e-4682-9823-43a2a4c2f85d/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/76d69e73-f54e-4682-9823-43a2a4c2f85d/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "df7d6f73-57f2-454f-8ef8-676733e27b6e",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/df7d6f73-57f2-454f-8ef8-676733e27b6e/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/df7d6f73-57f2-454f-8ef8-676733e27b6e/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "5189a128-e46f-4db6-af73-0644e346f5c8",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5189a128-e46f-4db6-af73-0644e346f5c8/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5189a128-e46f-4db6-af73-0644e346f5c8/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "c819f466-79bb-451e-8ee9-62855606c975",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c819f466-79bb-451e-8ee9-62855606c975/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c819f466-79bb-451e-8ee9-62855606c975/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Red": "https://m.media-amazon.com/images/I/316K1qytt4L._AC_SR38,50_.jpg",
    "Navy": "https://m.media-amazon.com/images/I/31e3vWCiZ-L._AC_SR38,50_.jpg",
    "White": "https://m.media-amazon.com/images/I/21iiWFKODXL._AC_SR38,50_.jpg",
    "Red Plaid": "https://m.media-amazon.com/images/I/419Niue+L1L._AC_SR38,50_.jpg",
    "Dark Blue": "https://m.media-amazon.com/images/I/31k+RR1bvOL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/310+se6n4JL._AC_SR38,50_.jpg",
    "Green": "https://m.media-amazon.com/images/I/41C5hRpCcsL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Red": "61OMAdH6U4L",
    "Navy": "51ogu7AsjHL",
    "White": "51PpHkzG7uL",
    "Red Plaid": "81K7UccWN3L",
    "Dark Blue": "51gRtGN3+pL",
    "Black": "51-Nivd0xCL",
    "Green": "81rRcvqWWnL"
  },
  "color_images": {
    "Red": [
      "https://m.media-amazon.com/images/I/61OMAdH6U4L._SL1500_.jpg"
    ],
    "Navy": [
      "https://m.media-amazon.com/images/I/51ogu7AsjHL._SL1500_.jpg"
    ],
    "White": [
      "https://m.media-amazon.com/images/I/51PpHkzG7uL._SL1500_.jpg"
    ],
    "Red Plaid": [
      "https://m.media-amazon.com/images/I/81K7UccWN3L._SL1500_.jpg"
    ],
    "Dark Blue": [
      "https://m.media-amazon.com/images/I/51gRtGN3+pL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/51-Nivd0xCL._SL1500_.jpg"
    ],
    "Green": [
      "https://m.media-amazon.com/images/I/81rRcvqWWnL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress-cocktail-bodycon",
      "title": "Womens Dress Cocktail Bodycon",
      "price": 47.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61NfEwzl3xL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-one-shoulder-maxi-formal",
      "title": "Womens Maxi Dress Evening One Shoulder Maxi Formal",
      "price": 69.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/5150AIQL4eL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail",
      "title": "Womens Dress Cocktail",
      "price": 103.54,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61JApwce25L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-formal-bodycon-evening-sleeveless",
      "title": "Womens Maxi Dress Maxi Formal Bodycon Evening Sleeveless",
      "price": 61.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61s8qg6u1VL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 158.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71PmRANW40L._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress-bodycon-split-ruched-off-shoulder",
      "title": "Womens Dress Bodycon Split Ruched Off Shoulder",
      "price": 38.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/41JjYcPgcpL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 95.61,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Work",
      "images": [
        "https://m.media-amazon.com/images/I/71hVgSIB1jL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 138.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51PZNrlyY9L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-split-evening-formal",
      "title": "Womens Maxi Dress Split Evening Formal",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51BZ1BqPx8L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 65.97,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/81wr8PDg55L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-v-neck",
      "title": "Womens Dress V Neck",
      "price": 82.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/710bSTpZ9hL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 278.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/91YXeyW506L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening-long-sleeve",
      "title": "Womens Maxi Dress Formal Evening Long Sleeve",
      "price": 87.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61nnk+flvaL._SL1500_.jpg"
      ]
    }
  ]
}