{
  "id": "womens-maxi-dress-long-sleeve",
  "handle": "womens-maxi-dress-long-sleeve",
  "sku": "JC1330",
  "asin": "B0DK4Y92LK",
  "title": "Womens Maxi Dress Long Sleeve",
  "title_original": "CIDER Sweater Dress for Women Long Sleeve Dress Mock Turtleneck Bow Tie Midi Work Dresses Old Money Dresses Fall Winter",
  "brand": "Visit the CIDER Store",
  "price": 45.99,
  "social_proof": {
    "bought_past_month": 1697,
    "text": "1697+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/61LabDaKTsL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71FCZQpRh4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61K8rj-O+LL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71E5iOMolHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/716ji9kgkqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61i1qh4MPDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61JBS4YXmRL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61p7RxDjlfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/619suRrUeyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61KUKoRLnkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71nqGWLzuKL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/61LabDaKTsL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71FCZQpRh4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61K8rj-O+LL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71E5iOMolHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/716ji9kgkqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61i1qh4MPDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61JBS4YXmRL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61p7RxDjlfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/619suRrUeyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61KUKoRLnkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71nqGWLzuKL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ October 16, 2024",
    "ASIN ‏": "‎ B0DK4XZMWQ",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#22,217 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #179 in Women's Casual Dresses",
    "Customer Reviews": "4.6 4.6 out of 5 stars (147)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Khaki",
      "Beige",
      "Burgundy",
      "Olive Green",
      "Black",
      "Grey"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.6,
    "count": 147,
    "customers_say": "Customers find this dress chic and well-made, with soft, high-quality fabric that's not too heavy. The dress fits well and is true to size, with one customer noting it falls below the calf. They appreciate its comfort and flattering design, with one mentioning it hides tummy concerns. Generated from the text of customer reviews Select to learn more Elegance (34) Fit (27) Quality (22) Fabric feel (13) Comfort (10) Flattering (9) Weight (9) Size (8) 34 customers mention elegance, 34 positive, 0 negative 34 customers mention \"Elegance\" 34 positive 0 negative Customers find the dress chic and sophisticated, with one mentioning it makes them feel feminine. \" Great dress it’s elegant and simple. She usually wears a large and chose a medium and it fit perfectly \" Read more \" ...I absolutely love this dress, well made a comfortable and very classy . \" Read more \" Really pretty. Perfect sized, not to heavy, Sophisticated ! Was very wrinkled but easily taken care of. 133, I got the large.... \" Read more \" This dress is beautiful , looks just like pictured on your website It fits like a GLOVE \" Read more 27 customers mention fit, 24 positive, 3 negative 27 customers mention \"Fit\" 24 positive 3 negative Customers find that the dress fits well, with one mentioning it is skin tight. \" ... Fits like a glove and true to size. I'm on the petite/shorter side 5'1 and it falls a bit below my calf, so can pair with boots or heels!... \" Read more \" Beautiful fit , very nice fabric. Will look great with boots as well as high heels. \" Read more \" Fits perfect ! I absolutely love this dress, well made a comfortable and very classy. \" Read more \" Fit perfectly BUT. The first time I tied the sash it came unraveled. Pulling apart.... \" Read more 22 customers mention quality, 20 positive, 2 negative 22 customers mention \"Quality\" 20 positive 2 negative Customers find the dress well-made, with one customer noting its excellent stitching and another mentioning it doesn't look or feel cheap. \" This is a great dress to have in my closet. It is versatile for seasonal occasions. Looks exactly as pictured. Very comfortable.... \" Read more \" This fit is perfect. I had so many compliments on the dress. Great quality and soft material.... \" Read more \" This sweater dress is beautifully made — the fabric feels high quality, soft, and substantial, and the stitching is excellent.... \" Read more \" Love the dress . The material feels nice. The fit is flattering. I felt fabulous. I wore with high heel boot and received compliments. \" Read more 13 customers mention fabric feel, 13 positive, 0 negative 13 customers mention \"Fabric feel\" 13 positive 0 negative Customers appreciate the dress's fabric, describing it as soft and high-quality. \" This sweater dress is beautifully made— the fabric feels high quality, soft , and substantial, and the stitching is excellent.... \" Read more \" This is ABSOLUTELY Amazing and very Soft . I wore this dress to Church and Received many compliments ☺️ \" Read more \" ...The weight is perfect, and just the right length. It’s a knit fabric . Doesn’t cling. \" Read more \" Beautiful fit, very nice fabric . Will look great with boots as well as high heels. \" Read more 10 customers mention comfort, 10 positive, 0 negative 10 customers mention \"Comfort\" 10 positive 0 negative Customers find the dress comfortable. \" I really like the fit of this dress it’s very flattering and comfortable I was hesitant to buy as past online purchases like this are always 2... \" Read more \" ...It’s not too light and not too heavy so I was very comfortable in an overly air conditioned meeting room. Great quality and true to size. \" Read more \" I am 5.11, I ordered XL, I am happy with this dress. Its super cozy , warm, stretches. Elegant dress. \" Read more \" ...Great quality and soft material. It allowed me to be comfortable in all day meetings and look stylish. \" Read more 9 customers mention flattering, 8 positive, 1 negative 9 customers mention \"Flattering\" 8 positive 1 negative Customers find the dress flattering, with one mentioning that it hides stomach concerns and another noting that the material hugs in all the right places. \" I really like the fit of this dress it’s very flattering and comfortable I was hesitant to buy as past online purchases like this are always 2... \" Read more \" ...Was very wrinkled but easily taken care of. 133, I got the large. Hides my stomach . Excellent for the cost! Fits but not clingy!... \" Read more \" ...It fits very well and looks flattering , but for me, it’s a bit too snug for my comfort.... \" Read more \" Fit beautifully. Arrived quickly. It is a heavier knit so it hugs in all the right place ! Fir the price, I thought is was a good deal. \" Read more 9 customers mention weight, 9 positive, 0 negative 9 customers mention \"Weight\" 9 positive 0 negative Customers appreciate that the dress is not too heavy. \" ...I love the weight of the fabric and the fit. \" Read more \" Love , love this sweater dress. The material is not too heavy . Great fit for Price. \" Read more \" Fit beautifully. Arrived quickly. It is a heavier knit so it hugs in all the right place! Fir the price, I thought is was a good deal. \" Read more \" Heavy weight knit . Really classy looking dress. Love it. \" Read more 8 customers mention size, 7 positive, 1 negative 8 customers mention \"Size\" 7 positive 1 negative Customers find the dress runs true to size. \" ...Fits like a glove and true to size . I'm on the petite/shorter side 5'1 and it falls a bit below my calf, so can pair with boots or heels!... \" Read more \" Really pretty. Perfect sized , not to heavy, Sophisticated! Was very wrinkled but easily taken care of. 133, I got the large.... \" Read more \" Runs true to size ... \" Read more \" Very good quality. Size is spot on !... \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Comfort and Style",
        "body": "This fit is perfect. I had so many compliments on the dress. Great quality and soft material. It allowed me to be comfortable in all day meetings and look stylish. Read more",
        "author": "Tina C.",
        "rating": 5.0,
        "date": "December 20, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/81i7SNV67AL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Comfort and Class",
        "body": "Fantastic dress and feel. Very soft sweater material especially for those who have sensitive skin. Elegant look where the wrap hides tummy concerns while allowing to show off your curves in a respectable manner as the material hugs your curves. The material is quite stretchy and keeps you warm in the winter. True to size. I hope you enjoy it as much as I have been. I have gotten lots of compliments in the office and out while at dinner with my husband. Read more",
        "author": "John F Norton",
        "rating": 5.0,
        "date": "November 18, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/51idyRP9MUL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/51IjXUBC1PL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Great sweat dress",
        "body": "The Long Sleeve High Neck maroon/burgundy Sweater Dress is absolutely stunning! The color is beautiful, and the material feels high-quality and soft. It fits very well and looks flattering, but for me, it’s a bit too snug for my comfort. If you enjoy a more form-fitting style, this dress is a great choice — elegant and well-made. Personally, I prefer something with a little more room to move, but overall, it’s a lovely piece. Read more",
        "author": "Kimberly",
        "rating": 5.0,
        "date": "November 2, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71KKR8hAz9L._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71SGeBX92NL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/7140kFpO8sL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "4.0 out of 5 stars Classy Sweater Dress-color block belt makes it!",
        "body": "Awesome sweater dress-light weight, but does does not look or feel cheap. Fits like a glove and true to size. I'm on the petite/shorter side 5'1 and it falls a bit below my calf, so can pair with boots or heels! Great price point for this dress. Read more",
        "author": "stacey a wilson",
        "rating": 4.0,
        "date": "November 20, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Buy",
        "body": "Really pretty. Perfect sized, not to heavy, Sophisticated! Was very wrinkled but easily taken care of. 133, I got the large. Hides my stomach. Excellent for the cost! Fits but not clingy! Love the dress. Read more",
        "author": "Nickki",
        "rating": 5.0,
        "date": "November 24, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars So many compliments!",
        "body": "Got this for a work trip to a colder climate and didn’t want to spend a lot of money because I live in Florida and don’t need winter work clothes. It’s adorable!! I received sooooo many compliments on this dress-I was surprised how many people noticed it. Definitely worth the money! It’s not too light and not too heavy so I was very comfortable in an overly air conditioned meeting room. Great quality and true to size. Read more",
        "author": "Oakley14",
        "rating": 5.0,
        "date": "November 1, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Perfect dress",
        "body": "Fits perfect! I absolutely love this dress, well made a comfortable and very classy. Read more",
        "author": "Received this yesterday. So soft and fits perfect and I highly recommend.",
        "rating": 5.0,
        "date": "December 8, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Cute but..",
        "body": "Fit perfectly BUT. The first time I tied the sash it came unraveled. Pulling apart. I wore it anyway I didn’t have another to wear in such short notice Read more",
        "author": "Todd&Kelli Stafford",
        "rating": 3.0,
        "date": "January 4, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.",
  "about_this_item": "Womens Maxi Dress Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.",
  "long_description": "Womens Maxi Dress Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Khaki, Beige, Burgundy, Olive Green, Black, Grey. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Khaki, Beige, Burgundy, Olive Green, Black, Grey. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "f288f9b4-1696-4cd9-a37f-79a8f5a5da99",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f288f9b4-1696-4cd9-a37f-79a8f5a5da99/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f288f9b4-1696-4cd9-a37f-79a8f5a5da99/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "cfb8a669-6834-49a6-9bb9-d7c5340035d1",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/cfb8a669-6834-49a6-9bb9-d7c5340035d1/embedded.cc.default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/cfb8a669-6834-49a6-9bb9-d7c5340035d1/embedded.cc.default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "1a1beb79-b679-40e0-8a91-3c0bb6e47f68",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1a1beb79-b679-40e0-8a91-3c0bb6e47f68/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1a1beb79-b679-40e0-8a91-3c0bb6e47f68/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "61c65ea6-a807-4184-8082-ced094711597",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/61c65ea6-a807-4184-8082-ced094711597/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/61c65ea6-a807-4184-8082-ced094711597/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Khaki": "https://m.media-amazon.com/images/I/21oiVSEavZL._AC_SR38,50_.jpg",
    "Beige": "https://m.media-amazon.com/images/I/21y59D0i+RL._AC_SR38,50_.jpg",
    "Burgundy": "https://m.media-amazon.com/images/I/318P89OZE8L._AC_SR38,50_.jpg",
    "Olive Green": "https://m.media-amazon.com/images/I/211gAVV2yDL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/21fOuKuEGXL._AC_SR38,50_.jpg",
    "Grey": "https://m.media-amazon.com/images/I/21zCseRfMgL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Khaki": "61JBS4YXmRL",
    "Beige": "61p7RxDjlfL",
    "Burgundy": "619suRrUeyL",
    "Olive Green": "61KUKoRLnkL",
    "Black": "61LabDaKTsL",
    "Grey": "71nqGWLzuKL"
  },
  "color_images": {
    "Khaki": [
      "https://m.media-amazon.com/images/I/61JBS4YXmRL._SL1500_.jpg"
    ],
    "Beige": [
      "https://m.media-amazon.com/images/I/61p7RxDjlfL._SL1500_.jpg"
    ],
    "Burgundy": [
      "https://m.media-amazon.com/images/I/619suRrUeyL._SL1500_.jpg"
    ],
    "Olive Green": [
      "https://m.media-amazon.com/images/I/61KUKoRLnkL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/61LabDaKTsL._SL1500_.jpg"
    ],
    "Grey": [
      "https://m.media-amazon.com/images/I/71nqGWLzuKL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress-cocktail-bodycon",
      "title": "Womens Dress Cocktail Bodycon",
      "price": 47.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61NfEwzl3xL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-one-shoulder-maxi-formal",
      "title": "Womens Maxi Dress Evening One Shoulder Maxi Formal",
      "price": 69.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/5150AIQL4eL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail",
      "title": "Womens Dress Cocktail",
      "price": 103.54,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61JApwce25L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-formal-bodycon-evening-sleeveless",
      "title": "Womens Maxi Dress Maxi Formal Bodycon Evening Sleeveless",
      "price": 61.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61s8qg6u1VL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 158.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71PmRANW40L._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress-bodycon-split-ruched-off-shoulder",
      "title": "Womens Dress Bodycon Split Ruched Off Shoulder",
      "price": 38.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/41JjYcPgcpL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 95.61,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Work",
      "images": [
        "https://m.media-amazon.com/images/I/71hVgSIB1jL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 138.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51PZNrlyY9L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-split-evening-formal",
      "title": "Womens Maxi Dress Split Evening Formal",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51BZ1BqPx8L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 65.97,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/81wr8PDg55L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-v-neck",
      "title": "Womens Dress V Neck",
      "price": 82.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/710bSTpZ9hL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 278.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/91YXeyW506L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening-long-sleeve",
      "title": "Womens Maxi Dress Formal Evening Long Sleeve",
      "price": 87.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61nnk+flvaL._SL1500_.jpg"
      ]
    }
  ]
}