{
  "id": "womens-dress-bodycon-cocktail",
  "handle": "womens-dress-bodycon-cocktail",
  "sku": "JC1303",
  "asin": "B0DKXV4MBS",
  "title": "Womens Dress Bodycon Cocktail",
  "title_original": "CHICME Womens Sexy Bodycon Party Dress Off The Shoulder Pearls Strap Midi Dress Ruffle Hem Cocktail Dresses",
  "brand": "Visit the CHICME Store",
  "price": 39.99,
  "social_proof": {
    "bought_past_month": 1512,
    "text": "1512+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/61HFhbQgC2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51Gm46eWxkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61qsKePHe2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51kYCgnjGDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61feFH0eSkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51u-KQtRDvL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51JfCA4mSaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41z9kRdUt1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/516zkQa24yL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61apc25Ok7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61MQC1QhNyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51-jPRI+mDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61NeHJBkfmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61MR2Vbq7JL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51p881FrAnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41hfHjhsOaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51yPrILJBrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61e4KFg5bxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51EkBZaROxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51DKFWhH12L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ESlx1YsEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/511NbfXunTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61EJI8s2MvL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61UAhCl3sQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51a9rwG6IHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61CAooNPOqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51GgfroquyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51Sakf-LhcL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/61HFhbQgC2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51Gm46eWxkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61qsKePHe2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51kYCgnjGDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61feFH0eSkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51u-KQtRDvL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51JfCA4mSaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41z9kRdUt1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/516zkQa24yL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61apc25Ok7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61MQC1QhNyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51-jPRI+mDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61NeHJBkfmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61MR2Vbq7JL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51p881FrAnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41hfHjhsOaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51yPrILJBrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61e4KFg5bxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51EkBZaROxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51DKFWhH12L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ESlx1YsEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/511NbfXunTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61EJI8s2MvL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61UAhCl3sQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51a9rwG6IHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61CAooNPOqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51GgfroquyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51Sakf-LhcL._SL1500_.jpg"
  ],
  "aplus_images": [
    "https://m.media-amazon.com/images/I/41%2B0%2BkRmkDL._SL1500_.jpg"
  ],
  "description_images": [
    "https://m.media-amazon.com/images/I/41%2B0%2BkRmkDL._SL1500_.jpg"
  ],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ October 25, 2024",
    "ASIN ‏": "‎ B0DKXRQR1J",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#7,308 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #19 in Women's Club & Night Out Dresses #46 in Women's Cocktail Dresses",
    "Customer Reviews": "3.9 3.9 out of 5 stars (580)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Red",
      "S-coffee",
      "Blue",
      "T-pink",
      "Black",
      "Green"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 3.9,
    "count": 580,
    "customers_say": "Customers love the dress's beauty, particularly the pearl straps that add elegance, and appreciate its fit, stretchiness, and vibrant red color. The material quality receives mixed feedback - while some find it nice, others describe it as cheap and thin. Moreover, the dress's durability is concerning, with customers reporting that the pearl straps break very easily. Additionally, several customers mention receiving their dress without the pearl straps. Select to learn more Beauty Fit Quality Stretchiness Color Material quality Strap durability Straps missing 75 customers mention \"Beauty\" 70 positive 5 negative Customers find the dress beautiful, with one mentioning it can be dressed up or down for different styles, while another describes it as holiday glam. \" Beautiful dress . My granddaughter looked amazing for homecoming. Her other dress was not a good fit, so 1 day before homecoming, this beauty arrived.\" Read more \" Cute dress but the top was cheaply made. Bottom is perfect! The top where the pearls are placed is just poorly done....\" Read more \" Dress is beautiful , very pretty and great priced, I gave 4 starts because the pearl straps fall down and don't stay in place very well.\" Read more \"Is it cute ? Girl look at it. Yes. Does it dress? Yes. Is it great quality? Absolutely not lol....\" Read more 61 customers mention \"Fit\" 53 positive 8 negative Customers are satisfied with the dress's fit, particularly noting its perfect length and stunning appearance. \"I love how soft this dress feels! Fits perfectly ! I’m a size medium. It’s not see through and not wrinkled. Silky material....\" Read more \"Beautiful dress, great fit \" Read more \"It’s more teal than green but I like the fit . The material is very stretchy and thin....\" Read more \" Fits like a glove . VERY stretchy. Soft material.\" Read more 48 customers mention \"Quality\" 38 positive 10 negative Customers have mixed opinions about the dress's quality, with some finding it good and loving it, while others describe it as cheaply made. \" Nice dress , I received lots of compliments. I loved the ruffle on the bottom. Lightweight fabric, true to size....\" Read more \"...The dress is soft and feels to be of a good quality . Shipping was fast! This is going to be great for the banquet that I have coming up this weekend.\" Read more \" Love the dress . Material is thin, but wearable. Can put a seamless spanking on and still look good....\" Read more \"...Material feels cheap, poor quality . Will return.\" Read more 24 customers mention \"Stretchiness\" 21 positive 3 negative Customers appreciate the dress's stretchiness, with one noting its breathable material. \"...Fits like a dream. True to size and very sexy/flirty dress! Very stretchy will fit easily and I love the fabric! The pearl straps are a nice touch!\" Read more \"I really loved this dress. Is super comfortable and stretchy . Everyone said it looked fantastic!\" Read more \"...It was just as it appears in the ad, and it's quite stretchy . It fits great. Only thing, the company needs to do better with packaging....\" Read more \"The dress is stretchable & style is cute but pearls broke off easily. I don’t think dress is worth the price charged.\" Read more 16 customers mention \"Color\" 15 positive 1 negative Customers love the dress's color, particularly its vibrant red shade. \"Good quality dress, loved the color and style . My only complaint is that the chains for the pearl shoulders are fragile and easily broken....\" Read more \"...The royal blue color is vibrant and flattering on many skin tones, while the asymmetrical ruffled hem adds a touch of elegance and movement.\" Read more \"This dress is beautiful and the color is everything ! Fits perfectly i got a size large true to fit . Lived it !\" Read more \"...I ordered a Medium I’m 5’3 160 lbs. very flattering and it’s a vibrant red .\" Read more 47 customers mention \"Material quality\" 23 positive 24 negative Customers have mixed opinions about the dress's material quality, with some loving the fabric while others describe it as cheap and thin. \" Very cheap material , beads on the arms one side was broke don’t buy,\" Read more \"Very beautiful dress. Fits well and comfortable. Great material \" Read more \" Bad material \" Read more \"...pink one, I loved the detail of the pearls on the straps, they are very thin , just like the turn it gives on the leg, it is very thin and elegant\" Read more 30 customers mention \"Strap durability\" 3 positive 27 negative Customers report issues with the dress's straps breaking easily and being flimsy. \"...for a cruise for elegant night and as soon as I tried it on the pearl straps broke , which was fine because I fixed it, so I thought....\" Read more \"Beautiful but broke when I tried it on \" Read more \"The dress arrive on the expected date, but the straps were broken .\" Read more \"Cheap material, straps snapped as you as you put it on\" Read more 20 customers mention \"Straps missing\" 5 positive 15 negative Customers report issues with the dress's straps, noting that they are missing or not properly attached. \"...I also got the wrong size, the straps were missing \" Read more \"The straps are missing and I can't used the dress is so cute but I need the straps, I just give a 3 star because I can used it , but everything...\" Read more \"Beautiful dress/ cheap straps ...\" Read more \"...It was missing the pearl straps . I had to buy pearls and make straps because if I exchanged the dress for a new one it would not have come in time.\" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Just right fit",
        "body": "The dress is cute. Color same as picture. Sizing for medium at 130 is perfecto. Pearl straps add a touch of elegance. Material is of good quality and soft. None see through. Length good and split is just right. Read more",
        "author": "Faye",
        "rating": 5.0,
        "date": "December 18, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Fits great true to size!",
        "body": "Bought this for NYE party. Fits like a dream. True to size and very sexy/flirty dress! Very stretchy will fit easily and I love the fabric! The pearl straps are a nice touch! Read more",
        "author": "Jerel Hotaling",
        "rating": 5.0,
        "date": "December 15, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Super cute dress.",
        "body": "Super cuteeeee. Get the dress. Wore it to a wedding and was stunning. It had no smell and fit like a glove! I got a small I'm 135 and 5'7. Fabric feels good on the skin. And worth every penny. Read more",
        "author": "Kitty Ross",
        "rating": 5.0,
        "date": "December 3, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71HMfIO0dRL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "4.0 out of 5 stars The colors is beautiful. The material is beautiful although the straps do need work.",
        "body": "So overall, the dress was beautiful. Right out of the package, the pearl straps broke. That was no problem because I fixed it. But then as I put on the dress to go out to my event, it broke once again so I had to fix it once again, but with the stronger I had to add a stronger piece to hold it together. For this dress being the price it is they need to make more sturdy, pearl straps. Other than that it was a beautiful dress. I wear a size medium, so I bought a size medium perfect!! Read more",
        "author": "Marlaina",
        "rating": 4.0,
        "date": "September 29, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61YuM68jwvL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/713J5R7z1cL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Beautiful Sexy dress",
        "body": "I ordered the dress in two sizes LG and EXLG. The large fit perfectly and material is very stretchey. I'm 5'4\" and 210. I had no problem with the pearl straps, but you will need help attaching because you have to wait until you have dress on your body. Read more",
        "author": "venetta steward",
        "rating": 5.0,
        "date": "December 18, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71KRbyRggQL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71pzvmKNStL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "3.0 out of 5 stars Sexy Dress",
        "body": "Love the dress. Material is thin, but wearable. Can put a seamless spanking on and still look good. The beads on the straps may break, so be careful putting dress on. Read more",
        "author": "Customer",
        "rating": 3.0,
        "date": "December 9, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Beautifully made dress",
        "body": "Fabric is so soft and the dress forms to your body perfectly. I’m 5’1 and was nervous it would be too long but the length was perfect and the color matches the picture perfectly. Read more",
        "author": "Sherri Scantling",
        "rating": 5.0,
        "date": "December 17, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Beautiful dress",
        "body": "Beautiful dress I love the pearls on shoulders material not bad, soft. My only trouble was pulling my dress down because it kept raising up. Read more",
        "author": "Shoronda Johnson",
        "rating": 4.0,
        "date": "November 10, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/81ENmLS0PnL._SY88._SL1500_.jpg"
        ]
      }
    ]
  },
  "short_description": "Womens Dress Bodycon Cocktail is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.",
  "about_this_item": "Womens Dress Bodycon Cocktail is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.",
  "long_description": "Womens Dress Bodycon Cocktail is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Red, S-coffee, Blue, T-pink, Black, Green. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Dress Bodycon Cocktail is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/41%2B0%2BkRmkDL._SL1500_.jpg",
      "alt": "Womens Dress Bodycon Cocktail details image 1"
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Red, S-coffee, Blue, T-pink, Black, Green. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "96c3fdff-f9cf-42fd-a180-92e63a66555b",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/96c3fdff-f9cf-42fd-a180-92e63a66555b/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/96c3fdff-f9cf-42fd-a180-92e63a66555b/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "1904d71c-f7cd-4982-a8a3-d083facf0f28",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1904d71c-f7cd-4982-a8a3-d083facf0f28/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1904d71c-f7cd-4982-a8a3-d083facf0f28/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "1eca7817-c942-4616-84a3-0fae56472348",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1eca7817-c942-4616-84a3-0fae56472348/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1eca7817-c942-4616-84a3-0fae56472348/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "030929c0-afdb-4e7e-b41b-0b7f665b8f69",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/030929c0-afdb-4e7e-b41b-0b7f665b8f69/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/030929c0-afdb-4e7e-b41b-0b7f665b8f69/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "ad45707d-a6bf-4254-bc44-df5a56b1f563",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ad45707d-a6bf-4254-bc44-df5a56b1f563/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ad45707d-a6bf-4254-bc44-df5a56b1f563/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "aa0ea66e-74a1-41d3-ac24-29185530965c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/aa0ea66e-74a1-41d3-ac24-29185530965c/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/aa0ea66e-74a1-41d3-ac24-29185530965c/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "36b4aa47-bb74-40a6-b171-3f0d876f8a15",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/36b4aa47-bb74-40a6-b171-3f0d876f8a15/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/36b4aa47-bb74-40a6-b171-3f0d876f8a15/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "ac06ed39-02fa-47c0-b2a8-c0c26aaaac1f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ac06ed39-02fa-47c0-b2a8-c0c26aaaac1f/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ac06ed39-02fa-47c0-b2a8-c0c26aaaac1f/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "06f6c745-d024-4ee3-97cb-9d429eb55b46",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/06f6c745-d024-4ee3-97cb-9d429eb55b46/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/06f6c745-d024-4ee3-97cb-9d429eb55b46/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "702a9f2f-ebaf-4e00-8797-eb3fe7eac391",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/702a9f2f-ebaf-4e00-8797-eb3fe7eac391/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/702a9f2f-ebaf-4e00-8797-eb3fe7eac391/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "68d3205b-af2b-4511-87fe-d2ffa136fe19",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/68d3205b-af2b-4511-87fe-d2ffa136fe19/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/68d3205b-af2b-4511-87fe-d2ffa136fe19/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "afc3d672-b7c0-4927-9e08-7a3fc537458d",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/afc3d672-b7c0-4927-9e08-7a3fc537458d/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/afc3d672-b7c0-4927-9e08-7a3fc537458d/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Red": "https://m.media-amazon.com/images/I/31TEnF-MGwL._AC_SR38,50_.jpg",
    "S-coffee": "https://m.media-amazon.com/images/I/31UM6PXjOVL._AC_SR38,50_.jpg",
    "Blue": "https://m.media-amazon.com/images/I/31-BGfw+xpL._AC_SR38,50_.jpg",
    "T-pink": "https://m.media-amazon.com/images/I/31RHtDg7+VL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31L8AMkEtfL._AC_SR38,50_.jpg",
    "Green": "https://m.media-amazon.com/images/I/31EA3aPB3OL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Red": "61HFhbQgC2L",
    "S-coffee": "41z9kRdUt1L",
    "Blue": "61MQC1QhNyL",
    "T-pink": "41hfHjhsOaL",
    "Black": "51EkBZaROxL",
    "Green": "61UAhCl3sQL"
  },
  "color_images": {
    "Red": [
      "https://m.media-amazon.com/images/I/61HFhbQgC2L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/51Gm46eWxkL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61qsKePHe2L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/51kYCgnjGDL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61feFH0eSkL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/51u-KQtRDvL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/51JfCA4mSaL._SL1500_.jpg"
    ],
    "S-coffee": [
      "https://m.media-amazon.com/images/I/41z9kRdUt1L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/516zkQa24yL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61apc25Ok7L._SL1500_.jpg"
    ],
    "Blue": [
      "https://m.media-amazon.com/images/I/61MQC1QhNyL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/51-jPRI+mDL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61NeHJBkfmL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61MR2Vbq7JL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/51p881FrAnL._SL1500_.jpg"
    ],
    "T-pink": [
      "https://m.media-amazon.com/images/I/41hfHjhsOaL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/51yPrILJBrL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61e4KFg5bxL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/51EkBZaROxL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/51DKFWhH12L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61ESlx1YsEL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/511NbfXunTL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61EJI8s2MvL._SL1500_.jpg"
    ],
    "Green": [
      "https://m.media-amazon.com/images/I/61UAhCl3sQL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/51a9rwG6IHL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61CAooNPOqL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/51GgfroquyL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/51Sakf-LhcL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-short-sleeve",
      "title": "Womens Maxi Dress Short Sleeve",
      "price": 58.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61KA-N1u3pL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-off-shoulder-bodycon",
      "title": "Womens Dress Off Shoulder Bodycon",
      "price": 35.58,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61abQ+pTZfL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-sleeveless",
      "title": "Womens Dress Sleeveless",
      "price": 38.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/715mIFtsTiL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening",
      "title": "Womens Maxi Dress Formal Evening",
      "price": 99.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61nB1Q-leJL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-formal-v-neck",
      "title": "Womens Dress Formal V Neck",
      "price": 74.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/613bOYdObBL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress-formal-cocktail-sleeveless",
      "title": "Womens Dress Formal Cocktail Sleeveless",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61X0anpI7nL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 17.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/71RMJX68+AL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-ruched-maxi-sleeveless-formal-bodycon-boat-neck",
      "title": "Womens Maxi Dress Ruched Maxi Sleeveless Formal Bodycon Boat Neck",
      "price": 57.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51yk6M5tgtL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-one-shoulder-maxi-bodycon-sleeveless-formal",
      "title": "Womens Maxi Dress One Shoulder Maxi Bodycon Sleeveless Formal",
      "price": 36.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/81nSuH9WJ7L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/61S2PVEELgL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-formal-cocktail",
      "title": "Womens Dress Formal Cocktail",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61tH755L2gL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-ruched",
      "title": "Womens Dress Ruched",
      "price": 45.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/819T+NSIXLL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-long-sleeve-maxi-cocktail",
      "title": "Womens Maxi Dress Bodycon Long Sleeve Maxi Cocktail",
      "price": 47.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/81Qz5s7t1VL._SL1500_.jpg"
      ]
    }
  ]
}