{
  "id": "womens-maxi-dress-formal-evening",
  "handle": "womens-maxi-dress-formal-evening",
  "sku": "JC2229",
  "asin": "B0DK6MVCM8",
  "title": "Womens Maxi Dress Formal Evening",
  "title_original": "Pinup Fashion Women Plus Size Formal Dresses - Evening Gowns Wedding Guest Glitter Prom Long Dress",
  "brand": "Visit the Pinup Fashion Store",
  "price": 58.99,
  "social_proof": {
    "bought_past_month": 51,
    "text": "51+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/71qWJEn1BgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81ZLH9-6ujL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71r4BUYaFUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71d7opJOEIL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71eH3gwaVSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/719PtqllokL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71wYtP7rZQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71O4ZnmAnLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71fwwGnOI1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71p7fQnv7ZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/7107l4ui9-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71-b8rYDSnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/717VcZi5QGL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/71qWJEn1BgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81ZLH9-6ujL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71r4BUYaFUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71d7opJOEIL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71eH3gwaVSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/719PtqllokL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71wYtP7rZQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71O4ZnmAnLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71fwwGnOI1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71p7fQnv7ZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/7107l4ui9-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71-b8rYDSnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/717VcZi5QGL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ October 17, 2024",
    "ASIN ‏": "‎ B0DK6M25GF",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#88,683 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #357 in Women's Formal Dresses",
    "Customer Reviews": "4.3 4.3 out of 5 stars (151)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Purple",
      "Black-regular",
      "Burgundy",
      "Hot Pink",
      "Black",
      "Champagne",
      "Navy Blue",
      "Green"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.3,
    "count": 151,
    "customers_say": "Customers find the dress fits well, with one mentioning it's perfect for wearing with flats, and they appreciate its shimmer and flattering design, particularly noting it works well for plus size figures. The dress receives positive feedback for its comfort, quality, and value, with one customer noting it's great for formal summer events. The material receives mixed reviews - while some find it soft, others describe it as scratchy. Generated from the text of customer reviews Select to learn more Fit (34) Looks (27) Comfort (18) Quality (17) Dress size (9) Flattering (9) Value for money (9) Material softness (13) 34 customers mention fit, 28 positive, 6 negative 34 customers mention \"Fit\" 28 positive 6 negative Customers are satisfied with how the dress fits, with one mentioning that the sleeves were just right for them. \" ...Once I tried it on, all my worries went away. It fit perfectly , it felt good, it actually looked good and I like that it's not itchy or anything... \" Read more \" Great price and good fit . Runs true to size but I sized up not knowing. Fabric was comfortable and washed easy. \" Read more \" ...Excellent quality for the price, fit true to size , flattering silhouette, and I received so many compliments I started feeling like a Hollywood... \" Read more \" ...I did have to size up 1 size to accommodate larger breasts. It fit great , received lots of compliments.... \" Read more 27 customers mention looks, 24 positive, 3 negative 27 customers mention \"Looks\" 24 positive 3 negative Customers find the dress pretty, with one mentioning its silver sparkles throughout and another noting it looked like it was worth a million dollars. \" Beautiful dress and was flattering. I bought 3 and this was the dress I chose as the most flattering and comfortable. \" Read more \" Beautiful and I can take the dress off without un zipping... \" Read more \" So cute ! I love the material,fit,comfortable,stretchy,length, and just over all so cute! Using it for a party! \" Read more \" ...worrying about about ruining an expensive outfit but I still looked good ! Dress stayed wrinkle - free all evening. \" Read more 18 customers mention comfort, 17 positive, 1 negative 18 customers mention \"Comfort\" 17 positive 1 negative Customers find the dress comfortable and not itchy. \" It was flowy, comfortable , long enough, but I did have to get a bigger size then usually but it's gonna be good for dancing all night in it \" Read more \" ...It fit great and was very comfortable . It was a formal event and every one could not believe that I had ordered it from Amazon. \" Read more \" ...it felt good, it actually looked good and I like that it's not itchy or anything like that. I was kind of over the moon with the fit of this dress.... \" Read more \" ...Runs true to size but I sized up not knowing. Fabric was comfortable and washed easy. \" Read more 17 customers mention quality, 16 positive, 1 negative 17 customers mention \"Quality\" 16 positive 1 negative Customers find the dress to be of good quality. \" ...Price is very reasonable for such a nice dress . \" Read more \" ...Fit perfectly. Dress is so soft, it's like wearing a nightgown. Great quality . And looks stunning on.... \" Read more \" Well made , good fit, god price... \" Read more \" Love this dress I have two of them. Black and burgundy Easy wash \" Read more 9 customers mention dress size, 9 positive, 0 negative 9 customers mention \"Dress size\" 9 positive 0 negative Customers find the dress suitable for formal events, with one mentioning it's perfect for dancing all night. \" ...It fit great and was very comfortable. It was a formal event and every one could not believe that I had ordered it from Amazon. \" Read more \" Fit as expected. Was perfect for the wedding (long dresses requested) . Good buy for the price.... \" Read more \" ...did have to get a bigger size then usually but it's gonna be good for dancing all night in it \" Read more \" ...This gown was comfortable and allowed me to serve dinner without worrying about about ruining an expensive outfit but I still looked good!... \" Read more 9 customers mention flattering, 9 positive, 0 negative 9 customers mention \"Flattering\" 9 positive 0 negative Customers find the dress flattering, with one mentioning that it hugs in the right places. \" Beautiful dress and was flattering . I bought 3 and this was the dress I chose as the most flattering and comfortable. \" Read more \" This dress is very flattering while still being simple. It's not itchy. It is also machine washable which in my book is a huge plus. \" Read more \" ...Excellent quality for the price, fit true to size, flattering silhouette , and I received so many compliments I started feeling like a Hollywood... \" Read more \" Beautiful and flattering gown . True to size \" Read more 9 customers mention value for money, 7 positive, 2 negative 9 customers mention \"Value for money\" 7 positive 2 negative Customers find the dress to be a great value, with one mentioning it offers excellent quality for the price. \" Great price and good fit. Runs true to size but I sized up not knowing. Fabric was comfortable and washed easy. \" Read more \" ...Dark blue with subtle silver sparkles. Great value at even twice the cost. I’m very happy with my purchase! \" Read more \" The stress was high quality and totally worth the price . It was almost floor length on me and I am 5'4. It did not wrinkle and was easy to wash.... \" Read more \" Not worth $60 . Cheaply made, bad seam lines. Some on the front neck line which are very noticable.... \" Read more 13 customers mention material softness, 9 positive, 4 negative 13 customers mention \"Material softness\" 9 positive 4 negative Customers have mixed opinions about the dress's material, with some finding it soft and loving it, while others describe it as scratchy and cheap-looking. \" Absolutely gorgeous dress. Fit perfectly. Dress is so soft , it's like wearing a nightgown. Great quality. And looks stunning on.... \" Read more \" ...It was very comfortable and fit well. Material was soft and breathable. Best of all, no dry cleaning needed. Washed on delicate cycle with no issues.... \" Read more \" ...Up close, the fabric looked cheap . Edit: I apparently like the way this dress looks online because I ordered it again in hot pink.... \" Read more \" Wow! This dress is beautiful, fit perfectly. Material soft and fitted loose like I wanted. The color is amazing I just love it \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Comfortable",
        "body": "The stress was high quality and totally worth the price. It was almost floor length on me and I am 5'4. It did not wrinkle and was easy to wash. This will be a go-to item for semi-formal-related items. It's definitely flattering to a plus size figure. The color is exactly as promised. It was very comfortable to wear and had mild stretch. The cut covers a multitude of sins I have larger breasts and was able to fully fill out the top and I feel like it would still be okay for a smaller chested woman. Read more",
        "author": "wendy fitzgerald",
        "rating": 5.0,
        "date": "December 11, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars I was so shocked!! (in a good way!)",
        "body": "Why did you pick this product vs others?: I honestly didn't have high hopes for this dress. I was concerned about the fit, the feel, the quality and how it was going to look on my squishy body. Once I tried it on, all my worries went away. It fit perfectly, it felt good, it actually looked good and I like that it's not itchy or anything like that. I was kind of over the moon with the fit of this dress. I'm looking forward to wearing it on formal night on the cruise. Read more",
        "author": "Tracie Gerber",
        "rating": 5.0,
        "date": "July 8, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Excellent dress! Fits well, wonderful material & overnight shopping. Love it!",
        "body": "I love this dress and am so relieved it got here overnight! I had rented 2 dresses from rent the runway and neither fit. Very slim pickings for the overnight dresses they give you when you get the wrong size, so I bought this as a backup. It’s wonderful! The material is stretchy and not thin. It falls nicely and was not wrinkled out of the package so will travel well. Perfect length for me to wear with flats. I may have been able to go a size smaller, but I’m happy with the 18. I’m 5’10”, 190 lbs, and very busty. The cut of the neck is not too low even without pinning it. The color is beautiful. Dark blue with subtle silver sparkles. Great value at even twice the cost. I’m very happy with my purchase! Read more",
        "author": "Another Bizzy Mom",
        "rating": 5.0,
        "date": "August 27, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars It is pretty.",
        "body": "The fit is great. It looks good on. The material is not soft, but it is okay. I wouldn't wear it on a warm day. Read more",
        "author": "Sarah Calla",
        "rating": 4.0,
        "date": "July 24, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Fine dress, problematic chest",
        "body": "I wore this to a black-tie wedding, and it was fine. It is stretchy, and the fabric is not heavy. I was comfortable the whole night and didn't feel overheated. The chest didn't fit properly, and I had to be careful not to show my bra. I didn't order the dress with enough time to address the chest issue before my event; however, if I had, I would have been able to fix the problem with a pin or some stitching. Read more",
        "author": "Customer",
        "rating": 3.0,
        "date": "February 15, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Flattering",
        "body": "Beautiful dress and was flattering. I bought 3 and this was the dress I chose as the most flattering and comfortable. Read more",
        "author": "Amy",
        "rating": 5.0,
        "date": "December 18, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Well made, good fit, god price",
        "body": "Fit as expected. Was perfect for the wedding (long dresses requested) . Good buy for the price. The bottom was not quite as flared as the picture but that might have as much to do with my shape as the dress's. It is not high end or fancy - I would not expect that for this price, but it was perfect for me. Read more",
        "author": "Maria P",
        "rating": 5.0,
        "date": "November 19, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Pretty dress",
        "body": "It was flowy, comfortable, long enough, but I did have to get a bigger size then usually but it's gonna be good for dancing all night in it Read more",
        "author": "Maria Galindo",
        "rating": 5.0,
        "date": "November 26, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Formal Evening is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.",
  "about_this_item": "Womens Maxi Dress Formal Evening is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.",
  "long_description": "Womens Maxi Dress Formal Evening is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Purple, Black-regular, Burgundy, Hot Pink, Black, Champagne, Navy Blue, Green. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Formal Evening is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Purple, Black-regular, Burgundy, Hot Pink, Black, Champagne, Navy Blue, Green. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "422983a2-744c-444d-a04c-4e3841c45410",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/422983a2-744c-444d-a04c-4e3841c45410/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/422983a2-744c-444d-a04c-4e3841c45410/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "4bc97d69-c010-4126-bdf8-2e01dae88d6c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4bc97d69-c010-4126-bdf8-2e01dae88d6c/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4bc97d69-c010-4126-bdf8-2e01dae88d6c/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "10aeee71-e347-4c48-a3d3-41c87c5599b0",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/10aeee71-e347-4c48-a3d3-41c87c5599b0/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/10aeee71-e347-4c48-a3d3-41c87c5599b0/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "a2bde24c-8c20-4fde-aca6-b0973e8be7a8",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a2bde24c-8c20-4fde-aca6-b0973e8be7a8/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a2bde24c-8c20-4fde-aca6-b0973e8be7a8/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "077d37d8-1fd6-43c5-a61f-cd9a5df8e36d",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/077d37d8-1fd6-43c5-a61f-cd9a5df8e36d/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/077d37d8-1fd6-43c5-a61f-cd9a5df8e36d/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Purple": "https://m.media-amazon.com/images/I/41ZnzekbQVL._AC_SR38,50_.jpg",
    "Black-regular": "https://m.media-amazon.com/images/I/41mh1y7p1+L._AC_SR38,50_.jpg",
    "Burgundy": "https://m.media-amazon.com/images/I/415YiuzEOeL._AC_SR38,50_.jpg",
    "Hot Pink": "https://m.media-amazon.com/images/I/419spYF0kgL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/41owRcJ5cAL._AC_SR38,50_.jpg",
    "Champagne": "https://m.media-amazon.com/images/I/31IrI48tjSL._AC_SR38,50_.jpg",
    "Navy Blue": "https://m.media-amazon.com/images/I/419FV-qkANL._AC_SR38,50_.jpg",
    "Green": "https://m.media-amazon.com/images/I/41yJVDVq5UL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Purple": "71wYtP7rZQL",
    "Black-regular": "71O4ZnmAnLL",
    "Burgundy": "71fwwGnOI1L",
    "Hot Pink": "71p7fQnv7ZL",
    "Black": "71qWJEn1BgL",
    "Champagne": "7107l4ui9-L",
    "Navy Blue": "71-b8rYDSnL",
    "Green": "717VcZi5QGL"
  },
  "color_images": {
    "Purple": [
      "https://m.media-amazon.com/images/I/71wYtP7rZQL._SL1500_.jpg"
    ],
    "Black-regular": [
      "https://m.media-amazon.com/images/I/71O4ZnmAnLL._SL1500_.jpg"
    ],
    "Burgundy": [
      "https://m.media-amazon.com/images/I/71fwwGnOI1L._SL1500_.jpg"
    ],
    "Hot Pink": [
      "https://m.media-amazon.com/images/I/71p7fQnv7ZL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/71qWJEn1BgL._SL1500_.jpg"
    ],
    "Champagne": [
      "https://m.media-amazon.com/images/I/7107l4ui9-L._SL1500_.jpg"
    ],
    "Navy Blue": [
      "https://m.media-amazon.com/images/I/71-b8rYDSnL._SL1500_.jpg"
    ],
    "Green": [
      "https://m.media-amazon.com/images/I/717VcZi5QGL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 76.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/519NIxJvOuL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-long-sleeve-ruched",
      "title": "Womens Maxi Dress Cocktail Long Sleeve Ruched",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61FPh32pv6L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-formal",
      "title": "Womens Dress Formal",
      "price": 75.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61PMgdXV6wL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 165.9,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/51NHIlMRpQL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-v-neck-cocktail-evening-ruched",
      "title": "Womens Maxi Dress Long Sleeve V Neck Cocktail Evening Ruched",
      "price": 53.88,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71IDqGFqZLL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-bodycon-v-neck-long-sleeve-ruched",
      "title": "Womens Maxi Dress Bodycon V Neck Long Sleeve Ruched",
      "price": 36.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51TARubmowL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 33.89,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Work",
      "images": [
        "https://m.media-amazon.com/images/I/61aolLkLa0L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-bodycon",
      "title": "Womens Dress Bodycon",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71NvPtfMJ5L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-formal-v-neck",
      "title": "Womens Maxi Dress Long Sleeve Formal V Neck",
      "price": 84.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51UvLPA1DyL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 89.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61rRvmJ+FqL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-one-shoulder-cocktail",
      "title": "Womens Dress One Shoulder Cocktail",
      "price": 42.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61wOHRqmGHL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-long-sleeve-ruched",
      "title": "Womens Maxi Dress Bodycon Long Sleeve Ruched",
      "price": 36.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61yFldWfTJL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-long-sleeve-ruched-bodycon",
      "title": "Womens Maxi Dress Cocktail Long Sleeve Ruched Bodycon",
      "price": 27.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61kxACexcRL._SL1500_.jpg"
      ]
    }
  ]
}