{
  "id": "womens-maxi-dress-high-split-split-maxi-formal",
  "handle": "womens-maxi-dress-high-split-split-maxi-formal",
  "sku": "JC1045",
  "asin": "B0DK11KFDF",
  "title": "Womens Maxi Dress High Split Split Maxi Formal",
  "title_original": "Aigeman Women Vintage Flapper Dresses 1920s Great Gatsby Halter Fringed Maxi Dress Tassels High Split Formal Dress 19",
  "brand": "Visit the Aigeman Store",
  "price": 59.99,
  "social_proof": {
    "bought_past_month": 1857,
    "text": "1857+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/61CQ4jOFT9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61aubD-CQyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71D4eRJvcpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61BI86-i2fL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71WaKOejjWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71dbTYYKYiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61XYsvs1fML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71FTsfDViUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71FLELfV8ZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71geKD9RfhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81ggUX+DmRL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71zOhxbxjBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71SGrqlEsmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81V6j+AGaLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ivHnM3KUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/811sAkj2U-L._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/61CQ4jOFT9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61aubD-CQyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71D4eRJvcpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61BI86-i2fL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71WaKOejjWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71dbTYYKYiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61XYsvs1fML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71FTsfDViUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71FLELfV8ZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71geKD9RfhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81ggUX+DmRL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71zOhxbxjBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71SGrqlEsmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81V6j+AGaLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ivHnM3KUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/811sAkj2U-L._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ April 28, 2023",
    "ASIN ‏": "‎ B0C3V4SVK5",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#27,154 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #327 in Women's Formal Dresses",
    "Customer Reviews": "4.2 4.2 out of 5 stars (258)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Red",
      "Sky Blue",
      "Chololate",
      "Wine Red",
      "Purplish Red",
      "Purple",
      "Reddish Brown",
      "Royal Blue",
      "Leopard",
      "Black",
      "Coffee",
      "Khaki Green"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.2,
    "count": 258,
    "customers_say": "Customers find the dress looks expensive and flatters by hugging the body in all the right places, while also appreciating its stretchiness and good fit. Moreover, they consider it good value for money and praise its quality, with one customer noting the perfect black fringe detail. However, the fabric quality receives mixed feedback, with some customers describing it as shiny spandex-like while others find it cheap, and several mention the slit being too high. Generated from the text of customer reviews Select to learn more Looks (39) Quality (37) Fit (33) Value for money (14) Flattering (11) Stretchiness (11) Fabric quality (14) Slit (11) 39 customers mention looks, 36 positive, 3 negative 39 customers mention \"Looks\" 36 positive 3 negative Customers find the dress gorgeous and sexy, with one customer noting its perfect black fringe detail and another mentioning its right amount of sparkle. \" It is a beautiful dress ! The fit, length (I'm 5'10'', 165 lbs), and fabric are great, however, the slit is quite high.... \" Read more \" Its a cute dress , but I think I received a different color than I ordered.. \" Read more \" It's a nice look and flattering, fun and sexy .... \" Read more \" Very comfy & very cute !! Stretchy & easy to dance in \" Read more 37 customers mention quality, 34 positive, 3 negative 37 customers mention \"Quality\" 34 positive 3 negative Customers appreciate the dress's quality, particularly noting that the fringe is well-made. \" Great dress !!! Super impressed with the look and overall fit. The fringe adds such a nice touch and the brown color was great. \" Read more \" ...Gorgeous style, great quality , and a very reasonable price. I would 100% buy it again in another color. \" Read more \" This is a well made , beautiful dress! Great for a wedding in guest outfit. I’m 5’3”, 127 lbs, & wearing a size small.... \" Read more \" Loved this dress ! Wore to a 20’s themed wedding and it was perfect.... \" Read more 33 customers mention fit, 27 positive, 6 negative 33 customers mention \"Fit\" 27 positive 6 negative Customers like how the dress fits, with one mentioning its stretchy nature. \" ...The fabric is excellent quality, with a great fit and beautiful movement when dancing. Highly recommend for any 1920s-style event! \" Read more \" Love the fit and how it looks however; I ordered the color coffee TWICE (which shows as a taupe-ish color) and they sent me a chocolate brown color... \" Read more \" I can’t say enough about this dress! It fit like a glove , I got the M size I’m 5’5 for reference. The compliments were endless! \" Read more \" ...Dress was comfortable but definitely a snug fit that will hug your curves everywhere! \" Read more 14 customers mention value for money, 10 positive, 4 negative 14 customers mention \"Value for money\" 10 positive 4 negative Customers find the dress to be a great value for money, with one customer noting that the quality material matches the price point. \" ...is the perfect thickness so it looks expensive despite being an inexpensive dress . Definitely recommend. \" Read more \" Love this dress for the price . It’s great!! \" Read more \" Amazing dress & super soft & fun. Not worth the price though. Size down for sure. \" Read more \" ...This dress is affordable , comfortable, and fun while keeping a classic style.... \" Read more 11 customers mention flattering, 11 positive, 0 negative 11 customers mention \"Flattering\" 11 positive 0 negative Customers find the dress flattering, noting that it hugs the body in all the right places. \" ...It fits true to size and is super flattering — hugs in all the right places!! \" Read more \" I bought this dress on a whim and I looked gorgeous in it. It’s very flattering and I’m sure it’ll look beautiful on you too.... \" Read more \" Very flattering dress . Loved the high neck and fringe on the bottom.... \" Read more \" ...Still love it. Has nice stretch and body hugging . \" Read more 11 customers mention stretchiness, 10 positive, 1 negative 11 customers mention \"Stretchiness\" 10 positive 1 negative Customers appreciate the dress's stretchiness. \" ...The material is smooth, stretchy , and fit like a glove (in addition to a bodysuit).... \" Read more \" ...to be a “costume” the quality is actually really nice, the material is stretchy & wasn’t too thin but wasn’t so thick I was sweating.... \" Read more \" ...Tons of compliments. Good purchase. Material was stretchy , but nice, very flattering. The color was exactly as pictured. The fit was perfect.... \" Read more \" ...The fabric is soft, lightweight, and has just the right amount of stretch .... \" Read more 14 customers mention fabric quality, 6 positive, 8 negative 14 customers mention \"Fabric quality\" 6 positive 8 negative Customers have mixed opinions about the dress's fabric, with some finding it excellent while others describe it as cheap and made of shiny spandex-like material. \" This dress has a pretty color, but the shiny fabric and sewing makes it look more like a costume dress than an actual dress to wear at a normal... \" Read more \" Dress is a comfortable, slinky material and fringe is of good quality. Feels more expensive than it is. Would be great for a 20s theme party.... \" Read more \" Terrible material looks like a cheap table cloth \" Read more \" Spandex material ! It was great for my Halloween party! It wasn’t see through and it had stretchy fit. I think it was a hit! \" Read more 11 customers mention slit, 4 positive, 7 negative 11 customers mention \"Slit\" 4 positive 7 negative Customers have mixed opinions about the dress's slit, with several noting it's too high, while one customer mentions it doesn't bother them while walking. \" ...Even with shapewear which can still be shown because the slit is too high . It’s definitely stretchy but the material is way too thin. \" Read more \" Love the cut of this dress ! \" Read more \" Just as described. The slit is a bit high , but it worked with fish nets! So many compliments. \" Read more \" ...length (I'm 5'10'', 165 lbs), and fabric are great, however, the slit is quite high .... \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars This dress is absolutely stunning and far exceeded my expectation",
        "body": "I bought the Aigeman Women Vintage Flapper Dress for a special event. The beading and sequins are beautiful and look much more expensive than the actual price. It has just the right amount of sparkle without being over the top. The fit is very flattering – it skims the body nicely without clinging in the wrong places, and the length is perfect: classy, but still fun and flirty. The fabric has a nice weight to it, so it hangs well and doesn’t feel cheap or flimsy. I was able to move, dance, and sit comfortably all night long. I also really appreciated that it came exactly as pictured. The colors are rich, the fringe moves beautifully when you walk or dance, and I got so many compliments from friends and even strangers. People kept asking where I got it! If you’re looking for a glamorous, vintage-inspired dress for a party, wedding, or themed event, I highly recommend this one. Gorgeous style, great quality, and a very reasonable price. I would 100% buy it again in another color. Read more",
        "author": "Teri O'Brien",
        "rating": 5.0,
        "date": "November 16, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Great for cocktail events",
        "body": "Great dress!!! Super impressed with the look and overall fit. The fringe adds such a nice touch and the brown color was great. Read more",
        "author": "Ange",
        "rating": 5.0,
        "date": "December 10, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Wrong Color",
        "body": "I saw several customers received the wrong color. I also received the dark brown when I order the lighter one. It’s still very pretty, but I was hoping for the other color. It fits greats and the quality material does fit the price. I’m 5”4” and weigh 160. I don’t think it’s worth trying to send it back because it appears they don’t have the lighter color, since the other customers continue to get the dark brown. Read more",
        "author": "Judith campos",
        "rating": 4.0,
        "date": "August 19, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71vdmlTTT6L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Worth the $$!! Beautiful dress!!",
        "body": "This is a well made, beautiful dress! Great for a wedding in guest outfit. I’m 5’3”, 127 lbs, & wearing a size small. I tried on with boots and the length was perfect! I’d would but this in another color! Read more",
        "author": "Christy",
        "rating": 5.0,
        "date": "December 15, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71UljB6Y-XL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/51GlQJxCVkL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Perfect dress",
        "body": "Wore this to a Western Formal wedding. Tons of compliments. Good purchase. Material was stretchy, but nice, very flattering. The color was exactly as pictured. The fit was perfect. It was wrinkled on arrival, but easily steamed out and endured a three hour trip with no added wrinkles. Worth every penny. Read more",
        "author": "Dana",
        "rating": 5.0,
        "date": "October 19, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/81TIcpvoPxL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "3.0 out of 5 stars Seller needs to fix issue, dress is good though",
        "body": "Giving 3 stars because the dress is perfect. It’s the seller that ain’t. Ordered this coffee color THREE times and got the dark brown chocolate instead. There has to be an inventory issue that isn’t getting fixed sadly. I really wanted the Tan Coffee color! Read more",
        "author": "Simply Ella",
        "rating": 3.0,
        "date": "July 30, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Perfect western dress",
        "body": "Perfect for a western elegance feel. Wore for a photo shoot and would totally work for a wedding guest outfit. Read more",
        "author": "Raquel Peterson",
        "rating": 5.0,
        "date": "November 17, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "1.0 out of 5 stars Recieved used dress",
        "body": "Exactly as pictured. Major issue: it came USED!!! It smells strong parfume , and cigarette smoke!!!! The armpits smell RANKKKKKK and deodorant stains!!!!! I’m SO LIVID THE WEDDING IS TOMORROW!!!!!!!!!!! Now I have NOTHING to wear except a $54 dress that’s used. I can wash it but I deserve some Type of refund for this nasty dress . Again, dress is cute and just like Pictured. But it was USED Read more",
        "author": "T",
        "rating": 1.0,
        "date": "January 25, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress High Split Split Maxi Formal is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.",
  "about_this_item": "Womens Maxi Dress High Split Split Maxi Formal is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.",
  "long_description": "Womens Maxi Dress High Split Split Maxi Formal is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Red, Sky Blue, Chololate, Wine Red, Purplish Red, Purple, Reddish Brown, Royal Blue, Leopard, Black, Coffee, Khaki Green. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress High Split Split Maxi Formal is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Red, Sky Blue, Chololate, Wine Red, Purplish Red, Purple, Reddish Brown, Royal Blue, Leopard, Black, Coffee, Khaki Green. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "7df8814d-7b98-432c-8231-19a380c29dc0",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7df8814d-7b98-432c-8231-19a380c29dc0/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7df8814d-7b98-432c-8231-19a380c29dc0/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "5f64fd33-6385-4775-bd96-b2e470e08eaa",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5f64fd33-6385-4775-bd96-b2e470e08eaa/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5f64fd33-6385-4775-bd96-b2e470e08eaa/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "7c81432e-a71b-4407-b8e1-ea2d1a96a861",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7c81432e-a71b-4407-b8e1-ea2d1a96a861/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7c81432e-a71b-4407-b8e1-ea2d1a96a861/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "01b7d9c5-1933-4f1b-8873-48ed75356131",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/01b7d9c5-1933-4f1b-8873-48ed75356131/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/01b7d9c5-1933-4f1b-8873-48ed75356131/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "57ef37af-7249-4dcd-b0a7-4acbdf607aea",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/57ef37af-7249-4dcd-b0a7-4acbdf607aea/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/57ef37af-7249-4dcd-b0a7-4acbdf607aea/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "c3bf2351-8542-4344-a88f-61538ef0f5df",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c3bf2351-8542-4344-a88f-61538ef0f5df/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c3bf2351-8542-4344-a88f-61538ef0f5df/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "3d65a0f4-13c6-44a0-963d-d561aca9876c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3d65a0f4-13c6-44a0-963d-d561aca9876c/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3d65a0f4-13c6-44a0-963d-d561aca9876c/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "68ca7fa3-91b2-440f-ada5-3fce6bf1590a",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/68ca7fa3-91b2-440f-ada5-3fce6bf1590a/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/68ca7fa3-91b2-440f-ada5-3fce6bf1590a/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Red": "https://m.media-amazon.com/images/I/319Qm+vv35L._AC_SR38,50_.jpg",
    "Sky Blue": "https://m.media-amazon.com/images/I/310k+yCsHjL._AC_SR38,50_.jpg",
    "Chololate": "https://m.media-amazon.com/images/I/31PS+UtBjUL._AC_SR38,50_.jpg",
    "Wine Red": "https://m.media-amazon.com/images/I/312n-IgRHML._AC_SR38,50_.jpg",
    "Purplish Red": "https://m.media-amazon.com/images/I/31Xg90t+jvL._AC_SR38,50_.jpg",
    "Purple": "https://m.media-amazon.com/images/I/313S-dfadgL._AC_SR38,50_.jpg",
    "Reddish Brown": "https://m.media-amazon.com/images/I/41iVWOnHJ7L._AC_SR38,50_.jpg",
    "Royal Blue": "https://m.media-amazon.com/images/I/31LROmRIk8L._AC_SR38,50_.jpg",
    "Leopard": "https://m.media-amazon.com/images/I/41rVz3MFA-L._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/41jqEjZqMRL._AC_SR38,50_.jpg",
    "Coffee": "https://m.media-amazon.com/images/I/31XYdPbiELL._AC_SR38,50_.jpg",
    "Khaki Green": "https://m.media-amazon.com/images/I/41HqUrTWzyL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Red": "71dbTYYKYiL",
    "Sky Blue": "61XYsvs1fML",
    "Chololate": "61CQ4jOFT9L",
    "Wine Red": "71FTsfDViUL",
    "Purplish Red": "71FLELfV8ZL",
    "Purple": "71geKD9RfhL",
    "Reddish Brown": "81ggUX+DmRL",
    "Royal Blue": "71zOhxbxjBL",
    "Leopard": "71SGrqlEsmL",
    "Black": "81V6j+AGaLL",
    "Coffee": "71ivHnM3KUL",
    "Khaki Green": "811sAkj2U-L"
  },
  "color_images": {
    "Red": [
      "https://m.media-amazon.com/images/I/71dbTYYKYiL._SL1500_.jpg"
    ],
    "Sky Blue": [
      "https://m.media-amazon.com/images/I/61XYsvs1fML._SL1500_.jpg"
    ],
    "Chololate": [
      "https://m.media-amazon.com/images/I/61CQ4jOFT9L._SL1500_.jpg"
    ],
    "Wine Red": [
      "https://m.media-amazon.com/images/I/71FTsfDViUL._SL1500_.jpg"
    ],
    "Purplish Red": [
      "https://m.media-amazon.com/images/I/71FLELfV8ZL._SL1500_.jpg"
    ],
    "Purple": [
      "https://m.media-amazon.com/images/I/71geKD9RfhL._SL1500_.jpg"
    ],
    "Reddish Brown": [
      "https://m.media-amazon.com/images/I/81ggUX+DmRL._SL1500_.jpg"
    ],
    "Royal Blue": [
      "https://m.media-amazon.com/images/I/71zOhxbxjBL._SL1500_.jpg"
    ],
    "Leopard": [
      "https://m.media-amazon.com/images/I/71SGrqlEsmL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/81V6j+AGaLL._SL1500_.jpg"
    ],
    "Coffee": [
      "https://m.media-amazon.com/images/I/71ivHnM3KUL._SL1500_.jpg"
    ],
    "Khaki Green": [
      "https://m.media-amazon.com/images/I/811sAkj2U-L._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-formal",
      "title": "Womens Maxi Dress Formal",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61IcEYiG5oL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-mermaid-evening-formal",
      "title": "Womens Maxi Dress Long Sleeve Mermaid Evening Formal",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51bZiuy+7KL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 168.94,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71nyroeI+PL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-bodycon-one-shoulder",
      "title": "Womens Dress Bodycon One Shoulder",
      "price": 38.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51LTPZDa1AL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 140.88,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/81KBYKOx4OL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress-sleeveless-formal-ruched",
      "title": "Womens Dress Sleeveless Formal Ruched",
      "price": 31.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51lfujm2hSL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 568.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71q84fXVudL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-one-shoulder-formal",
      "title": "Womens Maxi Dress Evening One Shoulder Formal",
      "price": 88.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51dteyRhDhL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-long-sleeve-mermaid-evening-maxi",
      "title": "Womens Maxi Dress Formal Long Sleeve Mermaid Evening Maxi",
      "price": 72.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51BTOKJlAdL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi",
      "title": "Womens Maxi Dress Maxi",
      "price": 132.3,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71mNvsSn-8L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-maxi",
      "title": "Womens Maxi Dress Long Sleeve Maxi",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/612vrP+P6EL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 35.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61dKto0nS0L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-bodycon-v-neck-maxi",
      "title": "Womens Maxi Dress Long Sleeve Bodycon V Neck Maxi",
      "price": 44.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61NjE1FKC7L._SL1500_.jpg"
      ]
    }
  ]
}