{
  "id": "womens-dress-cocktail-ruched-sleeveless-bodycon",
  "handle": "womens-dress-cocktail-ruched-sleeveless-bodycon",
  "sku": "JC2190",
  "asin": "B0DK3HJFFH",
  "title": "Womens Dress Cocktail Ruched Sleeveless Bodycon",
  "title_original": "OWIN Women's Sexy Summer Casual Mock Neck Dresses Sleeveless Ruched Bodycon Cocktail Party Mini Dress",
  "brand": "Visit the OWIN Store",
  "price": 38.99,
  "social_proof": {
    "bought_past_month": 827,
    "text": "827+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/610NAHUevoL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61zTaWF8fcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71fKXeFCahL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71XvQLVGNwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61nBdTRvZwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61KR6Cgv63L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61xGnhrsbmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61uT-ZGQM6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61oiRW3wM5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/6107LysixKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/612YL+TIvpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61tNT1Gw-kL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61i+m109Q8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61cjEcPiQaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61rdKhHIUmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61FegUDixLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ZqKAB9e7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61u+Lh6K0ZL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/610NAHUevoL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61zTaWF8fcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71fKXeFCahL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71XvQLVGNwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61nBdTRvZwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61KR6Cgv63L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61xGnhrsbmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61uT-ZGQM6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61oiRW3wM5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/6107LysixKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/612YL+TIvpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61tNT1Gw-kL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61i+m109Q8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61cjEcPiQaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61rdKhHIUmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61FegUDixLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ZqKAB9e7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61u+Lh6K0ZL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ October 15, 2024",
    "ASIN ‏": "‎ B0DK3JX2BZ",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#34,554 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #153 in Women's Club & Night Out Dresses",
    "Customer Reviews": "4.3 4.3 out of 5 stars (271)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Brown",
      "Apricot",
      "Army Green",
      "Black",
      "Orange",
      "Light Blue",
      "Red",
      "Rose Red",
      "Navy",
      "Pink",
      "White",
      "Purple",
      "Royal Blue",
      "Green"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.3,
    "count": 271,
    "customers_say": "Customers find this dress to be a perfect little black dress that fits great and feels comfortable. The material is soft and well-made, with one customer noting it's double-layered, and they appreciate that it's not see-through. The dress is flattering, with one customer mentioning it hugs the body perfectly, and customers like its versatility, with one noting it's ideal for night out occasions. Regarding sizing, while some it's true to size, others report it runs very big. Generated from the text of customer reviews Select to learn more Looks (36) Fit (31) Material quality (27) Quality (26) Flattering (20) Comfort (16) Sheerness (12) Size (13) 36 customers mention looks, 36 positive, 0 negative 36 customers mention \"Looks\" 36 positive 0 negative Customers love the dress's appearance, describing it as a perfect little black dress that is chic and sexy, with one customer noting it has an expensive look. \" Quality products and service with FAST shipping! This sexy & form fitting short coctail dress fits true to size, & would be great for any... \" Read more \" Cute ! Stretchy material so pretty comfy. I got a large and it fit well all around. I’m in between med/lg and DDD bust. \" Read more \" Super cute and comfortable but seam with the sipper ripped after the second wear. I was able to sew it back together easily though \" Read more \" Really comfy dress and pretty ! Fit well and was flattering \" Read more 31 customers mention fit, 26 positive, 5 negative 31 customers mention \"Fit\" 26 positive 5 negative Customers like how the dress fits, with one mentioning it wears nicely over top. \" ... Fits true to size . The length can be adjusted by pulling up or down (adjusting the sides) while still looking timeless. I highly recommend!! \" Read more \" I am 5’4” and 145 lbs and I ordered a Medium. This is a great dress. Fits well and flattering due to it is ruched. \" Read more \" ...Wore it for a birthday dinner and it did not disappoint. Fits like a glove . True to size. Material is perfect and not see through. \" Read more \" Fits just right , Can't wait to use this little black number . \" Read more 27 customers mention material quality, 25 positive, 2 negative 27 customers mention \"Material quality\" 25 positive 2 negative Customers like the dress's material, describing it as soft and comfortable, with one customer noting it's double-layered and another mentioning it allows skin to breathe. \" ...Great for errands, parties, and concerts. It’s soft , thick, absolutely not see through. You can dress this garment up and down. It’s very versatile!... \" Read more \" ...Super flattering and hugs all the right places. The material is soft . And you can barely see the panty line. 5’7 and 220 lbs. \" Read more \" Great material , true to size. It was a perfect last minute dress !! \" Read more \" ...It’s nice and stretchy and the ruching also makes it flattering. Very soft . And not see through at all bc it has a double layer inside.... \" Read more 26 customers mention quality, 24 positive, 2 negative 26 customers mention \"Quality\" 24 positive 2 negative Customers appreciate the quality of the dress, noting its nice material. \" I am 5’4” and 145 lbs and I ordered a Medium. This is a great dress . Fits well and flattering due to it is ruched. \" Read more \" Nice dress ! Fits a little loose than I would like but they don’t or didn’t have an XS option. The color looks great! \" Read more \" ...Stretchy. Perfect length for me. Color of dress is as pictured. Good quality . Can be shorter if wanted due to the scrunching.... \" Read more \" Bought for my daughter's end-of-year banquet. Well made . Quality material. Size fits appropriately. Super pleased with the product. \" Read more 20 customers mention flattering, 19 positive, 1 negative 20 customers mention \"Flattering\" 19 positive 1 negative Customers find the dress flattering, noting that it hugs the body perfectly. \" Fits true to size . It hugs all the right places , flattering and very comfortable. I never leave revies so that should tell you something. \" Read more \" ...I got a small and it fits perfectly! I’m super happy with it. It’s very flattering , a value for money, the material quality is super comfortable,... \" Read more \" ...The quality is amazing, soft, comfortable, and super flattering in all the right places. It works perfectly for a night out or a work event.... \" Read more \" ...But overall a very forgiving and flattering dress ! \" Read more 16 customers mention comfort, 15 positive, 1 negative 16 customers mention \"Comfort\" 15 positive 1 negative Customers find the dress comfortable, with one mentioning it is very forgiving. \" Super cute and comfortable but seam with the sipper ripped after the second wear. I was able to sew it back together easily though \" Read more \" Fits true to size . It hugs all the right places , flattering and very comfortable . I never leave revies so that should tell you something. \" Read more \" Comfy , flattering, and great value.... \" Read more \" Really comfy dress and pretty! Fit well and was flattering \" Read more 12 customers mention sheerness, 10 positive, 2 negative 12 customers mention \"Sheerness\" 10 positive 2 negative Customers appreciate that the dress is not see-through. \" ... Not see through and fits great, I am 125 pounds and 5 ft 4, and it’s a great fit for M. Very soft and stretchy but looks very classy. \" Read more \" Amazing quality! Not see through at all , thick and double lined, perfect for any bride or graduate. Fits true to size.... \" Read more \" ...Great for errands, parties, and concerts. It’s soft, thick, absolutely not see through . You can dress this garment up and down. It’s very versatile!... \" Read more \" ...zipper held up all day, no need for any slip underneath it was not see through and the fabric felt amazing. So cool and soft.... \" Read more 13 customers mention size, 9 positive, 4 negative 13 customers mention \"Size\" 9 positive 4 negative Customers have mixed experiences with the dress's fit, with some finding it true to size while others report that it runs very big. \" This dress is very flattering and true to size . Highly recommend and not as short as the picture shows. \" Read more \" ...Sexy and comfortable! I’m 5’3” and 140 and the Medium was perfect . \" Read more \" ...fine on me but I was just uncomfortable with the sizing so I’d say it runs big . \" Read more \" Adorable little white dress. Thick material that is flattering and accurate to size . Perfect length & would recommend:) \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Perfect little black dress",
        "body": "Perfect little higher neck little black dress. Wore it for a birthday dinner and it did not disappoint. Fits like a glove. True to size. Material is perfect and not see through. Read more",
        "author": "Haleigh_riopelle",
        "rating": 5.0,
        "date": "December 1, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Sexy & Classy",
        "body": "Obsessed! This black dress is everything. The quality is amazing, soft, comfortable, and super flattering in all the right places. It works perfectly for a night out or a work event. It’s the perfect mix of sexy and classy. Read more",
        "author": "Clara",
        "rating": 5.0,
        "date": "November 19, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71le8jImOVL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71UoMhUch6L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Perfect fit",
        "body": "Very comfortable and versatile dress! Fabric is stretchy and soft very beautiful dress Read more",
        "author": "Patricia Dolmo",
        "rating": 5.0,
        "date": "December 18, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Love!",
        "body": "Good quality, very cute and flattering Read more",
        "author": "sweetlady922",
        "rating": 4.0,
        "date": "December 15, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars True to size, perfect white dress for any occasion",
        "body": "Amazing quality! Not see through at all, thick and double lined, perfect for any bride or graduate. Fits true to size. The length can be adjusted by pulling up or down (adjusting the sides) while still looking timeless. I highly recommend!! Read more",
        "author": "Alaina Yeater",
        "rating": 5.0,
        "date": "December 7, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Big in the waist",
        "body": "Really pretty but runs large in the waist Read more",
        "author": "Natassja",
        "rating": 3.0,
        "date": "December 13, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Super cute and comfortable",
        "body": "I’m 5’3” and about 155 lbs and the medium fits really well. It has a back zipper but I don’t think I even would have needed it really, cause it’s really stretchy. It’s definitely thick enough material (it’s kind of double lined) and the material nearly feels like really soft swimsuit material. I have no idea if it will breathe well for dancing etc, or how well it will wash. But overall a very forgiving and flattering dress! Read more",
        "author": "Elizabeth Searing",
        "rating": 5.0,
        "date": "September 21, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71B5pYaXl+L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "1.0 out of 5 stars Very cheap",
        "body": "It was cheap quality- wore it one day and the material had a whole Read more",
        "author": "Gabriel",
        "rating": 1.0,
        "date": "December 2, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Dress Cocktail Ruched Sleeveless Bodycon is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.",
  "about_this_item": "Womens Dress Cocktail Ruched Sleeveless Bodycon is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.",
  "long_description": "Womens Dress Cocktail Ruched Sleeveless Bodycon is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Brown, Apricot, Army Green, Black, Orange, Light Blue, Red, Rose Red, Navy, Pink, White, Purple, Royal Blue, Green. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Dress Cocktail Ruched Sleeveless Bodycon is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Brown, Apricot, Army Green, Black, Orange, Light Blue, Red, Rose Red, Navy, Pink, White, Purple, Royal Blue, Green. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "318b5a5c-cafc-41c2-8586-a330f15b8eac",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/318b5a5c-cafc-41c2-8586-a330f15b8eac/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/318b5a5c-cafc-41c2-8586-a330f15b8eac/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/bfdf6284-aa37-4f48-954b-701ad54b2c37.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "ea037a48-c7a5-49ac-bf57-ac9e81d0d198",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ea037a48-c7a5-49ac-bf57-ac9e81d0d198/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ea037a48-c7a5-49ac-bf57-ac9e81d0d198/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/bfdf6284-aa37-4f48-954b-701ad54b2c37.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "cb44df41-26dd-4519-9d9f-8c9984e5076c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/cb44df41-26dd-4519-9d9f-8c9984e5076c/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/cb44df41-26dd-4519-9d9f-8c9984e5076c/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/bfdf6284-aa37-4f48-954b-701ad54b2c37.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "b0f8a167-09c5-4abe-a3d5-4d7e3f564f19",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b0f8a167-09c5-4abe-a3d5-4d7e3f564f19/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b0f8a167-09c5-4abe-a3d5-4d7e3f564f19/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/bfdf6284-aa37-4f48-954b-701ad54b2c37.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "a815f145-2b19-4f54-9d14-8e0f1decd968",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a815f145-2b19-4f54-9d14-8e0f1decd968/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a815f145-2b19-4f54-9d14-8e0f1decd968/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/bfdf6284-aa37-4f48-954b-701ad54b2c37.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "c6ade1e9-306e-492e-a724-6b9ba19ac6b2",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c6ade1e9-306e-492e-a724-6b9ba19ac6b2/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c6ade1e9-306e-492e-a724-6b9ba19ac6b2/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/bfdf6284-aa37-4f48-954b-701ad54b2c37.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "eba043f2-fd06-45e1-b204-bd121c43e68e",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/eba043f2-fd06-45e1-b204-bd121c43e68e/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/eba043f2-fd06-45e1-b204-bd121c43e68e/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/bfdf6284-aa37-4f48-954b-701ad54b2c37.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "be4621eb-403b-4418-8d5e-45cc9c46cec9",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/be4621eb-403b-4418-8d5e-45cc9c46cec9/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/be4621eb-403b-4418-8d5e-45cc9c46cec9/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/bfdf6284-aa37-4f48-954b-701ad54b2c37.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "342c6b97-3614-4334-9861-4f871f9dc156",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/342c6b97-3614-4334-9861-4f871f9dc156/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/342c6b97-3614-4334-9861-4f871f9dc156/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/bfdf6284-aa37-4f48-954b-701ad54b2c37.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "eddc9476-7fff-4e91-a0cd-46e881dc4f03",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/eddc9476-7fff-4e91-a0cd-46e881dc4f03/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/eddc9476-7fff-4e91-a0cd-46e881dc4f03/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/bfdf6284-aa37-4f48-954b-701ad54b2c37.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "a66162de-449d-49c2-b4f3-7b35ab5eebdc",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a66162de-449d-49c2-b4f3-7b35ab5eebdc/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a66162de-449d-49c2-b4f3-7b35ab5eebdc/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/bfdf6284-aa37-4f48-954b-701ad54b2c37.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "3639c13e-7236-4152-924e-e61cc993215c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3639c13e-7236-4152-924e-e61cc993215c/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3639c13e-7236-4152-924e-e61cc993215c/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/bfdf6284-aa37-4f48-954b-701ad54b2c37.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Brown": "https://m.media-amazon.com/images/I/310R6DkiduL._AC_SR38,50_.jpg",
    "Apricot": "https://m.media-amazon.com/images/I/31fNsM7UInL._AC_SR38,50_.jpg",
    "Army Green": "https://m.media-amazon.com/images/I/31keQpBxvTL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31sSQEL754L._AC_SR38,50_.jpg",
    "Orange": "https://m.media-amazon.com/images/I/31vQOekZqnL._AC_SR38,50_.jpg",
    "Light Blue": "https://m.media-amazon.com/images/I/31I0Awra+mL._AC_SR38,50_.jpg",
    "Red": "https://m.media-amazon.com/images/I/31Je3f0i0wL._AC_SR38,50_.jpg",
    "Rose Red": "https://m.media-amazon.com/images/I/31QPkaCl8lL._AC_SR38,50_.jpg",
    "Navy": "https://m.media-amazon.com/images/I/31yMg3FxnSL._AC_SR38,50_.jpg",
    "Pink": "https://m.media-amazon.com/images/I/31jI4MsjnqL._AC_SR38,50_.jpg",
    "White": "https://m.media-amazon.com/images/I/31Mi9C2OUoL._AC_SR38,50_.jpg",
    "Purple": "https://m.media-amazon.com/images/I/31-2ZTs1NjL._AC_SR38,50_.jpg",
    "Royal Blue": "https://m.media-amazon.com/images/I/31phOYm94XL._AC_SR38,50_.jpg",
    "Green": "https://m.media-amazon.com/images/I/31qxydQgvkL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Brown": "61KR6Cgv63L",
    "Apricot": "61xGnhrsbmL",
    "Army Green": "61uT-ZGQM6L",
    "Black": "610NAHUevoL",
    "Orange": "61oiRW3wM5L",
    "Light Blue": "6107LysixKL",
    "Red": "612YL+TIvpL",
    "Rose Red": "61tNT1Gw-kL",
    "Navy": "61i+m109Q8L",
    "Pink": "61cjEcPiQaL",
    "White": "61rdKhHIUmL",
    "Purple": "61FegUDixLL",
    "Royal Blue": "61ZqKAB9e7L",
    "Green": "61u+Lh6K0ZL"
  },
  "color_images": {
    "Brown": [
      "https://m.media-amazon.com/images/I/61KR6Cgv63L._SL1500_.jpg"
    ],
    "Apricot": [
      "https://m.media-amazon.com/images/I/61xGnhrsbmL._SL1500_.jpg"
    ],
    "Army Green": [
      "https://m.media-amazon.com/images/I/61uT-ZGQM6L._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/610NAHUevoL._SL1500_.jpg"
    ],
    "Orange": [
      "https://m.media-amazon.com/images/I/61oiRW3wM5L._SL1500_.jpg"
    ],
    "Light Blue": [
      "https://m.media-amazon.com/images/I/6107LysixKL._SL1500_.jpg"
    ],
    "Red": [
      "https://m.media-amazon.com/images/I/612YL+TIvpL._SL1500_.jpg"
    ],
    "Rose Red": [
      "https://m.media-amazon.com/images/I/61tNT1Gw-kL._SL1500_.jpg"
    ],
    "Navy": [
      "https://m.media-amazon.com/images/I/61i+m109Q8L._SL1500_.jpg"
    ],
    "Pink": [
      "https://m.media-amazon.com/images/I/61cjEcPiQaL._SL1500_.jpg"
    ],
    "White": [
      "https://m.media-amazon.com/images/I/61rdKhHIUmL._SL1500_.jpg"
    ],
    "Purple": [
      "https://m.media-amazon.com/images/I/61FegUDixLL._SL1500_.jpg"
    ],
    "Royal Blue": [
      "https://m.media-amazon.com/images/I/61ZqKAB9e7L._SL1500_.jpg"
    ],
    "Green": [
      "https://m.media-amazon.com/images/I/61u+Lh6K0ZL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 38.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71l8OE0DiEL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-mermaid-evening-v-neck-ruched-formal",
      "title": "Womens Maxi Dress Mermaid Evening V Neck Ruched Formal",
      "price": 74.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/41IEFJ24+SL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-maxi",
      "title": "Womens Maxi Dress Formal Maxi",
      "price": 74.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61Q047q7RjL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-ruched-mermaid-one-shoulder-formal",
      "title": "Womens Maxi Dress Maxi Ruched Mermaid One Shoulder Formal",
      "price": 84.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51dhGTr8JuL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-maxi-one-shoulder-evening-mermaid",
      "title": "Womens Maxi Dress Formal Maxi One Shoulder Evening Mermaid",
      "price": 94.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71ebKvALyYL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 88.49,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61imYyqh0TL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 42.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71I4ByfK7+L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-mermaid-long-sleeve",
      "title": "Womens Maxi Dress Mermaid Long Sleeve",
      "price": 138.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61okltnvUWL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-v-neck",
      "title": "Womens Maxi Dress Long Sleeve V Neck",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51HDzZ3fJzL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 295.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51tOCtnN9ML._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-sleeveless-ruched-boat-neck",
      "title": "Womens Dress Sleeveless Ruched Boat Neck",
      "price": 24.29,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51iPeZV6KDL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening-ruched",
      "title": "Womens Maxi Dress Formal Evening Ruched",
      "price": 69.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/514SkoNnvLL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-long-sleeve-maxi",
      "title": "Womens Maxi Dress Cocktail Long Sleeve Maxi",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61blndjnsnL._SL1500_.jpg"
      ]
    }
  ]
}