{
  "id": "womens-maxi-dress-long-sleeve",
  "handle": "womens-maxi-dress-long-sleeve",
  "sku": "JC1505",
  "asin": "B0DKF72ZN6",
  "title": "Womens Maxi Dress Long Sleeve",
  "title_original": "Floerns Women's Plus Size Floral Gothic Dress Flare Long Sleeve Mesh Grunge A Line Dress",
  "brand": "Visit the Floerns Store",
  "price": 39.99,
  "social_proof": {
    "bought_past_month": 152,
    "text": "152+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/71ldsPt7VmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81i5sD4CXtL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81Em5g1MHCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81Tx1rjWf6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Z+xa0JXEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81-fS74zdPL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71BBIKVxCEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71-rE0A9k+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71VE6CYRrDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71yIUTNWDIL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71YLWGY9ZcL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/71ldsPt7VmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81i5sD4CXtL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81Em5g1MHCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81Tx1rjWf6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Z+xa0JXEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81-fS74zdPL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71BBIKVxCEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71-rE0A9k+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71VE6CYRrDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71yIUTNWDIL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71YLWGY9ZcL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ October 21, 2024",
    "ASIN ‏": "‎ B0DKF5GNDF",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#42,361 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #1,021 in Women's Casual Dresses",
    "Customer Reviews": "4.5 4.5 out of 5 stars (62)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Brown",
      "Purple",
      "Burgundy",
      "Army Green",
      "Dark Blue",
      "Black"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.5,
    "count": 62,
    "customers_say": "Customers find the dress fits well, with one mentioning it accommodates large busts, and they appreciate its appearance, with one describing it as having beautiful witchy vibes. Moreover, the dress receives positive feedback for its quality, comfort, and material, and customers consider it good value for money. However, opinions about sizing are mixed, with some finding it true to size while others say it runs large. Generated from the text of customer reviews Select to learn more Fit (20) Look (18) Quality (7) Flattering (6) Comfort (5) Material quality (5) Value for money (4) Size (9) 20 customers mention fit, 15 positive, 5 negative 20 customers mention \"Fit\" 15 positive 5 negative Customers are satisfied with how the dress fits, with one mentioning it accommodates large chests well and another noting there's plenty of room for the bust. \" Omg!!!!!!! This thing is the right size based off the sizing chart. Fits amazing .... \" Read more \" ...5'6 / 175lbs / size 14 -xl / 40 DD. Now with that in mind, the XL fit perfectly . I wore it braless due to the center gap.... \" Read more \" This fit WEIRD . The dress itself was ok, though it looked cheap due to materials. But geez, the chest area!... \" Read more \" This dress fits me amazing and it’s very flattering. I’m 207lbs, 40G and carry most of my weight in my chest, glutes and midsection.... \" Read more 18 customers mention look, 18 positive, 0 negative 18 customers mention \"Look\" 18 positive 0 negative Customers find the dress cute, with one mentioning it has beautiful witchy vibes. \" The dress is super cute . I absolutely loved the flared sleeves. I ordered it for a fall wedding and got a lot of compliments on it.... \" Read more \" ...Fit great and material was nice! I got the green and it’s beautiful ! \" Read more \" Right now I weigh 290ish and I’m about 5’5 - loved this dress sooo cute ! Felt amazing and comfortable. \" Read more \" Gorgeous dress !... \" Read more 7 customers mention quality, 7 positive, 0 negative 7 customers mention \"Quality\" 7 positive 0 negative Customers find the dress to be of good quality. \" ... Amazing dress absolutely love it!!! \" Read more \" The best dress I have ever put on my body! I have a hanging belly and it was totally disguised.... \" Read more \" This dress is fantastic !! Super cute and I love it. Some things to note: - Fit is TTS -... \" Read more \" This fit WEIRD. The dress itself was ok , though it looked cheap due to materials. But geez, the chest area!... \" Read more 6 customers mention flattering, 5 positive, 1 negative 6 customers mention \"Flattering\" 5 positive 1 negative Customers find the dress flattering, with one mentioning it shows a lot of leg. \" This dress fits me amazing and it’s very flattering . I’m 207lbs, 40G and carry most of my weight in my chest, glutes and midsection.... \" Read more \" Buy it! Buy the dress!! It’s so beautiful & flattering . \" Read more \" ...Fit is TTS - It's short mini length and shows a lot of leg -... \" Read more \" I love this dress! It's so flattering on my curvy figure , and seems to be well-made. I'm about a size 14 and the XL fits very comfortably.... \" Read more 5 customers mention comfort, 5 positive, 0 negative 5 customers mention \"Comfort\" 5 positive 0 negative Customers find the dress comfortable. \" ...Felt amazing and comfortable . \" Read more \" ...This dress looks so good on and is very comfortable as well. Great price and love the look! \" Read more \" ...It looked gorgeous on her and was comfortable enough for her to dance and enjoy the whole night.... \" Read more \" Bought this for a Practical Magic themed night. Very comfortable Size was exact... \" Read more 5 customers mention material quality, 4 positive, 1 negative 5 customers mention \"Material quality\" 4 positive 1 negative Customers like the material of the dress. \" ... Fabric is nice ! It's thin almost chiffon fabric and the black pattern is a velvet texture.... \" Read more \" I absolutely loved this dress so much! Fit great and material was nice ! I got the green and it’s beautiful! \" Read more \" ... Material is wonderful Washes easily- would recommend- hang dry ONLY \" Read more \" This fit WEIRD. The dress itself was ok, though it looked cheap due to materials . But geez, the chest area!... \" Read more 4 customers mention value for money, 3 positive, 1 negative 4 customers mention \"Value for money\" 3 positive 1 negative Customers find the dress offers good value for money. \" ...This dress looks so good on and is very comfortable as well. Great price and love the look! \" Read more \" ...It's not too thick or thin, and is better than expected for the cost . \" Read more \" ...People were saying the dress was cheap feeling and not worth the price but I honestly thought the fabric felt decent but I'm also not use to being... \" Read more \" Beautiful and great item for the affordable cost .... \" Read more 9 customers mention size, 6 positive, 3 negative 9 customers mention \"Size\" 6 positive 3 negative Customers have mixed opinions about the dress's sizing, with some finding it true to size while others note that the chest area can accommodate larger busts and that the length is longer than expected. \" ...Very comfortable Size was exact There is a slight peakaboo in the chest because of the drawstring bust, but no complaints.... \" Read more \" This dress is really cute. It’s a big longer than I expected but that’s okay! I’m 5’3 and this is an XL.... \" Read more \" ...The size was true to the chart and fit her beautifully in all the right places.... \" Read more \" Omg!!!!!!! This thing is the right size based off the sizing chart. Fits amazing.... \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Gorgeous dress!",
        "body": "This dress fits me amazing and it’s very flattering. I’m 207lbs, 40G and carry most of my weight in my chest, glutes and midsection. This dress looks so good on and is very comfortable as well. Great price and love the look! Read more",
        "author": "Mhysa",
        "rating": 5.0,
        "date": "December 11, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Gorgeous dress",
        "body": "I bought this homecoming dress for my daughter, and it was absolutely perfect! The size was true to the chart and fit her beautifully in all the right places. It looked gorgeous on her and was comfortable enough for her to dance and enjoy the whole night. She felt confident and looked stunning — we couldn’t have been happier with this dress! Read more",
        "author": "Tonya",
        "rating": 5.0,
        "date": "October 14, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Cute and comfortable",
        "body": "Love this dress. It’s very short so I have to wear boy shorts underneath instead of my usual biker shorts. Don’t need a bra because the top part is loose and gathered in a cute way. Read more",
        "author": "Alexis Jensen",
        "rating": 5.0,
        "date": "November 4, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Cute plus size alternative dress.",
        "body": "The dress is super cute. I absolutely loved the flared sleeves. I ordered it for a fall wedding and got a lot of compliments on it. I'm 5'3\" and 225 pounds and typically wear a size XL sometimes 2X as I have a 42DDD/F chest and need extra room in tops. I hate wearing dresses as alot of them have a specific sewn in section for breasts and those typically are way to small for me despite the dress fitting everywhere else. After reading reviews and seeing the measurements I sized up two sizes (3x) in hopes it would work out. Alot of people in the reviews were talking about how the chest cage was \"laughably oversized\" but it just barely fit my girls. One thing that isn't shown or mentioned is the front where the tie is has a slit and the strings are used to close it. Having a large chest those often suck because it makes the chest look like when a women is wearing a button up too small and her chest is busting at the seems and you get peaks of everything here or there so I ended up having to safety pin it close so I didn't flash people. I'll probs end up sewing it shut later on. I didn't want to size up again because I knew the bottom half of the dress and sleeves would have been drowning me with fabric. People were saying the dress was cheap feeling and not worth the price but I honestly thought the fabric felt decent but I'm also not use to being able to find cute alternative things in my size for super cheap do maybe thats why I wasn't bothered by the price point. I'll definitely wear this at other events or even just during spring/summer at the flower festivals. Read more",
        "author": "A. Cortez",
        "rating": 4.0,
        "date": "October 19, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61Ac2UZV4+L._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71O+q7PXl3L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Beautiful witchy vibes!",
        "body": "This dress is fantastic!! Super cute and I love it. Some things to note: - Fit is TTS - It's short mini length and shows a lot of leg - There is a gap in the front bust where it ties and if you have a large chest that gap will be wide. I wore a thin black tank underneath so it just showed black and looked intentional. - Fabric is nice! It's thin almost chiffon fabric and the black pattern is a velvet texture. There is a liner so it isn't see through besides the sleeves Read more",
        "author": "Ali D",
        "rating": 5.0,
        "date": "October 2, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Low quality, stitching/layout is off not as pictured.",
        "body": "Decent quality only complaints I have is the bust area is open in the middle it has about 1/2 inch gap so even if you \"close\" and tie the strings it still shows gonna need to figure out how to fix that. Also the thread used for stitching is super thin. I went to the a bow with the string and it snapped before even tying. Also heard a few \"snaps\" from the threading around the waist. Pretty bummed but I need the outfit for an event and can't find anything locally. I did size down from recommendation and it fits good. I am a 40DD and it was still a little loose. I will upload a picture once I get back home. I got black and it was a nice color nothing faded. I think this dress is overpriced. I wouldn't pay more than 15$ for this dress in all honesty. Super comfy no itchy fabric fit and flare fit. Super cute over all I would highly recommend for the smaller body sizes for the plus sizes just be mindful our bodies need better quality to be flattering and last. Read more",
        "author": "Christina O.",
        "rating": 3.0,
        "date": "October 14, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Very flattering",
        "body": "You can already see for yourself that this dress is cute. So I'll try to stick to the things that might help! 5'6 / 175lbs / size 14 -xl / 40 DD. Now with that in mind, the XL fit perfectly. I wore it braless due to the center gap. Plenty of room for my bust. I did choose to double knot the bow to not cause a public panic with strings coming undone. Very flattering & lightweight. I live in Florida and tend to get hot really easily. This was perfect for an October evening out. Read more",
        "author": "Melissa",
        "rating": 5.0,
        "date": "October 13, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Larger in the top than expected, all else great",
        "body": "Beautiful and great item for the affordable cost. The fit was a bit too big in the shoulders and bust area but was an easy fix with a quick tack in the back neckline. Read more",
        "author": "Velina Clements",
        "rating": 5.0,
        "date": "September 28, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.",
  "about_this_item": "Womens Maxi Dress Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.",
  "long_description": "Womens Maxi Dress Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Brown, Purple, Burgundy, Army Green, Dark Blue, Black. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Brown, Purple, Burgundy, Army Green, Dark Blue, Black. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "6b167ef8-3a52-4f57-8c24-7329c6bfea71",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6b167ef8-3a52-4f57-8c24-7329c6bfea71/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6b167ef8-3a52-4f57-8c24-7329c6bfea71/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/a1581a62-affb-48f7-b9ac-364df0354593.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "c39e6312-c8d6-413d-b87b-053375c19f50",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c39e6312-c8d6-413d-b87b-053375c19f50/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c39e6312-c8d6-413d-b87b-053375c19f50/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/a1581a62-affb-48f7-b9ac-364df0354593.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "00b93177-8b2c-488d-a7fc-4b34ac4460e8",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/00b93177-8b2c-488d-a7fc-4b34ac4460e8/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/00b93177-8b2c-488d-a7fc-4b34ac4460e8/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/a1581a62-affb-48f7-b9ac-364df0354593.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "d2564060-502a-4dae-92a7-0c2046f88a76",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d2564060-502a-4dae-92a7-0c2046f88a76/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d2564060-502a-4dae-92a7-0c2046f88a76/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/a1581a62-affb-48f7-b9ac-364df0354593.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "335c2a57-e4be-4980-a147-aff4d742fc66",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/335c2a57-e4be-4980-a147-aff4d742fc66/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/335c2a57-e4be-4980-a147-aff4d742fc66/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/a1581a62-affb-48f7-b9ac-364df0354593.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "f12d77a6-49fb-4184-9777-8e7eaf96a24f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f12d77a6-49fb-4184-9777-8e7eaf96a24f/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f12d77a6-49fb-4184-9777-8e7eaf96a24f/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/a1581a62-affb-48f7-b9ac-364df0354593.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Brown": "https://m.media-amazon.com/images/I/412t+MfuIcL._AC_SR38,50_.jpg",
    "Purple": "https://m.media-amazon.com/images/I/41HruqRZcyL._AC_SR38,50_.jpg",
    "Burgundy": "https://m.media-amazon.com/images/I/41Ih1wiINSL._AC_SR38,50_.jpg",
    "Army Green": "https://m.media-amazon.com/images/I/41zeoAAY2hL._AC_SR38,50_.jpg",
    "Dark Blue": "https://m.media-amazon.com/images/I/413VJOzWojL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/41iV1UyN3vL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Brown": "71BBIKVxCEL",
    "Purple": "71-rE0A9k+L",
    "Burgundy": "71VE6CYRrDL",
    "Army Green": "71ldsPt7VmL",
    "Dark Blue": "71yIUTNWDIL",
    "Black": "71YLWGY9ZcL"
  },
  "color_images": {
    "Brown": [
      "https://m.media-amazon.com/images/I/71BBIKVxCEL._SL1500_.jpg"
    ],
    "Purple": [
      "https://m.media-amazon.com/images/I/71-rE0A9k+L._SL1500_.jpg"
    ],
    "Burgundy": [
      "https://m.media-amazon.com/images/I/71VE6CYRrDL._SL1500_.jpg"
    ],
    "Army Green": [
      "https://m.media-amazon.com/images/I/71ldsPt7VmL._SL1500_.jpg"
    ],
    "Dark Blue": [
      "https://m.media-amazon.com/images/I/71yIUTNWDIL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/71YLWGY9ZcL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress-cocktail-bodycon",
      "title": "Womens Dress Cocktail Bodycon",
      "price": 47.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61NfEwzl3xL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-one-shoulder-maxi-formal",
      "title": "Womens Maxi Dress Evening One Shoulder Maxi Formal",
      "price": 69.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/5150AIQL4eL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail",
      "title": "Womens Dress Cocktail",
      "price": 103.54,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61JApwce25L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-formal-bodycon-evening-sleeveless",
      "title": "Womens Maxi Dress Maxi Formal Bodycon Evening Sleeveless",
      "price": 61.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61s8qg6u1VL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 158.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71PmRANW40L._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress-bodycon-split-ruched-off-shoulder",
      "title": "Womens Dress Bodycon Split Ruched Off Shoulder",
      "price": 38.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/41JjYcPgcpL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 95.61,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Work",
      "images": [
        "https://m.media-amazon.com/images/I/71hVgSIB1jL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 138.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51PZNrlyY9L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-split-evening-formal",
      "title": "Womens Maxi Dress Split Evening Formal",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51BZ1BqPx8L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 65.97,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/81wr8PDg55L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-v-neck",
      "title": "Womens Dress V Neck",
      "price": 82.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/710bSTpZ9hL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 278.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/91YXeyW506L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening-long-sleeve",
      "title": "Womens Maxi Dress Formal Evening Long Sleeve",
      "price": 87.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61nnk+flvaL._SL1500_.jpg"
      ]
    }
  ]
}