{
  "id": "womens-maxi-dress-bodycon-long-sleeve",
  "handle": "womens-maxi-dress-bodycon-long-sleeve",
  "sku": "JC1621",
  "asin": "B0DKNW2CBJ",
  "title": "Womens Maxi Dress Bodycon Long Sleeve",
  "title_original": "HBQ Women's Casual Sweater Dress Turtleneck Ribbed Bodycon Long Sleeve Mini Knit Dresses 2025 Fashion",
  "brand": "Visit the HBQ Store",
  "price": 19.99,
  "social_proof": {
    "bought_past_month": 695,
    "text": "695+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/61doOUdWc3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71H1ffyGxZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71cQD46Hw1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71wY7ll5spL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/714YZ9-PN5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61tDuilILyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Y6IkfwvFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61AxU6RXEQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61J7oL1dbiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/712Fj5arXaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61gk8WXJUkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61YPF99kTFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61K62xIMJoL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61CVnoQFPgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/610Yuhjl-XL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ZPH6h-ziL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61lI8+xaISL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61m3QJwzR7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71+tfAsFP-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Updxrhs5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ME5E+awsL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71qOawhwNeL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71mRCYectgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61o6JwmSx3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71jVLMnD9RL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/616drvU8GRL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61EiDwmzMoL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61gIy3yujUL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/61doOUdWc3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71H1ffyGxZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71cQD46Hw1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71wY7ll5spL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/714YZ9-PN5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61tDuilILyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Y6IkfwvFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61AxU6RXEQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61J7oL1dbiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/712Fj5arXaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61gk8WXJUkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61YPF99kTFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61K62xIMJoL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61CVnoQFPgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/610Yuhjl-XL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ZPH6h-ziL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61lI8+xaISL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61m3QJwzR7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71+tfAsFP-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Updxrhs5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ME5E+awsL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71qOawhwNeL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71mRCYectgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61o6JwmSx3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71jVLMnD9RL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/616drvU8GRL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61EiDwmzMoL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61gIy3yujUL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ October 23, 2024",
    "ASIN ‏": "‎ B0FC65HK3H",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#7,631 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #35 in Women's Casual Dresses",
    "Customer Reviews": "4.0 4.0 out of 5 stars (240)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Brown",
      "Blue",
      "92-red",
      "92-green",
      "Black",
      "Orange",
      "Red",
      "Rose Red",
      "91-green",
      "92-blue",
      "92-grey",
      "Khaki",
      "Pink",
      "92-black",
      "92-khaki",
      "Dark Blue",
      "88-grey",
      "Light Purple",
      "Dark Purple",
      "88-purple",
      "Green",
      "Grey",
      "91-black",
      "91-khaki"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.0,
    "count": 240,
    "customers_say": "Customers find the dress super soft and comfortable, with one mentioning it's perfect for pairing with thigh-high boots. The material receives mixed feedback - while some find it nice, others note it's thinner than expected. The dress is cute, though opinions on color are divided between those who love it and those who find it disappointing. The fit is also mixed, with some finding it perfect while others note it's tight around the neck. Select to learn more Cute Comfort Soft material Fit Sheerness Material thickness Color Quality 22 customers mention \"Cute\" 21 positive 1 negative Customers find the dress cute. \" Cute , comfortable and you can dress it up or down. I am between a xl and xxl and snagged a xxl and it was perfect but slightly loose....\" Read more \"What a cute sweater dress !...\" Read more \"The dress is super cute , but I ended up returning it because it was too long and had too much extra fabric....\" Read more \"It’s really cute but the material is very thin and see-through. It wouldn’t be very warm on its own due to the same reason....\" Read more 17 customers mention \"Comfort\" 17 positive 0 negative Customers find the dress comfortable, with one mentioning they don't feel suffocated and another noting it's not itchy. \"Fit well. Soft and comfortable . Has some stretch to it but also fits close. Got a 2XL. I’m 5’6” 230lb. Thinking of buying again in a different color.\" Read more \"Wish I took pictures. Was comfy and nice material. Bought it for my birthday dinner in January....\" Read more \"5’4” 112lbs. Great fit, comfortable fabric . Nice color green. Bought size small. Not see through if you don’t stretch it to the max....\" Read more \"The material is very comfortable , it’s stretchy but thin. I picked the green one, be aware it’s more of a grey color.\" Read more 15 customers mention \"Soft material\" 14 positive 1 negative Customers find the dress's material super soft. \"Fit well. Soft and comfortable. Has some stretch to it but also fits close. Got a 2XL. I’m 5’6” 230lb. Thinking of buying again in a different color.\" Read more \"LOVE it! Super soft and fits exactly as expected per the sizing chart....\" Read more \"...cute pair heels or tall boots and u have a night out outfit , very soft material and not itchy nor does it get too hot\" Read more \"...The fabric is really soft , the color matches the photos perfectly, and it’s thick enough that it isn’t see-through....\" Read more 34 customers mention \"Fit\" 21 positive 13 negative Customers have mixed opinions about the dress's fit, with some finding it perfect while others note it's tight around the neck. \"5’4” 112lbs. Great fit , comfortable fabric. Nice color green. Bought size small. Not see through if you don’t stretch it to the max....\" Read more \"The dress is super cute, but I ended up returning it because it was too long and had too much extra fabric....\" Read more \" Fit well . Soft and comfortable. Has some stretch to it but also fits close. Got a 2XL. I’m 5’6” 230lb. Thinking of buying again in a different color.\" Read more \"Perfect ALL around, perfect fit , just the right stretch and length wasn't too thick and heavy wore it to a birthday party under a wool coat.\" Read more 20 customers mention \"Sheerness\" 6 positive 14 negative Customers have mixed opinions about the dress's sheerness, with several noting it is see-through. \"I should’ve gone a size up, see through and rough material. I won’t but again.\" Read more \"It’s really cute but the material is very thin and see-through . It wouldn’t be very warm on its own due to the same reason....\" Read more \"...Nice color green. Bought size small. Not see through if you don’t stretch it to the max. Very flattering.\" Read more \"...Its the perfect length to pair with some thigh high boots ! Its a little sheer but nothing that some dark undergarments or shapeware cant take care...\" Read more 19 customers mention \"Material thickness\" 9 positive 10 negative Customers have mixed opinions about the dress's material thickness, with some finding it nice while others note it is thinner than expected. \"...I wore it with knee-high boots and my husband loved it. The fabric is on the thinner side , but if that’s an issue, you can always wear spanx.\" Read more \"...I love the dark gray color and I love the material and how it fits - I'm not mad about the length to be honest because for me it looks like a midi...\" Read more \"...but I ended up returning it because it was too long and had too much extra fabric ....\" Read more \" Material was nice and soft. True to size. Fit was just weird.\" Read more 14 customers mention \"Color\" 9 positive 5 negative Customers have mixed opinions about the dress's color, with some loving it while others find it disappointing. \"What a cute sweater dress! I love the color and how this dress fits me, and although the material is quite thin, it definitely keeps me cozy and...\" Read more \"Too short and color was not like the picture \" Read more \"I love the color of this dress and it feels very comfortable on....\" Read more \"Love it! The material is so soft and the color is beautiful .Its the perfect length to pair with some thigh high boots !...\" Read more 11 customers mention \"Quality\" 7 positive 4 negative Customers have mixed opinions about the dress, with some loving it while others find the quality very cheap. \"This dress is very soft, durable and comfortable. It is a nice sweater dress that is thinner and very comfortable to wear in warmer weather, it hugs...\" Read more \"...Even when it’s scrunched up it’s to long. Plus quality of material is cheap material stretches quickly.\" Read more \"It is a nice dress but very see through. You need a slip.\" Read more \"The dress is fine . Great fit. The material is soft but thin. Most disappointing is the color. It looks nothing like the photo....\" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Beautiful casual holiday dress",
        "body": "LOVE it! Super soft and fits exactly as expected per the sizing chart. HOWEVER, this is NOT a mini in any way unless you scrunch it up around your waist and hips making it rouched (for reference I'm 5'1\", 100 lbs. 32\"x24\"x34\" and ordered a small). I love the dark gray color and I love the material and how it fits - I'm not mad about the length to be honest because for me it looks like a midi and works. The material is great and the stretch is there so it helps keep the fitted shape. I will say it seems like the thickness of the material wouldn't be very warm (it's fairly thin) in a cold climate but in 60-70 degrees with a wrap or boots it's great. Also, it is pretty sheer so unless you are wearing a dark color and maybe some sort of form-fitting undergarment you will definitely be able to see through it - it shows everything and every bump so be warned. Read more",
        "author": "promogal",
        "rating": 5.0,
        "date": "December 5, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Perfect for cool weather",
        "body": "Love it! The material is so soft and the color is beautiful.Its the perfect length to pair with some thigh high boots ! Its a little sheer but nothing that some dark undergarments or shapeware cant take care of! Read more",
        "author": "Desi",
        "rating": 5.0,
        "date": "November 27, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Shaper outline does show through a little.",
        "body": "What a cute sweater dress! I love the color and how this dress fits me, and although the material is quite thin, it definitely keeps me cozy and warm. Now, I will always wear a full body shaper and a nice pair of silky and shiny nude pantyhose with all of my dresses, and this dress does show the outline of my body shaper, since it fits snugly, but it isn't that bad. I actually like that it shows through just a little. This is just a fun dress to wear for the day or for a night out, matched with shiny pantyhose and, of course, a sexy pair of high heeled ankle boots. Read more",
        "author": "Lenny S.",
        "rating": 4.0,
        "date": "October 18, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Would buy again",
        "body": "Cute, comfortable and you can dress it up or down. I am between a xl and xxl and snagged a xxl and it was perfect but slightly loose. Warm and comfortable, it was longer than what the pictures portray but still good. If it between sizes I would go with your smaller size bc the dress does have stretch to it. Read more",
        "author": "Felicia Luchkiw",
        "rating": 5.0,
        "date": "December 12, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "1.0 out of 5 stars Fit",
        "body": "Definitely not like the picture. Had a weird uncomfortable fit and it is see through. Quality seems very cheap. I got a size small and it was tight around the neck Read more",
        "author": "Lorena",
        "rating": 1.0,
        "date": "November 12, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Size down for the length",
        "body": "I’m 5’5 and this dress is down to my knees. Definitely not short. It’s clings to the body and is soft. I recommend wearing a shaper if you don’t already have that hour glass shape. It shows every little roll/crease Read more",
        "author": "kelli",
        "rating": 3.0,
        "date": "December 5, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars My favorite little black dress !",
        "body": "Ive had this dress for a few months now and I can say I'm obsessed!! Can dress this up or down, and it hugs my curves very nicely. It's a bit thin but not see through! Very stretchy as well, I don't feel suffocated and that's usually my biggest issues with skin hugging dresses like these! The color has also stayed dark despite many washes. Very versatile piece, I'm in love with it! Worth every penny in my opinion!! Read more",
        "author": "T.F.",
        "rating": 5.0,
        "date": "October 29, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "2.0 out of 5 stars Dress needs a revamp, they missed the mark",
        "body": "Wanted to love this dress, liked the style with the gray stripe on the chest area. I ordered a medium and could hardly get the dress over my head. The size issue was getting the waist part over my chest and the neck hole is really snug too. I'm 5'4\", 142 lbs., with a normal sized head lol. For it being 4% spandex/elastene, it was not stretchy overall. The stripe does not carry over to the back of the dress either and the dress was too long. Just unflattering everywhere unfortunately. Read more",
        "author": "sf81az",
        "rating": 2.0,
        "date": "October 29, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Bodycon Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.",
  "about_this_item": "Womens Maxi Dress Bodycon Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.",
  "long_description": "Womens Maxi Dress Bodycon Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Brown, Blue, 92-red, 92-green, Black, Orange, Red, Rose Red, 91-green, 92-blue, 92-grey, Khaki, Pink, 92-black. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Bodycon Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Brown, Blue, 92-red, 92-green, Black, Orange, Red, Rose Red, 91-green, 92-blue, 92-grey, Khaki, Pink, 92-black. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "9b219fe0-7f58-4307-b52b-c627505db481",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9b219fe0-7f58-4307-b52b-c627505db481/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9b219fe0-7f58-4307-b52b-c627505db481/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "8871e757-078a-4fc2-ac40-385134882ff4",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8871e757-078a-4fc2-ac40-385134882ff4/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8871e757-078a-4fc2-ac40-385134882ff4/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "8a3573e1-0ddc-477c-bec1-0da54c0eb168",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8a3573e1-0ddc-477c-bec1-0da54c0eb168/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8a3573e1-0ddc-477c-bec1-0da54c0eb168/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "04779a0c-010c-4d4c-af69-0f00cc6c0cef",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/04779a0c-010c-4d4c-af69-0f00cc6c0cef/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/04779a0c-010c-4d4c-af69-0f00cc6c0cef/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "c8cb5ca3-d974-4a14-b472-a841ea3f6416",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c8cb5ca3-d974-4a14-b472-a841ea3f6416/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c8cb5ca3-d974-4a14-b472-a841ea3f6416/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "bc0d5a99-833c-46e4-880a-376fbf9b9792",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bc0d5a99-833c-46e4-880a-376fbf9b9792/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bc0d5a99-833c-46e4-880a-376fbf9b9792/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "b9f8b084-fbcf-422e-bdd6-568769e7d3fd",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b9f8b084-fbcf-422e-bdd6-568769e7d3fd/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b9f8b084-fbcf-422e-bdd6-568769e7d3fd/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "bb556303-3e49-4f8b-b50a-ee29ea7729aa",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bb556303-3e49-4f8b-b50a-ee29ea7729aa/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bb556303-3e49-4f8b-b50a-ee29ea7729aa/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Brown": "https://m.media-amazon.com/images/I/41ek6+mC7dL._AC_SR38,50_.jpg",
    "Blue": "https://m.media-amazon.com/images/I/41eYB99hrNL._AC_SR38,50_.jpg",
    "92-red": "https://m.media-amazon.com/images/I/41n8Wrsh22L._AC_SR38,50_.jpg",
    "92-green": "https://m.media-amazon.com/images/I/41c8+VEQqwL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31D6mK+lyPL._AC_SR38,50_.jpg",
    "Orange": "https://m.media-amazon.com/images/I/419GSvRXkFL._AC_SR38,50_.jpg",
    "Red": "https://m.media-amazon.com/images/I/3142sgmlyAL._AC_SR38,50_.jpg",
    "Rose Red": "https://m.media-amazon.com/images/I/31zMXFD76GL._AC_SR38,50_.jpg",
    "91-green": "https://m.media-amazon.com/images/I/41qe8rzTRgL._AC_SR38,50_.jpg",
    "92-blue": "https://m.media-amazon.com/images/I/41givNDavrL._AC_SR38,50_.jpg",
    "92-grey": "https://m.media-amazon.com/images/I/41Tl0F6KhlL._AC_SR38,50_.jpg",
    "Khaki": "https://m.media-amazon.com/images/I/41yUmplIx1L._AC_SR38,50_.jpg",
    "Pink": "https://m.media-amazon.com/images/I/31SYGBez+3L._AC_SR38,50_.jpg",
    "92-black": "https://m.media-amazon.com/images/I/316LaZreU8L._AC_SR38,50_.jpg",
    "92-khaki": "https://m.media-amazon.com/images/I/41Ee4KvzjpL._AC_SR38,50_.jpg",
    "Dark Blue": "https://m.media-amazon.com/images/I/41q5i7EsG5L._AC_SR38,50_.jpg",
    "88-grey": "https://m.media-amazon.com/images/I/41BqTQwTBCL._AC_SR38,50_.jpg",
    "Light Purple": "https://m.media-amazon.com/images/I/41-ATxPGIHL._AC_SR38,50_.jpg",
    "Dark Purple": "https://m.media-amazon.com/images/I/41Jo7kJ22QL._AC_SR38,50_.jpg",
    "88-purple": "https://m.media-amazon.com/images/I/41a0iZ1WhjL._AC_SR38,50_.jpg",
    "Green": "https://m.media-amazon.com/images/I/41Ydb6SM96L._AC_SR38,50_.jpg",
    "Grey": "https://m.media-amazon.com/images/I/319gSJ8EzpL._AC_SR38,50_.jpg",
    "91-black": "https://m.media-amazon.com/images/I/312iG6vnpsL._AC_SR38,50_.jpg",
    "91-khaki": "https://m.media-amazon.com/images/I/41qSfn12KrL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Brown": "61tDuilILyL",
    "Blue": "71Y6IkfwvFL",
    "92-red": "61AxU6RXEQL",
    "92-green": "61J7oL1dbiL",
    "Black": "61doOUdWc3L",
    "Orange": "712Fj5arXaL",
    "Red": "61gk8WXJUkL",
    "Rose Red": "61YPF99kTFL",
    "91-green": "61K62xIMJoL",
    "92-blue": "61CVnoQFPgL",
    "92-grey": "610Yuhjl-XL",
    "Khaki": "71ZPH6h-ziL",
    "Pink": "61lI8+xaISL",
    "92-black": "61m3QJwzR7L",
    "92-khaki": "71+tfAsFP-L",
    "Dark Blue": "71Updxrhs5L",
    "88-grey": "61ME5E+awsL",
    "Light Purple": "71qOawhwNeL",
    "Dark Purple": "71mRCYectgL",
    "88-purple": "61o6JwmSx3L",
    "Green": "71jVLMnD9RL",
    "Grey": "616drvU8GRL",
    "91-black": "61EiDwmzMoL",
    "91-khaki": "61gIy3yujUL"
  },
  "color_images": {
    "Brown": [
      "https://m.media-amazon.com/images/I/61tDuilILyL._SL1500_.jpg"
    ],
    "Blue": [
      "https://m.media-amazon.com/images/I/71Y6IkfwvFL._SL1500_.jpg"
    ],
    "92-red": [
      "https://m.media-amazon.com/images/I/61AxU6RXEQL._SL1500_.jpg"
    ],
    "92-green": [
      "https://m.media-amazon.com/images/I/61J7oL1dbiL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/61doOUdWc3L._SL1500_.jpg"
    ],
    "Orange": [
      "https://m.media-amazon.com/images/I/712Fj5arXaL._SL1500_.jpg"
    ],
    "Red": [
      "https://m.media-amazon.com/images/I/61gk8WXJUkL._SL1500_.jpg"
    ],
    "Rose Red": [
      "https://m.media-amazon.com/images/I/61YPF99kTFL._SL1500_.jpg"
    ],
    "91-green": [
      "https://m.media-amazon.com/images/I/61K62xIMJoL._SL1500_.jpg"
    ],
    "92-blue": [
      "https://m.media-amazon.com/images/I/61CVnoQFPgL._SL1500_.jpg"
    ],
    "92-grey": [
      "https://m.media-amazon.com/images/I/610Yuhjl-XL._SL1500_.jpg"
    ],
    "Khaki": [
      "https://m.media-amazon.com/images/I/71ZPH6h-ziL._SL1500_.jpg"
    ],
    "Pink": [
      "https://m.media-amazon.com/images/I/61lI8+xaISL._SL1500_.jpg"
    ],
    "92-black": [
      "https://m.media-amazon.com/images/I/61m3QJwzR7L._SL1500_.jpg"
    ],
    "92-khaki": [
      "https://m.media-amazon.com/images/I/71+tfAsFP-L._SL1500_.jpg"
    ],
    "Dark Blue": [
      "https://m.media-amazon.com/images/I/71Updxrhs5L._SL1500_.jpg"
    ],
    "88-grey": [
      "https://m.media-amazon.com/images/I/61ME5E+awsL._SL1500_.jpg"
    ],
    "Light Purple": [
      "https://m.media-amazon.com/images/I/71qOawhwNeL._SL1500_.jpg"
    ],
    "Dark Purple": [
      "https://m.media-amazon.com/images/I/71mRCYectgL._SL1500_.jpg"
    ],
    "88-purple": [
      "https://m.media-amazon.com/images/I/61o6JwmSx3L._SL1500_.jpg"
    ],
    "Green": [
      "https://m.media-amazon.com/images/I/71jVLMnD9RL._SL1500_.jpg"
    ],
    "Grey": [
      "https://m.media-amazon.com/images/I/616drvU8GRL._SL1500_.jpg"
    ],
    "91-black": [
      "https://m.media-amazon.com/images/I/61EiDwmzMoL._SL1500_.jpg"
    ],
    "91-khaki": [
      "https://m.media-amazon.com/images/I/61gIy3yujUL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-v-neck-long-sleeve",
      "title": "Womens Maxi Dress V Neck Long Sleeve",
      "price": 42.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61ESKKVXeyL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 174.91,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71SN6Oih0hL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-cocktail-v-neck",
      "title": "Womens Maxi Dress Long Sleeve Cocktail V Neck",
      "price": 58.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/615ijFkMCdL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-v-neck-bodycon",
      "title": "Womens Maxi Dress Long Sleeve V Neck Bodycon",
      "price": 47.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61QbwpUJEwL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 24.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61H3TuaNRDL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-cocktail-split-formal",
      "title": "Womens Maxi Dress Cocktail Split Formal",
      "price": 57.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51TDVOmSHDL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi",
      "title": "Womens Maxi Dress Maxi",
      "price": 35.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/6135-lSmLWL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 55.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/81BWIeE3JdL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 169.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51Cd8onMJbL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 35.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71xNIsc8O6L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-evening-v-neck-mermaid-bodycon",
      "title": "Womens Dress Evening V Neck Mermaid Bodycon",
      "price": 84.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61VKe8rgggL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-ruched-sleeveless-maxi-cocktail",
      "title": "Womens Maxi Dress Bodycon Ruched Sleeveless Maxi Cocktail",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51KEafj4npL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-sleeveless-cocktail",
      "title": "Womens Dress Sleeveless Cocktail",
      "price": 43.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61yL+tI8RDL._SL1500_.jpg"
      ]
    }
  ]
}