{
  "id": "womens-dress",
  "handle": "womens-dress",
  "sku": "JC1361",
  "asin": "B0DK14NBCK",
  "title": "Womens Dress",
  "title_original": "CUPSHE Women Corduroy Fall Dresses Front Bib Pocket Square Neck Wide Strap Casual Overall Mini Dress",
  "brand": "Visit the CUPSHE Store",
  "price": 39.99,
  "social_proof": {
    "bought_past_month": 809,
    "text": "809+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/71QaY2E0Y9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61anqbItt9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71I2l+YuqyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ubZcaUrWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/816IEPEBaUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71afrvtoGOL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ohXb2hJVL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61-mtKJsMIL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71SsHaCJRtL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/610jnhQDZ-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Q3+vQ3uKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81y5LHn6DEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71tJWe11OWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71++5b6T-qL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71q0nSuPY-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71fd1SFQ34L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/611F8r+70VL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71OqAIOMUQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61TSN3yeJkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/712VHQLsxiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71xeF16JMYL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/71QaY2E0Y9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61anqbItt9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71I2l+YuqyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ubZcaUrWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/816IEPEBaUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71afrvtoGOL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ohXb2hJVL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61-mtKJsMIL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71SsHaCJRtL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/610jnhQDZ-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Q3+vQ3uKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81y5LHn6DEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71tJWe11OWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71++5b6T-qL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71q0nSuPY-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71fd1SFQ34L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/611F8r+70VL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71OqAIOMUQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61TSN3yeJkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/712VHQLsxiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71xeF16JMYL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ March 20, 2025",
    "ASIN ‏": "‎ B0F1ZX7BZL",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#20,982 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #480 in Women's Casual Dresses",
    "Customer Reviews": "4.0 4.0 out of 5 stars (672)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Brown",
      "Olive Green",
      "Dark Grey",
      "Apricot",
      "Grey Plaid",
      "Black",
      "Orange",
      "Brown Plaid",
      "Navy",
      "Wine Red",
      "Yellow",
      "Red Plaid",
      "Blue Plaid",
      "Light Purple",
      "Grey"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.0,
    "count": 672,
    "customers_say": "Customers find the dress cute, comfortable, and appreciate its perfect length above the knee. The fit is loose enough all around, though some mention it's tight on the hips. The quality and material thickness receive mixed feedback - while some say it's nice and thick, others find it feels cheap and thin. Moreover, durability is a concern as customers report the dress breaking right out of the bag. Generated from the text of customer reviews Select to learn more Cute (58) Fit (51) Comfort (16) Length (16) Quality (36) Material thickness (30) Size (20) Durability (14) 58 customers mention cute, 57 positive, 1 negative 58 customers mention \"Cute\" 57 positive 1 negative Customers find the dress cute, with one noting that it looks like real corduroy. \" ...Would’ve been such a cute and comfortable dress for the holidays. Felt thick like with some tights and a long sleeve it would be warm too.... \" Read more \" Super cute , I get a lot of good compliments when I wear this. Has a side zipper too that makes it easy to put on.... \" Read more \" So cute . Bought this for my daughter. She loves it. It isn’t thick. \" Read more \" Cute dress . Im 5'8 190 lbs hits above my knee. I got xl. It fits, but i could go up a size just for more comfort. Adjustable straps. \" Read more 51 customers mention fit, 38 positive, 13 negative 51 customers mention \"Fit\" 38 positive 13 negative Customers like how the dress fits, with one mentioning it's loose enough all around, and another noting it's not quite to their knees. \" Loved this! Casual but still dressy enough for what I needed it for! Fits well . Love the color! \" Read more \" ...It's a perfect length, not mini, great for Office work. Fits true to size , I love the zipper on the side. Will buy more colors!! \" Read more \" I think it’s cute but tighter on the hips than I would have liked, but take that with a grain of salt as I do have a larger butt.... \" Read more \" Super cute. Great fit . TTS \" Read more 16 customers mention comfort, 15 positive, 1 negative 16 customers mention \"Comfort\" 15 positive 1 negative Customers find the dress comfortable. \" It’s comfy ! Its cute! Its trendy! It’s budget friendly. Absolutely perfect! \" Read more \" This dress is adorable and comfortable . I got so many compliments on Thanksgiving. I am almost 5’10” and it was the perfect length. \" Read more \" ...It's not tight still have room in it. Very comfortable . If you like it really Loose than size up. I'm 5'6 150 great height also on my not to short. \" Read more \" So obsessed with this! I want it in every color! It’s so comfortable and love the adjustable straps! \" Read more 16 customers mention length, 13 positive, 3 negative 16 customers mention \"Length\" 13 positive 3 negative Customers like the dress's length, which sits above the knee, with one customer noting it's long enough to wear without leggings. \" I love this skirt jumper! It's a perfect length , not mini, great for Office work. Fits true to size, I love the zipper on the side.... \" Read more \" ...Material is a nice thickness and the length is just above my knee . I pair with Steve Madden Troopa boots for a fun and stylish outfit.... \" Read more \" I am 5'8 and got a medium, not too short but the perfect above knee length . Quality is alright but it did the job for family pictures!... \" Read more \" I am 4'11, 95 lbs and the XS fits perfect. Goes right above the knee and loose enough all around. It's a thinner material which is what I wanted.... \" Read more 36 customers mention quality, 21 positive, 15 negative 36 customers mention \"Quality\" 21 positive 15 negative Customers have mixed opinions about the dress's quality, with some finding it nice and well-made, while others describe it as flimsy and cheap. \" ...I've only worn it once, but so far, it appears to be great quality . Love the pockets, deep olive color, and material fabric.... \" Read more \" Poor quality but a super cute look \" Read more \" Fits well. Nice quality . Cute. Wore with boots and got lots of compliments. \" Read more \" Material is very thin and cheap . I never even wore this and I just noticed that it’s broken and it’s too late to return.... \" Read more 30 customers mention material thickness, 10 positive, 20 negative 30 customers mention \"Material thickness\" 10 positive 20 negative Customers have mixed opinions about the dress's material thickness, with some finding it nice and soft while others describe it as very thin and cheap. \" Thin and flimsy. The overall snaps didn’t even stay together and the whole thing lacked structure. It was horrible to adjust, too.... \" Read more \" Exactly as pictured! Such a fun dress to run errands. Material is a nice thickness and the length is just above my knee.... \" Read more \" Material is very thin and cheap. I never even wore this and I just noticed that it’s broken and it’s too late to return.... \" Read more \" The dress is a thin material and the clips feel cheap. I got my normal size and the belly area is a little snug.... \" Read more 20 customers mention size, 6 positive, 14 negative 20 customers mention \"Size\" 6 positive 14 negative Customers have mixed opinions about the dress's sizing, with some finding it true to size while others report that it runs really small. \" ...This runs small so size up 1 size. The overalls do not clasp into place on the button they just are there and if you move the wrong way come undone.... \" Read more \" Runs really small and is thin and flimsy material \" Read more \" Surprisingly, this fit very well and is true to size . It looks adorable on and it’s a perfect length. \" Read more \" This item runs very small I wear a large and could not get it over my shoulders. \" Read more 14 customers mention durability, 2 positive, 12 negative 14 customers mention \"Durability\" 2 positive 12 negative Customers report durability issues with the dress, noting that it breaks right out of the bag and is flimsy, with one customer mentioning it only lasts about 2-3 washes. \" Thin and flimsy . The overall snaps didn’t even stay together and the whole thing lacked structure. It was horrible to adjust, too.... \" Read more \" I wore it one day and it tore . It came fine in the package, I always inspect but one day.... \" Read more \" ...all i had to do was lean over to zip up boots and the side seem ripped . It didn't even seem too tight.... \" Read more \" By the time I was able to wear it, I couldn't return it and it was damaged . The hooks where you clip were both broke. \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Super cute",
        "body": "Fits well. Nice quality. Cute. Wore with boots and got lots of compliments. Read more",
        "author": "Lydia Burke",
        "rating": 5.0,
        "date": "December 20, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Great find!",
        "body": "Surprisingly, this fit very well and is true to size. It looks adorable on and it’s a perfect length. Read more",
        "author": "whitney",
        "rating": 5.0,
        "date": "November 3, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Snug but beautiful!",
        "body": "Firts a little snug as there is no stretch to it. But its really nice and the perfect length! It is a little on the thin side. Read more",
        "author": "Anie N",
        "rating": 4.0,
        "date": "December 10, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "1.0 out of 5 stars Material isn’t too great. But it’s nice",
        "body": "I wore it one day and it tore. It came fine in the package, I always inspect but one day. It does feel like very idk not sturdy material but Sighh it is a pretty color Read more",
        "author": "Diana Lopez",
        "rating": 1.0,
        "date": "December 10, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71RBvtzdkRL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars So cute!",
        "body": "This dress is adorable and comfortable. I got so many compliments on Thanksgiving. I am almost 5’10” and it was the perfect length. Read more",
        "author": "Gabriele",
        "rating": 5.0,
        "date": "December 5, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71kbh4ktRuL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Fits perfectly",
        "body": "So cute for fall! The perfect color. Not very thick material. The adjustable straps are great for different heights. Read more",
        "author": "Tara Goldstein",
        "rating": 5.0,
        "date": "November 3, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Runs small",
        "body": "Super cute but material was a little cheap and runs small, I had to return. Was looking forward to this dress. Read more",
        "author": "Michelle Hernandez",
        "rating": 3.0,
        "date": "September 24, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "2.0 out of 5 stars Not a great fit",
        "body": "This is labeled as brown, the picture to me did look like it had a bit of gray as well, but it’s definitely just brown. Loose on the top and tight on the hips. Just not as cute at the picture unfortunately. Read more",
        "author": "Anne",
        "rating": 2.0,
        "date": "November 27, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Dress is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.",
  "about_this_item": "Womens Dress is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.",
  "long_description": "Womens Dress is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Brown, Olive Green, Dark Grey, Apricot, Grey Plaid, Black, Orange, Brown Plaid, Navy, Wine Red, Yellow, Red Plaid, Blue Plaid, Light Purple. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Dress is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Brown, Olive Green, Dark Grey, Apricot, Grey Plaid, Black, Orange, Brown Plaid, Navy, Wine Red, Yellow, Red Plaid, Blue Plaid, Light Purple. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "58886930-5830-40a1-a7de-f4fd83dd99a8",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/58886930-5830-40a1-a7de-f4fd83dd99a8/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/58886930-5830-40a1-a7de-f4fd83dd99a8/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "0e19707d-c28e-49ad-86e2-85f2adb75e78",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0e19707d-c28e-49ad-86e2-85f2adb75e78/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0e19707d-c28e-49ad-86e2-85f2adb75e78/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "bd6cb159-b24e-4521-b8c1-8c322657f444",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bd6cb159-b24e-4521-b8c1-8c322657f444/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bd6cb159-b24e-4521-b8c1-8c322657f444/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "022ce489-1a37-4067-b2fe-01fb3f9e55bd",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/022ce489-1a37-4067-b2fe-01fb3f9e55bd/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/022ce489-1a37-4067-b2fe-01fb3f9e55bd/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "1f7d3081-59cc-450a-b3d7-7e26c2244fbd",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1f7d3081-59cc-450a-b3d7-7e26c2244fbd/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1f7d3081-59cc-450a-b3d7-7e26c2244fbd/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "fd48d77d-c19c-4afe-9425-46c7c5d2f941",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/fd48d77d-c19c-4afe-9425-46c7c5d2f941/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/fd48d77d-c19c-4afe-9425-46c7c5d2f941/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "4a5595bf-37c4-457c-ab78-54c1f0da6a5d",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4a5595bf-37c4-457c-ab78-54c1f0da6a5d/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4a5595bf-37c4-457c-ab78-54c1f0da6a5d/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "48ae29d8-bef3-496a-8d34-cb6355bbf562",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/48ae29d8-bef3-496a-8d34-cb6355bbf562/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/48ae29d8-bef3-496a-8d34-cb6355bbf562/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "343ed746-4607-4c98-82b8-9866c693f36b",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/343ed746-4607-4c98-82b8-9866c693f36b/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/343ed746-4607-4c98-82b8-9866c693f36b/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "f621a549-e3d0-43dd-9814-019efbc336b3",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f621a549-e3d0-43dd-9814-019efbc336b3/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f621a549-e3d0-43dd-9814-019efbc336b3/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "f6043c82-df24-4527-9406-009dbcbbe5c3",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f6043c82-df24-4527-9406-009dbcbbe5c3/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f6043c82-df24-4527-9406-009dbcbbe5c3/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "61d7cb40-4eda-4d82-a418-85477d371959",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/61d7cb40-4eda-4d82-a418-85477d371959/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/61d7cb40-4eda-4d82-a418-85477d371959/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Brown": "https://m.media-amazon.com/images/I/312OtbDe02L._AC_SR38,50_.jpg",
    "Olive Green": "https://m.media-amazon.com/images/I/319Ok57yX8L._AC_SR38,50_.jpg",
    "Dark Grey": "https://m.media-amazon.com/images/I/31-qkSI3EmL._AC_SR38,50_.jpg",
    "Apricot": "https://m.media-amazon.com/images/I/41YaDg5emuL._AC_SR38,50_.jpg",
    "Grey Plaid": "https://m.media-amazon.com/images/I/412WOmw-T1L._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/414WTEbPVgL._AC_SR38,50_.jpg",
    "Orange": "https://m.media-amazon.com/images/I/416FtQWCB4L._AC_SR38,50_.jpg",
    "Brown Plaid": "https://m.media-amazon.com/images/I/41MH-xjS2qL._AC_SR38,50_.jpg",
    "Navy": "https://m.media-amazon.com/images/I/41gSqUkr6+L._AC_SR38,50_.jpg",
    "Wine Red": "https://m.media-amazon.com/images/I/41aJExva1sL._AC_SR38,50_.jpg",
    "Yellow": "https://m.media-amazon.com/images/I/31CSRz0XGuL._AC_SR38,50_.jpg",
    "Red Plaid": "https://m.media-amazon.com/images/I/4153wZHtVJL._AC_SR38,50_.jpg",
    "Blue Plaid": "https://m.media-amazon.com/images/I/41lm+lIOs5L._AC_SR38,50_.jpg",
    "Light Purple": "https://m.media-amazon.com/images/I/41f9X4aVUpL._AC_SR38,50_.jpg",
    "Grey": "https://m.media-amazon.com/images/I/41iOpxzrUGL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Brown": "61-mtKJsMIL",
    "Olive Green": "71SsHaCJRtL",
    "Dark Grey": "610jnhQDZ-L",
    "Apricot": "71Q3+vQ3uKL",
    "Grey Plaid": "81y5LHn6DEL",
    "Black": "71tJWe11OWL",
    "Orange": "71++5b6T-qL",
    "Brown Plaid": "71q0nSuPY-L",
    "Navy": "71fd1SFQ34L",
    "Wine Red": "71QaY2E0Y9L",
    "Yellow": "611F8r+70VL",
    "Red Plaid": "71OqAIOMUQL",
    "Blue Plaid": "61TSN3yeJkL",
    "Light Purple": "712VHQLsxiL",
    "Grey": "71xeF16JMYL"
  },
  "color_images": {
    "Brown": [
      "https://m.media-amazon.com/images/I/61-mtKJsMIL._SL1500_.jpg"
    ],
    "Olive Green": [
      "https://m.media-amazon.com/images/I/71SsHaCJRtL._SL1500_.jpg"
    ],
    "Dark Grey": [
      "https://m.media-amazon.com/images/I/610jnhQDZ-L._SL1500_.jpg"
    ],
    "Apricot": [
      "https://m.media-amazon.com/images/I/71Q3+vQ3uKL._SL1500_.jpg"
    ],
    "Grey Plaid": [
      "https://m.media-amazon.com/images/I/81y5LHn6DEL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/71tJWe11OWL._SL1500_.jpg"
    ],
    "Orange": [
      "https://m.media-amazon.com/images/I/71++5b6T-qL._SL1500_.jpg"
    ],
    "Brown Plaid": [
      "https://m.media-amazon.com/images/I/71q0nSuPY-L._SL1500_.jpg"
    ],
    "Navy": [
      "https://m.media-amazon.com/images/I/71fd1SFQ34L._SL1500_.jpg"
    ],
    "Wine Red": [
      "https://m.media-amazon.com/images/I/71QaY2E0Y9L._SL1500_.jpg"
    ],
    "Yellow": [
      "https://m.media-amazon.com/images/I/611F8r+70VL._SL1500_.jpg"
    ],
    "Red Plaid": [
      "https://m.media-amazon.com/images/I/71OqAIOMUQL._SL1500_.jpg"
    ],
    "Blue Plaid": [
      "https://m.media-amazon.com/images/I/61TSN3yeJkL._SL1500_.jpg"
    ],
    "Light Purple": [
      "https://m.media-amazon.com/images/I/712VHQLsxiL._SL1500_.jpg"
    ],
    "Grey": [
      "https://m.media-amazon.com/images/I/71xeF16JMYL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-sleeveless-maxi",
      "title": "Womens Maxi Dress Sleeveless Maxi",
      "price": 48.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71qwUjryGiL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 43.69,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61-pFN+nfgL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-bodycon",
      "title": "Womens Maxi Dress Maxi Bodycon",
      "price": 36.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61o6MKJoZLL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-one-shoulder-formal-mermaid-bodycon-evening-maxi",
      "title": "Womens Maxi Dress One Shoulder Formal Mermaid Bodycon Evening Maxi",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71mgUBuGwhL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-v-neck-short-sleeve",
      "title": "Womens Dress V Neck Short Sleeve",
      "price": 34.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71T+iJeFITL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress-cocktail-ruched-evening-split",
      "title": "Womens Dress Cocktail Ruched Evening Split",
      "price": 29.69,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/61003bnFhAS._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-maxi",
      "title": "Womens Maxi Dress Formal Maxi",
      "price": 64.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/61RWPo72AmL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-mermaid-one-shoulder",
      "title": "Womens Maxi Dress Mermaid One Shoulder",
      "price": 238.74,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51lR3NNtXCL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-maxi-formal-long-sleeve-v-neck",
      "title": "Womens Maxi Dress Cocktail Maxi Formal Long Sleeve V Neck",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61cfJoIR5bL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-bodycon-ruched",
      "title": "Womens Maxi Dress Cocktail Bodycon Ruched",
      "price": 49.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51+rVhgLHSL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-formal",
      "title": "Womens Dress Formal",
      "price": 75.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51TVxkZ3J2L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening",
      "title": "Womens Maxi Dress Formal Evening",
      "price": 64.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/516ScMrYzlL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-ruched-bodycon-v-neck",
      "title": "Womens Maxi Dress Long Sleeve Ruched Bodycon V Neck",
      "price": 33.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51AvldIvTmL._SL1500_.jpg"
      ]
    }
  ]
}