{
  "id": "womens-maxi-dress-ruched-maxi-split-bodycon-high-split",
  "handle": "womens-maxi-dress-ruched-maxi-split-bodycon-high-split",
  "sku": "JC1959",
  "asin": "B0DL5D2D9K",
  "title": "Womens Maxi Dress Ruched Maxi Split Bodycon High Split",
  "title_original": "Memoriesea Women's Sexy Tube Bodycon Ruched Strapless High Split Party Maxi Dresses",
  "brand": "Visit the Memoriesea Store",
  "price": 21.99,
  "social_proof": {
    "bought_past_month": 88,
    "text": "88+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/61ygQxbpMiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ZUzCPYpfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81eFiCDcHFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81pVsH97tSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/610olHmiJUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61JVvt5SvjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/619kRmxzslL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61zBeC9lfBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/8105BAZaRkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81Yy5UfC7qL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81hl-pTa0CL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61slJrJI9FL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/610hBgll4+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61G3f+x1jZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/612uH0HNdUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81dtAFjS1pL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81DUTg9-iGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81ZMtRJgL9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61esrUYdX6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61U9hJ3dm5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61GaMr3wP8L._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/61ygQxbpMiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ZUzCPYpfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81eFiCDcHFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81pVsH97tSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/610olHmiJUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61JVvt5SvjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/619kRmxzslL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61zBeC9lfBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/8105BAZaRkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81Yy5UfC7qL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81hl-pTa0CL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61slJrJI9FL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/610hBgll4+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61G3f+x1jZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/612uH0HNdUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81dtAFjS1pL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81DUTg9-iGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81ZMtRJgL9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61esrUYdX6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61U9hJ3dm5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61GaMr3wP8L._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Product Dimensions ‏": "‎ 6.3 x 4.72 x 0.39 inches; 10.58 ounces",
    "Item model number ‏": "‎ ME084",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ October 28, 2024",
    "ASIN ‏": "‎ B0DL5D9BZQ",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#76,632 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #287 in Women's Formal Dresses #430 in Women's Club & Night Out Dresses",
    "Customer Reviews": "4.3 4.3 out of 5 stars (84)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Wine Red",
      "Black",
      "Green"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.3,
    "count": 84,
    "customers_say": "Customers find the dress gorgeous, comfortable, and appreciate its soft, stretchy fabric. They like its fit, with one customer noting it pulls easily over the body, and they praise its great quality. The dress has a shimmer sheerness appearance that customers like, though some mention it's super see-through. Generated from the text of customer reviews Select to learn more Beauty (15) Fit (11) Dress quality (9) Stretchiness (8) Sparkle (7) Comfort (5) Soft fabric (5) Sheerness (7) 15 customers mention beauty, 15 positive, 0 negative 15 customers mention \"Beauty\" 15 positive 0 negative Customers find the dress gorgeous, with one mentioning its strapless look. \" It is a beautiful dress \" Read more \" 5’1” 105 lbs, XS fit perfect. Absolutely gorgeous . 5 stars! This dress is perfect for summer evenings.... \" Read more \" The dress is stunning it fits perfectly, great quality for the price. Really like the shimmer sheerness appearance, it flows beautifully. \" Read more \" The dress was really cute overall it just ran a bit big \" Read more 11 customers mention fit, 11 positive, 0 negative 11 customers mention \"Fit\" 11 positive 0 negative Customers are satisfied with how the dress fits, with one mentioning that it just pulls over the body, while another notes it's not too loose. \" The dress is stunning it fits perfectly , great quality for the price. Really like the shimmer sheerness appearance, it flows beautifully. \" Read more \" Dress is really stretchy. Dress wasn’t too long which was great for me, since I’m short. Loved the color.... \" Read more \" 5’1” 105 lbs, XS fit perfect . Absolutely gorgeous. 5 stars! This dress is perfect for summer evenings.... \" Read more \" ...The fit is very comfortable , if you want a more snug fit then size down because the dress has a lot of stretch to it.... \" Read more 9 customers mention dress quality, 8 positive, 1 negative 9 customers mention \"Dress quality\" 8 positive 1 negative Customers find the dress to be of great quality. \" It’s a great dress ! \" Read more \" beautiful style dress . perfet fitting . dress quality is fantastic , \" Read more \" ...Overall it’s great quality and it’s exactly what I need for my event! \" Read more \" Very well made . The sheer material is so soft. Fabric is light weight. Fits perfectly. They style is absolutely amazing.... \" Read more 8 customers mention stretchiness, 8 positive, 0 negative 8 customers mention \"Stretchiness\" 8 positive 0 negative Customers like the dress's stretchiness. \" ...material is on the thin side but still super cute and stretchy and the glitter on dress doesn't get all over you, which was 1 of my concerns.... \" Read more \" Dress is really stretchy . Dress wasn’t too long which was great for me, since I’m short. Loved the color.... \" Read more \" ...if you want a more snug fit then size down because the dress has a lot of stretch to it .... \" Read more \" ...5 stars! This dress is perfect for summer evenings. The fabric is stretchy and lightweight, but not sheer enough to see through.... \" Read more 7 customers mention sparkle, 6 positive, 1 negative 7 customers mention \"Sparkle\" 6 positive 1 negative Customers like the dress's shimmer sheerness appearance, with one mentioning its glittery finish and another appreciating its color. \" ...Dress wasn’t too long which was great for me, since I’m short. Loved the color .... \" Read more \" ...The material wasn’t what I was expecting from the picture but it is very glittery .... \" Read more \" ...The color and shininess of the dress was amazing but it was kind of itchy and the dress was not the smoothest material.... \" Read more \" ...i love the strapless look and it really is sparkly like the photos . the leg slit is flattering.... \" Read more 5 customers mention comfort, 5 positive, 0 negative 5 customers mention \"Comfort\" 5 positive 0 negative Customers find the dress comfortable. \" ...I was pleasantly surprised by the fit and shape. It’s very comfortable with no gapping anywhere.... \" Read more \" So comfy !!! The material is stretchy and hugs every curve right!! Best $20 I've spent for a Halloween costume (S) 5'2, 100 lbs. \" Read more \" Super comfy and easy to wear. \" Read more \" Sparkly, Stretchy and comfortable ... \" Read more 5 customers mention soft fabric, 4 positive, 1 negative 5 customers mention \"Soft fabric\" 4 positive 1 negative Customers like the soft fabric of the dress. \" This dress is absolutely gorgeous! The fabric is soft and stretchy, hugging my curves perfectly.... \" Read more \" Stretch fit. Very soft and non itchy or scratchy material. I am in love and this is literally just a costume piece for me.... \" Read more \" ...The outside is a little rough due to the glitter but the inside is softer or rather smoother!... \" Read more \" ...the dress was amazing but it was kind of itchy and the dress was not the smoothest material . The fit I would say is true to size! \" Read more 7 customers mention sheerness, 3 positive, 4 negative 7 customers mention \"Sheerness\" 3 positive 4 negative Customers have mixed opinions about the dress's sheerness, with some finding it super see-through while another customer notes it's not sheer enough to see through. \" ...Fits perfectly. They style is absolutely amazing. The dress is not see through but it is breathable material. \" Read more \" ...Loved the color. Wish the material was a little thicker but was not see through so that’s good.... \" Read more \" This dress was underwhelming. The material is very thin and it is super see through .... \" Read more \" ...The fabric is stretchy and lightweight, but not sheer enough to see through .... \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Great New Year’s Eve dress!",
        "body": "The dress is stunning it fits perfectly, great quality for the price. Really like the shimmer sheerness appearance, it flows beautifully. Read more",
        "author": "nothinglikesweet_t",
        "rating": 5.0,
        "date": "December 3, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61hlrxfLjAL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Affordable dress that looks like a million bucks",
        "body": "5’1” 105 lbs, XS fit perfect. Absolutely gorgeous. 5 stars! This dress is perfect for summer evenings. The fabric is stretchy and lightweight, but not sheer enough to see through. I have a large bust and the top stayed in place without any fabric adhesive or constant fidgeting. Read more",
        "author": "Kaitlyn",
        "rating": 5.0,
        "date": "September 21, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/7140QlaStuL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Beautiful dress",
        "body": "Very well made. The sheer material is so soft. Fabric is light weight. Fits perfectly. They style is absolutely amazing. The dress is not see through but it is breathable material. Read more",
        "author": "CarrieZema",
        "rating": 5.0,
        "date": "September 30, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Amazing Dress!! <33",
        "body": "Helloo! I usually dont write reviews but this dress was amazing for the price!! The fabric is VERY stretchy which is good! The outside is a little rough due to the glitter but the inside is softer or rather smoother! I am 5'4\" and without heels the bottom of the dress touched the floor however not by very much! I will say about the dress btw it isn't like super sheer but I did notice if light was coming from like up under it (ex: light pointed at you whilst your legs are crossed) the material is pretty sheer so I would definitely be careful just incase what you wear but honestly this dress is such a steal! I am 5'4\" 190lbs My waist is about 36-37\" My bust is about 50\"? I believe? Last time I measured it was so we will go with that! Honestly though, you should have no problem! Also if your a bigger girlie the glitter and the slight rutches it has (or you can make them yourself) is forgiving!! It is a very stunning dress overall! Again, be careful though as the material isnt SUPER thick and is a little sheer, but I find that stretchy dresses tend to be like that sometimes Read more",
        "author": "Brooke Ward",
        "rating": 4.0,
        "date": "February 13, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61UULuNsEfL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71wzKzZ+C0L._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/61vrG3srGZL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71-LqWX-6ZL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71rgaeXoTDL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Simple beauty",
        "body": "I really don’t have a single complaint about this dress. It is on the thinner side and could possibly be a little see-through. The transparency is not bad though, if you are wearing undergarments you will be fine. The fit is very comfortable, if you want a more snug fit then size down because the dress has a lot of stretch to it. I am 5’5” 175-180lbs and a large would have been perfect but I purposely sized up because I was bloated. I am definitely getting the red one in large for my “feeling skinny” days lol. Read more",
        "author": "Shay F.",
        "rating": 5.0,
        "date": "January 28, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars everything",
        "body": "beautiful style dress . perfet fitting . dress quality is fantastic , Read more",
        "author": "Mayra",
        "rating": 5.0,
        "date": "October 21, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Great Dress",
        "body": "The dress was really cute overall it just ran a bit big Read more",
        "author": "dia",
        "rating": 3.0,
        "date": "November 21, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Sparkly, Stretchy and comfortable",
        "body": "I ordered this for my upcoming birthday and i love it. it’s true to size. for reference i am 5”4 130lbs and i got a small. it’s stretchy and just pulls over your body. i love the strapless look and it really is sparkly like the photos. the leg slit is flattering. it could be a little longer but i like that it doesn’t drag. hope this helps :) Read more",
        "author": "Bern",
        "rating": 5.0,
        "date": "January 22, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71is3udSj0L._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71gBloW8TwL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71t+a5somlL._SY88._SL1500_.jpg"
        ]
      }
    ]
  },
  "short_description": "Womens Maxi Dress Ruched Maxi Split Bodycon High Split is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.",
  "about_this_item": "Womens Maxi Dress Ruched Maxi Split Bodycon High Split is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.",
  "long_description": "Womens Maxi Dress Ruched Maxi Split Bodycon High Split is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Wine Red, Black, Green. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Ruched Maxi Split Bodycon High Split is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Wine Red, Black, Green. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "13e140fa-7c86-43d9-9da7-7eac530332a5",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/13e140fa-7c86-43d9-9da7-7eac530332a5/embedded.cc.default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/13e140fa-7c86-43d9-9da7-7eac530332a5/embedded.cc.default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "3071d915-acb3-446e-bebe-763e4a02aafd",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3071d915-acb3-446e-bebe-763e4a02aafd/embedded.cc.default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3071d915-acb3-446e-bebe-763e4a02aafd/embedded.cc.default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "298141c6-c582-4457-8036-1c06a2f06d54",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/298141c6-c582-4457-8036-1c06a2f06d54/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/298141c6-c582-4457-8036-1c06a2f06d54/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "b1fc1f29-1b3b-41e6-a88b-b8611386e89c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b1fc1f29-1b3b-41e6-a88b-b8611386e89c/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b1fc1f29-1b3b-41e6-a88b-b8611386e89c/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Wine Red": "https://m.media-amazon.com/images/I/41OWPj43k4L._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31ihcd9bP0L._AC_SR38,50_.jpg",
    "Green": "https://m.media-amazon.com/images/I/41VCV38ancL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Wine Red": "61zBeC9lfBL",
    "Black": "61ygQxbpMiL",
    "Green": "612uH0HNdUL"
  },
  "color_images": {
    "Wine Red": [
      "https://m.media-amazon.com/images/I/61zBeC9lfBL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/8105BAZaRkL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81Yy5UfC7qL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81hl-pTa0CL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61slJrJI9FL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/610hBgll4+L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61G3f+x1jZL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/61ygQxbpMiL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71ZUzCPYpfL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81eFiCDcHFL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81pVsH97tSL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/610olHmiJUL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61JVvt5SvjL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/619kRmxzslL._SL1500_.jpg"
    ],
    "Green": [
      "https://m.media-amazon.com/images/I/612uH0HNdUL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81dtAFjS1pL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81DUTg9-iGL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81ZMtRJgL9L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61esrUYdX6L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61U9hJ3dm5L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61GaMr3wP8L._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-long-sleeve-v-neck-bodycon",
      "title": "Womens Maxi Dress Long Sleeve V Neck Bodycon",
      "price": 47.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61QbwpUJEwL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-maxi-cocktail-mermaid-evening",
      "title": "Womens Maxi Dress Formal Maxi Cocktail Mermaid Evening",
      "price": 55.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51xwRNp-naL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-off-shoulder-evening",
      "title": "Womens Maxi Dress Formal Off Shoulder Evening",
      "price": 54.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61XzdxMMIDL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 24.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/81sqgjrGfHL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-ruched-bodycon-v-neck",
      "title": "Womens Maxi Dress Long Sleeve Ruched Bodycon V Neck",
      "price": 33.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51AvldIvTmL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress-formal",
      "title": "Womens Dress Formal",
      "price": 75.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71ufk9Qt0cL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-short-sleeve",
      "title": "Womens Maxi Dress Maxi Short Sleeve",
      "price": 36.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61J4Ur7wG9L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-sleeveless",
      "title": "Womens Dress Sleeveless",
      "price": 38.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/6154UwOhqOL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail-v-neck-bodycon",
      "title": "Womens Dress Cocktail V Neck Bodycon",
      "price": 19.95,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/611HBMEYCCL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-bodycon-sleeveless",
      "title": "Womens Dress Bodycon Sleeveless",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61FIJtXEdWL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-maxi-long-sleeve",
      "title": "Womens Maxi Dress Bodycon Maxi Long Sleeve",
      "price": 44.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51HPiBldymL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 36.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61zhcs54aWL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-ruched-bodycon",
      "title": "Womens Dress Ruched Bodycon",
      "price": 35.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Work",
      "images": [
        "https://m.media-amazon.com/images/I/51NELB6yskL._SL1500_.jpg"
      ]
    }
  ]
}