{
  "id": "womens-maxi-dress-v-neck-long-sleeve",
  "handle": "womens-maxi-dress-v-neck-long-sleeve",
  "sku": "JC1490",
  "asin": "B0DNFPPKRB",
  "title": "Womens Maxi Dress V Neck Long Sleeve",
  "title_original": "Ficerd Women's Knit Long Sleeve Sweater Dress Casual V Neck Tunic Dresses Fall Trendy Outfits",
  "brand": "Visit the Ficerd Store",
  "price": 39.99,
  "social_proof": {
    "bought_past_month": 935,
    "text": "935+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/81352cAhoXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81reY1GAvqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81dgZXYK-ML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/816HrhRTS4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81yeNwovVwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81x0Ed-Cb-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81xhFENj0ML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81G7P5zcSgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81i7RfQZh1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/718ieaSa8SL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81hm5ZRWa+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81hQ68LowwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/811VosWFioL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81iyOxdGOfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81-wS48LAOL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81D0sCn5LiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81jRM9agqBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81Cn1X5QRML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81fwYnaxIdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81hrC6f9UXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81GvYBFB+NL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81uL+udMbqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81lfoLqeeKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81GAAMZqq0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81Q+e7zEMoL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/814FPny7xkL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/81352cAhoXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81reY1GAvqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81dgZXYK-ML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/816HrhRTS4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81yeNwovVwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81x0Ed-Cb-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81xhFENj0ML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81G7P5zcSgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81i7RfQZh1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/718ieaSa8SL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81hm5ZRWa+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81hQ68LowwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/811VosWFioL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81iyOxdGOfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81-wS48LAOL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81D0sCn5LiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81jRM9agqBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81Cn1X5QRML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81fwYnaxIdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81hrC6f9UXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81GvYBFB+NL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81uL+udMbqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81lfoLqeeKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81GAAMZqq0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81Q+e7zEMoL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/814FPny7xkL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Package Dimensions ‏": "‎ 10.04 x 2.36 x 1.97 inches; 13.76 ounces",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ August 27, 2024",
    "Manufacturer ‏": "‎ Ficerd",
    "ASIN ‏": "‎ B0DFB9T18W",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#11,372 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #84 in Women's Casual Dresses",
    "Customer Reviews": "4.0 4.0 out of 5 stars (341)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Light Brown",
      "Blue",
      "Pumpkin",
      "Olive Green",
      "Dirty Pink",
      "Coffee",
      "Dark Gray",
      "Gray Blue",
      "Dark Brown",
      "Dark Green",
      "Red",
      "Rose Red",
      "Wine Red",
      "Mustard Green",
      "Purple",
      "Dark Blue",
      "Light Gray",
      "Light Purple",
      "Rose Pink",
      "Caramel",
      "Green",
      "Light Khaki"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.0,
    "count": 341,
    "customers_say": "Customers love the sweater dress's style, particularly noting the cute puffy sleeves and flattering fit and flare shape. The dress is soft, comfortable, and warm, with a perfect length that reaches the knee, and one customer mentions it's not too clingy or tight. The material thickness receives mixed feedback, with several customers finding it too thin, and opinions about the color are divided between those who love it and those who find it off. Select to learn more Style Fit Softness Comfort Length Warmth Color Material thickness 50 customers mention \"Style\" 45 positive 5 negative Customers appreciate the dress's style, noting its beautiful appearance and cute puffy sleeves, with one customer mentioning it's nice enough for church. \"This dress is cute , but it’s got some flaws. Color is off…I thought this was going to be a coral. It’s more of an orange. Fabric is soft, very thin....\" Read more \"...The material is light and breathable. Overall its a nice dress .\" Read more \" Love this dress ! Slimming, soft and pretty colors available. Perfect length. I will be wearing this for family photo session.\" Read more \"This is a very comfortable and pretty dress - and very flattering. I wear it with knee high boots - very stylish and it keeps me warm.\" Read more 41 customers mention \"Fit\" 33 positive 8 negative Customers like how the dress fits, particularly noting its flattering flared shape, with one customer mentioning it's not too clingy or tight. \"...Normally fit medium. I ordered medium and it was a perfect fit . I am in love with this dress!...\" Read more \" Great fit . Looks great\" Read more \"The dress itself is super soft and comfy warm. It fits true to size , just a bit on the short side. The color was beautiful....\" Read more \"Perfect for winter or summer. I got a medium. 5'5\" 168#. Fits perfect . I bought in multiple colors.\" Read more 32 customers mention \"Softness\" 32 positive 0 negative Customers find the dress super soft. \"Love this dress! Slimming, soft and pretty colors available. Perfect length. I will be wearing this for family photo session.\" Read more \"I really wanted to love this dress; it was the right length, so soft , cute style. But it was so see-through, I had to return it. Keep shopping!\" Read more \"I LOVE this dress! It is super soft and comfortable! I get a lot of compliments when I wear it. Love pairing it with me boots! Feel gorgeous in it!\" Read more \"Good quality and very soft . The fit was smaller than expected so if you purchase you may want to size up depending on how you like the fit....\" Read more 26 customers mention \"Comfort\" 26 positive 0 negative Customers find the dress comfortable, with one mentioning it's not itchy. \"...The small is a perfect top of the knee length dress. Soft, comfy and hangs nicely on the body. Slightly thin fabric, don't mind wearing a slip....\" Read more \"I LOVE this dress! It is super soft and comfortable ! I get a lot of compliments when I wear it. Love pairing it with me boots! Feel gorgeous in it!\" Read more \" Very comfortable . I love the light weight fabric.\" Read more \"I really like the look of this dress and it is warm and so comfortable !...\" Read more 20 customers mention \"Length\" 16 positive 4 negative Customers like the dress's length, with several noting it's knee-length, and one mentioning it's longer than expected. \"Love this dress! Slimming, soft and pretty colors available. Perfect length . I will be wearing this for family photo session.\" Read more \"I like the shape and length of the dress , but the material is too thin to be called a sweater dress\" Read more \"...Fits perfect. Knee length . Not too clingy so safe from a reveal of muffin top or back fat.\" Read more \" Sleeves are too long and loose. Kinda sloppy looking dress. Would only wear at home to lounge.\" Read more 17 customers mention \"Warmth\" 15 positive 2 negative Customers find the dress warm and comfortable. \"Super flattering. Dress is a great length, warm , comfortable and fits closely to the body without being too tight. V neck is modest....\" Read more \"...I wear it with knee high boots - very stylish and it keeps me warm .\" Read more \"I love the dress. Beautiful dress and so warm and comfortable. I’m 5’2” and weight 118. It’s true to size.\" Read more \"...The color is true to the website photo, it’s a thin fabric so it’s not too hot . I wear with leggings and knee high boots to work and it’s great!\" Read more 20 customers mention \"Color\" 13 positive 7 negative Customers have mixed opinions about the dress's color, with some loving it while others find it off. \"...But this dress just did not do it for me. I did love the color , how light weighted and soft it was tho!\" Read more \"Loved the dress itself. The color was different from picture and I didn’t like it....\" Read more \"This was very soft and a beautiful color . Length perfect for knee high boots. It fit but I thought it flowed away from the body more....\" Read more \"...It fits true to size, just a bit on the short side. The color was beautiful . What was really annoying though is the shoulder seams....\" Read more 29 customers mention \"Material thickness\" 8 positive 21 negative Customers find the material of the dress too thin. \"Meh, thin material , not all that flattering.\" Read more \" Material too thin \" Read more \"Very soft. Thin so you don't get hot but can have a sweater look. Sleeves are dressy and length is perfect for leggings.\" Read more \"Color was not as advertised. Material is too thin for a fall or winter and is see through. I tried a slip and it showed through too much....\" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Nicely made. Fit a petite!",
        "body": "Super comfortable! Fit like a petite-size (on me) -Sleeve length was surprisingly perfect. Quality was good. Wish the colors were a better variety, but this worked well. Read more",
        "author": "Lynn",
        "rating": 5.0,
        "date": "December 17, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Comfortable dress",
        "body": "I love this dress, it’s a thinner material than I expected but it’s soft and warm. I would buy it again in another color. I normally wear an XS but that size was not available. The small fits me just fine, the length is perfect. 5’3” 110lbs. Read more",
        "author": "BAB",
        "rating": 5.0,
        "date": "November 20, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Good quality but size up",
        "body": "Good quality and very soft. The fit was smaller than expected so if you purchase you may want to size up depending on how you like the fit. The material is light and breathable. Overall its a nice dress. Read more",
        "author": "Jacqueline Miller",
        "rating": 4.0,
        "date": "October 15, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Nice Dress!",
        "body": "I LOVE this dress! It is super soft and comfortable! I get a lot of compliments when I wear it. Love pairing it with me boots! Feel gorgeous in it! Read more",
        "author": "Buehls",
        "rating": 5.0,
        "date": "December 6, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Great color (mint green)",
        "body": "I love the color and fit. Cute and flattering with leggings. The fabric won’t last if treated like typical laundry but it looks nice for the first few wearings! Read more",
        "author": "K Adams",
        "rating": 3.0,
        "date": "August 23, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "1.0 out of 5 stars Save yourself the return",
        "body": "I really wanted to love this dress; it was the right length, so soft, cute style. But it was so see-through, I had to return it. Keep shopping! Read more",
        "author": "Catherine Lazzaro",
        "rating": 1.0,
        "date": "December 9, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Flattering",
        "body": "Super flattering. Dress is a great length, warm, comfortable and fits closely to the body without being too tight. V neck is modest. Appropriate for work or social events. Receive compliments every time I wear it. Read more",
        "author": "Cass",
        "rating": 5.0,
        "date": "November 28, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Warm and comfy",
        "body": "This has become one of my wife's favorite. It is both soft and comfortable and it launders well, although I usually dry flat. The dress fits her well and the size fit as expected. It also helps to keep her warm. Read more",
        "author": "Customer",
        "rating": 5.0,
        "date": "December 4, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress V Neck Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.",
  "about_this_item": "Womens Maxi Dress V Neck Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.",
  "long_description": "Womens Maxi Dress V Neck Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Light Brown, Blue, Pumpkin, Olive Green, Dirty Pink, Coffee, Dark Gray, Gray Blue, Dark Brown, Dark Green, Red, Rose Red, Wine Red, Mustard Green. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress V Neck Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Light Brown, Blue, Pumpkin, Olive Green, Dirty Pink, Coffee, Dark Gray, Gray Blue, Dark Brown, Dark Green, Red, Rose Red, Wine Red, Mustard Green. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "4f519947-a778-4fb2-b0fc-4aac6aee44df",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4f519947-a778-4fb2-b0fc-4aac6aee44df/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4f519947-a778-4fb2-b0fc-4aac6aee44df/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "32bca3b6-33c8-43d0-b908-3f1b822db8e8",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/32bca3b6-33c8-43d0-b908-3f1b822db8e8/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/32bca3b6-33c8-43d0-b908-3f1b822db8e8/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "722d7c83-26c1-4625-8aa2-4f5311ef8749",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/722d7c83-26c1-4625-8aa2-4f5311ef8749/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/722d7c83-26c1-4625-8aa2-4f5311ef8749/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "b1f49b8d-a360-439a-8667-b957cbfb9a3c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b1f49b8d-a360-439a-8667-b957cbfb9a3c/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b1f49b8d-a360-439a-8667-b957cbfb9a3c/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "4651a72f-f37a-4123-9fe7-1af537ade532",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4651a72f-f37a-4123-9fe7-1af537ade532/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4651a72f-f37a-4123-9fe7-1af537ade532/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "697e0992-9ca8-4dc0-9246-8c5fe6da5bd9",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/697e0992-9ca8-4dc0-9246-8c5fe6da5bd9/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/697e0992-9ca8-4dc0-9246-8c5fe6da5bd9/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "87bee1d0-1f04-4018-85a2-a527c4d57665",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/87bee1d0-1f04-4018-85a2-a527c4d57665/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/87bee1d0-1f04-4018-85a2-a527c4d57665/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "72ed11a8-136f-48f2-9e81-2e28f0858481",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/72ed11a8-136f-48f2-9e81-2e28f0858481/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/72ed11a8-136f-48f2-9e81-2e28f0858481/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "835decc5-41ce-43e8-97eb-a54b15a8ea2e",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/835decc5-41ce-43e8-97eb-a54b15a8ea2e/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/835decc5-41ce-43e8-97eb-a54b15a8ea2e/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "447b6c26-5be7-40d1-a3ce-5d5d2e44eb5f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/447b6c26-5be7-40d1-a3ce-5d5d2e44eb5f/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/447b6c26-5be7-40d1-a3ce-5d5d2e44eb5f/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "2da040d4-b590-4334-b6e4-0120875bc624",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2da040d4-b590-4334-b6e4-0120875bc624/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2da040d4-b590-4334-b6e4-0120875bc624/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Light Brown": "https://m.media-amazon.com/images/I/41Iu1zl74-L._AC_SR38,50_.jpg",
    "Blue": "https://m.media-amazon.com/images/I/41FLWBVH9FL._AC_SR38,50_.jpg",
    "Pumpkin": "https://m.media-amazon.com/images/I/41fZlMCSQsL._AC_SR38,50_.jpg",
    "Olive Green": "https://m.media-amazon.com/images/I/41T+hWORe+L._AC_SR38,50_.jpg",
    "Dirty Pink": "https://m.media-amazon.com/images/I/314Wy1PmI8L._AC_SR38,50_.jpg",
    "Coffee": "https://m.media-amazon.com/images/I/41zJoK5UlpL._AC_SR38,50_.jpg",
    "Dark Gray": "https://m.media-amazon.com/images/I/41OEljVjFOL._AC_SR38,50_.jpg",
    "Gray Blue": "https://m.media-amazon.com/images/I/41ng9YC+rdL._AC_SR38,50_.jpg",
    "Dark Brown": "https://m.media-amazon.com/images/I/41OjXmafIGL._AC_SR38,50_.jpg",
    "Dark Green": "https://m.media-amazon.com/images/I/419kliCnjbL._AC_SR38,50_.jpg",
    "Red": "https://m.media-amazon.com/images/I/41oe5Q+bNQL._AC_SR38,50_.jpg",
    "Rose Red": "https://m.media-amazon.com/images/I/41ccvNWmyVL._AC_SR38,50_.jpg",
    "Wine Red": "https://m.media-amazon.com/images/I/41v9Qg6ypSL._AC_SR38,50_.jpg",
    "Mustard Green": "https://m.media-amazon.com/images/I/41WHgbIDm2L._AC_SR38,50_.jpg",
    "Purple": "https://m.media-amazon.com/images/I/41cUFND8m1L._AC_SR38,50_.jpg",
    "Dark Blue": "https://m.media-amazon.com/images/I/41pptZ7E3gL._AC_SR38,50_.jpg",
    "Light Gray": "https://m.media-amazon.com/images/I/41zxpcX0OQL._AC_SR38,50_.jpg",
    "Light Purple": "https://m.media-amazon.com/images/I/41Mj1maGOEL._AC_SR38,50_.jpg",
    "Rose Pink": "https://m.media-amazon.com/images/I/41IMsF0sH6L._AC_SR38,50_.jpg",
    "Caramel": "https://m.media-amazon.com/images/I/41eSrT+bVQL._AC_SR38,50_.jpg",
    "Green": "https://m.media-amazon.com/images/I/41N7brZxSkL._AC_SR38,50_.jpg",
    "Light Khaki": "https://m.media-amazon.com/images/I/417J4d6VxxL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Light Brown": "81x0Ed-Cb-L",
    "Blue": "81xhFENj0ML",
    "Pumpkin": "81G7P5zcSgL",
    "Olive Green": "81i7RfQZh1L",
    "Dirty Pink": "718ieaSa8SL",
    "Coffee": "81hm5ZRWa+L",
    "Dark Gray": "81hQ68LowwL",
    "Gray Blue": "811VosWFioL",
    "Dark Brown": "81iyOxdGOfL",
    "Dark Green": "81-wS48LAOL",
    "Red": "81D0sCn5LiL",
    "Rose Red": "81jRM9agqBL",
    "Wine Red": "81352cAhoXL",
    "Mustard Green": "81Cn1X5QRML",
    "Purple": "81fwYnaxIdL",
    "Dark Blue": "81hrC6f9UXL",
    "Light Gray": "81GvYBFB+NL",
    "Light Purple": "81uL+udMbqL",
    "Rose Pink": "81lfoLqeeKL",
    "Caramel": "81GAAMZqq0L",
    "Green": "81Q+e7zEMoL",
    "Light Khaki": "814FPny7xkL"
  },
  "color_images": {
    "Light Brown": [
      "https://m.media-amazon.com/images/I/81x0Ed-Cb-L._SL1500_.jpg"
    ],
    "Blue": [
      "https://m.media-amazon.com/images/I/81xhFENj0ML._SL1500_.jpg"
    ],
    "Pumpkin": [
      "https://m.media-amazon.com/images/I/81G7P5zcSgL._SL1500_.jpg"
    ],
    "Olive Green": [
      "https://m.media-amazon.com/images/I/81i7RfQZh1L._SL1500_.jpg"
    ],
    "Dirty Pink": [
      "https://m.media-amazon.com/images/I/718ieaSa8SL._SL1500_.jpg"
    ],
    "Coffee": [
      "https://m.media-amazon.com/images/I/81hm5ZRWa+L._SL1500_.jpg"
    ],
    "Dark Gray": [
      "https://m.media-amazon.com/images/I/81hQ68LowwL._SL1500_.jpg"
    ],
    "Gray Blue": [
      "https://m.media-amazon.com/images/I/811VosWFioL._SL1500_.jpg"
    ],
    "Dark Brown": [
      "https://m.media-amazon.com/images/I/81iyOxdGOfL._SL1500_.jpg"
    ],
    "Dark Green": [
      "https://m.media-amazon.com/images/I/81-wS48LAOL._SL1500_.jpg"
    ],
    "Red": [
      "https://m.media-amazon.com/images/I/81D0sCn5LiL._SL1500_.jpg"
    ],
    "Rose Red": [
      "https://m.media-amazon.com/images/I/81jRM9agqBL._SL1500_.jpg"
    ],
    "Wine Red": [
      "https://m.media-amazon.com/images/I/81352cAhoXL._SL1500_.jpg"
    ],
    "Mustard Green": [
      "https://m.media-amazon.com/images/I/81Cn1X5QRML._SL1500_.jpg"
    ],
    "Purple": [
      "https://m.media-amazon.com/images/I/81fwYnaxIdL._SL1500_.jpg"
    ],
    "Dark Blue": [
      "https://m.media-amazon.com/images/I/81hrC6f9UXL._SL1500_.jpg"
    ],
    "Light Gray": [
      "https://m.media-amazon.com/images/I/81GvYBFB+NL._SL1500_.jpg"
    ],
    "Light Purple": [
      "https://m.media-amazon.com/images/I/81uL+udMbqL._SL1500_.jpg"
    ],
    "Rose Pink": [
      "https://m.media-amazon.com/images/I/81lfoLqeeKL._SL1500_.jpg"
    ],
    "Caramel": [
      "https://m.media-amazon.com/images/I/81GAAMZqq0L._SL1500_.jpg"
    ],
    "Green": [
      "https://m.media-amazon.com/images/I/81Q+e7zEMoL._SL1500_.jpg"
    ],
    "Light Khaki": [
      "https://m.media-amazon.com/images/I/814FPny7xkL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress-v-neck-sleeveless",
      "title": "Womens Dress V Neck Sleeveless",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/81T7G18uRnL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-boat-neck-sleeveless",
      "title": "Womens Dress Boat Neck Sleeveless",
      "price": 19.79,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/518oJldZIfL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-formal",
      "title": "Womens Dress Formal",
      "price": 69.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51vneqmjy1L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-bodycon-sleeveless",
      "title": "Womens Dress Bodycon Sleeveless",
      "price": 40.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61nnB4TWroL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 324.43,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/41gTuGV5SBL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-formal-evening",
      "title": "Womens Maxi Dress Formal Evening",
      "price": 94.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61fzKHOQJGL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-ruched-v-neck-cocktail-maxi-formal",
      "title": "Womens Maxi Dress Ruched V Neck Cocktail Maxi Formal",
      "price": 129.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71i8AuwBqUL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-off-shoulder-maxi",
      "title": "Womens Maxi Dress Bodycon Off Shoulder Maxi",
      "price": 36.89,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61DDKd5ehZL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-v-neck-bodycon",
      "title": "Womens Maxi Dress Long Sleeve V Neck Bodycon",
      "price": 47.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61QbwpUJEwL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 76.9,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Wedding Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/514+blcsiGL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening",
      "title": "Womens Maxi Dress Formal Evening",
      "price": 77.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61Hj4-S+4eL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-cocktail-ruched",
      "title": "Womens Maxi Dress Bodycon Cocktail Ruched",
      "price": 37.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/91HL3aBO+gL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-v-neck-cocktail-evening-long-sleeve",
      "title": "Womens Maxi Dress V Neck Cocktail Evening Long Sleeve",
      "price": 64.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/71jdGTmoWkL._SL1500_.jpg"
      ]
    }
  ]
}