{
  "id": "womens-maxi-dress-long-sleeve-bodycon-formal-maxi",
  "handle": "womens-maxi-dress-long-sleeve-bodycon-formal-maxi",
  "sku": "JC3040",
  "asin": "B0DNF7YDWG",
  "title": "Womens Maxi Dress Long Sleeve Bodycon Formal Maxi",
  "title_original": "Women's Y2k Leopard Print Mesh Sheer Bodycon Maxi Dresses Cheetah Long Sleeve Elegant Formal Wedding Guest Dress",
  "brand": "Visit the BEAUDRM Store",
  "price": 39.99,
  "social_proof": {
    "bought_past_month": 64,
    "text": "64+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/71Pn-mKQ-yL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81Y1-tT37fL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81TfBgR685L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81VOb2bCdhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/810aZ-vgbmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71b35aQWVvL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ZoRhx9tqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71s1WoWXmSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/715t50zE2aL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Z+nKfr9DL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/71Pn-mKQ-yL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81Y1-tT37fL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81TfBgR685L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81VOb2bCdhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/810aZ-vgbmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71b35aQWVvL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ZoRhx9tqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71s1WoWXmSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/715t50zE2aL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Z+nKfr9DL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ November 18, 2024",
    "ASIN ‏": "‎ B0DNFCS597",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#55,318 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #538 in Women's Casual Dresses",
    "Customer Reviews": "4.6 4.6 out of 5 stars (89)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Brown",
      "Red Brown",
      "Multi Ginger",
      "Multicolor",
      "Grey"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.6,
    "count": 89,
    "customers_say": "Customers find the dress chic and flattering, with one noting that the leopard print isn't overwhelming. The dress fits well, with one customer mentioning it accommodates curves perfectly, and another noting it requires no tight undergarment. Customers appreciate its perfect length, comfort, stretchiness, and high-quality fabric, while also considering it good value for money. Generated from the text of customer reviews Select to learn more Style (24) Fit (16) Flattering (10) Length (10) Comfort (9) Stretchiness (6) Material quality (5) Value for money (5) 24 customers mention style, 24 positive, 0 negative 24 customers mention \"Style\" 24 positive 0 negative Customers love the dress's style, describing it as absolutely stunning with amazing quality, and one customer particularly appreciates the cheetah print design. \" Loved this dress !! So beautiful & elegant! \" Read more \" This dress looks s very chic and good quality. Not cheap looking. The only reason I gave it a 3 star is because it runs smaller than expected.... \" Read more \" ...The moment I put it on, I felt so elegant and confident. The fabric is high quality, soft, and flows beautifully.... \" Read more \" It's form fitting, very flattering and good quality . \" Read more 16 customers mention fit, 15 positive, 1 negative 16 customers mention \"Fit\" 15 positive 1 negative Customers are satisfied with how the dress fits, with one mentioning that no tight undergarment is needed. \" ...about this dress, but saw it on IG and just took a shot.. It fits like a glove and has a tightish lining.. Love it, length is perfect.. it is east... \" Read more \" The dress fits nice . I would order this again. Just go up a size if you’re plus size for the long length look. \" Read more \" ...I got so many compliments on it and how it fit my body . definitely a 10/10. \" Read more \" This gown is a “WOW” gown and amazing for the price! It fits true to size , so know your bust-waist-hip measurements and order accordingly.... \" Read more 10 customers mention flattering, 9 positive, 1 negative 10 customers mention \"Flattering\" 9 positive 1 negative Customers find the dress flattering, with one mentioning it provides a nice hug to the body. \" Very flattering , loved the material and fit,just a little ling for me,I'm 5'1 ,but I still loved it.Received alot of compliments.... \" Read more \" ...As a curvy petite women, 5'2 size 6, this dress hugged all the right places BUT could be warn without heels.... \" Read more \" So flattering . Fits like a glove and no tight undergarment needed! \" Read more \" ...The fit is perfect — flattering in all the right places without feeling too tight or too loose.... \" Read more 10 customers mention length, 7 positive, 3 negative 10 customers mention \"Length\" 7 positive 3 negative Customers are satisfied with the dress's length, finding it perfect and true to size. \" ...It fits great, it hugs your figure in the right places. Is true to size . Quality amazes me. \" Read more \" 5”0 perfect length with heels . Super classy and sexy at same time . Recieved so many compliments . \" Read more \" ...I’m 5’3 and the dress is long , but not too long. It’ll be fine with heels.... \" Read more \" THIS DRESS IS SO CUTE ON!! I SIZED UP but it has a lot of stretch to it, i'm giving it 4 stars only because i wish it was a tad longer, i'm 5'4 and... \" Read more 9 customers mention comfort, 9 positive, 0 negative 9 customers mention \"Comfort\" 9 positive 0 negative Customers find the dress comfortable. \" looked just like the picture on me ! fits me perfectly . comfortable & stretchy . lightweight dress feeling 100% recommend \" Read more \" ...The fabric was good and stretchy. Very comfortable dress . I love the cheetah print design. \" Read more \" Super comfortable and affordable \" Read more \" Comfy and nice hugs body! \" Read more 6 customers mention stretchiness, 5 positive, 1 negative 6 customers mention \"Stretchiness\" 5 positive 1 negative Customers like the dress's stretchiness. \" ...When I received the gown, it fit me the very same way. It is stretchy and easy to move in. The long sleeves are mesh, so it can be worn year round.... \" Read more \" ...in this dress and I maybe could’ve done a medium because it is super stretchy . I’m 5’3 and the dress is long, but not too long.... \" Read more \" ...I did my 40th birthday shoot in it. The fabric was good and stretchy . Very comfortable dress. I love the cheetah print design. \" Read more \" looked just like the picture on me ! fits me perfectly . comfortable & stretchy . lightweight dress feeling 100% recommend \" Read more 5 customers mention material quality, 4 positive, 1 negative 5 customers mention \"Material quality\" 4 positive 1 negative Customers appreciate the dress's fabric quality, with one mentioning that it is breathable. \" ...The material is breathable but also durable for the fall season. Perfect, to use as a base for the transition to winter.... \" Read more \" In love with this dress! I did my 40th birthday shoot in it. The fabric was good and stretchy. Very comfortable dress.... \" Read more \" ...The moment I put it on, I felt so elegant and confident. The fabric is high quality , soft, and flows beautifully.... \" Read more \" ...It’ll be fine with heels. The color is nice and the dress isn’t a super thick material , but it may still keep me warm due to the black underdress it... \" Read more 5 customers mention value for money, 5 positive, 0 negative 5 customers mention \"Value for money\" 5 positive 0 negative Customers find the dress offers great value for money. \" Super comfortable and affordable \" Read more \" This gown is a “WOW” gown and amazing for the price ! It fits true to size, so know your bust-waist-hip measurements and order accordingly.... \" Read more \" ...Most definitely worth buying . Gold accessories really set it off \" Read more \" Great Buy ... \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Good buy",
        "body": "Comfortable and feels great. I like that fit, I can breathe, move and still look classy Read more",
        "author": "pamgrace gachenge",
        "rating": 5.0,
        "date": "December 20, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars This is a “WOW” gown!",
        "body": "This gown is a “WOW” gown and amazing for the price! It fits true to size, so know your bust-waist-hip measurements and order accordingly. I am 5’8”, 159lbs, size 12 and I ordered an XL. It is lightweight, and body-hugging. It fits exactly like the photo of my selected Amazon model that best represents my figure. When I received the gown, it fit me the very same way. It is stretchy and easy to move in. The long sleeves are mesh, so it can be worn year round. I wore this gown to a July wedding and received many compliments. Not only on the fit and style, but how daring my choice was to wear a leopard- print gown to the wedding! I intend to wear it out to a romantic dinner, a black tie function, my fall cruise and wear it this Christmas when I host my yearly Holiday Dinner! It’s a festive gown! Also, it came folded up in an 10-inch by 10-inch package, which when opened and I removed the gown to try it on, you could not see a wrinkle. Great “go to” travel gown! This gown does it all! Read more",
        "author": "Curvy in LA",
        "rating": 5.0,
        "date": "July 20, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Great dress!",
        "body": "It’s stunning. It fits great, it hugs your figure in the right places. Is true to size. Quality amazes me. Read more",
        "author": "Lynoska",
        "rating": 5.0,
        "date": "October 13, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Leopard Print for the Win!",
        "body": "The dress exceeded my expectations! As a curvy petite women, 5'2 size 6, this dress hugged all the right places BUT could be warn without heels. I choose to purchase a size small, and was totally comfortable. The material is breathable but also durable for the fall season. Perfect, to use as a base for the transition to winter. The leopard print wasn't overwhelming, and received plenty of compliments. Read more",
        "author": "Leandra",
        "rating": 5.0,
        "date": "October 14, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Absolutely stunning dress",
        "body": "✨ Absolutely Stunning Dress! ✨ I couldn’t be happier with this dress! The moment I put it on, I felt so elegant and confident. The fabric is high quality, soft, and flows beautifully. The fit is perfect — flattering in all the right places without feeling too tight or too loose. I received so many compliments when I wore it! Whether you’re going to a special event, a dinner, or just want to feel gorgeous, this dress is a must-have. It’s truly a piece that makes you feel beautiful inside and out. Highly recommend Read more",
        "author": "ivanna",
        "rating": 5.0,
        "date": "June 23, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Length is too long for 5’3” lady",
        "body": "Beautiful dress & size is true to size. Sadly, the dress is too long for a 5’3” lady by about 6 inches too long. Read more",
        "author": "MJS",
        "rating": 5.0,
        "date": "November 5, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Very flattering",
        "body": "Very cute Read more",
        "author": "Raquel Ruiz",
        "rating": 5.0,
        "date": "December 19, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars great material and great dress!",
        "body": "THIS DRESS IS SO CUTE ON!! I SIZED UP but it has a lot of stretch to it, i'm giving it 4 stars only because i wish it was a tad longer, i'm 5'4 and it was hitting at my ankles. I got so many compliments on it and how it fit my body. definitely a 10/10. Read more",
        "author": "paige garner",
        "rating": 4.0,
        "date": "June 2, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Long Sleeve Bodycon Formal Maxi is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.",
  "about_this_item": "Womens Maxi Dress Long Sleeve Bodycon Formal Maxi is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.",
  "long_description": "Womens Maxi Dress Long Sleeve Bodycon Formal Maxi is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Brown, Red Brown, Multi Ginger, Multicolor, Grey. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Long Sleeve Bodycon Formal Maxi is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Brown, Red Brown, Multi Ginger, Multicolor, Grey. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "650b17e8-4a0d-4380-8e16-5d527c201e09",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/650b17e8-4a0d-4380-8e16-5d527c201e09/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/650b17e8-4a0d-4380-8e16-5d527c201e09/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/9da43145-69e9-470d-a5eb-3774185d315c.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "a6e875eb-1822-4fa2-993d-28edf87482ae",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a6e875eb-1822-4fa2-993d-28edf87482ae/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a6e875eb-1822-4fa2-993d-28edf87482ae/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/9da43145-69e9-470d-a5eb-3774185d315c.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "d552b2a8-ad83-4f89-a9b1-6ac7e3552379",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d552b2a8-ad83-4f89-a9b1-6ac7e3552379/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d552b2a8-ad83-4f89-a9b1-6ac7e3552379/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/9da43145-69e9-470d-a5eb-3774185d315c.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "1516f178-36d2-4a19-9985-63da2db756d2",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1516f178-36d2-4a19-9985-63da2db756d2/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1516f178-36d2-4a19-9985-63da2db756d2/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/9da43145-69e9-470d-a5eb-3774185d315c.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "c0017834-cb98-4104-8e03-dc3cd5414cd0",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c0017834-cb98-4104-8e03-dc3cd5414cd0/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c0017834-cb98-4104-8e03-dc3cd5414cd0/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/9da43145-69e9-470d-a5eb-3774185d315c.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "7eb27ef3-e7ea-4afc-b4f7-e6f3150fea0c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7eb27ef3-e7ea-4afc-b4f7-e6f3150fea0c/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7eb27ef3-e7ea-4afc-b4f7-e6f3150fea0c/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/9da43145-69e9-470d-a5eb-3774185d315c.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "b78aee6c-c658-4c82-85b3-867f81b9d3f7",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b78aee6c-c658-4c82-85b3-867f81b9d3f7/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b78aee6c-c658-4c82-85b3-867f81b9d3f7/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/9da43145-69e9-470d-a5eb-3774185d315c.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "cfd586c9-018f-43bd-9894-351c7d3e3a46",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/cfd586c9-018f-43bd-9894-351c7d3e3a46/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/cfd586c9-018f-43bd-9894-351c7d3e3a46/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/9da43145-69e9-470d-a5eb-3774185d315c.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "6516f317-414b-49d5-b245-5dcefccd1f4c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6516f317-414b-49d5-b245-5dcefccd1f4c/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6516f317-414b-49d5-b245-5dcefccd1f4c/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/9da43145-69e9-470d-a5eb-3774185d315c.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "6ce4c376-4c29-422a-ad4d-df5815a33881",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6ce4c376-4c29-422a-ad4d-df5815a33881/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6ce4c376-4c29-422a-ad4d-df5815a33881/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/9da43145-69e9-470d-a5eb-3774185d315c.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "e7b2bc1d-9959-4c80-961a-e6d5b7446fae",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e7b2bc1d-9959-4c80-961a-e6d5b7446fae/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e7b2bc1d-9959-4c80-961a-e6d5b7446fae/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/9da43145-69e9-470d-a5eb-3774185d315c.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "7f40d6d5-837b-43f7-a5b5-883ad665194c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7f40d6d5-837b-43f7-a5b5-883ad665194c/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7f40d6d5-837b-43f7-a5b5-883ad665194c/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/9da43145-69e9-470d-a5eb-3774185d315c.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Brown": "https://m.media-amazon.com/images/I/41eSIbh3IzL._AC_SR38,50_.jpg",
    "Red Brown": "https://m.media-amazon.com/images/I/41UwqeF+F5L._AC_SR38,50_.jpg",
    "Multi Ginger": "https://m.media-amazon.com/images/I/41d+BlD-A6L._AC_SR38,50_.jpg",
    "Multicolor": "https://m.media-amazon.com/images/I/41FRvoy76tL._AC_SR38,50_.jpg",
    "Grey": "https://m.media-amazon.com/images/I/41VoGLKInmL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Brown": "71Pn-mKQ-yL",
    "Red Brown": "71ZoRhx9tqL",
    "Multi Ginger": "71s1WoWXmSL",
    "Multicolor": "715t50zE2aL",
    "Grey": "71Z+nKfr9DL"
  },
  "color_images": {
    "Brown": [
      "https://m.media-amazon.com/images/I/71Pn-mKQ-yL._SL1500_.jpg"
    ],
    "Red Brown": [
      "https://m.media-amazon.com/images/I/71ZoRhx9tqL._SL1500_.jpg"
    ],
    "Multi Ginger": [
      "https://m.media-amazon.com/images/I/71s1WoWXmSL._SL1500_.jpg"
    ],
    "Multicolor": [
      "https://m.media-amazon.com/images/I/715t50zE2aL._SL1500_.jpg"
    ],
    "Grey": [
      "https://m.media-amazon.com/images/I/71Z+nKfr9DL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 694.95,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61X8XEqStvL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-maxi-v-neck",
      "title": "Womens Maxi Dress Long Sleeve Maxi V Neck",
      "price": 38.69,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61SBgdL7ppL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-v-neck-long-sleeve",
      "title": "Womens Maxi Dress V Neck Long Sleeve",
      "price": 19.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71p5Q07m9aL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-sleeveless-bodycon-maxi",
      "title": "Womens Maxi Dress Sleeveless Bodycon Maxi",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51b0UROkEPL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 109.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Wedding Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/514Egm6E2tL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-bodycon-long-sleeve-off-shoulder-ruched",
      "title": "Womens Maxi Dress Bodycon Long Sleeve Off Shoulder Ruched",
      "price": 35.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61stbY-feDL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-mermaid",
      "title": "Womens Maxi Dress Mermaid",
      "price": 169.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71XYPHhe+uL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 220.77,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/611xLID6gFL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 198.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61bUWCdsYeL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 54.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71ES22A0NiL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-maxi",
      "title": "Womens Maxi Dress Long Sleeve Maxi",
      "price": 16.13,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51AZFDpghJL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-formal",
      "title": "Womens Maxi Dress Evening Formal",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51LOMeoQOFL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61DfVWULliL._SL1500_.jpg"
      ]
    }
  ]
}