{
  "id": "womens-maxi-dress-formal-evening",
  "handle": "womens-maxi-dress-formal-evening",
  "sku": "JC2227",
  "asin": "B0DN6JLB22",
  "title": "Womens Maxi Dress Formal Evening",
  "title_original": "Pinup Fashion Plus Size Formal Dresses - Evening Gowns Wedding Sequin Embroidery V-Neck Prom Long Dress",
  "brand": "Visit the Pinup Fashion Store",
  "price": 79.99,
  "social_proof": {
    "bought_past_month": 382,
    "text": "382+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/71XX6oDQKnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81b2Cz2bybL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ofsry0CJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71jnElv5rSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/718AjS3NWdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71r-jeQD-3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71uThC4OEOL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/615ygJ2kLvL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71+fWauDqoL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61g-RNK8b9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71LxjiFjaWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71TSB+gkunL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/617fOC8GKgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71J+D67ADLL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/71XX6oDQKnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81b2Cz2bybL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ofsry0CJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71jnElv5rSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/718AjS3NWdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71r-jeQD-3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71uThC4OEOL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/615ygJ2kLvL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71+fWauDqoL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61g-RNK8b9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71LxjiFjaWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71TSB+gkunL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/617fOC8GKgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71J+D67ADLL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ October 9, 2024",
    "ASIN ‏": "‎ B0DJQVH3ZP",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#61,995 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #206 in Women's Formal Dresses",
    "Customer Reviews": "4.3 4.3 out of 5 stars (365)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Black-sequin",
      "Gold-regular",
      "Green-sequin",
      "White-sequin",
      "Navy-sequin",
      "Haze Blue-sequin",
      "Burgundy-sequin",
      "Gold-sequin",
      "Lavender-sequin"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.3,
    "count": 365,
    "customers_say": "Customers find the dress elegant, well-made, and comfortable, with one noting the tulle material doesn't scratch or itch. The dress is flattering, particularly for fuller figures, and customers consider it good value for money. While some it's true to size, others report it's not true to size, and opinions about the length are mixed, with some finding it good while others say it's too short. Generated from the text of customer reviews Select to learn more Elegance (89) Fit (59) Quality (45) Comfort (39) Flattering (13) Value for money (13) Size (28) Length (17) 89 customers mention elegance, 87 positive, 2 negative 89 customers mention \"Elegance\" 87 positive 2 negative Customers find the dress elegant and gorgeous, particularly appreciating its color, with one customer specifically mentioning its formal black design with sparkles. \" Beautiful dress . I am always afraid to buy some things on Amazon. However, this was a great purchase. Fit was purfect, and it made me look amazing.... \" Read more \" What a beautiful , original dress! I did size down as the dress seems to run big. I am 5'3\" and I will probably wear a shoe with a clunky heel.... \" Read more \" Dress looks just like what is shown it's very pretty and long the tulle is beautiful..the only issues I have with it are the zipper seemed to stick... \" Read more \" Gorgeous dress ! I bought it for my daughters elopement. It is slightly larger and I wish it was a bit tighter but looks beautiful.... \" Read more 59 customers mention fit, 48 positive, 11 negative 59 customers mention \"Fit\" 48 positive 11 negative Customers are satisfied with how the dress fits. \" Great quality and fits true to size . I got alot of compliments! Perfect for a formal wedding I attended \" Read more \" I love this dress! It fits well and makes me feel beautiful in it. I received several compliments, from complete strangers while on our last cruise.... \" Read more \" ...It was very comfortable and fit perfectly . I typically wear a size 18 dress and bought size XXL. \" Read more \" Beautiful dress, length was good, not to the floor. Fit was good , elastic waist. Back beautiful. Returned for a different color.... \" Read more 45 customers mention quality, 40 positive, 5 negative 45 customers mention \"Quality\" 40 positive 5 negative Customers find the dress well-made, with one mentioning it's perfect for summer weddings. \" Bought for my mom to wear to her birthday 'ball'. Good quality , fit her perfectly and she loved it! \" Read more \" This dress is GORGEOUS! Well made , classy, looks much more expensive than price paid. \" Read more \" Great quality and beautiful dress \" Read more \" ...Very beautiful. Very comfortable. Very well made . Dress fit perfectly in all areas. \" Read more 39 customers mention comfort, 30 positive, 9 negative 39 customers mention \"Comfort\" 30 positive 9 negative Customers find the dress comfortable. \" Turned out to be a nice quality dress for a gala. It was comfortable and the sizing guide was accurate based on my measurements.... \" Read more \" ...This dress is gorgeous! When I tried it on it was very comfortable , unfortunately it was a size too big and I did not have time to order another one.... \" Read more \" Loved this dress on me so comfortable . I ordered 1 size down and glad I did as it fit me perfectly. \" Read more \" ...But the sequin embroidery on it was just too uncomfortable and scratchy . *sob* \" Read more 13 customers mention flattering, 13 positive, 0 negative 13 customers mention \"Flattering\" 13 positive 0 negative Customers find the dress flattering, with one mentioning it enhances their figure and another noting it makes them appear slimmer. \" ...And I love it! It's true to size, and very flattering on this plus size body. Only issue, is that its itchy in the bust area.... \" Read more \" ...it is beautiful, flattering , comfortable and prettier in person than it’s pictures.... \" Read more \" ...The A-line of the dress was super flattering on me as well. I also loved the design and details. \" Read more \" I am a plus size lady. This was very flattering to my figure . \" Read more 13 customers mention value for money, 12 positive, 1 negative 13 customers mention \"Value for money\" 12 positive 1 negative Customers find the dress offers good value for money. \" Even more beautiful than pictured! Great value ! \" Read more \" Fits perfectly, very pretty. Excited for an occasion to wear it. Good value . \" Read more \" ...Returned for a different color. This blue is a dusty pale blue. Great for price ! Flows elegantly \" Read more \" ...It was flowing and fun, but not too revealing. A great value for a gown - wore to a black tie gala. \" Read more 28 customers mention size, 16 positive, 12 negative 28 customers mention \"Size\" 16 positive 12 negative Customers have mixed experiences with the dress's sizing, with some finding it true to size while others report it runs too big. \" ...The sheer cap sleeves were a nice detail. True to size . Received so many compliments throughout the night! Would highly recommend. \" Read more \" Not true to size , 16W. Fabric scratchy. Returned \" Read more \" ...I can’t count the compliments I’ve received. It runs true to size for me. I ordered up and it was a little big but comfortable.... \" Read more \" What a beautiful, original dress! I did size down as the dress seems to run big . I am 5'3\" and I will probably wear a shoe with a clunky heel.... \" Read more 17 customers mention length, 11 positive, 6 negative 17 customers mention \"Length\" 11 positive 6 negative Customers have mixed opinions about the dress length, with some finding it good while others report it runs too short. \" Perfect length (I’m 5’6-5’7) even wearing flats. It’s pretty tts, maybe just a little bit on the larger size.... \" Read more \" I’m short, but this dress is VERY long and tulle would have cost a fortune to have altered. \" Read more \" ...Got compliments on the dress. Also was a great length for me ... I'm pretty short and dresses tend to be too long but this just brushed the floor in... \" Read more \" ...It was comfortable and fit perfectly. I am 5'5\" and the length was just right where I could wear flat sandals with it.... \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars The dress is beautiful, it is perfect and the fabric feels of excellent",
        "body": "I'm delighted with this party dress. The material is soft, comfortable and feels very good quality. The design is elegant and modern, it fits flatteringly without feeling tight. The color is vibrant and the cut enhances the figure. I used it for a special occasion and everyone asked me where I bought it. It is definitely a dress that makes you feel confident, feminine and elegant. I would buy it again. Read more",
        "author": "Susana Báez",
        "rating": 5.0,
        "date": "November 21, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Good dress for the price - Looks nice - Order larger than you need - runs a bit small.",
        "body": "Great dress for attending a wedding. I followed the other reviews and ordered larger than I normally wood. Good thing that I did, by ordering up a size the dress fit me well. I don't know how well it will hold up, but it was a good buy for the wedding. I looked great and had fun. The dress was light enough that I did not overheat. The Wedding was the end of August in the North East - outside. Reception was inside - I felt comfortable the whole time. I'm a bigger girl so it was nice to have sleeves that covered the tops of my arms without being heavy and tight. Read more",
        "author": "Samantha",
        "rating": 5.0,
        "date": "October 5, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Pretty but Pay Attention",
        "body": "The dress is pretty, made well and fits the to size. However, if you’re buying black, note that the embellishments are all black. They are not silver and black as shown in image. It’s just the lighting that makes it appear silver. Read more",
        "author": "Shelby",
        "rating": 4.0,
        "date": "November 23, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Beautiful dress",
        "body": "This dress was perfect for my son's wedding. It was very comfortable and fit perfectly. I typically wear a size 18 dress and bought size XXL. Read more",
        "author": "Shelly G",
        "rating": 5.0,
        "date": "December 14, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61JZbJnjTkL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71VJgODMMEL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Beautiful Dress!",
        "body": "This is a beautiful dress. I can’t count the compliments I’ve received. It runs true to size for me. I ordered up and it was a little big but comfortable. I’m 200lbs 5’3 and it was a little long but with heels it just tipped the floor so that I wasn’t walking on it. I wore this for my son’s wedding. It is light weight. The fabric has a nice amount of stretch. I loved the cut it was modest not showing too much. Read more",
        "author": "Margaret A.",
        "rating": 5.0,
        "date": "November 22, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71c6jUugPGL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Very beautiful dress",
        "body": "I love this dress, very accommodating to my size beautifully made, and elegant Read more",
        "author": "Tablet",
        "rating": 5.0,
        "date": "December 19, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Like it!",
        "body": "While I really like this dress, every time I zip it up, I'm afraid the zipper is going to break. Also the design on the sleeves is a little scratchy. Other than that its a very nice dress. Read more",
        "author": "Kirsten Triplett",
        "rating": 3.0,
        "date": "November 26, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars This dress was just gorgeous on!",
        "body": "This dress made me feel like a goddess! It came out of the pack in great shape and I barely had to steam it. The embroidery and stitching seemed very well made. It was not see thru which I really appreciated. I am 5'11\" and it went to my ankles Read more",
        "author": "Rae Cole",
        "rating": 5.0,
        "date": "December 17, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Formal Evening is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.",
  "about_this_item": "Womens Maxi Dress Formal Evening is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.",
  "long_description": "Womens Maxi Dress Formal Evening is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Black-sequin, Gold-regular, Green-sequin, White-sequin, Navy-sequin, Haze Blue-sequin, Burgundy-sequin, Gold-sequin, Lavender-sequin. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Formal Evening is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Black-sequin, Gold-regular, Green-sequin, White-sequin, Navy-sequin, Haze Blue-sequin, Burgundy-sequin, Gold-sequin, Lavender-sequin. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "02d8c466-797c-46f6-be2b-4621469fd04d",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/02d8c466-797c-46f6-be2b-4621469fd04d/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/02d8c466-797c-46f6-be2b-4621469fd04d/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/ac0cb415-2962-488c-84a5-014808b7d683.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "c2e3320d-5dbd-4531-bab0-a6baf81313db",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c2e3320d-5dbd-4531-bab0-a6baf81313db/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c2e3320d-5dbd-4531-bab0-a6baf81313db/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/ac0cb415-2962-488c-84a5-014808b7d683.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "ab918156-9deb-4a74-b3e0-a6b6a333d89d",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ab918156-9deb-4a74-b3e0-a6b6a333d89d/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ab918156-9deb-4a74-b3e0-a6b6a333d89d/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/ac0cb415-2962-488c-84a5-014808b7d683.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "f518f3d6-475f-4453-8362-1defd80666ab",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f518f3d6-475f-4453-8362-1defd80666ab/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f518f3d6-475f-4453-8362-1defd80666ab/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/ac0cb415-2962-488c-84a5-014808b7d683.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Black-sequin": "https://m.media-amazon.com/images/I/41Cz9+L9EjL._AC_SR38,50_.jpg",
    "Gold-regular": "https://m.media-amazon.com/images/I/41Q3j31VsUL._AC_SR38,50_.jpg",
    "Green-sequin": "https://m.media-amazon.com/images/I/410BLxJb8xL._AC_SR38,50_.jpg",
    "White-sequin": "https://m.media-amazon.com/images/I/411zbbBgh0L._AC_SR38,50_.jpg",
    "Navy-sequin": "https://m.media-amazon.com/images/I/412HQQTdyzL._AC_SR38,50_.jpg",
    "Haze Blue-sequin": "https://m.media-amazon.com/images/I/41L7Yjpxg4L._AC_SR38,50_.jpg",
    "Burgundy-sequin": "https://m.media-amazon.com/images/I/41xyedy6Y-L._AC_SR38,50_.jpg",
    "Gold-sequin": "https://m.media-amazon.com/images/I/410Rl2QD30L._AC_SR38,50_.jpg",
    "Lavender-sequin": "https://m.media-amazon.com/images/I/41VX67ScbsL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Black-sequin": "71uThC4OEOL",
    "Gold-regular": "615ygJ2kLvL",
    "Green-sequin": "71+fWauDqoL",
    "White-sequin": "61g-RNK8b9L",
    "Navy-sequin": "71LxjiFjaWL",
    "Haze Blue-sequin": "71XX6oDQKnL",
    "Burgundy-sequin": "71TSB+gkunL",
    "Gold-sequin": "617fOC8GKgL",
    "Lavender-sequin": "71J+D67ADLL"
  },
  "color_images": {
    "Black-sequin": [
      "https://m.media-amazon.com/images/I/71uThC4OEOL._SL1500_.jpg"
    ],
    "Gold-regular": [
      "https://m.media-amazon.com/images/I/615ygJ2kLvL._SL1500_.jpg"
    ],
    "Green-sequin": [
      "https://m.media-amazon.com/images/I/71+fWauDqoL._SL1500_.jpg"
    ],
    "White-sequin": [
      "https://m.media-amazon.com/images/I/61g-RNK8b9L._SL1500_.jpg"
    ],
    "Navy-sequin": [
      "https://m.media-amazon.com/images/I/71LxjiFjaWL._SL1500_.jpg"
    ],
    "Haze Blue-sequin": [
      "https://m.media-amazon.com/images/I/71XX6oDQKnL._SL1500_.jpg"
    ],
    "Burgundy-sequin": [
      "https://m.media-amazon.com/images/I/71TSB+gkunL._SL1500_.jpg"
    ],
    "Gold-sequin": [
      "https://m.media-amazon.com/images/I/617fOC8GKgL._SL1500_.jpg"
    ],
    "Lavender-sequin": [
      "https://m.media-amazon.com/images/I/71J+D67ADLL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 76.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/519NIxJvOuL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-long-sleeve-ruched",
      "title": "Womens Maxi Dress Cocktail Long Sleeve Ruched",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61FPh32pv6L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-formal",
      "title": "Womens Dress Formal",
      "price": 75.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61PMgdXV6wL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 165.9,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/51NHIlMRpQL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-v-neck-cocktail-evening-ruched",
      "title": "Womens Maxi Dress Long Sleeve V Neck Cocktail Evening Ruched",
      "price": 53.88,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71IDqGFqZLL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-bodycon-v-neck-long-sleeve-ruched",
      "title": "Womens Maxi Dress Bodycon V Neck Long Sleeve Ruched",
      "price": 36.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51TARubmowL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 33.89,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Work",
      "images": [
        "https://m.media-amazon.com/images/I/61aolLkLa0L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-bodycon",
      "title": "Womens Dress Bodycon",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71NvPtfMJ5L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-formal-v-neck",
      "title": "Womens Maxi Dress Long Sleeve Formal V Neck",
      "price": 84.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51UvLPA1DyL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 89.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61rRvmJ+FqL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-one-shoulder-cocktail",
      "title": "Womens Dress One Shoulder Cocktail",
      "price": 42.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61wOHRqmGHL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-long-sleeve-ruched",
      "title": "Womens Maxi Dress Bodycon Long Sleeve Ruched",
      "price": 36.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61yFldWfTJL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-long-sleeve-ruched-bodycon",
      "title": "Womens Maxi Dress Cocktail Long Sleeve Ruched Bodycon",
      "price": 27.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61kxACexcRL._SL1500_.jpg"
      ]
    }
  ]
}