{
  "id": "womens-maxi-dress-maxi",
  "handle": "womens-maxi-dress-maxi",
  "sku": "JC2851",
  "asin": "B0DNMT1TGT",
  "title": "Womens Maxi Dress Maxi",
  "title_original": "Women Plaid Maxi Dress Long Puff Sleeve Square Neck Flowy Boho Dress Bow Tie Smocked Fall Dresses",
  "brand": "Visit the ABYOVRT Store",
  "price": 51.99,
  "social_proof": {
    "bought_past_month": 851,
    "text": "851+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/71J+5iZv2bL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61wOMzBxllL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61EHXAPMtEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71uhKfYvquL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81IC-lsB1PL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71PgZsLwJeL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/711gjH0Lw0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71+1OGtmO5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71--BzJLHDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61EaHKtjFsL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/613FAP9u61L._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/71J+5iZv2bL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61wOMzBxllL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61EHXAPMtEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71uhKfYvquL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81IC-lsB1PL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71PgZsLwJeL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/711gjH0Lw0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71+1OGtmO5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71--BzJLHDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61EaHKtjFsL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/613FAP9u61L._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Date First Available ‏": "‎ November 20, 2024",
    "ASIN ‏": "‎ B0DNMT6NG7",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#65,902 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #672 in Women's Casual Dresses",
    "Customer Reviews": "3.6 3.6 out of 5 stars (42)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Red a",
      "Brown",
      "Red B",
      "Blue",
      "Green"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 3.6,
    "count": 42,
    "customers_say": "Customers find the dress cute and flattering, with perfect length and wearability as a perfect fall dress. The material thickness receives mixed feedback - while some say it's thick, others find it thin. The fit, comfort, and fabric quality also get mixed reviews. Generated from the text of customer reviews Select to learn more Style (18) Wearability (6) Flattering (4) Length (4) Fit (10) Material thickness (9) Comfort (4) Fabric quality (6) 18 customers mention style, 16 positive, 2 negative 18 customers mention \"Style\" 16 positive 2 negative Customers find the dress super cute, with one mentioning that the bows look great on the back. \" This is a beautiful dress . I am 5'5\", 145lbs, Medium and I ordered small following the comments and it was perfect! Lots of compliments too! \" Read more \" Super cute ! Same as the picture \" Read more \" Love this! Fits great! 5’4 105 pounds size small. So cute ! \" Read more \" Big fan. High quality, very cute on , true to size. Love for autumn.... \" Read more 6 customers mention wearability, 6 positive, 0 negative 6 customers mention \"Wearability\" 6 positive 0 negative Customers find the dress perfect for fall and holidays, with one mentioning it works well for Christmas Eve dinner. \" I love this dress. It’s the perfect fall dress . It’s very comfortable, very feminine and flattering.... \" Read more \" ...Its very flattering. I recieved many compliments while wearing it. Both casual and can be dressed up \" Read more \" ...Madder Dakota dress, obviously lower quality but it’s very pretty and wearable . \" Read more \" This dress was perfect for Christmas Eve dinner ! A great dupe for another popular brand. \" Read more 4 customers mention flattering, 3 positive, 1 negative 4 customers mention \"Flattering\" 3 positive 1 negative Customers find the dress flattering. \" ...the back dips slightly lower with a square neck line which is very flattering . And the bows look so cut on the back. \" Read more \" ...It’s the perfect fall dress. It’s very comfortable, very feminine and flattering . The material is not see through and is a thicker material.... \" Read more \" ...The biggest issue was the shape. It was very boxy and not flattering to any part of the body .... \" Read more \" ...Its very flattering . I recieved many compliments while wearing it. Both casual and can be dressed up \" Read more 4 customers mention length, 3 positive, 1 negative 4 customers mention \"Length\" 3 positive 1 negative Customers like the dress's length, with one mentioning it's not too low cut. \" Fire got many compliments. Perfect length I’m 5’3 and it was above ish or at ish my ankles but I’m just happy it wasn’t dragging on the floor. \" Read more \" Good measurements and length . I’m 5’7 & it went almost to my ankles! Also 7 months pregnant and the modesty on this dress is adorable. \" Read more \" The material was thick but slightly scratchy. It was a bit long but with heels that part could have possibly been mitigated.... \" Read more \" ...I am in the shorter size so it is a FULL maxi length in me . The thickness and material was exactly as expected.... \" Read more 10 customers mention fit, 6 positive, 4 negative 10 customers mention \"Fit\" 6 positive 4 negative Customers have mixed opinions about how the dress fits. \" ... Fit my chest , not too tight. Fabric is like a linen blend that wrinkles easy but steams well.... \" Read more \" Beautiful dress. Recommend ordering a size smaller as this dress is quite loose . Im 5'9, 150 ordered a size small.... \" Read more \" Fit was ok , but the material was awful. I didn’t check before purchasing but it’s must be some kind of polyester that felt really cheap and tacky.... \" Read more \" Adorable dress but not ideal for bigger chests . It messes up the bow spacing making the dress look odd. \" Read more 9 customers mention material thickness, 3 positive, 6 negative 9 customers mention \"Material thickness\" 3 positive 6 negative Customers have mixed opinions about the dress's material thickness, with some finding it thick while others say it's thin. \" Fit was ok, but the material was awful . I didn’t check before purchasing but it’s must be some kind of polyester that felt really cheap and tacky.... \" Read more \" ...It’s very comfortable, very feminine and flattering. The material is not see through and is a thicker material.... \" Read more \" This dress is really really cute!! The fabric is a bit thin but I quite like that because I get hot easily lol and the ribbon bows on the front are... \" Read more \" Quality was pretty cheap and the material was super thin \" Read more 4 customers mention comfort, 2 positive, 2 negative 4 customers mention \"Comfort\" 2 positive 2 negative Customers have mixed opinions about the dress's comfort. \" I love this dress. It’s the perfect fall dress. It’s very comfortable , very feminine and flattering.... \" Read more \" The material was thick but slightly scratchy . It was a bit long but with heels that part could have possibly been mitigated.... \" Read more \" Beautiful and comfortable ... \" Read more \" ...It’s not very comfortable and isn’t flattering :/ \" Read more 6 customers mention fabric quality, 1 positive, 5 negative 6 customers mention \"Fabric quality\" 1 positive 5 negative Customers find the fabric quality of the dress to be cheap. \" HORRIBLE QUALITY ! Smells so weird, material is plasticy, absolutely awful. \" Read more \" Quality was pretty cheap and the material was super thin \" Read more \" Pretty spot on to the real Damson Madder Dakota dress, obviously lower quality but it’s very pretty and wearable. \" Read more \" ...n’t check before purchasing but it’s must be some kind of polyester that felt really cheap and tacky. Hard to capture in photos but almost shiny.... \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Perfect for Fall / Holidays",
        "body": "Soooo cute and a perfect designer look a like. Once steamed it was so stinking cute. Wore for date night but would also be cute for fall / christmas season! Fit my chest, not too tight. Fabric is like a linen blend that wrinkles easy but steams well. But honestly with the gingham pattern some wrinkles go unnoticed. Read more",
        "author": "Samantha Dahlborg",
        "rating": 5.0,
        "date": "August 14, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71HQmAmmHfL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "1.0 out of 5 stars Cute but doesn’t fit well on top",
        "body": "Not enough space in the bust. Looks weird Read more",
        "author": "NJ",
        "rating": 1.0,
        "date": "December 9, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars So cute",
        "body": "This dress is adorable. I am not busty at all. It felt like the dress looked a little odd on me so I turned it backwards. Sounds crazy I know. But if you're small chested, the back dips slightly lower with a square neck line which is very flattering. And the bows look so cut on the back. Read more",
        "author": "Customer",
        "rating": 5.0,
        "date": "November 22, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Cute Holiday Dress!",
        "body": "This dress is really really cute!! The fabric is a bit thin but I quite like that because I get hot easily lol and the ribbon bows on the front are velvet which is nice. The only downside is that I got the green, and it’s not as dark as pictured. It is also rather tighter than expected. I mean, it fits me like a glove. My bust is 47inches and waist is 35 inches and it fits perfectly in the size large. There’s a bit of stretching in the bust, so if you’re a busty gal it’ll fit nicely but not loose like in the picture. Otherwise it’s very very cute!! I am tempted to get it in brown! Read more",
        "author": "Laurissa DeNoyelles",
        "rating": 4.0,
        "date": "October 2, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61oNJMs8pML._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/61CID5UKl6L._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71tlqhalM7L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "3.0 out of 5 stars Feels cheap",
        "body": "Fit was ok, but the material was awful. I didn’t check before purchasing but it’s must be some kind of polyester that felt really cheap and tacky. Hard to capture in photos but almost shiny. Gingham feels like it should be a natural fiber like cotton so this just didn’t work for me. Was like the material used on a cheap Halloween costume. Definitely not worth $50. Read more",
        "author": "Danielle",
        "rating": 3.0,
        "date": "November 24, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71sD8kXA6aL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/81OBHiEKm2L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars The perfect fall dress",
        "body": "I love this dress. It’s the perfect fall dress. It’s very comfortable, very feminine and flattering. The material is not see through and is a thicker material. I love this dress and would definitely recommend it Read more",
        "author": "Grace",
        "rating": 5.0,
        "date": "August 5, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "2.0 out of 5 stars Poor quality fabric",
        "body": "The style of this dress is sooo cute and I wanted to like it really bad. The fabric is just so cheap and almost plastic feeling. I am pretty disappointed. Read more",
        "author": "Anna Oldroyd",
        "rating": 2.0,
        "date": "November 9, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Nice",
        "body": "Good measurements and length. I’m 5’7 & it went almost to my ankles! Also 7 months pregnant and the modesty on this dress is adorable. Read more",
        "author": "roboticKitten",
        "rating": 5.0,
        "date": "October 7, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Maxi is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.",
  "about_this_item": "Womens Maxi Dress Maxi is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.",
  "long_description": "Womens Maxi Dress Maxi is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Red a, Brown, Red B, Blue, Green. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Maxi is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Red a, Brown, Red B, Blue, Green. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "6787800e-46b5-4647-8803-20f3ad4745e9",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6787800e-46b5-4647-8803-20f3ad4745e9/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6787800e-46b5-4647-8803-20f3ad4745e9/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/69522c2d-f802-4cd0-8526-b03cdf4bbc22.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "74d9347e-b2b2-4b4d-8297-9016011264d8",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/74d9347e-b2b2-4b4d-8297-9016011264d8/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/74d9347e-b2b2-4b4d-8297-9016011264d8/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/69522c2d-f802-4cd0-8526-b03cdf4bbc22.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "66efda2a-d445-4a6a-b0fb-49bdb7974047",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/66efda2a-d445-4a6a-b0fb-49bdb7974047/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/66efda2a-d445-4a6a-b0fb-49bdb7974047/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/69522c2d-f802-4cd0-8526-b03cdf4bbc22.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "aeb55ee6-6f05-40d0-a198-40cb1a3b1472",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/aeb55ee6-6f05-40d0-a198-40cb1a3b1472/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/aeb55ee6-6f05-40d0-a198-40cb1a3b1472/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/69522c2d-f802-4cd0-8526-b03cdf4bbc22.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Red a": "https://m.media-amazon.com/images/I/41-UYOZVLIL._AC_SR38,50_.jpg",
    "Brown": "https://m.media-amazon.com/images/I/41xIBu4kivL._AC_SR38,50_.jpg",
    "Red B": "https://m.media-amazon.com/images/I/41j0NyWiKtL._AC_SR38,50_.jpg",
    "Blue": "https://m.media-amazon.com/images/I/417xJttLBfL._AC_SR38,50_.jpg",
    "Green": "https://m.media-amazon.com/images/I/41tdiQ970bL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Red a": "71+1OGtmO5L",
    "Brown": "71J+5iZv2bL",
    "Red B": "71--BzJLHDL",
    "Blue": "61EaHKtjFsL",
    "Green": "613FAP9u61L"
  },
  "color_images": {
    "Red a": [
      "https://m.media-amazon.com/images/I/71+1OGtmO5L._SL1500_.jpg"
    ],
    "Brown": [
      "https://m.media-amazon.com/images/I/71J+5iZv2bL._SL1500_.jpg"
    ],
    "Red B": [
      "https://m.media-amazon.com/images/I/71--BzJLHDL._SL1500_.jpg"
    ],
    "Blue": [
      "https://m.media-amazon.com/images/I/61EaHKtjFsL._SL1500_.jpg"
    ],
    "Green": [
      "https://m.media-amazon.com/images/I/613FAP9u61L._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-bodycon-long-sleeve-ruched",
      "title": "Womens Maxi Dress Bodycon Long Sleeve Ruched",
      "price": 38.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/718YKBFbs3L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-off-shoulder-mermaid-evening",
      "title": "Womens Maxi Dress Formal Off Shoulder Mermaid Evening",
      "price": 86.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71C+AFY6HAL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-formal",
      "title": "Womens Maxi Dress Evening Formal",
      "price": 69.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71amdzuBfbL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-bodycon-sleeveless",
      "title": "Womens Dress Bodycon Sleeveless",
      "price": 29.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51UthcjfRfL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 38.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71l8OE0DiEL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress-sleeveless",
      "title": "Womens Dress Sleeveless",
      "price": 41.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71QMCW+8CcL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-ruched-v-neck-cocktail-bodycon",
      "title": "Womens Dress Ruched V Neck Cocktail Bodycon",
      "price": 45.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/51TCVhb-WzL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 298.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71Jq8YdpWeL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-split",
      "title": "Womens Dress Split",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61PPeTKsusL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-maxi-cocktail",
      "title": "Womens Maxi Dress Long Sleeve Maxi Cocktail",
      "price": 62.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71u2Xray0mL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-long-sleeve-ruched-cocktail-bodycon-formal",
      "title": "Womens Maxi Dress Maxi Long Sleeve Ruched Cocktail Bodycon Formal",
      "price": 28.3,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/81e1pG2+yqL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening-long-sleeve",
      "title": "Womens Maxi Dress Formal Evening Long Sleeve",
      "price": 75.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61e8WX2EcaL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-v-neck",
      "title": "Womens Dress V Neck",
      "price": 69.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/81MCqkA-7cL._SL1500_.jpg"
      ]
    }
  ]
}