{
  "id": "womens-maxi-dress-long-sleeve",
  "handle": "womens-maxi-dress-long-sleeve",
  "sku": "JC1325",
  "asin": "B0DPMTW6P1",
  "title": "Womens Maxi Dress Long Sleeve",
  "title_original": "CHYRII Women Spring Fashion 2025 Square Neck Long Sleeve Casual A-Line Midi Dress",
  "brand": "Visit the CHYRII Store",
  "price": 45.99,
  "social_proof": {
    "bought_past_month": 104,
    "text": "104+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/51g3DTDsW9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51yKY0Nxt-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/515nYalfQ0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61PDGLpZLcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61sK8j-kNoL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61d89d0PLnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51EglNzLJ0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51SLZaUu7gL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51dN1IiZLjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51lgZT8ajXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51c2cVaKKsL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/51g3DTDsW9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51yKY0Nxt-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/515nYalfQ0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61PDGLpZLcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61sK8j-kNoL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61d89d0PLnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51EglNzLJ0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51SLZaUu7gL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51dN1IiZLjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51lgZT8ajXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51c2cVaKKsL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ January 13, 2025",
    "ASIN ‏": "‎ B0DSWJJD74",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#67,310 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #697 in Women's Casual Dresses #1,070 in Women's Formal Dresses",
    "Customer Reviews": "4.0 4.0 out of 5 stars (268)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Brown",
      "White",
      "Beige",
      "Blue",
      "Army Green",
      "Black"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.0,
    "count": 268,
    "customers_say": "Customers find this dress gorgeous, with one mentioning it was perfect for a choir concert, and they appreciate its amazing fit, soft material, and stretchiness. The dress is comfortable, flattering, and features a great length with long sleeves. They like its quality, with one customer noting its double lining, and another mentioning how it hugs the body in all the right places. Generated from the text of customer reviews Select to learn more Beauty (43) Fit (31) Fabric quality (27) Quality (23) Comfort (21) Flattering (17) Length (11) Stretchiness (11) 43 customers mention beauty, 40 positive, 3 negative 43 customers mention \"Beauty\" 40 positive 3 negative Customers find the dress beautiful, with one mentioning it makes them feel like a princess and another noting it adds a sophisticated touch. \" Beautiful , I’m usually a 22 in women’s pants (idk dress size so using that as reference) and a 2-3x in shirts and this fit perfectly, it is pretty... \" Read more \" cute , well fitted dress. I usually wear a large in dresses (pear-ish shaped) and the large fit will.... \" Read more \" I ordered in another color, such a beautiful dress ! I wished it had more colors options. \" Read more \" Pretty dress , fits great, except for where the skirt meets the top, it puckers funny because of the seam. \" Read more 31 customers mention fit, 24 positive, 7 negative 31 customers mention \"Fit\" 24 positive 7 negative Customers like how the dress fits, with one mentioning it's big bust friendly and another noting the fabric is loose on the tummy. \" ...I’m 5’3 and weigh 230 pounds and I got the XXL and it fit perfectly . Hardest part about the dress is finding a bra you can’t see underneath.... \" Read more \" Perfect for an elopement or small wedding ceremony. It fits great and is so comfortable. I love the length and I am 4'11\".... \" Read more \" Great fit and comfortable... \" Read more \" This dress was cute but the bottom part felt so heavy! And the sleeves were tight so I returned it but purchased the spaghetti strap version of this... \" Read more 27 customers mention fabric quality, 19 positive, 8 negative 27 customers mention \"Fabric quality\" 19 positive 8 negative Customers love the material of the dress, describing it as soft and of good quality, with one customer noting that the skirt has a flowy texture. \" Fabric is good quality and not see through. I’m returning it only because I orders another item that was a little more elegant for my event. \" Read more \" ...The material is soft and great quality. I especially love the curved design on the front because it adds a sophisticated touch!... \" Read more \" I returned this item because the fabric was cheap \" Read more \" I love the material and shape of this dress. For being long sleeved it did not get to hot. The top was very stretchy. Worth the money. \" Read more 23 customers mention quality, 20 positive, 3 negative 23 customers mention \"Quality\" 20 positive 3 negative Customers praise the dress's quality, with one mentioning its double lining and another noting it's perfect for postpartum wear. \" ...The material is soft and great quality . I especially love the curved design on the front because it adds a sophisticated touch!... \" Read more \" Love this dress ! Purchased it for engagement photos, and it was just what I was looking for. \" Read more \" Gorgeous dress, the arms are a little tight but it’s a great dress . It can be dressed up or down as you like.... \" Read more \" Loved the dress , it is fitted on the top but it is very comfortable. Received many compliments. For reference I ordered a small, 140 lbs. \" Read more 21 customers mention comfort, 20 positive, 1 negative 21 customers mention \"Comfort\" 20 positive 1 negative Customers find the dress comfortable. \" ...Color is true to picture and was comfortable but I had to return because it was a bit tight for my liking. If you’re between sizes, size up.... \" Read more \" I was skeptical of this dress, buy BOY was I wrong. This thing was so comfortable , so flattering, and it fits better than I expected.... \" Read more \" Loved the dress, it is fitted on the top but it is very comfortable . Received many compliments. For reference I ordered a small, 140 lbs. \" Read more \" Love this dress! Fabric is comfy and I love the color! \" Read more 17 customers mention flattering, 16 positive, 1 negative 17 customers mention \"Flattering\" 16 positive 1 negative Customers find the dress flattering, with one mentioning it hugs them in all the right spots. \" I absolutely love this dress it’s so flattering I’m 5’7 200 pounds and it hugged me all in the right spots the fabric is loose on the tummy but... \" Read more \" Y'all, I never leave reviews but this dress was absolutely flattering & soft! I wore it for my baby's baptism last weekend & I loved it.... \" Read more \" This dress is the perfect blend of chic and timeless, with a flattering square neckline , a fitted bodice, and flowy A-line skirt.... \" Read more \" Very flattering feminine dress . True to size. Good length for petite women. \" Read more 11 customers mention length, 8 positive, 3 negative 11 customers mention \"Length\" 8 positive 3 negative Customers like the length of the dress, particularly its long sleeves and square neckline. \" I love the material and shape of this dress. For being long sleeved it did not get to hot. The top was very stretchy. Worth the money. \" Read more \" ...I carry my weight in my hips and chest, I love that this dress has long sleeves because I’m insecure about my arms.... \" Read more \" ...and a 2-3x in shirts and this fit perfectly, it is pretty low cut and will prob need a strapless bra so heads up on that.... \" Read more \" ...'s also a liner in the skirt which is a nice detail, I also love the square neckline ... Neckline... All in all I would buy this dress again but in a... \" Read more 11 customers mention stretchiness, 9 positive, 2 negative 11 customers mention \"Stretchiness\" 9 positive 2 negative Customers like the dress's stretchiness, with one mentioning its soft, stretchy material. \" ...I love it. Trust to size. Stretchy . Its amazing. Dont mind my dirty mirror but this dress is perfect, thick, great quality.... \" Read more \" Beautiful dress but runs very small. Has a lot of stretch but still very small.... \" Read more \" ...I got the blue and I love the color . The sizing is accurate, stretchy on top and flowy on the bottom . Cute for a wedding or just a casual look . \" Read more \" Love this dress! The bodice is double lined with soft stretchy material that helps you feel secure, and the skirt is a different flowy material that... \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars excellent staple piece for the closet",
        "body": "cute, well fitted dress. I usually wear a large in dresses (pear-ish shaped) and the large fit will. love the bodice circular dip at the front, it’s elongating. If you’re short (I am 5ft 2) you may find it a tad long as I did (most dresses are made to fit a range of sizes and I usually find them to be long for me) It’s an easy alteration at the tailor or easier if you’ve got the ability to do a quick alteration yourself. it’s a great closet staple. at this point I’ve paired it with so many things it’s ridiculous. crop sweaters, belted scarves, vests etc. Wash it on gentle/cool (I wash everything in a gentle cool) and the wear and tear is not noticeable and it’s gotten a ton of wear since I’ve bought it. Photographs adorably. Read more",
        "author": "Grandits Family",
        "rating": 5.0,
        "date": "December 19, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71XBM0GhcyL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Great dress!",
        "body": "Love this dress! The bodice is double lined with soft stretchy material that helps you feel secure, and the skirt is a different flowy material that really gives off princess vibes. The skirt is also lined which was a happy surprise! I originally got this dress for castle touring in France and it was perfect for that. I love it so much I ordered it in black too. I got the XL because it does run a little tight in the bodice Read more",
        "author": "Dana",
        "rating": 5.0,
        "date": "October 6, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61mW0bpq9oL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/61Cjznz2mKL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "4.0 out of 5 stars Comfortable dress .",
        "body": "Fabric is a good quality. I got the blue and I love the color . The sizing is accurate, stretchy on top and flowy on the bottom . Cute for a wedding or just a casual look . Read more",
        "author": "Nick Ordzie",
        "rating": 4.0,
        "date": "August 19, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Stylish, classic and beautiful",
        "body": "Gorgeous dress, the arms are a little tight but it’s a great dress. It can be dressed up or down as you like. I’m gonna get a few more in different colors. ❤️ Read more",
        "author": "Customer",
        "rating": 5.0,
        "date": "December 15, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Nice material, breathable but material ripped at the seam.",
        "body": "I quite liked this dress but on my first wear, it literally ripped at the underarm seam when I was adjusting the sleeves. Luckily, the sleeves were long enough with extra material so I could just conceal the tear. But the dress was nice, thick material but not too heavy. It was pretty comfortable to wear and not tight to the point were it’s not breathable so I appreciate that. Read more",
        "author": "Ashley X",
        "rating": 3.0,
        "date": "December 9, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "1.0 out of 5 stars Beautiful Dress, but the Stitching Needs Improvement & Stronger Sewing!",
        "body": "When I received this dress, I was disappointed to find that the stitching had come undone. I had to act quickly and repair it myself since I needed to wear it for an event. The dress itself is beautiful and fits well, but the sewing was weak and poorly finished. Read more",
        "author": "Yasmin",
        "rating": 1.0,
        "date": "August 20, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Love this dress! So versatile for any occasion!",
        "body": "Received so many compliments on this dress! Love the way this dress hid some of my insecurities. Would definitely recommend! I sized up from my normal size to make sure the top wasn’t too snug and it was so comfortable! Size XXL, color: blue, height 5’0” Read more",
        "author": "NoyNoy K",
        "rating": 5.0,
        "date": "December 15, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/81Wg7ug6ndL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Love this dress",
        "body": "Wore this dress for my engagement photos and felt beautiful. I’m 5’3 and weigh 230 pounds and I got the XXL and it fit perfectly. Hardest part about the dress is finding a bra you can’t see underneath. The top is a bit thin and although it isn’t see through. Any lump and bump can easily be seen. The bottom of the dress also easily wrinkles. I love the dress tho and bought 2 more colors. Read more",
        "author": "Lebbeast",
        "rating": 5.0,
        "date": "November 3, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71dyPevdSDL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71R1Ic-GTIL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71xUpL1SjBL._SY88._SL1500_.jpg"
        ]
      }
    ]
  },
  "short_description": "Womens Maxi Dress Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.",
  "about_this_item": "Womens Maxi Dress Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.",
  "long_description": "Womens Maxi Dress Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Brown, White, Beige, Blue, Army Green, Black. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Brown, White, Beige, Blue, Army Green, Black. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "d4818234-555f-4c7a-b2b2-3d146026a65f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d4818234-555f-4c7a-b2b2-3d146026a65f/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d4818234-555f-4c7a-b2b2-3d146026a65f/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "7afa4d4d-9bf8-484a-9fe5-2232e6dbab94",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7afa4d4d-9bf8-484a-9fe5-2232e6dbab94/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7afa4d4d-9bf8-484a-9fe5-2232e6dbab94/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "eef827d9-0415-4270-ab46-616c81148cd1",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/eef827d9-0415-4270-ab46-616c81148cd1/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/eef827d9-0415-4270-ab46-616c81148cd1/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "8ebaa269-848b-42f1-bea3-228bc9fcc750",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8ebaa269-848b-42f1-bea3-228bc9fcc750/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8ebaa269-848b-42f1-bea3-228bc9fcc750/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "6bd190ba-0e7e-4343-8d9a-467f5c494196",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6bd190ba-0e7e-4343-8d9a-467f5c494196/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6bd190ba-0e7e-4343-8d9a-467f5c494196/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "36a1bcca-82f2-4b4a-9bd1-14142ce99c2d",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/36a1bcca-82f2-4b4a-9bd1-14142ce99c2d/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/36a1bcca-82f2-4b4a-9bd1-14142ce99c2d/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "77894e10-1dce-40ad-b6f7-6461c117bd20",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/77894e10-1dce-40ad-b6f7-6461c117bd20/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/77894e10-1dce-40ad-b6f7-6461c117bd20/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "7c010e18-7343-4e5a-be36-d8bba406fdf6",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7c010e18-7343-4e5a-be36-d8bba406fdf6/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7c010e18-7343-4e5a-be36-d8bba406fdf6/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "466891b3-651b-4cb7-b22b-7d1685f2f227",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/466891b3-651b-4cb7-b22b-7d1685f2f227/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/466891b3-651b-4cb7-b22b-7d1685f2f227/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "f07b9485-9dfe-4df8-9f96-7df133148269",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f07b9485-9dfe-4df8-9f96-7df133148269/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f07b9485-9dfe-4df8-9f96-7df133148269/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "99c8f556-291a-4fc8-987e-a26a72483c51",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/99c8f556-291a-4fc8-987e-a26a72483c51/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/99c8f556-291a-4fc8-987e-a26a72483c51/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "c6ea8357-5788-4967-8cc5-9ccb2c8c6a47",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c6ea8357-5788-4967-8cc5-9ccb2c8c6a47/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c6ea8357-5788-4967-8cc5-9ccb2c8c6a47/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Brown": "https://m.media-amazon.com/images/I/31KsPDDi7lL._AC_SR38,50_.jpg",
    "White": "https://m.media-amazon.com/images/I/31ci+P2o5uL._AC_SR38,50_.jpg",
    "Beige": "https://m.media-amazon.com/images/I/3171+XHEXRL._AC_SR38,50_.jpg",
    "Blue": "https://m.media-amazon.com/images/I/31cIh5dEoiL._AC_SR38,50_.jpg",
    "Army Green": "https://m.media-amazon.com/images/I/317Ui0gQ31L._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31CqNLvz4mL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Brown": "51EglNzLJ0L",
    "White": "51SLZaUu7gL",
    "Beige": "51g3DTDsW9L",
    "Blue": "51dN1IiZLjL",
    "Army Green": "51lgZT8ajXL",
    "Black": "51c2cVaKKsL"
  },
  "color_images": {
    "Brown": [
      "https://m.media-amazon.com/images/I/51EglNzLJ0L._SL1500_.jpg"
    ],
    "White": [
      "https://m.media-amazon.com/images/I/51SLZaUu7gL._SL1500_.jpg"
    ],
    "Beige": [
      "https://m.media-amazon.com/images/I/51g3DTDsW9L._SL1500_.jpg"
    ],
    "Blue": [
      "https://m.media-amazon.com/images/I/51dN1IiZLjL._SL1500_.jpg"
    ],
    "Army Green": [
      "https://m.media-amazon.com/images/I/51lgZT8ajXL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/51c2cVaKKsL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress-cocktail-bodycon",
      "title": "Womens Dress Cocktail Bodycon",
      "price": 47.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61NfEwzl3xL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-one-shoulder-maxi-formal",
      "title": "Womens Maxi Dress Evening One Shoulder Maxi Formal",
      "price": 69.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/5150AIQL4eL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail",
      "title": "Womens Dress Cocktail",
      "price": 103.54,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61JApwce25L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-formal-bodycon-evening-sleeveless",
      "title": "Womens Maxi Dress Maxi Formal Bodycon Evening Sleeveless",
      "price": 61.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61s8qg6u1VL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 158.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71PmRANW40L._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress-bodycon-split-ruched-off-shoulder",
      "title": "Womens Dress Bodycon Split Ruched Off Shoulder",
      "price": 38.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/41JjYcPgcpL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 95.61,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Work",
      "images": [
        "https://m.media-amazon.com/images/I/71hVgSIB1jL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 138.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51PZNrlyY9L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-split-evening-formal",
      "title": "Womens Maxi Dress Split Evening Formal",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51BZ1BqPx8L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 65.97,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/81wr8PDg55L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-v-neck",
      "title": "Womens Dress V Neck",
      "price": 82.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/710bSTpZ9hL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 278.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/91YXeyW506L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening-long-sleeve",
      "title": "Womens Maxi Dress Formal Evening Long Sleeve",
      "price": 87.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61nnk+flvaL._SL1500_.jpg"
      ]
    }
  ]
}