{
  "id": "womens-dress",
  "handle": "womens-dress",
  "sku": "JC1517",
  "asin": "B0DPZL5G7V",
  "title": "Womens Dress",
  "title_original": "Florboom Women's Sweetheart Knot Front Dress Flutter Sleeve Tie Back A-Line Chiffon Mini Dresses",
  "brand": "Visit the Florboom Store",
  "price": 46.99,
  "social_proof": {
    "bought_past_month": 957,
    "text": "957+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/615rmgyupRL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71AFQhOuhZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81Ez1d5RuTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81Ta8F5K1ML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81NjxGbzC1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71JcCVeGxcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71c4RJC9SmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/610c+v0jCoL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71nENm7U+OL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71AjI1KqbxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71hImJXJ1BL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/615rmgyupRL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71AFQhOuhZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81Ez1d5RuTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81Ta8F5K1ML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81NjxGbzC1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71JcCVeGxcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71c4RJC9SmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/610c+v0jCoL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71nENm7U+OL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71AjI1KqbxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71hImJXJ1BL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Date First Available ‏": "‎ December 10, 2024",
    "ASIN ‏": "‎ B0DPZMCP7X",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#63,973 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #686 in Women's Casual Dresses",
    "Customer Reviews": "4.1 4.1 out of 5 stars (299)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Mint Green",
      "Red",
      "White",
      "Blue",
      "Yellow",
      "Black"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.1,
    "count": 299,
    "customers_say": "Customers find the dress cute and flattering, with one mentioning it's perfect for curvier bodies and another noting it hides the tummy well. Moreover, the dress receives positive feedback for its quality, comfort, and lightweight design. However, the fabric quality receives mixed reviews, with some praising it while others find it cheap. Additionally, customers disagree on the length, with some finding it perfect for taller girls while others say it's too long. Select to learn more Cute Fit Flattering Quality Comfort Lightweight Fabric quality Length 46 customers mention \"Cute\" 44 positive 2 negative Customers find the dress cute, with one mentioning that it looks good dressed up with heels and jewelry. \"This is such a cute dress !! Perfect material and color. It compliments my body type and is super flowy. I am 5'7 and 185lbs. I ordered a large\" Read more \"...The only thing we had a difficult time with is the bow in the back. It's cute but we never got it to sit quite right.\" Read more \" Beautiful dress . Light and airy. Comes with an attached liner inside the dress so thats a plus. Also true to size with a good amount of stretch....\" Read more \" SO CUTE !!! Great lines and quality with a liner that isn’t see through! Perfect graduation dress!\" Read more 36 customers mention \"Fit\" 27 positive 9 negative Customers like how the dress fits, with one mentioning it falls elegantly past the hips and another noting it's perfect for curvier bodies. \"This fits true to size , I am a 16 Jean size and XL top size. It fits well and it’s really flattering. It does come wrinkled so make sure to steam it!\" Read more \"...The blue is light and saturated. It’s stretchy but fits well . It’s perfect for a beach day or a casual summer date!\" Read more \"Material is soft and comfy, but the bust is a bit tight and the back is more open than expected. It is also a little long for my taste.\" Read more \"Adorable. Fits perfectly and is absolutely comfortable.\" Read more 20 customers mention \"Flattering\" 20 positive 0 negative Customers find the dress flattering, with one mentioning it hides the tummy well. \"Runs a little small Cloth is like SHEIN material Very flattering Love the dress overall Not see through...\" Read more \"LITERALLY PERFECT. Not see through, perfect length, flowy, flattering . I am 5’9-195 lbs and I got a large....\" Read more \"...I ordered it for graduation pictures and it’s so flattering !\" Read more \"...everything but this dress made me look and feel amazing, and is super flattering !...\" Read more 19 customers mention \"Quality\" 16 positive 3 negative Customers find the dress has amazing quality. \" LOVE THIS DRESS ! I felt like Mia in the princess diaries with this color… IYKYK!!\" Read more \"Loved this dress as soon as I pulled it out of the package. Great quality and fits great. Is super comfortable....\" Read more \"...Definitely worth the money & a fabulous dress for any occasion .\" Read more \"Extremely flattering well made and beautiful yellow color.\" Read more 17 customers mention \"Comfort\" 17 positive 0 negative Customers find the dress comfortable, noting they can move freely in it. \"Cute dress! Comfortable and not transparent I did end up wearing nude undergarments but if the back didn’t show the straps I could have gone with a...\" Read more \"...Great quality and fits great. Is super comfortable . This was about my 10th dress I have tried on for an upcoming event and finally found the one!...\" Read more \" Very comfortable , pleased with purchase. As advertised!\" Read more \" Super comfy dress and I get so many compliments every time I wear it. Color and length were spot on to the picture....\" Read more 11 customers mention \"Lightweight\" 11 positive 0 negative Customers appreciate that the dress is lightweight. \"Beautiful dress. Light and airy. Comes with an attached liner inside the dress so thats a plus. Also true to size with a good amount of stretch....\" Read more \"...Look the look on me. Fit like a glove. Red is so pretty. Perfect light weight summer dress .\" Read more \"Fit as expected., material is lightweight and soft but not cheap. Color is true and price is very good considering how nice it looks.\" Read more \"The fabric feels lightweight and breathable, and it doesn’t wrinkle easily, which is great for travel....\" Read more 16 customers mention \"Fabric quality\" 10 positive 6 negative Customers have mixed opinions about the fabric of the dress, with some finding it great while others describe it as cheap material. \"...It's beautiful, lightweight, flowy material . Fit is true to size. The only thing we had a difficult time with is the bow in the back....\" Read more \"...because the material is light and thin so darker colors may show through....\" Read more \"...Love the color it’s not too light and fabric is thick so it’s not see through. Dress is long but I’m 4’11 so it was expected.\" Read more \" Great fabric . Look the look on me. Fit like a glove. Red is so pretty. Perfect light weight summer dress.\" Read more 11 customers mention \"Length\" 6 positive 5 negative Customers have mixed opinions about the dress's length, with some finding it perfect and particularly suitable for taller women, while others say it's a bit long. \"...I'm 5'7 and 140 lb and this dress is the perfect length , right around the knee. I can bend down in it and it not show anything....\" Read more \"... Dress is long but I’m 4’11 so it was expected.\" Read more \"I love my dress ! The length is great . I like the materials thickness so you can’t see throw it !!\" Read more \"It fit a bit weird around my waist. It was a little long for my liking as well. It was big on my waist but fit my bust. Definitely cute tho!...\" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Beautiful dress! Highly recommend!",
        "body": "I ordered this dress for my bridal shower & was very pleased with it. It flows beautifully & was very flattering for my body shape. I am 5”5 around 170 lbs with a more curvy body type & size medium was perfect for me. The only thing I will note is that it’s a little more fitted in the breast area (I’m a B cup & medium was perfect so I will say if you have bigger breasts you may want to order up one size just to allow a little more room in that area). Also, like any packaged clothing you order online it arrived a little wrinkled but I had it steamed & it was perfect. Definitely worth the money & a fabulous dress for any occasion. Read more",
        "author": "Kamryn Avila",
        "rating": 5.0,
        "date": "November 3, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/81wt2M6QYcL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Beautiful, Buy It, Stay true to your size!",
        "body": "Beautiful White Dress. I weight 200 lbs and my height is 5' 3'. Bust size 42 DD. Yes it has wrinkles from being inside a package in the pictures. But as soon as I washed and dried it there were no wrinkles. Overall fits good for a plus size women. I wear usually 16,18-20 in sizes and 2XL. This 2XL fits perfect. It is a beautiful dress for a plus siE girlie. Read more",
        "author": "Amanda Howard",
        "rating": 5.0,
        "date": "December 10, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71QKJA+DRfL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71-IFWubJXL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71eCm30CZQL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Pretty fit dress",
        "body": "Snug fit and fabric is really soft. The string on back is pretty for adjusting the top of the dress, skirt is loose so you can move comfortable, and the waist is also loose it doesn’t hug you like most dresses. Love the color it’s not too light and fabric is thick so it’s not see through. Dress is long but I’m 4’11 so it was expected. Read more",
        "author": "Eun Hyun joong",
        "rating": 5.0,
        "date": "July 12, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "1.0 out of 5 stars One side shorter than the other- returned",
        "body": "Well the top and back was so cute but they obviously hemmed it so wrong! One side is completely different than the other. The shorter side was right below my butt and the other was almost to my knee. I was so sad because this dress would have been so cute and fit perfect if it was all one length. Read more",
        "author": "Cristina Rivera",
        "rating": 1.0,
        "date": "September 6, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61C9dUnRruL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/61h9WzyTY-L._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/61DkVEM0GgL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "3.0 out of 5 stars Weird fit",
        "body": "It fit a bit weird around my waist. It was a little long for my liking as well. It was big on my waist but fit my bust. Definitely cute tho! Just not for my body Read more",
        "author": "Kaileigh Decker",
        "rating": 3.0,
        "date": "June 17, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Material is different!",
        "body": "Runs a little small Cloth is like SHEIN material Very flattering Love the dress overall Not see through Has lining under the dress to ensure comfort and privacy Pure white color Read more",
        "author": "Anonymous",
        "rating": 4.0,
        "date": "July 7, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Flattering, Feminine, and Super Comfortable!",
        "body": "The fabric feels lightweight and breathable, and it doesn’t wrinkle easily, which is great for travel. I wore it to brunch and got several compliments! It’s cute enough for a date or casual outing but can also be dressed up with heels and jewelry. Definitely a great value for the price. Read more",
        "author": "Mx Hernandez",
        "rating": 5.0,
        "date": "October 23, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Great quality and fit",
        "body": "Loved this dress as soon as I pulled it out of the package. Great quality and fits great. Is super comfortable. This was about my 10th dress I have tried on for an upcoming event and finally found the one! I am 5’2 and it’s hard to find the perfect length but I did! Read more",
        "author": "Tabatha Findley",
        "rating": 5.0,
        "date": "November 26, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Dress is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.",
  "about_this_item": "Womens Dress is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.",
  "long_description": "Womens Dress is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Mint Green, Red, White, Blue, Yellow, Black. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Dress is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Mint Green, Red, White, Blue, Yellow, Black. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "5979281c-e45f-47c6-8c47-3d194f37ff44",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5979281c-e45f-47c6-8c47-3d194f37ff44/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5979281c-e45f-47c6-8c47-3d194f37ff44/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "40d04832-8560-49e4-b9f2-b78fdbb1cc2a",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/40d04832-8560-49e4-b9f2-b78fdbb1cc2a/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/40d04832-8560-49e4-b9f2-b78fdbb1cc2a/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "bf12aaa2-0d52-46da-a55c-c917ea70195c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bf12aaa2-0d52-46da-a55c-c917ea70195c/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bf12aaa2-0d52-46da-a55c-c917ea70195c/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "4b7dfe20-820f-436f-8c2d-2f27a5af218f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4b7dfe20-820f-436f-8c2d-2f27a5af218f/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4b7dfe20-820f-436f-8c2d-2f27a5af218f/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "8f305ace-268a-4af7-bc3a-6e5095baddac",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8f305ace-268a-4af7-bc3a-6e5095baddac/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8f305ace-268a-4af7-bc3a-6e5095baddac/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "0e3673a7-09e4-40ec-842b-673b7d2c461d",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0e3673a7-09e4-40ec-842b-673b7d2c461d/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0e3673a7-09e4-40ec-842b-673b7d2c461d/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "c0730ebb-8ecb-4f83-8489-98d95b27afb2",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c0730ebb-8ecb-4f83-8489-98d95b27afb2/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c0730ebb-8ecb-4f83-8489-98d95b27afb2/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "7859f334-0714-4e65-aa25-f1061f7c5a82",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7859f334-0714-4e65-aa25-f1061f7c5a82/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7859f334-0714-4e65-aa25-f1061f7c5a82/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "79d26bdc-1644-409e-8471-b0ed10bcf2b9",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/79d26bdc-1644-409e-8471-b0ed10bcf2b9/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/79d26bdc-1644-409e-8471-b0ed10bcf2b9/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "337c5758-55b1-4a18-afea-462c6bc4f45c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/337c5758-55b1-4a18-afea-462c6bc4f45c/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/337c5758-55b1-4a18-afea-462c6bc4f45c/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "959c30f3-585e-49f4-bdd0-e32cfa34735c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/959c30f3-585e-49f4-bdd0-e32cfa34735c/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/959c30f3-585e-49f4-bdd0-e32cfa34735c/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Mint Green": "https://m.media-amazon.com/images/I/41FQGvJXTGL._AC_SR38,50_.jpg",
    "Red": "https://m.media-amazon.com/images/I/41AcGXiSI2L._AC_SR38,50_.jpg",
    "White": "https://m.media-amazon.com/images/I/31I1cUa9TUL._AC_SR38,50_.jpg",
    "Blue": "https://m.media-amazon.com/images/I/41cxkvrOIgL._AC_SR38,50_.jpg",
    "Yellow": "https://m.media-amazon.com/images/I/319vRG5E8kL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/41ied8c4TPL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Mint Green": "71c4RJC9SmL",
    "Red": "610c+v0jCoL",
    "White": "615rmgyupRL",
    "Blue": "71nENm7U+OL",
    "Yellow": "71AjI1KqbxL",
    "Black": "71hImJXJ1BL"
  },
  "color_images": {
    "Mint Green": [
      "https://m.media-amazon.com/images/I/71c4RJC9SmL._SL1500_.jpg"
    ],
    "Red": [
      "https://m.media-amazon.com/images/I/610c+v0jCoL._SL1500_.jpg"
    ],
    "White": [
      "https://m.media-amazon.com/images/I/615rmgyupRL._SL1500_.jpg"
    ],
    "Blue": [
      "https://m.media-amazon.com/images/I/71nENm7U+OL._SL1500_.jpg"
    ],
    "Yellow": [
      "https://m.media-amazon.com/images/I/71AjI1KqbxL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/71hImJXJ1BL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-sleeveless-maxi",
      "title": "Womens Maxi Dress Sleeveless Maxi",
      "price": 48.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71qwUjryGiL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 43.69,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61-pFN+nfgL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-bodycon",
      "title": "Womens Maxi Dress Maxi Bodycon",
      "price": 36.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61o6MKJoZLL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-one-shoulder-formal-mermaid-bodycon-evening-maxi",
      "title": "Womens Maxi Dress One Shoulder Formal Mermaid Bodycon Evening Maxi",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71mgUBuGwhL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-v-neck-short-sleeve",
      "title": "Womens Dress V Neck Short Sleeve",
      "price": 34.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71T+iJeFITL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress-cocktail-ruched-evening-split",
      "title": "Womens Dress Cocktail Ruched Evening Split",
      "price": 29.69,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/61003bnFhAS._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-maxi",
      "title": "Womens Maxi Dress Formal Maxi",
      "price": 64.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/61RWPo72AmL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-mermaid-one-shoulder",
      "title": "Womens Maxi Dress Mermaid One Shoulder",
      "price": 238.74,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51lR3NNtXCL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-maxi-formal-long-sleeve-v-neck",
      "title": "Womens Maxi Dress Cocktail Maxi Formal Long Sleeve V Neck",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61cfJoIR5bL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-bodycon-ruched",
      "title": "Womens Maxi Dress Cocktail Bodycon Ruched",
      "price": 49.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51+rVhgLHSL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-formal",
      "title": "Womens Dress Formal",
      "price": 75.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51TVxkZ3J2L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening",
      "title": "Womens Maxi Dress Formal Evening",
      "price": 64.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/516ScMrYzlL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-ruched-bodycon-v-neck",
      "title": "Womens Maxi Dress Long Sleeve Ruched Bodycon V Neck",
      "price": 33.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51AvldIvTmL._SL1500_.jpg"
      ]
    }
  ]
}