{
  "id": "womens-dress-cocktail-evening-formal",
  "handle": "womens-dress-cocktail-evening-formal",
  "sku": "JC2797",
  "asin": "B0DPG95XHV",
  "title": "Womens Dress Cocktail Evening Formal",
  "title_original": "Wedding Guest Dresses for Women Have Pockets Cocktail Dress Ruffle Sleeve A Line Evening Party Formal Dresses for Women",
  "brand": "QMZ",
  "price": 58.82,
  "social_proof": {
    "bought_past_month": 880,
    "text": "880+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/61kElF9x3hL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81W5uj3f68L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81OEV-2LnrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/813G+2H0leL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81okcFXi44L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/813TeOvcL3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71JZyoKmTHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71mQwOod+EL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71KyYfr1SML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71xZ44X6LIL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71bo1RRDftL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71lJO619NjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71wfNTH4sjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ICEUdNUlL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ZIrPPUS9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71RgtGD52eL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/61kElF9x3hL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81W5uj3f68L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81OEV-2LnrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/813G+2H0leL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81okcFXi44L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/813TeOvcL3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71JZyoKmTHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71mQwOod+EL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71KyYfr1SML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71xZ44X6LIL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71bo1RRDftL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71lJO619NjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71wfNTH4sjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ICEUdNUlL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ZIrPPUS9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71RgtGD52eL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Date First Available ‏": "‎ March 23, 2025",
    "ASIN ‏": "‎ B0F27H93CB",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#76,847 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #288 in Women's Formal Dresses",
    "Customer Reviews": "4.1 4.1 out of 5 stars (352)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Dark Green",
      "Purple",
      "Yellow",
      "Burgundy",
      "Peacock Blue",
      "Royal Blue",
      "Army Green",
      "Black",
      "Bright Red",
      "Coffee",
      "Navy Blue"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.1,
    "count": 352,
    "customers_say": "Customers find the dress fits true to size and appreciate its elegant design, with one noting the pretty broche-type pin at the waist. Moreover, the dress is well-made, comfortable, and flattering for various body types, with one customer mentioning how it minimizes curves. Additionally, they like the color options and appreciate the pockets, with one noting they are deep enough to hold items. However, the fabric weight receives mixed feedback, with some finding it lightweight while others describe it as heavy. Generated from the text of customer reviews Select to learn more Fit (63) Elegance (57) Quality (41) Color (27) Comfort (24) Flattering (22) Pockets (22) Fabric weight (28) 63 customers mention fit, 57 positive, 6 negative 63 customers mention \"Fit\" 57 positive 6 negative Customers are satisfied with how the dress fits, noting it runs true to size and moves well. \" ...I loved the color and the fit was perfect, true to size . I wore it for a southern style wedding in October. When I washed it, it came out perfect. \" Read more \" This dress showed up quickly and fit great - was very pretty and I will wear again. Fit true to size and had pockets - which I loved! \" Read more \" It’s fits great , thick fabric, the brooch gems were green, a bit loose on top for the girlies that are small chested. \" Read more \" This dress is absolutely gorgeous. It fit perfectly . I got a size large. I am 5'6\" and weigh 165. The broche type pin for the waist is so pretty!!... \" Read more 57 customers mention elegance, 55 positive, 2 negative 57 customers mention \"Elegance\" 55 positive 2 negative Customers find the dress elegant, describing it as gorgeous, with one customer particularly appreciating the pretty broche-type pin for the waist. \" Beautiful dress , color is wonderful, fabric is no-iron. Size 12 fits a 38\" bust & 32\" waist. I'm 5'7\" tall, & back hem just reaches my ankles.... \" Read more \" Beautiful and did fit perfectly. Good fabric. Love it. Thank you \" Read more \" This was a very nice dress , well made maybe a little too heavy but nice.... \" Read more \" Excellent dress - elegant and stylish, sits and fits well for the size. Wore it to a wedding - was perfect for the occasion. \" Read more 41 customers mention quality, 40 positive, 1 negative 41 customers mention \"Quality\" 40 positive 1 negative Customers find the dress well-made and beautiful, with one customer mentioning it was perfect for their daughter's wedding. \" Great dress , wrong color broche... \" Read more \" The dress was well made . The length was perfect. The material was very soft. It was a great wedding guest dress. The color was very flattering. \" Read more \" Love the dress ! Love the color (teal)! I got a 3x because sixes usually run small. It is slightly too large but still looks great!... \" Read more \" Nice dress , especially for the price! It fits and has flattering shape for my inverted triangle body type.... \" Read more 27 customers mention color, 21 positive, 6 negative 27 customers mention \"Color\" 21 positive 6 negative Customers like the dress's color, with some finding it pretty, and one mentioning it matches the size description accurately. \" Pretty color , good quality. I’d like to see it made from a different fabric…a bit lighter fabric! \" Read more \" This was the perfect black dress for a semi-formal event. \" Read more \" ...It was a great wedding guest dress. The color was very flattering . \" Read more \" ...I need 2 sizes larger than normal. Color isn't as vibrant as pictured either. \" Read more 24 customers mention comfort, 24 positive, 0 negative 24 customers mention \"Comfort\" 24 positive 0 negative Customers find the dress comfortable. \" This dress is so comfortable and elegant but has pockets!! Lucky for me I have two weddings I can wear this at.... \" Read more \" ...It blended in great. The dress was very comfortable . The size was just right and the cut was very flattering on my figure.... \" Read more \" Comfy and the pockets were a huge plus! \" Read more \" True to size. Comfortable to wear . Elegant style for wedding and formal dinner. \" Read more 22 customers mention flattering, 19 positive, 3 negative 22 customers mention \"Flattering\" 19 positive 3 negative Customers find the dress flattering for various body types, with one mentioning how it gathers at the waist and another noting how it minimizes curves. \" Fit is great! Very flattering yet comfortable to wear. Love the length. Wore to an awards banquet and received many compliments. \" Read more \" Beautiful quality dress, flattering fit ... \" Read more \" Dress is very pretty and flattering ! I only had to return as I struggle with needing a smaller size on top. \" Read more \" The dress measurements were perfect. The dress was flattering and comfortable. It was great price. \" Read more 22 customers mention pockets, 20 positive, 2 negative 22 customers mention \"Pockets\" 20 positive 2 negative Customers appreciate the dress's pockets, with one mentioning they are deep enough to hold items. \" ... Has pockets . Fits well and looks good on a larger woman (XL) 5’5” 160 pounds. Ready for a cocktail party or as a wedding guest. Very dressy. \" Read more \" ...The color is rich looking and it has pockets . Pockets are a plus! The top part of the dress is lined and the split skirt is an illusion.... \" Read more \" I love this dress. Great cut, flattering for any figure. Love the pockets ! I always get compliments when I wear this dress. Flattering:... \" Read more \" ...Fit true to size and had pockets - which I loved! \" Read more 28 customers mention fabric weight, 14 positive, 14 negative 28 customers mention \"Fabric weight\" 14 positive 14 negative Customers have mixed opinions about the fabric weight of the dress, with some finding it not too heavy while others say it's a little heavy. \" Really a lovely dress. The fabric is heavy enough that it hangs well. I am 5’4” and weight 150. The Large size was a glove fit.... \" Read more \" 5'5\" 158lbs Size 10 (L) - Very pretty on. Material is heavy though and was too hot for our April event.... \" Read more \" The dress is so comfortable, light weight for a summer wedding and the color was perfect, material is of good quality.... \" Read more \" ...The dress looked very chic good value. The issues I had was the dress was heavy and the fabric made me very hot.... \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Beautiful Dress..Nice Fit",
        "body": "Beautiful dress! Dress is well made. Nice material (heavy enough to wear in fall weather). The length was perfect for me. I'm 5'5. I ordered a size XL. I generally wear size 14/16. Will be ordering another color. I did have to adjust the decorative brooch that came with the dress. Read more",
        "author": "T. Hill",
        "rating": 5.0,
        "date": "November 6, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Perfect dress found!!!",
        "body": "Fit perfectly and style was flattering to my shape. Fabric is thick yet stretchy, can handle the elements and movement, and not see-thru. I received many compliments on dress look and color (I ordered the yellow). Used it for my brother’s coastal wedding and was best choice!! It looked better than a dress from Nordstrom that was 3x the price! So comfortable- was able to sit, dance and move easily in it. I want one in a few more colors!! Read more",
        "author": "NotErn",
        "rating": 5.0,
        "date": "November 17, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars This dress is devine.",
        "body": "This dress is gorgeous and true to colour. It comes with two pockets that are deep enough to hold things not just for show. The dress looked very chic good value. The issues I had was the dress was heavy and the fabric made me very hot. Would not recommend wearing in summer or in tropics if you will not be in air conditioning. The fabric clung in all the right places. Read more",
        "author": "book worm",
        "rating": 4.0,
        "date": "August 30, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Elegant but comfy!",
        "body": "This dress is so comfortable and elegant but has pockets!! Lucky for me I have two weddings I can wear this at. Great Quality, fits to size, it flows gracefully because the fabric is light feeling. Read more",
        "author": "Louis & Melissa Herzner",
        "rating": 5.0,
        "date": "September 16, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/718IlFoK3JL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "3.0 out of 5 stars Material quality is good. Has pockets, which is nice.",
        "body": "The dress is nice. I like the fit and the style. Not to sure about the top, it has a slanted bodice, which I didn’t notice in the picture and comes a little low and shows my underclothing. Also, the jewel on the front is cheap looking and is green, not blue to match the dress. Haven’t decided if I will keep. I will likely return. Read more",
        "author": "Customer",
        "rating": 3.0,
        "date": "June 5, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars True to size",
        "body": "This dress is worth every penny. I loved the color and the fit was perfect, true to size. I wore it for a southern style wedding in October. When I washed it, it came out perfect. Read more",
        "author": "CH",
        "rating": 5.0,
        "date": "November 18, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Beautiful semi formal dress!",
        "body": "The fit was perfect. The material was medium weight. It is a beautiful dress that just hangs and flows beautifully. I wore it to my granddaughter’s fall wedding. My sister borrowed it for a Christmas event because she liked it so much! I would buy again! Olive green color! Read more",
        "author": "Pat",
        "rating": 5.0,
        "date": "November 19, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Pretty good for the price!",
        "body": "I needed a last-minute short-sleeve dress for a wedding this coming weekend since the weather's going to be much warmer than usual so I bought this one in \"coffee.\" First, the color: colors aren't always easy when buying online so know that this shade looks more like \"coffee with cream.\" It's brown but it's a light brown. The fabric is kind of heavy. Personally, I really like the weight but if you want something light and breathable, you won't like this. The fabric itself looks like crêpe and it has a little stretch to it, too. It has a zipper but I didn't need it. Also, be aware that the neckline is intentionally asymetrical. The flutter sleeves are nice and roomy and the skirt part has great twirl factor!. Oh. And. IT HAS POCKETS!! They're not *deep deep* but they're totally deep enough for me to shove my hands into. A habit. #sorrynotsorry The gemstone thing is just a brooch and it easily comes off if you don't like it. I'm a little busty and, if you are too, know that it hangs weirdly on the dress. It makes the brooch look like it's hanging off your boob. If you're an A or B cup, though, you'll be fine! I'll definitely use the brooch on something else but this dress looks great without it. I normally wear size L but I bought this dress in a size XL. I'm so glad I did - XL was perfect. For context, I'm 5'5\" and weigh 158 lbs - normally a size US 14 or a snug size 12. Read more",
        "author": "Chicago Kelley",
        "rating": 4.0,
        "date": "October 1, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Dress Cocktail Evening Formal is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.",
  "about_this_item": "Womens Dress Cocktail Evening Formal is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.",
  "long_description": "Womens Dress Cocktail Evening Formal is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Dark Green, Purple, Yellow, Burgundy, Peacock Blue, Royal Blue, Army Green, Black, Bright Red, Coffee, Navy Blue. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Dress Cocktail Evening Formal is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Dark Green, Purple, Yellow, Burgundy, Peacock Blue, Royal Blue, Army Green, Black, Bright Red, Coffee, Navy Blue. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "3ab05254-983f-4329-ad7d-9b45d29cbf82",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3ab05254-983f-4329-ad7d-9b45d29cbf82/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3ab05254-983f-4329-ad7d-9b45d29cbf82/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/d0f9074b-208b-430c-91ba-a4c4d576c898.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "2349dd63-055f-44f4-be75-6b26ca78083c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2349dd63-055f-44f4-be75-6b26ca78083c/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2349dd63-055f-44f4-be75-6b26ca78083c/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/d0f9074b-208b-430c-91ba-a4c4d576c898.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "34d23045-d5e4-48eb-b319-bfa93e965db7",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/34d23045-d5e4-48eb-b319-bfa93e965db7/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/34d23045-d5e4-48eb-b319-bfa93e965db7/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/d0f9074b-208b-430c-91ba-a4c4d576c898.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "79af1f92-f06f-4b84-9301-9db0fa725139",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/79af1f92-f06f-4b84-9301-9db0fa725139/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/79af1f92-f06f-4b84-9301-9db0fa725139/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/d0f9074b-208b-430c-91ba-a4c4d576c898.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "d05ea450-600b-41b4-be8b-c21b03665f55",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d05ea450-600b-41b4-be8b-c21b03665f55/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d05ea450-600b-41b4-be8b-c21b03665f55/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/d0f9074b-208b-430c-91ba-a4c4d576c898.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "ddae32fa-8420-4ebb-894c-21cd8d3d01a9",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ddae32fa-8420-4ebb-894c-21cd8d3d01a9/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ddae32fa-8420-4ebb-894c-21cd8d3d01a9/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/d0f9074b-208b-430c-91ba-a4c4d576c898.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "ab00b2b2-9d72-4ef0-ad32-6ae5edc0f953",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ab00b2b2-9d72-4ef0-ad32-6ae5edc0f953/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ab00b2b2-9d72-4ef0-ad32-6ae5edc0f953/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/d0f9074b-208b-430c-91ba-a4c4d576c898.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "2573880d-335f-4d13-ae6d-fa3ab399342e",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2573880d-335f-4d13-ae6d-fa3ab399342e/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2573880d-335f-4d13-ae6d-fa3ab399342e/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/d0f9074b-208b-430c-91ba-a4c4d576c898.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "ef3f1b7e-ea23-4709-9aeb-eeb6939cc014",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ef3f1b7e-ea23-4709-9aeb-eeb6939cc014/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ef3f1b7e-ea23-4709-9aeb-eeb6939cc014/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/d0f9074b-208b-430c-91ba-a4c4d576c898.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "67601ee2-85fc-4253-a564-5e5cedf50a65",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/67601ee2-85fc-4253-a564-5e5cedf50a65/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/67601ee2-85fc-4253-a564-5e5cedf50a65/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/d0f9074b-208b-430c-91ba-a4c4d576c898.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "0cc376b6-1875-4ec4-a37a-8312dd389cf7",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0cc376b6-1875-4ec4-a37a-8312dd389cf7/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0cc376b6-1875-4ec4-a37a-8312dd389cf7/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/d0f9074b-208b-430c-91ba-a4c4d576c898.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Dark Green": "https://m.media-amazon.com/images/I/41WREx0Q-jL._AC_SR38,50_.jpg",
    "Purple": "https://m.media-amazon.com/images/I/41iU7NZXpbL._AC_SR38,50_.jpg",
    "Yellow": "https://m.media-amazon.com/images/I/41JNdJ0j8CL._AC_SR38,50_.jpg",
    "Burgundy": "https://m.media-amazon.com/images/I/410D1m0-PSL._AC_SR38,50_.jpg",
    "Peacock Blue": "https://m.media-amazon.com/images/I/41uvYU0o3bL._AC_SR38,50_.jpg",
    "Royal Blue": "https://m.media-amazon.com/images/I/41xT5iQYKML._AC_SR38,50_.jpg",
    "Army Green": "https://m.media-amazon.com/images/I/41Oij32TpWL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/414AknPLsYL._AC_SR38,50_.jpg",
    "Bright Red": "https://m.media-amazon.com/images/I/41l9l+ht3IL._AC_SR38,50_.jpg",
    "Coffee": "https://m.media-amazon.com/images/I/416DA2uzDiL._AC_SR38,50_.jpg",
    "Navy Blue": "https://m.media-amazon.com/images/I/41JqBQ4gu0L._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Dark Green": "71JZyoKmTHL",
    "Purple": "71mQwOod+EL",
    "Yellow": "71KyYfr1SML",
    "Burgundy": "71xZ44X6LIL",
    "Peacock Blue": "71bo1RRDftL",
    "Royal Blue": "71lJO619NjL",
    "Army Green": "71wfNTH4sjL",
    "Black": "61kElF9x3hL",
    "Bright Red": "71ICEUdNUlL",
    "Coffee": "71ZIrPPUS9L",
    "Navy Blue": "71RgtGD52eL"
  },
  "color_images": {
    "Dark Green": [
      "https://m.media-amazon.com/images/I/71JZyoKmTHL._SL1500_.jpg"
    ],
    "Purple": [
      "https://m.media-amazon.com/images/I/71mQwOod+EL._SL1500_.jpg"
    ],
    "Yellow": [
      "https://m.media-amazon.com/images/I/71KyYfr1SML._SL1500_.jpg"
    ],
    "Burgundy": [
      "https://m.media-amazon.com/images/I/71xZ44X6LIL._SL1500_.jpg"
    ],
    "Peacock Blue": [
      "https://m.media-amazon.com/images/I/71bo1RRDftL._SL1500_.jpg"
    ],
    "Royal Blue": [
      "https://m.media-amazon.com/images/I/71lJO619NjL._SL1500_.jpg"
    ],
    "Army Green": [
      "https://m.media-amazon.com/images/I/71wfNTH4sjL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/61kElF9x3hL._SL1500_.jpg"
    ],
    "Bright Red": [
      "https://m.media-amazon.com/images/I/71ICEUdNUlL._SL1500_.jpg"
    ],
    "Coffee": [
      "https://m.media-amazon.com/images/I/71ZIrPPUS9L._SL1500_.jpg"
    ],
    "Navy Blue": [
      "https://m.media-amazon.com/images/I/71RgtGD52eL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-long-sleeve-maxi",
      "title": "Womens Maxi Dress Long Sleeve Maxi",
      "price": 19.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71XYDBVpzaL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-bodycon-formal-maxi",
      "title": "Womens Maxi Dress Long Sleeve Bodycon Formal Maxi",
      "price": 42.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61G-sMJRi5L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-off-shoulder-long-sleeve",
      "title": "Womens Maxi Dress Off Shoulder Long Sleeve",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71jFKbUARjL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-one-shoulder-long-sleeve-evening",
      "title": "Womens Maxi Dress Formal One Shoulder Long Sleeve Evening",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61IAExJcrzL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 37.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/613fdSJqbAL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-sleeveless-evening-ruched-one-shoulder-formal-bodycon",
      "title": "Womens Maxi Dress Sleeveless Evening Ruched One Shoulder Formal Bodycon",
      "price": 53.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/512S0vLGDkL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-long-sleeve-formal",
      "title": "Womens Maxi Dress Cocktail Long Sleeve Formal",
      "price": 44.64,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/61+63JLKAFL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-sleeveless-bodycon",
      "title": "Womens Dress Sleeveless Bodycon",
      "price": 23.45,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61I+nA44lyL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail-evening",
      "title": "Womens Dress Cocktail Evening",
      "price": 44.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61Q-pqILlHL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail",
      "title": "Womens Dress Cocktail",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51ZsV-asyZL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-long-sleeve-mermaid-evening-maxi",
      "title": "Womens Maxi Dress Formal Long Sleeve Mermaid Evening Maxi",
      "price": 72.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51BTOKJlAdL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-formal-evening",
      "title": "Womens Dress Formal Evening",
      "price": 74.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61Er9CvHl3L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-ruched-v-neck-bodycon",
      "title": "Womens Maxi Dress Long Sleeve Ruched V Neck Bodycon",
      "price": 52.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51P9ot37JEL._SL1500_.jpg"
      ]
    }
  ]
}