{
  "id": "womens-dress-cocktail-sleeveless",
  "handle": "womens-dress-cocktail-sleeveless",
  "sku": "JC3191",
  "asin": "B0DQ4Y91NH",
  "title": "Womens Dress Cocktail Sleeveless",
  "title_original": "Zattcas Womens 2025 Spring Summer Square Neck Sleeveless Flowy Swing Midi Dress Wedding Guest Prom Cocktail Party Dress",
  "brand": "Visit the Zattcas Store",
  "price": 14.99,
  "social_proof": {
    "bought_past_month": 310,
    "text": "310+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/61HI+q0TWfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71SSMFcgSHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71H74Bg2gvL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71tU6wTadtL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71P4ApUQ29L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61MWt5UI6QL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71PCZIkpFQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71VrDB4DdgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71bsRo-65nL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Ra+GvkDWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71hww-UdeuL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/61HI+q0TWfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71SSMFcgSHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71H74Bg2gvL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71tU6wTadtL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71P4ApUQ29L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61MWt5UI6QL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71PCZIkpFQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71VrDB4DdgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71bsRo-65nL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Ra+GvkDWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71hww-UdeuL._SL1500_.jpg"
  ],
  "aplus_images": [
    "https://m.media-amazon.com/images/I/31S9lTEVP1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31nJKMaihDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/314RKE1JGnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31D7ArD-asL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31mrPVC%2BueL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31YkRiC7DmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31ZoRr18YJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31WGT4VxD-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41vLzvfce9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41lnjsCbTVL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31iMTLPfFhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31pmNHgkwWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31LXF85xzJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31K-wtNbLhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31JezAgRvPL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/317rgv2v3SL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/4152tDxP-RL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41vntd8ZJ2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41IBDlijpIL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41w3dhXR5nL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/316QALVj%2BlL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31Hgj1XEpbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31cNa8txyZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41VM1qU3v3L._SL1500_.jpg"
  ],
  "description_images": [
    "https://m.media-amazon.com/images/I/31S9lTEVP1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31nJKMaihDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/314RKE1JGnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31D7ArD-asL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31mrPVC%2BueL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31YkRiC7DmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31ZoRr18YJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31WGT4VxD-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41vLzvfce9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41lnjsCbTVL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31iMTLPfFhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31pmNHgkwWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31LXF85xzJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31K-wtNbLhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31JezAgRvPL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/317rgv2v3SL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/4152tDxP-RL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41vntd8ZJ2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41IBDlijpIL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41w3dhXR5nL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/316QALVj%2BlL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31Hgj1XEpbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31cNa8txyZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41VM1qU3v3L._SL1500_.jpg"
  ],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ December 11, 2024",
    "ASIN ‏": "‎ B0DQ4ZMG23",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#75,175 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #863 in Women's Casual Dresses",
    "Customer Reviews": "4.2 4.2 out of 5 stars (224)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "White",
      "Black"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.2,
    "count": 224,
    "customers_say": "Customers find the dress well-made and versatile, with one mentioning it's perfect for business luncheons. The material is thick, comfortable, and not see-through, and one customer notes it hits just below the knees. While some it's true to size, others mention it runs small, and opinions on value for money are mixed. Select to learn more Quality Fit Elegance Material quality Comfort Material see through Size Value for money 41 customers mention \"Quality\" 34 positive 7 negative Customers find the dress well-made and versatile, noting it can be dressed up for business luncheons and engagement photos. \"For the price this is a great dress , super comfortable and stretchy. I ordered a medium and it fits great I’m 5’4” and 155lbs....\" Read more \" Love this dress !...\" Read more \"Just as advertised. Good material for that price. Love the dress . Will definitely buy another one in a different color.\" Read more \" Nice dress . I don’t usually wear sleeveless, but I’m gonna wear a denim jacket with it\" Read more 33 customers mention \"Fit\" 28 positive 5 negative Customers like how the dress fits, with one mentioning that the length hits just below the knees and another noting that the shoulder sleeves are not too long. \"...154lbs, waist 29.5” hips 39.5” bust 36” and I got a medium and it fits perfectly . Has stretch to it\" Read more \" Fit perfectly . Needed this for an all white event in Jamaica. The material quality was great.\" Read more \"Versatile, great fit , and easy to style...\" Read more \" Beautiful fitting dress . I am 5’6 and 152 wearing a size medium! Very comfortable....\" Read more 30 customers mention \"Elegance\" 27 positive 3 negative Customers find the dress elegant, with one mentioning it feels like a princess wearing it. \"The dress is absolutely beautiful and flowy! It is true to size and such good value for money\" Read more \"This is a beautiful dress that has lining and is not see thru. It fits nicely and I got compliments....\" Read more \"...2. The dress is off-white, not white. While the dress is cute , I do not and will not wear previously used garments when I purchased a new garment\" Read more \" very cute and fits as described. I'm 5'6, 158 lbs and I purchased a large....\" Read more 25 customers mention \"Material quality\" 19 positive 6 negative Customers like the material of the dress, noting that it is nice and thick, with one customer mentioning it has a double-layered feel. \"Fits true to size and good quality material . I like the way it flatters my figure.\" Read more \"I love the dress and the fabric . It’s very comfortable, and it’s fully lined.\" Read more \"...It does not cling to your stomach which is super nice. The Fabric is thicker and feels high quality\" Read more \"I like the design but the fabric is cheap \" Read more 16 customers mention \"Comfort\" 16 positive 0 negative Customers find the dress comfortable. \"...Fabric is soft and comfortable , you can comfortably wear a bra thanks to the straps and neckline, it hugs the waist beautifully. Absolutely love it!\" Read more \"Beautiful fitting dress . I am 5’6 and 152 wearing a size medium! Very comfortable ....\" Read more \"...recommend sizing down, it is extremely stretchy which makes it super comfortable . It does not cling to your stomach which is super nice....\" Read more \"...The color is a true cornflower blue, and the fabric is super comfortable with a good amount of stretch.\" Read more 10 customers mention \"Material see through\" 10 positive 0 negative Customers appreciate that the dress is not see-through, with one customer noting it is lined to prevent this issue, while another mentions it works well for concealing bra straps. \"...white being see through and I’m pleasantly surprised that it is not see through … however the seams are extremely visible which for me is not great....\" Read more \"...It is modest, comfortable, and fit perfect. The material is not see through so I didn’t have to worry about that....\" Read more \"...It is double lined and not see through at all ....\" Read more \"This is a beautiful dress that has lining and is not see thru . It fits nicely and I got compliments....\" Read more 12 customers mention \"Size\" 6 positive 6 negative Customers have mixed experiences with the dress's sizing, with some finding it true to size while others report it being too small. \"It is double layered and NOT see through! It is a good length and true to size . The zipper is on the side of the dress and material is stretchy....\" Read more \"I’m giving this 3 stars because the quality was there, but this dress is HUGE ! I got the smallest size and was swimming in it.\" Read more \"Returned with no issue, it ran small \" Read more \"...going to wear it to a wedding, but when I finally tried it on it was too small . Can I still return the dress please.?\" Read more 11 customers mention \"Value for money\" 7 positive 4 negative Customers have mixed opinions about the dress's value for money. \" Great dress for the price . Light and comfortable. Also it has a zipper on the side if you need. I am 158 5'4 order a Medium, fits perfectly.\" Read more \"...dress although I ordered a medium it was too tight, this was a very expensive dress . Also the packaging was not great....\" Read more \"Just as advertised. Good material for that price . Love the dress. Will definitely buy another one in a different color.\" Read more \"...It did come a bit wrinkly but a really great dress and quality for the price .\" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Versatile, great fit, and easy to style",
        "body": "I'm 5'7\", 125 lbs, and I got the small. This is a WONDERFUL dress. Slight stretch, good material. Once I steam the wrinkles from shipping, I don't think it will wrinkle easily. The length on me is below the knee, which is just what I wanted. I love the wider straps; they don't dig in and they conceal the bra straps. The fit on this is amazing. I'm not gifted with \"huge tracks of land\" if you catch my meaning, and this dress works with that. I can just as easily see it working with ladies with more acreage, but I think if you have over a C cup, you may want to consider the medium. The dress will still fit you well because of the cut. I got the black dress, but I think I'll be getting the apricot as well. This is a great staple piece for your wardrobe. Read more",
        "author": "Shauna Ow",
        "rating": 5.0,
        "date": "October 14, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61LPHpLY+YL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/51XBrHvx+EL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71TtSp-ZdDL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71A5UFthqtL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Cute versatile dress",
        "body": "This dress is a soft, silky, and nice heavy knit material. I bought it for Halloween Belle costume, but plan on wearing it more than just halloween! It is cute as is or layered with shirts under (see white dress under), turtle necks, sweaters / tops over it, or just wearing as is! For reference I am 5’9” 154lbs, waist 29.5” hips 39.5” bust 36” and I got a medium and it fits perfectly. Has stretch to it Read more",
        "author": "Abs0fsteel",
        "rating": 5.0,
        "date": "October 18, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71jrotRJYEL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/712lALkiyBL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71MGdWFLRgL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "4.0 out of 5 stars Great!",
        "body": "Love this dress!! worked perfect for my bridal shower, I would recommend sizing down, it is extremely stretchy which makes it super comfortable. It does not cling to your stomach which is super nice. The Fabric is thicker and feels high quality Read more",
        "author": "Lilly",
        "rating": 4.0,
        "date": "June 12, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Simple but classic",
        "body": "It fit me perfectly, and was so pretty for an autumn wedding. Read more",
        "author": "Customer",
        "rating": 5.0,
        "date": "November 25, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Cheap fabric",
        "body": "I like the design but the fabric is cheap Read more",
        "author": "ALICIA REYES",
        "rating": 3.0,
        "date": "November 22, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Perfect Wedding attire",
        "body": "This fit me perfect i wear a size xl, 5’7 and 220. Color is so pretty and bright. Perfect to dance in all night at a wedding so comfy and lightweight. It did come a bit wrinkly but a really great dress and quality for the price. Read more",
        "author": "Deanna simon",
        "rating": 5.0,
        "date": "October 6, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "1.0 out of 5 stars This dress stinks",
        "body": "Stitching is crooked, material is thin and feels like something a costume would be made of. Neckline is not even-it slants to the left, and it is much shorter than anticipated. The darts down the front are awkward. This is just an awful dress. The $14 price tag isn't even enough to entice me to keep it. Read more",
        "author": "Lisa",
        "rating": 1.0,
        "date": "September 20, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Perfect all occasion dress",
        "body": "fits perfectly, great material, hides bulges Read more",
        "author": "Jo F",
        "rating": 5.0,
        "date": "December 11, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Dress Cocktail Sleeveless is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.",
  "about_this_item": "Womens Dress Cocktail Sleeveless is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.",
  "long_description": "Womens Dress Cocktail Sleeveless is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: White, Black. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Dress Cocktail Sleeveless is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/31S9lTEVP1L._SL1500_.jpg",
      "alt": "Womens Dress Cocktail Sleeveless details image 1"
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/31nJKMaihDL._SL1500_.jpg",
      "alt": "Womens Dress Cocktail Sleeveless details image 2"
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/314RKE1JGnL._SL1500_.jpg",
      "alt": "Womens Dress Cocktail Sleeveless details image 3"
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/31D7ArD-asL._SL1500_.jpg",
      "alt": "Womens Dress Cocktail Sleeveless details image 4"
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: White, Black. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/31mrPVC%2BueL._SL1500_.jpg",
      "alt": "Womens Dress Cocktail Sleeveless details image 5"
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "56a80434-fb70-4478-bc3d-24c624a45cd2",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/56a80434-fb70-4478-bc3d-24c624a45cd2/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/56a80434-fb70-4478-bc3d-24c624a45cd2/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/82c43e56-058b-4c06-b43b-c9d03525c489.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "e1761501-b139-45a8-8d96-2431d123547b",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e1761501-b139-45a8-8d96-2431d123547b/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e1761501-b139-45a8-8d96-2431d123547b/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/82c43e56-058b-4c06-b43b-c9d03525c489.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "4833c1cd-ac48-4150-b3bb-18bc25ae34fe",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4833c1cd-ac48-4150-b3bb-18bc25ae34fe/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4833c1cd-ac48-4150-b3bb-18bc25ae34fe/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/82c43e56-058b-4c06-b43b-c9d03525c489.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "ff4693e3-c9df-4ccb-91ba-58027b6952f9",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ff4693e3-c9df-4ccb-91ba-58027b6952f9/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ff4693e3-c9df-4ccb-91ba-58027b6952f9/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/82c43e56-058b-4c06-b43b-c9d03525c489.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "8c4f2a18-d1e9-44ef-ae41-48cc0629f2f7",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8c4f2a18-d1e9-44ef-ae41-48cc0629f2f7/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8c4f2a18-d1e9-44ef-ae41-48cc0629f2f7/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/82c43e56-058b-4c06-b43b-c9d03525c489.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "b07bcac1-3f46-4e2c-99e6-662007255bde",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b07bcac1-3f46-4e2c-99e6-662007255bde/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b07bcac1-3f46-4e2c-99e6-662007255bde/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/82c43e56-058b-4c06-b43b-c9d03525c489.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "bbb7f52c-381e-49cc-a926-95a55c9ecd8c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bbb7f52c-381e-49cc-a926-95a55c9ecd8c/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bbb7f52c-381e-49cc-a926-95a55c9ecd8c/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/82c43e56-058b-4c06-b43b-c9d03525c489.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "946d189b-094e-4455-be62-2db0f486d97f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/946d189b-094e-4455-be62-2db0f486d97f/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/946d189b-094e-4455-be62-2db0f486d97f/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/82c43e56-058b-4c06-b43b-c9d03525c489.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "31d6de08-65ba-4cab-9629-a6709f870527",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/31d6de08-65ba-4cab-9629-a6709f870527/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/31d6de08-65ba-4cab-9629-a6709f870527/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/82c43e56-058b-4c06-b43b-c9d03525c489.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "68aa5229-011a-4034-bb96-ae0c76dbbb40",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/68aa5229-011a-4034-bb96-ae0c76dbbb40/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/68aa5229-011a-4034-bb96-ae0c76dbbb40/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/82c43e56-058b-4c06-b43b-c9d03525c489.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "5e6bb574-3fcf-4812-a4a3-e4fb50384189",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5e6bb574-3fcf-4812-a4a3-e4fb50384189/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5e6bb574-3fcf-4812-a4a3-e4fb50384189/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/82c43e56-058b-4c06-b43b-c9d03525c489.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "8f4ca2d3-cea6-41e9-99d2-204977e63f48",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8f4ca2d3-cea6-41e9-99d2-204977e63f48/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8f4ca2d3-cea6-41e9-99d2-204977e63f48/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/82c43e56-058b-4c06-b43b-c9d03525c489.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "White": "https://m.media-amazon.com/images/I/31W4REOn7qL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31uO8v2w80L._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "White": "61HI+q0TWfL",
    "Black": "61MWt5UI6QL"
  },
  "color_images": {
    "White": [
      "https://m.media-amazon.com/images/I/61HI+q0TWfL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71SSMFcgSHL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71H74Bg2gvL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71tU6wTadtL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71P4ApUQ29L._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/61MWt5UI6QL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71PCZIkpFQL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71VrDB4DdgL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71bsRo-65nL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71Ra+GvkDWL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71hww-UdeuL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 44.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/81+PWHqLTjL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-bodycon-sleeveless-cocktail-ruched-v-neck",
      "title": "Womens Dress Bodycon Sleeveless Cocktail Ruched V Neck",
      "price": 56.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61vGL0kNJYL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-long-sleeve-ruched",
      "title": "Womens Maxi Dress Bodycon Long Sleeve Ruched",
      "price": 48.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61GxtvdkbCL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-bodycon",
      "title": "Womens Dress Bodycon",
      "price": 44.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71f2SHW7r3L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-long-sleeve-ruched-cocktail-off-shoulder-bodycon",
      "title": "Womens Maxi Dress Formal Long Sleeve Ruched Cocktail Off Shoulder Bodycon",
      "price": 46.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71xihJgY9BL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-bodycon-ruched-long-sleeve",
      "title": "Womens Maxi Dress Bodycon Ruched Long Sleeve",
      "price": 24.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61qiT1BxzSL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-cocktail-formal-off-shoulder",
      "title": "Womens Maxi Dress Evening Cocktail Formal Off Shoulder",
      "price": 115.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/81sAnoK5v1L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-mermaid-evening-formal",
      "title": "Womens Maxi Dress Mermaid Evening Formal",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71r8V4721qL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 155.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61Oyv4QLL-L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail-short-sleeve",
      "title": "Womens Dress Cocktail Short Sleeve",
      "price": 36.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/51VJVq72XsL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-v-neck-formal-long-sleeve",
      "title": "Womens Maxi Dress V Neck Formal Long Sleeve",
      "price": 84.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51LKzkO+MDL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-formal-evening",
      "title": "Womens Maxi Dress Maxi Formal Evening",
      "price": 52.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61NaRoByawL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-maxi",
      "title": "Womens Maxi Dress Long Sleeve Maxi",
      "price": 29.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/614-6WTFsKL._SL1500_.jpg"
      ]
    }
  ]
}