{
  "id": "womens-dress-bodycon",
  "handle": "womens-dress-bodycon",
  "sku": "JC2702",
  "asin": "B0DQY6XK4J",
  "title": "Womens Dress Bodycon",
  "title_original": "Trendy Queen Womens Mini Summer Dresses 2025 Going Out Off The Shoulder Bodycon Sexy Party Club Spring Fashion Outfits",
  "brand": "Visit the Trendy Queen Store",
  "price": 29.99,
  "social_proof": {
    "bought_past_month": 1083,
    "text": "1083+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/61rbnrxsfpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61O9Su9RxOL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51G5m6WYazL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51CLridMo0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71+-hyfifTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61t6Ee6-OhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61VMba3zULL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61f3g-JYsUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61dhm6efy1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61gSJse7SfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61GSwzyBuoL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61vSCXpxYgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61KD9aevYhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Gis3KlubL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61jHTb559HL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61AuUsv3XNL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61fN4f5gkWL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/61rbnrxsfpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61O9Su9RxOL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51G5m6WYazL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51CLridMo0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71+-hyfifTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61t6Ee6-OhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61VMba3zULL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61f3g-JYsUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61dhm6efy1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61gSJse7SfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61GSwzyBuoL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61vSCXpxYgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61KD9aevYhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Gis3KlubL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61jHTb559HL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61AuUsv3XNL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61fN4f5gkWL._SL1500_.jpg"
  ],
  "aplus_images": [
    "https://m.media-amazon.com/images/I/31mAVXD-BpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31yIp%2Bv-HQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31x9NiC2FhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31fI5sjHb3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41ym8jPnvZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31piKjlQLBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/311ZZusmT%2BL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/318lz9aNruL._SL1500_.jpg"
  ],
  "description_images": [
    "https://m.media-amazon.com/images/I/31mAVXD-BpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31yIp%2Bv-HQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31x9NiC2FhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31fI5sjHb3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41ym8jPnvZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31piKjlQLBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/311ZZusmT%2BL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/318lz9aNruL._SL1500_.jpg"
  ],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ January 10, 2025",
    "ASIN ‏": "‎ B0DQY7B8PF",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#10,050 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #27 in Women's Club & Night Out Dresses #147 in Women's Casual Dresses",
    "Customer Reviews": "4.3 4.3 out of 5 stars (629)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Brown",
      "Hotpink",
      "Burgundy",
      "Lightblue",
      "Black",
      "Red",
      "Pink",
      "White",
      "Purple",
      "Yellow",
      "Navyblue",
      "Green",
      "Grey"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.3,
    "count": 629,
    "customers_say": "Customers find the dress form-fitting and appreciate its vibrant color, describing it as a perfect black dress that hugs in all the right places. The material receives positive feedback for its double fabric construction, and customers find it comfortable and flattering. While some it runs true to size, others find it too small. Select to learn more Fit Color Quality Comfort Material quality Flattering See through Size 71 customers mention \"Fit\" 62 positive 9 negative Customers like how the dress fits, describing it as form-fitting and tight. \"...I sized down to a large and it was the perfect fit . The material is compressive. I ordered black.\" Read more \"...I got a small in black , I’m 5ft, 125lbs. It’s very soft and perfect length so I wasn’t worried about my dress rising on a girls night out!...\" Read more \"Super cute. Fits as expected . Hugs in right places and good length.\" Read more \"Cute, it’s a good length not to long or short, quality is alright\" Read more 54 customers mention \"Color\" 52 positive 2 negative Customers like the dress's color, describing it as vibrant and perfect for a black dress, with one customer noting its bodycon style. \"Material is not sheer, great coverage. Super cute . True to size. Easy to wear in summer or fall. Color is true to picture.\" Read more \"this dress was so cute very comfortable and breathable in it made my body flattering. I got so many complaints. the fit runs true to size....\" Read more \"What a beautiful dress . My 14 yo rocked it she’s about 100 lbs n almost 5 tall. Obviously cropped her face out....\" Read more \"This dress is giving me LIFE.....comfortable, good fit, multipurpose, & sexy !!!\" Read more 37 customers mention \"Quality\" 34 positive 3 negative Customers love the quality of this dress, with one describing it as a classic LBD. \"Perfect white dress! Great quality and thicker material. Looked great on my daughter for graduation.\" Read more \" Great dress . I received so many compliments.\" Read more \"Very comfortable and good quality \" Read more \" Amazing dress !...\" Read more 26 customers mention \"Comfort\" 24 positive 2 negative Customers find the dress comfortable. \"...It disappointed me. Though it is comfortable , it’s not leather like the picture makes it seem. The color also isn’t as deep as the picture suggests....\" Read more \"...It's super flattering, comfy , and perfect for warm weather. The fit was just right, and I got so many compliments when I wore it....\" Read more \" Very comfortable and easy to put on. I would say it’s a lot longer than advertised so can probably be worn to a work event or something like that....\" Read more \"Fits super nice, good material and very comfy .\" Read more 25 customers mention \"Material quality\" 20 positive 5 negative Customers like the dress's material, with several noting its double-layered construction and nice feel, while one customer mentions it's not see-through. \"super cute, good material , comfortable and fit very nicely!!\" Read more \"This dress was perfect! It fit well, material was great it was not see through, very comfortable I recommend.\" Read more \"The dress is cute and great material , but it arrived with smoke odor. The odor was strong but had no time to return it as I had an event that day....\" Read more \"True to size. The material does look cheap but matches the price. Not see through. Looks like image.\" Read more 19 customers mention \"Flattering\" 18 positive 1 negative Customers find the dress flattering, with one mentioning it highlights their figure and another noting how it hugs in all the right places. \"Loved this classic l.b.d. Very flattering and versatile. I liked it so much I also bought it in red.\" Read more \"Nice cute summer dress. Hugs in all the right places . Buy it.\" Read more \"I bought this dress for summer and absolutely loved it! It's super flattering , comfy, and perfect for warm weather....\" Read more \"This is so cute and flattering ! Way better than I expected for the price. It is thin but not in a cheap way somehow....\" Read more 19 customers mention \"See through\" 14 positive 5 negative Customers appreciate that the dress is not see-through. \"This dress was perfect! It fit well, material was great it was not see through , very comfortable I recommend.\" Read more \"...It’s nice that it is stretchy and it does not have a zipper. Not see through at all and true to color.\" Read more \"...Ended up returning because it was very see through ....\" Read more \"Daughter bought for bday party. Fit very well and not too revealing . Comfortable throughout the night. She did wear shorts underneath though.\" Read more 20 customers mention \"Size\" 13 positive 7 negative Customers have mixed experiences with the dress's sizing, with some finding it true to size while others report it runs too small. \"Material is not sheer, great coverage. Super cute. True to size . Easy to wear in summer or fall. Color is true to picture.\" Read more \" runs big , should have sized down. overall great dress for the price not see thru at all. 5’0” 135lbs\" Read more \"... Dress is true to size and fits my teenage daughter perfectly. Double layer fabric and seems to be well-made. The dress has lots of versatility!...\" Read more \"Stunning! Comfy and runs true to size . I got a small and it fits perfectly. I’m 5’4 135lbs\" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Love!!",
        "body": "This dress is really beautiful. The fabric is almost like a faux suede, but I think it's just a thick microfiber. It is not see-through, and it has a built-in bra. It feels really soft and looks very elegant. I wore this to dinner with some girlfriends for my birthday. I got a size small and it was stretchy and fit really well. Not too long, not too short, and didn't ride up when I was walking. I'm 5'2.5, 118 lbs, and I got a size small Read more",
        "author": "DuchessDani",
        "rating": 5.0,
        "date": "December 13, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61t3YKqGeqL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars You should buy.",
        "body": "The material is the best. I love its quality as well. The length and comforting is the best. Its really soft as well. Highly recommended. I wore this on my birthday and it was soo cute: Read more",
        "author": "Angie",
        "rating": 5.0,
        "date": "November 10, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars So cute",
        "body": "Super cute. Fits as expected. Hugs in right places and good length. Read more",
        "author": "Jamie",
        "rating": 5.0,
        "date": "December 16, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Classy and stylish Little Black Dress with lots of versatility!!",
        "body": "This Little Black Dress is a bodycon style, so will stretch and mold to your body. Dress is true to size and fits my teenage daughter perfectly. Double layer fabric and seems to be well-made. The dress has lots of versatility! The contemporary and fashionable off-the-shoulder look can be worn with neither, one or both straps off-the-shoulder. Dress can be accessorized and dressed down for a casual look or dressed up for a more formal look. It's almost a perfect little black dress. I would have given this dress 5-Stars, but took 1-Star off because of the fabric. The fabric is the type of texture that will attract every little piece of lint, dryer dust, carpet fiber, pet hair, loose hairs, etc. You will need to use a lint roller EVERY time you pull this dress out of your closet and put it on. So will definitely advise to not roll around on the carpet, cuddle with your dog, or get a haircut while wearing this dress. Read more",
        "author": "Domestic Multitask-er",
        "rating": 4.0,
        "date": "October 4, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Amazing dress",
        "body": "this dress was so cute very comfortable and breathable in it made my body flattering. I got so many complaints. the fit runs true to size. this dress is very stretchy and light weight and the material does not feel cheap and its thick enough to not be see through but not heavy. Read more",
        "author": "Alyssa Adams",
        "rating": 5.0,
        "date": "June 23, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Perfect Little Black Dress",
        "body": "This dress is form fitting but stunning on! It is the perfect LBD. Read more",
        "author": "J. Michelle",
        "rating": 5.0,
        "date": "November 19, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars See through and tight",
        "body": "Very tight and see through Read more",
        "author": "Shan",
        "rating": 3.0,
        "date": "December 10, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars A little long",
        "body": "Very comfortable and easy to put on. I would say it’s a lot longer than advertised so can probably be worn to a work event or something like that. I’m 5’4 and it went past my knees. It’s nice that it is stretchy and it does not have a zipper. Not see through at all and true to color. Read more",
        "author": "Kalyda O’Connor",
        "rating": 4.0,
        "date": "October 9, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Dress Bodycon is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.",
  "about_this_item": "Womens Dress Bodycon is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.",
  "long_description": "Womens Dress Bodycon is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Brown, Hotpink, Burgundy, Lightblue, Black, Red, Pink, White, Purple, Yellow, Navyblue, Green, Grey. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Dress Bodycon is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/31mAVXD-BpL._SL1500_.jpg",
      "alt": "Womens Dress Bodycon details image 1"
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/31yIp%2Bv-HQL._SL1500_.jpg",
      "alt": "Womens Dress Bodycon details image 2"
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/31x9NiC2FhL._SL1500_.jpg",
      "alt": "Womens Dress Bodycon details image 3"
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/31fI5sjHb3L._SL1500_.jpg",
      "alt": "Womens Dress Bodycon details image 4"
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Brown, Hotpink, Burgundy, Lightblue, Black, Red, Pink, White, Purple, Yellow, Navyblue, Green, Grey. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/41ym8jPnvZL._SL1500_.jpg",
      "alt": "Womens Dress Bodycon details image 5"
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "c369e773-cb4f-4d65-beca-30dca01642a1",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c369e773-cb4f-4d65-beca-30dca01642a1/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c369e773-cb4f-4d65-beca-30dca01642a1/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "0d4966d3-2e89-4016-8815-68f388f4ded7",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0d4966d3-2e89-4016-8815-68f388f4ded7/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0d4966d3-2e89-4016-8815-68f388f4ded7/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "0adf5a30-e77a-4b28-9654-54727059e404",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0adf5a30-e77a-4b28-9654-54727059e404/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0adf5a30-e77a-4b28-9654-54727059e404/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "894329b2-8b33-42e8-9acf-1f7e7673e3aa",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/894329b2-8b33-42e8-9acf-1f7e7673e3aa/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/894329b2-8b33-42e8-9acf-1f7e7673e3aa/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "82334625-a018-4036-998b-164c1aa2abfd",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/82334625-a018-4036-998b-164c1aa2abfd/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/82334625-a018-4036-998b-164c1aa2abfd/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "aa301a9a-7bf7-41b1-8262-3fa04b3776d2",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/aa301a9a-7bf7-41b1-8262-3fa04b3776d2/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/aa301a9a-7bf7-41b1-8262-3fa04b3776d2/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Brown": "https://m.media-amazon.com/images/I/319qzUTUAOL._AC_SR38,50_.jpg",
    "Hotpink": "https://m.media-amazon.com/images/I/31dVCz40LZL._AC_SR38,50_.jpg",
    "Burgundy": "https://m.media-amazon.com/images/I/31nIPodbU3L._AC_SR38,50_.jpg",
    "Lightblue": "https://m.media-amazon.com/images/I/31yqqMVOS0L._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31XmGV8qa0L._AC_SR38,50_.jpg",
    "Red": "https://m.media-amazon.com/images/I/31U4LRYwzRL._AC_SR38,50_.jpg",
    "Pink": "https://m.media-amazon.com/images/I/31m8SUu9m4L._AC_SR38,50_.jpg",
    "White": "https://m.media-amazon.com/images/I/31ULvNC-SqL._AC_SR38,50_.jpg",
    "Purple": "https://m.media-amazon.com/images/I/31raRFm6w8L._AC_SR38,50_.jpg",
    "Yellow": "https://m.media-amazon.com/images/I/41QWjKzmMNL._AC_SR38,50_.jpg",
    "Navyblue": "https://m.media-amazon.com/images/I/31IT9ceyTrL._AC_SR38,50_.jpg",
    "Green": "https://m.media-amazon.com/images/I/31rMtDpSy0L._AC_SR38,50_.jpg",
    "Grey": "https://m.media-amazon.com/images/I/31QDDpyaqBL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Brown": "61t6Ee6-OhL",
    "Hotpink": "61VMba3zULL",
    "Burgundy": "61f3g-JYsUL",
    "Lightblue": "61dhm6efy1L",
    "Black": "61rbnrxsfpL",
    "Red": "61gSJse7SfL",
    "Pink": "61GSwzyBuoL",
    "White": "61vSCXpxYgL",
    "Purple": "61KD9aevYhL",
    "Yellow": "61Gis3KlubL",
    "Navyblue": "61jHTb559HL",
    "Green": "61AuUsv3XNL",
    "Grey": "61fN4f5gkWL"
  },
  "color_images": {
    "Brown": [
      "https://m.media-amazon.com/images/I/61t6Ee6-OhL._SL1500_.jpg"
    ],
    "Hotpink": [
      "https://m.media-amazon.com/images/I/61VMba3zULL._SL1500_.jpg"
    ],
    "Burgundy": [
      "https://m.media-amazon.com/images/I/61f3g-JYsUL._SL1500_.jpg"
    ],
    "Lightblue": [
      "https://m.media-amazon.com/images/I/61dhm6efy1L._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/61rbnrxsfpL._SL1500_.jpg"
    ],
    "Red": [
      "https://m.media-amazon.com/images/I/61gSJse7SfL._SL1500_.jpg"
    ],
    "Pink": [
      "https://m.media-amazon.com/images/I/61GSwzyBuoL._SL1500_.jpg"
    ],
    "White": [
      "https://m.media-amazon.com/images/I/61vSCXpxYgL._SL1500_.jpg"
    ],
    "Purple": [
      "https://m.media-amazon.com/images/I/61KD9aevYhL._SL1500_.jpg"
    ],
    "Yellow": [
      "https://m.media-amazon.com/images/I/61Gis3KlubL._SL1500_.jpg"
    ],
    "Navyblue": [
      "https://m.media-amazon.com/images/I/61jHTb559HL._SL1500_.jpg"
    ],
    "Green": [
      "https://m.media-amazon.com/images/I/61AuUsv3XNL._SL1500_.jpg"
    ],
    "Grey": [
      "https://m.media-amazon.com/images/I/61fN4f5gkWL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress-sleeveless-cocktail-bodycon",
      "title": "Womens Dress Sleeveless Cocktail Bodycon",
      "price": 36.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61NaDgRQ-DL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-maxi-formal-long-sleeve-v-neck",
      "title": "Womens Maxi Dress Cocktail Maxi Formal Long Sleeve V Neck",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61cfJoIR5bL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-sleeveless",
      "title": "Womens Dress Sleeveless",
      "price": 41.28,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61lY17e0IcL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 21.8,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/61c5mGhNGcL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-mermaid-ruched-evening-v-neck",
      "title": "Womens Maxi Dress Formal Mermaid Ruched Evening V Neck",
      "price": 69.88,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51MYR9Nc8RL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-bodycon-ruched-formal-cocktail-maxi",
      "title": "Womens Maxi Dress Bodycon Ruched Formal Cocktail Maxi",
      "price": 67.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61t+0j79QxL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-v-neck",
      "title": "Womens Dress V Neck",
      "price": 19.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/615dowAZsGL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-boat-neck-sleeveless",
      "title": "Womens Dress Boat Neck Sleeveless",
      "price": 19.79,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/518oJldZIfL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 345.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71+iIZQZYxL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-long-sleeve",
      "title": "Womens Maxi Dress Cocktail Long Sleeve",
      "price": 41.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/81saIlybqBL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening",
      "title": "Womens Maxi Dress Formal Evening",
      "price": 84.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51jvA+mhorL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-bodycon-ruched-maxi-cocktail",
      "title": "Womens Maxi Dress Long Sleeve Bodycon Ruched Maxi Cocktail",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/51YdcAHT9EL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-one-shoulder",
      "title": "Womens Maxi Dress Formal One Shoulder",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51lJ+bpf3JL._SL1500_.jpg"
      ]
    }
  ]
}