{
  "id": "womens-maxi-dress-formal-cocktail-bodycon-maxi",
  "handle": "womens-maxi-dress-formal-cocktail-bodycon-maxi",
  "sku": "JC1647",
  "asin": "B0DQ1GPS4K",
  "title": "Womens Maxi Dress Formal Cocktail Bodycon Maxi",
  "title_original": "HTZMO Women Elegant Summer Bodycon Maxi Dress Halter Neck Formal Wedding Guest Cocktail Party Long Dresses",
  "brand": "Visit the HTZMO Store",
  "price": 59.99,
  "social_proof": {
    "bought_past_month": 1218,
    "text": "1218+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/51Z6RvK5lUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61JbpitdqPL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61t5-PTnqFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/6111BGyhjxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61-5OePw40L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61mK8zM+4QL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71sd88i3VPL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61uN8vAuhPL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/515cPGbn7vL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51aw06CzkZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51jx+NfSwLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61KiFChn+xL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/512XppmvkqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51vb+xiDWkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/615rrrOZizL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51JG1nRCCuL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51W9rwk3boL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51selAqlbYL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51dGmTqkpCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51QfN1F2NjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ox6THMgrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/515OuNpZJ8L._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/51Z6RvK5lUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61JbpitdqPL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61t5-PTnqFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/6111BGyhjxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61-5OePw40L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61mK8zM+4QL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71sd88i3VPL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61uN8vAuhPL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/515cPGbn7vL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51aw06CzkZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51jx+NfSwLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61KiFChn+xL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/512XppmvkqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51vb+xiDWkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/615rrrOZizL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51JG1nRCCuL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51W9rwk3boL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51selAqlbYL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51dGmTqkpCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51QfN1F2NjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ox6THMgrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/515OuNpZJ8L._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ February 10, 2025",
    "ASIN ‏": "‎ B0DWMQ46C3",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#19,370 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #37 in Women's Formal Dresses #123 in Women's Club & Night Out Dresses",
    "Customer Reviews": "4.2 4.2 out of 5 stars (261)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Mesh Beigefloral",
      "Wine",
      "Brown",
      "Blue",
      "Black",
      "Mesh Pinkfloral",
      "Red",
      "Lightpink",
      "Mesh Brownfloral",
      "Navy",
      "Lavender",
      "Pink",
      "White",
      "Yellow",
      "Mesh Redprint",
      "Green"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.2,
    "count": 261,
    "customers_say": "Customers find this dress chic and high-quality, with a nice fit that's tight enough for stomach control while being comfortable. The dress is flattering, with one customer noting how it accentuates the body, and they appreciate its thick material and double lining. While some it's not see-through, others find it somewhat transparent. Generated from the text of customer reviews Select to learn more Elegance (55) Fit (45) Quality (40) Flattering (19) Material thickness (17) Material quality (14) Comfort (13) See through (17) 55 customers mention elegance, 53 positive, 2 negative 55 customers mention \"Elegance\" 53 positive 2 negative Customers find the dress chic and flattering, with one customer particularly appreciating the \"choker\" detail. \" Beautiful dress , my daughter wore this to a wedding this weekend and I thought she looked fantastic. She was comfortable and felt great all night. \" Read more \" Super cute and amazing quality! I'm 5'3\" 115 pounds with a 28E bra size. I got the X-small and it fits perfectly, doesn't fall down at all.... \" Read more \" ...Shows curves. Fits for drag. Very good length and flowy. Very chic and elegant . Recommend to steam NOT iron.... \" Read more \" ...I got for a wedding (that ended up being cancelled) but it’s so cute that I decided to keep it. \" Read more 45 customers mention fit, 37 positive, 8 negative 45 customers mention \"Fit\" 37 positive 8 negative Customers like how the dress fits, noting it's tight enough for stomach control while remaining comfortable, with one customer mentioning it's not restrictive. \" ...I wore it for my wedding reception and it fit perfectly . It’s thick, not see through, and wasn’t too rigid yet not too stretchy.... \" Read more \" Love the fit and color. But the back is kind of see through, you will need to wear something underneath. Soft fabric and came in a bag. \" Read more \" Loved it! The material was very nice, not thin and not shiny. The dress fit well . It was tight (how I wanted it to be) but not restrictive!... \" Read more \" The dress itself fit fine , but was see through. However, the second I opened my package I noticed the entire dress was dirty.... \" Read more 40 customers mention quality, 33 positive, 7 negative 40 customers mention \"Quality\" 33 positive 7 negative Customers find the dress to be a high-quality showstopper, with one customer specifically mentioning it as a perfect wedding guest dress. \" It’s a great dress ! Not see through and perfect baby yellow.... \" Read more \" I absolutely LOVE this dress. It is PERFECT and classy. I did 4 out of 5 stars because the dress ripped along the breast area.... \" Read more \" Stunning dress! Received so many compliments. Was the perfect wedding guest dress . 10/10 \" Read more \" ...but also went to an after club event and danced the night away and very cool , never felt warm/sweaty, and looked sexy in the club that I got lots... \" Read more 19 customers mention flattering, 18 positive, 1 negative 19 customers mention \"Flattering\" 18 positive 1 negative Customers find the dress flattering, with individual reviews noting how it accentuates the body, shows curves, and hits at the ankles. \" ...fits snug while still being stretchy, and is incredibly elegant and flattering . I will be wearing it to a formal/black tie wedding.... \" Read more \" This dress, specifically in this color, was so flattering ! It had a mesh overlay, and I loved the \"choker\"/\"collar\" detail.... \" Read more \" ...not as tight as I thought it would be, it’s a soft material and very flattering ! I’m wearing this for my wedding rehearsal dinner! \" Read more \" flattering dress and great material. it is very pricey and you can definitely find the exact same dress for half the price anywhere else \" Read more 17 customers mention material thickness, 13 positive, 4 negative 17 customers mention \"Material thickness\" 13 positive 4 negative Customers appreciate the dress's material thickness, with one noting it's not very expensive. \" Wore this for my engagement pictures. Loved the dress. Very slimming .... \" Read more \" The fabric is thick , the color is the same (red).... \" Read more \" This was soooo much better than I expected! The material quality is thick and not see through. The length was perfect.... \" Read more \" Material was SUPER thin & see thru \" Read more 14 customers mention material quality, 12 positive, 2 negative 14 customers mention \"Material quality\" 12 positive 2 negative Customers like the material of the dress, finding it nice and great, with one customer noting that it is double lined. \" flattering dress and great material . it is very pricey and you can definitely find the exact same dress for half the price anywhere else \" Read more \" Loved it! The material was very nice , not thin and not shiny. The dress fit well. It was tight (how I wanted it to be) but not restrictive!... \" Read more \" ...I wore it to a bridal event and received many compliments. The fabric is great , and it is true to size! \" Read more \" Good fit, got an XS fits snug but not too tight. Nice fabric and seems good quality. \" Read more 13 customers mention comfort, 12 positive, 1 negative 13 customers mention \"Comfort\" 12 positive 1 negative Customers find the dress comfortable. \" LOVE!!! Absolutely obsessed! The material is double lined and comfortable , the top's \"adhesive\" material holds tight even on a larger chest when... \" Read more \" Super cute and comfortable dress .... \" Read more \" ...I got so many compliments and felt so comfortable ! 10/10! \" Read more \" ...Fits true to size, accentuates the body incredibly, and was so comfortable .... \" Read more 17 customers mention see through, 11 positive, 6 negative 17 customers mention \"See through\" 11 positive 6 negative Customers have mixed opinions about the dress's transparency, with some finding it not see-through while others disagree. \" ...Material is a little stretchy but not too much. Not see through , its a soft as well. Color is super pretty and true to picture. \" Read more \" White was very see through , I could make out my entire leg tattoo, however the style was cute and I’m sure it would work in a more opaque color \" Read more \" I was skeptical but this dress is so chic. It isn’t see through although I wouldn’t wear colored under wear. It is stretchy which is nice.... \" Read more \" ...Very comfortable dress. Not really see-through . I plan to order this dress in a different color for future events :)) \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Exactly as pictured! Worth the purchase!",
        "body": "I never write reviews for anything, but my goodness I had to write one for this dress. It looks and feels like quality material, it fits snug while still being stretchy, and is incredibly elegant and flattering. I will be wearing it to a formal/black tie wedding. I’m 5’3” and approximately 130lbs. I was very hesitant about ordering an XS but I’m glad I did, it fits perfectly. If you’re between sizes, dare I recommend sizing down — only caveat being if you’re more chesty. Read more",
        "author": "Kayla",
        "rating": 5.0,
        "date": "December 8, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Love it!",
        "body": "I got an XS im 5'1 about a 120lbs, it fit perfect. Material is a little stretchy but not too much. Not see through, its a soft as well. Color is super pretty and true to picture. Read more",
        "author": "Mariah",
        "rating": 5.0,
        "date": "December 9, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/7167W5eLPBL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Perfect wedding guest dress",
        "body": "I can’t say enough good things about this dress. True to size. Flattering. A girl at the same wedding was wearing this dress in a different color- we are different body types and it fit her like a glove (in her size, too). Stretchy and “warmer,” so maybe a good fall or winter wedding dress. Read more",
        "author": "Hannah Walker",
        "rating": 5.0,
        "date": "December 9, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/81tozn3v17L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "4.0 out of 5 stars Perfect",
        "body": "Wore this for my engagement pictures. Loved the dress. Very slimming. The only thing that was annoying was the straps were a bit longer than I personally needed so I had to have our photographer edit out the excess strap that was bunching up on my back. I could’ve gotten it altered beforehand but was in a pinch and it looked great. Read more",
        "author": "Leah Riale",
        "rating": 4.0,
        "date": "December 8, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Great Dress for the Cost! Tons of Compliments",
        "body": "This dress, specifically in this color, was so flattering! It had a mesh overlay, and I loved the \"choker\"/\"collar\" detail. It was stretchy, so it was well fitted. I'd consider it true to size. Length wise, I know a lot of cheaper dresses only work on shorter frames. For reference, I'm 5'7\" and proportionally I have long legs and shorter torso. On a similar frame it wont drag the floor, but as you can see on myself it was still a good length without being awkward. In my pictures you also can see the top of it did roll down a bit (like just half an inch) but wasn't that big of a deal. A lot of that I think was my son tugging on my top rather than the dress itself. I got TONS of compliments this evening. Great last minute option that is wedding friendly and comfy too! Read more",
        "author": "Danielle Field",
        "rating": 5.0,
        "date": "July 10, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/81JJMkblybL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/813Y97iwRuL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Great white bridal era dress!!",
        "body": "Beautiful dress! Not see through and great material Read more",
        "author": "Michelle Rivera",
        "rating": 5.0,
        "date": "December 17, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Not for me",
        "body": "Chokes you, awkward neck strap. Looked cute but uncomfortable Read more",
        "author": "Amy",
        "rating": 3.0,
        "date": "October 10, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Beautiful",
        "body": "Absolutely love this dress! The neck does not “choke” you, it fits very comfortably. I am 5’3 and between 135-140lbs. I originally ordered a small but I could not get it to zip up all the way, it was too small around my upper back area. It fit my body well so I was a little disappointed. I returned for a Medium and it was little looser than I wanted around my body but did zip up and fit my top better. I have 34 DDD chest so may want to consider your breast size when ordering. I got compliments all night and the dress was comfortable and easy to dance in! It does have some stretch but still want to be mindful when choosing your size Read more",
        "author": "Savannah Walters",
        "rating": 4.0,
        "date": "December 7, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71niLbwjX2L._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/61LWt3W+-nL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/61KG5yOMBVL._SY88._SL1500_.jpg"
        ]
      }
    ]
  },
  "short_description": "Womens Maxi Dress Formal Cocktail Bodycon Maxi is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.",
  "about_this_item": "Womens Maxi Dress Formal Cocktail Bodycon Maxi is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.",
  "long_description": "Womens Maxi Dress Formal Cocktail Bodycon Maxi is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Mesh Beigefloral, Wine, Brown, Blue, Black, Mesh Pinkfloral, Red, Lightpink, Mesh Brownfloral, Navy, Lavender, Pink, White, Yellow. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Formal Cocktail Bodycon Maxi is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Mesh Beigefloral, Wine, Brown, Blue, Black, Mesh Pinkfloral, Red, Lightpink, Mesh Brownfloral, Navy, Lavender, Pink, White, Yellow. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "3d24507d-633c-4f4f-bb6f-c91a85e54d9e",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3d24507d-633c-4f4f-bb6f-c91a85e54d9e/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3d24507d-633c-4f4f-bb6f-c91a85e54d9e/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/552b0439-6111-44e5-a207-24971b1cbf4a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "8afcdd65-377f-4a47-8d81-3179ca2e46de",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8afcdd65-377f-4a47-8d81-3179ca2e46de/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8afcdd65-377f-4a47-8d81-3179ca2e46de/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/552b0439-6111-44e5-a207-24971b1cbf4a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "fa40aa0e-3612-4742-844b-2b12f9247d41",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/fa40aa0e-3612-4742-844b-2b12f9247d41/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/fa40aa0e-3612-4742-844b-2b12f9247d41/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/552b0439-6111-44e5-a207-24971b1cbf4a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "9120bc35-5859-4ef6-bce5-4a7365182d43",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9120bc35-5859-4ef6-bce5-4a7365182d43/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9120bc35-5859-4ef6-bce5-4a7365182d43/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/552b0439-6111-44e5-a207-24971b1cbf4a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "420004c1-bdb2-498e-b1c2-17c0a5d1bc64",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/420004c1-bdb2-498e-b1c2-17c0a5d1bc64/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/420004c1-bdb2-498e-b1c2-17c0a5d1bc64/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/552b0439-6111-44e5-a207-24971b1cbf4a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "25b5011a-783b-484e-b245-ea851e87cdb7",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/25b5011a-783b-484e-b245-ea851e87cdb7/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/25b5011a-783b-484e-b245-ea851e87cdb7/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/552b0439-6111-44e5-a207-24971b1cbf4a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "892cdb8b-ebf3-4593-9628-1c4b620cb6a6",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/892cdb8b-ebf3-4593-9628-1c4b620cb6a6/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/892cdb8b-ebf3-4593-9628-1c4b620cb6a6/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/552b0439-6111-44e5-a207-24971b1cbf4a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "96db7ecc-b865-4eb4-8821-8fb16fb32fac",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/96db7ecc-b865-4eb4-8821-8fb16fb32fac/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/96db7ecc-b865-4eb4-8821-8fb16fb32fac/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/552b0439-6111-44e5-a207-24971b1cbf4a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "2ff544fe-0e8e-4b64-9978-5182918b4f30",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2ff544fe-0e8e-4b64-9978-5182918b4f30/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2ff544fe-0e8e-4b64-9978-5182918b4f30/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/552b0439-6111-44e5-a207-24971b1cbf4a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "b68c440c-ad01-4c25-9670-716dd4517a4d",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b68c440c-ad01-4c25-9670-716dd4517a4d/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b68c440c-ad01-4c25-9670-716dd4517a4d/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/552b0439-6111-44e5-a207-24971b1cbf4a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "75941b86-1f25-4990-b657-1d7625c283ff",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/75941b86-1f25-4990-b657-1d7625c283ff/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/75941b86-1f25-4990-b657-1d7625c283ff/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/552b0439-6111-44e5-a207-24971b1cbf4a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "d3d65568-0eaf-4f89-b8ea-5d44f49851e4",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d3d65568-0eaf-4f89-b8ea-5d44f49851e4/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d3d65568-0eaf-4f89-b8ea-5d44f49851e4/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/552b0439-6111-44e5-a207-24971b1cbf4a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Mesh Beigefloral": "https://m.media-amazon.com/images/I/31MBj45QuDL._AC_SR38,50_.jpg",
    "Wine": "https://m.media-amazon.com/images/I/31prDb2szUL._AC_SR38,50_.jpg",
    "Brown": "https://m.media-amazon.com/images/I/31IXXxEvOWL._AC_SR38,50_.jpg",
    "Blue": "https://m.media-amazon.com/images/I/31T0K82FtdL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31GuHJeW+FL._AC_SR38,50_.jpg",
    "Mesh Pinkfloral": "https://m.media-amazon.com/images/I/31IsVIXKgnL._AC_SR38,50_.jpg",
    "Red": "https://m.media-amazon.com/images/I/31wYiA-WnjL._AC_SR38,50_.jpg",
    "Lightpink": "https://m.media-amazon.com/images/I/310xVgY6U8L._AC_SR38,50_.jpg",
    "Mesh Brownfloral": "https://m.media-amazon.com/images/I/31Vjablot6L._AC_SR38,50_.jpg",
    "Navy": "https://m.media-amazon.com/images/I/210yxkFBtgL._AC_SR38,50_.jpg",
    "Lavender": "https://m.media-amazon.com/images/I/21yN0wuD8yL._AC_SR38,50_.jpg",
    "Pink": "https://m.media-amazon.com/images/I/2177SO+wDpL._AC_SR38,50_.jpg",
    "White": "https://m.media-amazon.com/images/I/31QnDDMDr2L._AC_SR38,50_.jpg",
    "Yellow": "https://m.media-amazon.com/images/I/21VpxG8V3RL._AC_SR38,50_.jpg",
    "Mesh Redprint": "https://m.media-amazon.com/images/I/310KDtrIFrL._AC_SR38,50_.jpg",
    "Green": "https://m.media-amazon.com/images/I/31-VeXfsc3L._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Mesh Beigefloral": "61uN8vAuhPL",
    "Wine": "515cPGbn7vL",
    "Brown": "51aw06CzkZL",
    "Blue": "51jx+NfSwLL",
    "Black": "51Z6RvK5lUL",
    "Mesh Pinkfloral": "61KiFChn+xL",
    "Red": "512XppmvkqL",
    "Lightpink": "51vb+xiDWkL",
    "Mesh Brownfloral": "615rrrOZizL",
    "Navy": "51JG1nRCCuL",
    "Lavender": "51W9rwk3boL",
    "Pink": "51selAqlbYL",
    "White": "51dGmTqkpCL",
    "Yellow": "51QfN1F2NjL",
    "Mesh Redprint": "61ox6THMgrL",
    "Green": "515OuNpZJ8L"
  },
  "color_images": {
    "Mesh Beigefloral": [
      "https://m.media-amazon.com/images/I/61uN8vAuhPL._SL1500_.jpg"
    ],
    "Wine": [
      "https://m.media-amazon.com/images/I/515cPGbn7vL._SL1500_.jpg"
    ],
    "Brown": [
      "https://m.media-amazon.com/images/I/51aw06CzkZL._SL1500_.jpg"
    ],
    "Blue": [
      "https://m.media-amazon.com/images/I/51jx+NfSwLL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/51Z6RvK5lUL._SL1500_.jpg"
    ],
    "Mesh Pinkfloral": [
      "https://m.media-amazon.com/images/I/61KiFChn+xL._SL1500_.jpg"
    ],
    "Red": [
      "https://m.media-amazon.com/images/I/512XppmvkqL._SL1500_.jpg"
    ],
    "Lightpink": [
      "https://m.media-amazon.com/images/I/51vb+xiDWkL._SL1500_.jpg"
    ],
    "Mesh Brownfloral": [
      "https://m.media-amazon.com/images/I/615rrrOZizL._SL1500_.jpg"
    ],
    "Navy": [
      "https://m.media-amazon.com/images/I/51JG1nRCCuL._SL1500_.jpg"
    ],
    "Lavender": [
      "https://m.media-amazon.com/images/I/51W9rwk3boL._SL1500_.jpg"
    ],
    "Pink": [
      "https://m.media-amazon.com/images/I/51selAqlbYL._SL1500_.jpg"
    ],
    "White": [
      "https://m.media-amazon.com/images/I/51dGmTqkpCL._SL1500_.jpg"
    ],
    "Yellow": [
      "https://m.media-amazon.com/images/I/51QfN1F2NjL._SL1500_.jpg"
    ],
    "Mesh Redprint": [
      "https://m.media-amazon.com/images/I/61ox6THMgrL._SL1500_.jpg"
    ],
    "Green": [
      "https://m.media-amazon.com/images/I/515OuNpZJ8L._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress-short-sleeve",
      "title": "Womens Dress Short Sleeve",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61Gm5oBtjDL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-maxi-evening-short-sleeve",
      "title": "Womens Maxi Dress Formal Maxi Evening Short Sleeve",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/510UzQ4LvcL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-sleeveless-cocktail",
      "title": "Womens Dress Sleeveless Cocktail",
      "price": 36.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61GAjqeyL3L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-one-shoulder-formal-mermaid-bodycon-evening-maxi",
      "title": "Womens Maxi Dress One Shoulder Formal Mermaid Bodycon Evening Maxi",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71mgUBuGwhL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail",
      "title": "Womens Maxi Dress Cocktail",
      "price": 65.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61PhpTXzljL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-long-sleeve-maxi",
      "title": "Womens Maxi Dress Long Sleeve Maxi",
      "price": 30.5,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61mj6wDIcCL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 14.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/613okEvjDbL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-sleeveless",
      "title": "Womens Dress Sleeveless",
      "price": 129.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71xFoTa7vML._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-split-long-sleeve",
      "title": "Womens Maxi Dress Split Long Sleeve",
      "price": 24.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61T+7nX7foL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 27.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/615JfwLyTTL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71q7jQuq5DL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-formal-evening",
      "title": "Womens Dress Formal Evening",
      "price": 74.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61Er9CvHl3L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-cocktail-one-shoulder-evening-sleeveless-maxi",
      "title": "Womens Maxi Dress Bodycon Cocktail One Shoulder Evening Sleeveless Maxi",
      "price": 48.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51Yw6AC7ljL._SL1500_.jpg"
      ]
    }
  ]
}