{
  "id": "womens-maxi-dress-bodycon-formal-maxi-cocktail",
  "handle": "womens-maxi-dress-bodycon-formal-maxi-cocktail",
  "sku": "JC2255",
  "asin": "B0DQB7K95J",
  "title": "Womens Maxi Dress Bodycon Formal Maxi Cocktail",
  "title_original": "Popilush Womens Shapewear Maxi Dress Multi Way Wear Off The Shoulder Bodycon Long Cocktail Formal Dresses",
  "brand": "Visit the Popilush Store",
  "price": 129.99,
  "social_proof": {
    "bought_past_month": 144,
    "text": "144+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/71O0-Wp24QL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71fmr1-8TyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61sS+tiLSpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81nGMjPhkYL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71TfQ7WZJ5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81qFgX8XH4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71lS2CeuVsL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71BcW849M3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71clM0x8fxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71sLhZF9TcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/710v9-4fnpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/716hwmKHdYL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/71O0-Wp24QL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71fmr1-8TyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61sS+tiLSpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81nGMjPhkYL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71TfQ7WZJ5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81qFgX8XH4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71lS2CeuVsL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71BcW849M3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71clM0x8fxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71sLhZF9TcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/710v9-4fnpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/716hwmKHdYL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ July 3, 2024",
    "ASIN ‏": "‎ B0D8PB766J",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#33,727 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #652 in Women's Dresses",
    "Customer Reviews": "4.1 4.1 out of 5 stars (428)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Red",
      "Blue",
      "Purple",
      "Black",
      "Champagne",
      "Navy Blue",
      "Green"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.1,
    "count": 428,
    "customers_say": "Customers find this dress perfect for formal occasions, with an amazing fit that's comfortable and flatters their curves. The built-in shapewear works well, with one customer noting it hugs everything perfectly. The material quality receives mixed feedback - while some praise its stunning appearance, others find it looks and feels cheap. The shapewear's effectiveness is also mixed, with some saying it holds in the right places while others find it too clingy. Select to learn more Beauty Quality Fit Flattering Shape wear Comfort Material quality Shapewear 73 customers mention \"Beauty\" 67 positive 6 negative Customers find the dress beautiful, describing it as a perfect formal dress that looks really pretty. \"This dress is beautiful and I love the built in shape wear! Fits beautifully. Nice fabric and great style . Got so many compliments on it....\" Read more \" Beautiful dress . Hold in the right places. Received lots of compliments on it. Loved how I felt confident in it. Wore to a wedding as a guest....\" Read more \"...The color is beautiful but I can’t wear this to the event I needed it for this weekend....\" Read more \" Gorgeous but HORRIBLY wrong about size. It’s sizing for a child. I’m a medium to large and returning a 3rd time for an xxl. What the hell?\" Read more 62 customers mention \"Quality\" 53 positive 9 negative Customers find the dress to be of good quality, noting it's not made of cheap material, with one customer specifically mentioning it doesn't look or feel cheap. \" Great dress , the shapewear works great and the material is good quality\" Read more \" Nice dress but runs small! I am 130lbs & had to get a large. I am usually a size 6 in dresses. Also very long.\" Read more \" Perfect dress !!! Literally the most flattering thing ever. Fits perfectly and the shape wear is chef's kisses!\" Read more \"Love, love, love this dress ! I received so many compliments and was comfortable the entire evening. Can’t wait to wear again!...\" Read more 59 customers mention \"Fit\" 44 positive 15 negative Customers are satisfied with how the dress fits, with one mentioning that it smooths everything out without being painful or too tight. \"Fit true to size! I’m typically a large and this fit perfectly ! The built in shapewear was perfect and did not really roll up on the thighs at all....\" Read more \"...recommend it for anyone I wore it to a wedding so comfortable fits perfectly im so self conscious and had no worries it made ne feel comfortable...\" Read more \"...I would recommend sizing up as the shapewear is tight . The black dress will be perfect for the night/formal wedding we are attending\" Read more \"...you size up 1 size I am a small and ordered a medium and it’s the perfect fit ! This is not cheap material. It is well made and is so flattering!\" Read more 39 customers mention \"Flattering\" 31 positive 8 negative Customers find the shapewear dress flattering and slimming, making them feel confident. \" So flattering ! love the built in shorts and bra/support- no needing to buy special undergarments. I’m 5’0 and 104lbs and got xs.\" Read more \"...a little off because I had to squeeze into this but once on it’s very flattering . The color is amazing and I received many compliments....\" Read more \"...I am so relieved that this dress is just as flattering as I’d hope!d I am still working on getting my fitness back and this is so smooth and...\" Read more \"This DEFINITELY sucks you in ! I found it rather uncomfortable. The satin look showed to many of my flaws for my liking. I will be returning this....\" Read more 39 customers mention \"Shape wear\" 33 positive 6 negative Customers appreciate the built-in shapewear feature of the dress, with one customer noting it provides perfect compression from waistline to mid-thigh. \"...I have a few of their dresses. This one has the built in shape wear that I love, was very comfortable, stretchy as always and runs true to size, but...\" Read more \" Love the built in shapewear !! I felt so supported all night\" Read more \"... Love the shapewear , bra padding and slit to go to bathroom. Really well thought out dress with variety and options on straps. For was a 10/10!...\" Read more \"I love this dress! The shape wear is great and the dress fit perfect 10/10 recommend\" Read more 29 customers mention \"Comfort\" 27 positive 2 negative Customers find the dress comfortable, with one mentioning that the vent for bathroom use is convenient. \"...The shapewear felt like great quality and comfortable … hugged all the right places… I am sure I could have went with my original size but opted for...\" Read more \"Super cute, super comfortable , well-made of quality fabric. I wore to chaperone prom and it was a hit!\" Read more \"...This one has the built in shape wear that I love, was very comfortable , stretchy as always and runs true to size, but the material was a little to...\" Read more \"...It was extremely comfortable as I danced all night at the reception. I received many compliments however, this is not my favorite dress....\" Read more 56 customers mention \"Material quality\" 29 positive 27 negative Customers have mixed opinions about the dress's material quality, with some praising its stunning appearance and beautiful sheen, while others find it looks and feels cheap and not as expected. \" Great material and LOVED it on! Really snatches you in. I was 2 months postpartum and bought 2X the shapewear is tight but that’s the point.\" Read more \"...For almost $140 with tax, it’s absurd. It’s basically swimsuit material ....\" Read more \"...I wore it tonight and felt beautiful in it (early in the night.)...\" Read more \"...The material was not as expected . It’s more of a silky/satin material. But, I saw a recommendation to size up one and I did....\" Read more 27 customers mention \"Shapewear\" 18 positive 9 negative Customers have mixed opinions about the shapewear dress: some say it holds them in perfectly, while others find it too clingy. \"...I absolutely love this dress! I won't need to hem it, and it holds you in , in all the right places....\" Read more \"Could not get this on over my hips. It’s a pull-on dress and I was afraid I would rip it....\" Read more \"...The shapewear made me feel so confident and snatched and the dress was great quality....\" Read more \"It holds you in perfectly . When you sit, you can see the shareware but because it’s a similar color, it works\" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Buy the dress",
        "body": "Cute dress! So flattering. I am 5'0\" and the length was great, i even wore flats with it but was orginally planning on wearing heels and would have looked great. The quality of the color was great and it didnt look or feel cheap. The shapewear was not too tight but hugged in the right places. Would reccommend. I recieved many compliments on this dress. Read more",
        "author": "Marissa Monte",
        "rating": 5.0,
        "date": "October 29, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Yes! This is a great dress",
        "body": "Beautiful dress and the shapewear is so flattering. It’s also comfortable which isn’t usually how shapewear works. I got the purple color and it’s elegant. I’m wearing it to a red carpet premiere and pairing it with the right accessories to dazzle it up a bit. Read more",
        "author": "Cristal P",
        "rating": 5.0,
        "date": "November 10, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Beautiful dress",
        "body": "First, this dress fit amazingly. I got a size large. I am 5'7 and 169lbs. The built in Spanx cinched me in and smoothed out any bulges. The cut of the dress was flattering. With the built in Spanx you don't need a bra or panties and the dress has a opening in the crotch for easy bathroom access. The material is lightweight and stretchy. I had concerns about the material being so thin but in pictures you cannot even tell. Overall a very nice dress. However, the material snags very easily and the built in bra didn't give me the fullness in my chest like I would have if wearing my own bra. The cups of the built in bra also felt lower set in the dress which led to a lack of lift in the chest area. So I did wear a strapless bra with the dress to correct this. Read more",
        "author": "Natalie A. Nieto",
        "rating": 4.0,
        "date": "November 17, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/6110DGTIPvL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Shapewear built in!",
        "body": "Very flattering and forgiving on the curves with thick fabric and great support. This wonderful dress has a built in shelf bra, shapewear from waistline to mid thigh, as well as ruching on one side of the waist. I wore a strapless bra but most could easily skip one as it has good support. The sleeves are versatile and I opted to use the spaghetti straps for additional support, positioning the capped sleeves up. For a different occasion it would be fun to wear fully off the shoulder. The shapewear has a split crotch for using the restroom but I did not attempt this maneuver. Hand washed (per recommendations), steamed smooth and ready to wear again. Large fit me perfectly with no alternations, 5'9\" 140 lbs and busty. Getting softer around the middle as I age (50+) and this dress was still flattering. Read more",
        "author": "bright847",
        "rating": 5.0,
        "date": "October 15, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71rrw2Zh-WL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "1.0 out of 5 stars Looks like it’s from SHEIN…so cheap looking!",
        "body": "Not sure if it’s just the color (which I loved in the photo but is not great in real life), but this dress looks like a costume. It looks like a $20 dress from SHEIN. For almost $140 with tax, it’s absurd. It’s basically swimsuit material. It also has random marks and spots and I can’t tell if they are factory damage or if the material is genuinely supposed to look this weird. The built in shapewear is a joke, it has almost no compression. I’m a curvy size 8 and this makes me look much larger, but if I had sized up it would have been baggy. I have a relatively small waist but this made me look like I have all kinds of lumps and bumps. It’s also kind of short for me which was unexpected because I’m only 5’7”, but it doesn’t even hit my ankle. OH, and the slit goes really high which is fine in theory but in actuality has you flashing an awkward amount of sheer green fake underwear with an opening in the center that’s miserably under the dress. Bought for a wedding guest dress but it’s unwearable. I am confused as to why people love this dress. Returning it. Read more",
        "author": "Danielle",
        "rating": 1.0,
        "date": "September 17, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/715ycpFtsuL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Extremely Comfortable",
        "body": "Absolutely BEAUTIFUL!! Extremely comfortable to wear & flexible to move in. The built in bra & spandex are a lifesaver. I like to wear panties & with this dress it's impossible. You will definitely see the entire panties across your @$$. Read more",
        "author": "Debbie",
        "rating": 5.0,
        "date": "December 8, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71nUeiCSOsL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "2.0 out of 5 stars Low quality, expensive, but beautiful fit.",
        "body": "The dress looks really pretty on, the built in spanx lining was very slimming and made me feel great. The green color was also quite beautiful. However, the material is very low quality. Even from just trying it on, I noticed little threads visibly fraying all over the dress. And I mean ALL over. The dress is not worth the price. For a + $100 dress, I would expect something that would last longer than one wear. Maybe if the dress were like $50, I’d be more compelled to keep it, and care less about the quality, — but not for $100+. So I returned it. Very very disappointing. The manufacturer really needs to reevaluate the pricing. Buyer be ware!!! Read more",
        "author": "Alexandria CC",
        "rating": 2.0,
        "date": "July 1, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Only amazing if you are small enough to not need shape wear",
        "body": "I wanted to love this dress but I did not. The material is stunning and the built in shape-wear is intense in an amazing way, but this dress is not bigger girl friendly I’m 5’5’’, 240lbs, and a normal size 16. According to the size guide I would be an XXL in their sizing so that is what I got. I could get the dress on, but I looked like a busted can of biscuits. The shape wear pulled in extra tight in my waist, almost of the point of hurting, and the straps were extremely tight, meaning I could only wear it as a strapless item. This can be an amazing item, but only if you are small enough to not actually need shape wear to start with. It is too clingy and exaggerated all the wrong parts of my body. Read more",
        "author": "Cassandra",
        "rating": 3.0,
        "date": "October 10, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Bodycon Formal Maxi Cocktail is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.",
  "about_this_item": "Womens Maxi Dress Bodycon Formal Maxi Cocktail is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.",
  "long_description": "Womens Maxi Dress Bodycon Formal Maxi Cocktail is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Red, Blue, Purple, Black, Champagne, Navy Blue, Green. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Bodycon Formal Maxi Cocktail is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Red, Blue, Purple, Black, Champagne, Navy Blue, Green. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "06c1870e-cf46-4660-9178-9d4d6c7a3deb",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/06c1870e-cf46-4660-9178-9d4d6c7a3deb/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/06c1870e-cf46-4660-9178-9d4d6c7a3deb/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/48a5c487-f45b-4362-8970-b85e5f752e45.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "7cd6c314-f1bf-4e6c-bb72-95be729f71b2",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7cd6c314-f1bf-4e6c-bb72-95be729f71b2/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7cd6c314-f1bf-4e6c-bb72-95be729f71b2/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/48a5c487-f45b-4362-8970-b85e5f752e45.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "1cd77bf7-a650-4d1f-b8fd-2a5171049710",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1cd77bf7-a650-4d1f-b8fd-2a5171049710/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1cd77bf7-a650-4d1f-b8fd-2a5171049710/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/48a5c487-f45b-4362-8970-b85e5f752e45.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "82b3dd21-1761-4d4d-bb51-bf92b640035d",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/82b3dd21-1761-4d4d-bb51-bf92b640035d/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/82b3dd21-1761-4d4d-bb51-bf92b640035d/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/48a5c487-f45b-4362-8970-b85e5f752e45.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "8f805bca-f3f1-4da4-9772-270a95759d7a",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8f805bca-f3f1-4da4-9772-270a95759d7a/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8f805bca-f3f1-4da4-9772-270a95759d7a/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/48a5c487-f45b-4362-8970-b85e5f752e45.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "eaad0b35-36bb-476a-82c0-958b28e7a3b9",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/eaad0b35-36bb-476a-82c0-958b28e7a3b9/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/eaad0b35-36bb-476a-82c0-958b28e7a3b9/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/48a5c487-f45b-4362-8970-b85e5f752e45.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "a039ecca-6314-47c2-be8a-ee189ed8bb4b",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a039ecca-6314-47c2-be8a-ee189ed8bb4b/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a039ecca-6314-47c2-be8a-ee189ed8bb4b/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/48a5c487-f45b-4362-8970-b85e5f752e45.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "fc4879fb-5a50-420a-b1d8-bc91391cda28",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/fc4879fb-5a50-420a-b1d8-bc91391cda28/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/fc4879fb-5a50-420a-b1d8-bc91391cda28/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/48a5c487-f45b-4362-8970-b85e5f752e45.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "a0088fec-f317-4bf5-a4b0-9561441b7612",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a0088fec-f317-4bf5-a4b0-9561441b7612/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a0088fec-f317-4bf5-a4b0-9561441b7612/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/48a5c487-f45b-4362-8970-b85e5f752e45.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "30baec83-dd08-4e1f-83a3-051a0847234a",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/30baec83-dd08-4e1f-83a3-051a0847234a/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/30baec83-dd08-4e1f-83a3-051a0847234a/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/48a5c487-f45b-4362-8970-b85e5f752e45.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "6e890553-c711-4e89-8a6b-24577b35ab9e",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6e890553-c711-4e89-8a6b-24577b35ab9e/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6e890553-c711-4e89-8a6b-24577b35ab9e/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/48a5c487-f45b-4362-8970-b85e5f752e45.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "c5bc67ca-898d-4bb1-8480-d1d820240e1b",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c5bc67ca-898d-4bb1-8480-d1d820240e1b/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c5bc67ca-898d-4bb1-8480-d1d820240e1b/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/48a5c487-f45b-4362-8970-b85e5f752e45.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Red": "https://m.media-amazon.com/images/I/4157DryTRZL._AC_SR38,50_.jpg",
    "Blue": "https://m.media-amazon.com/images/I/41t7HcIY8ML._AC_SR38,50_.jpg",
    "Purple": "https://m.media-amazon.com/images/I/41p5gnqwPkL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/41CWLeiAKRL._AC_SR38,50_.jpg",
    "Champagne": "https://m.media-amazon.com/images/I/41t-KDuy0hL._AC_SR38,50_.jpg",
    "Navy Blue": "https://m.media-amazon.com/images/I/41r34qQIUEL._AC_SR38,50_.jpg",
    "Green": "https://m.media-amazon.com/images/I/41tTPrcQ24L._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Red": "71lS2CeuVsL",
    "Blue": "71BcW849M3L",
    "Purple": "71clM0x8fxL",
    "Black": "71O0-Wp24QL",
    "Champagne": "71sLhZF9TcL",
    "Navy Blue": "710v9-4fnpL",
    "Green": "716hwmKHdYL"
  },
  "color_images": {
    "Red": [
      "https://m.media-amazon.com/images/I/71lS2CeuVsL._SL1500_.jpg"
    ],
    "Blue": [
      "https://m.media-amazon.com/images/I/71BcW849M3L._SL1500_.jpg"
    ],
    "Purple": [
      "https://m.media-amazon.com/images/I/71clM0x8fxL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/71O0-Wp24QL._SL1500_.jpg"
    ],
    "Champagne": [
      "https://m.media-amazon.com/images/I/71sLhZF9TcL._SL1500_.jpg"
    ],
    "Navy Blue": [
      "https://m.media-amazon.com/images/I/710v9-4fnpL._SL1500_.jpg"
    ],
    "Green": [
      "https://m.media-amazon.com/images/I/716hwmKHdYL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-mermaid",
      "title": "Womens Maxi Dress Mermaid",
      "price": 169.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71XYPHhe+uL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 36.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61eoqNurcrL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening",
      "title": "Womens Maxi Dress Formal Evening",
      "price": 99.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/610z2FCNfnL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 595.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/71DNMTsucHL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-ruched-long-sleeve-bodycon",
      "title": "Womens Maxi Dress Ruched Long Sleeve Bodycon",
      "price": 29.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71cykrXWgYL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-cocktail-bodycon-maxi",
      "title": "Womens Maxi Dress Cocktail Bodycon Maxi",
      "price": 32.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61tpO1rTF2L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-boat-neck-bodycon-long-sleeve",
      "title": "Womens Maxi Dress Boat Neck Bodycon Long Sleeve",
      "price": 36.89,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61g-xMLK3CL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-evening",
      "title": "Womens Dress Evening",
      "price": 43.54,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61Br2lIK6tL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-v-neck-bodycon",
      "title": "Womens Dress V Neck Bodycon",
      "price": 46.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/71COp7R+38L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-off-shoulder",
      "title": "Womens Maxi Dress Off Shoulder",
      "price": 93.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Wedding Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/61PI-IhW3vL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 43.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Work",
      "images": [
        "https://m.media-amazon.com/images/I/81JXmyg5QfL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-sleeveless-v-neck-split-maxi-cocktail",
      "title": "Womens Maxi Dress Sleeveless V Neck Split Maxi Cocktail",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/61YT6HmofvL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-mermaid-ruched-evening",
      "title": "Womens Maxi Dress Formal Mermaid Ruched Evening",
      "price": 72.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61WoHCKPxDL._SL1500_.jpg"
      ]
    }
  ]
}