{
  "id": "womens-dress-cocktail-v-neck",
  "handle": "womens-dress-cocktail-v-neck",
  "sku": "JC2969",
  "asin": "B0DR2GNCYX",
  "title": "Womens Dress Cocktail V Neck",
  "title_original": "Women's Sequin Dress for Women Sparkly Glitter V Neck Shift Cocktail Disco Outfit Party Club Night Out Mini Dresses",
  "brand": "Visit the Pungdra Store",
  "price": 39.99,
  "social_proof": {
    "bought_past_month": 1119,
    "text": "1119+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/712spNNP9kL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71JOE7d46xL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71p-Oc5HPXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71d5QCPH9DL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81XVsncjMCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71RGHYiYrAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/712HYWMIulL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Ocz46OEiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71OPFNoDfCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71U0VoVsoJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81Kkc5IHiuL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71HICa5tFRL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81AZIVOYBTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71sEzQKnAwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71+n2K5o8yL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/712spNNP9kL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71JOE7d46xL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71p-Oc5HPXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71d5QCPH9DL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81XVsncjMCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71RGHYiYrAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/712HYWMIulL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Ocz46OEiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71OPFNoDfCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71U0VoVsoJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81Kkc5IHiuL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71HICa5tFRL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81AZIVOYBTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71sEzQKnAwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71+n2K5o8yL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ December 20, 2024",
    "ASIN ‏": "‎ B0DR2P5ZBZ",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#17,843 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #68 in Women's Club & Night Out Dresses",
    "Customer Reviews": "3.7 3.7 out of 5 stars (134)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Red",
      "Rose Red",
      "Silver",
      "Pink",
      "Purple",
      "Black (With Multicolor)",
      "Gold(with Multicolor)",
      "Black(with Gold Blue)",
      "Black",
      "Champagne Gold",
      "Green"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 3.7,
    "count": 134,
    "customers_say": "Customers find the dress sparkly and pretty, with good quality and perfect fit. They describe it as comfortable and flattering, with one customer noting it outlines the body without being body-con. The length receives mixed feedback - while some find it perfect, others say it's a little bigger than desired. The shape aspect also gets mixed reviews, with some customers saying it has no shape at all. Generated from the text of customer reviews Select to learn more Style (21) Dress size (10) Comfort (9) Fit (9) Flattering (8) Quality (8) Length (13) Shape (4) 21 customers mention style, 19 positive, 2 negative 21 customers mention \"Style\" 19 positive 2 negative Customers find the dress very pretty and sparkly, with one customer particularly appreciating its black color. \" This is comfortable and cute . It does not chaffe the inner arm.... \" Read more \" This cute dress is very flattering and sparkly . It sways as you move to give your curves that extra umph!... \" Read more \" Cute dress but the back runs too low, my strapless bra was visible \" Read more \" Very cute !! I haven’t worn it yet but it fits great and hangs perfectly! \" Read more 10 customers mention dress size, 10 positive, 0 negative 10 customers mention \"Dress size\" 10 positive 0 negative Customers enjoy wearing this dress, with one mentioning it's perfect for bachelorette parties and another noting it's great for concerts. \" This was such a fun dress ! Perfect for those that are a little on the shorter side and don’t want something that hits at the knee.... \" Read more \" ...So comfortable and easy to wear Flattering: Great for all body types \" Read more \" Perfect for my bachelorette party ! Decent quality, just snagged easily. \" Read more \" ...beautifully and change tones depending on the angle so eye-catching and fun !... \" Read more 9 customers mention comfort, 7 positive, 2 negative 9 customers mention \"Comfort\" 7 positive 2 negative Customers find the dress comfortable, with one mentioning that it doesn't chafe the inner arm. \" ...This dress fit the bill. It skims the body but has some shape. It is comfortable and shimmery. It was inexpensive and I recommend. I’m 5’4, size 12.... \" Read more \" ...It’s comfy , flattering for all body types, and perfect for a night out, a party, or any event where you want to sparkle and stand out.... \" Read more \" ...For reference, I am 5’4 and it was the perfect length! It was pretty comfortable , considering it as sequence, and I was impressed with the lack of... \" Read more \" ...Wore very well, no sparkles falling off everywhere. Slightly itchy on the arms when you walk. \" Read more 9 customers mention fit, 8 positive, 1 negative 9 customers mention \"Fit\" 8 positive 1 negative Customers are satisfied with how the dress fits, noting that it hangs perfectly. \" fit perfectly , was a little itchy for me to try and wear for long periods \" Read more \" Nice simple dress, hangs well . The dress arrived with a large tare down the side. Possi ly the sewing machine missed half the dress.... \" Read more \" ...It sways as you move to give your curves that extra umph! It fits lose but it still clings where it matters \" Read more \" Very cute!! I haven’t worn it yet but it fits great and hangs perfectly! \" Read more 8 customers mention flattering, 8 positive, 0 negative 8 customers mention \"Flattering\" 8 positive 0 negative Customers find the dress flattering, with one mentioning it outlines the body without being body-con, while another notes it covers a bra well. \" ...Fit: So comfortable and easy to wear Flattering : Great for all body types \" Read more \" ...It’s comfy, flattering for all body types , and perfect for a night out, a party, or any event where you want to sparkle and stand out.... \" Read more \" This cute dress is very flattering and sparkly. It sways as you move to give your curves that extra umph!... \" Read more \" ...The length? Chef's Kiss! Just above the knees and totally flattering without being so short that I'd feel self-conscious raising my arms when... \" Read more 8 customers mention quality, 7 positive, 1 negative 8 customers mention \"Quality\" 7 positive 1 negative Customers love this dress and find it to be of good quality. \" ...Lined and good quality . Wore very well, no sparkles falling off everywhere. Slightly itchy on the arms when you walk. \" Read more \" Nice simple dress , hangs well. The dress arrived with a large tare down the side. Possi ly the sewing machine missed half the dress.... \" Read more \" What lovely dress . Worth the price \" Read more \" This dress is a dream . The cut and shape are so forgiving of unfortunate body shapes. It hides my giant scar pooch on my tummy. \" Read more 13 customers mention length, 4 positive, 9 negative 13 customers mention \"Length\" 4 positive 9 negative Customers have mixed opinions about the dress's length, with some finding it perfect while others say it's a little bigger than desired. \" Nice but runs big . \" Read more \" Sizing is so wrong !!!!!! It’s giant my daughter was so sad. \" Read more \" ...This dress fit the bill. It skims the body but has some shape. It is comfortable and shimmery. It was inexpensive and I recommend. I’m 5’4, size 12.... \" Read more \" This dress was sparkly but absolutely no shape to it. It was longer than I thought . I returned it. \" Read more 4 customers mention shape, 2 positive, 2 negative 4 customers mention \"Shape\" 2 positive 2 negative Customers have mixed opinions about the dress's shape, with some noting it has none. \" ...This dress fit the bill. It skims the body but has some shape . It is comfortable and shimmery. It was inexpensive and I recommend. I’m 5’4, size 12.... \" Read more \" This dress was sparkly but absolutely no shape to it . It was longer than I thought. I returned it. \" Read more \" This dress is a dream. The cut and shape are so forgiving of unfortunate body shapes . It hides my giant scar pooch on my tummy. \" Read more \" ...thick material and double lined. It does not have much shape to it . Looks really good when you're tan! \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Comfy and sparkly!",
        "body": "Flattering and I love the the sequins isn’t itchy! It’s a great neckline and length Read more",
        "author": "Sandymilly",
        "rating": 5.0,
        "date": "December 11, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Very cute not for petite women",
        "body": "So cute and festive for the holidays just a little bigger than I wanted. The shape is not for petite women but it’s still really cute. Read more",
        "author": "Samantha",
        "rating": 3.0,
        "date": "December 6, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61GVI3mJ50L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "4.0 out of 5 stars Sparkly and cute",
        "body": "Cute dress! I received a lot of compliments on it when I wore it on a cruise this past summer. It does come really long in length so I had to cut the bottom a bit and bring it up. thick material and double lined. It does not have much shape to it. Looks really good when you're tan! Read more",
        "author": "Customer",
        "rating": 4.0,
        "date": "October 22, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/7126PJoVKiL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Good fit and great look!",
        "body": "It fit right and looks great! Read more",
        "author": "Ernesto Sotolongo",
        "rating": 5.0,
        "date": "December 7, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "1.0 out of 5 stars Doesn’t waste your money",
        "body": "Missed the return window by a day… don’t waste your money. Material is cheap and looks so tacky. So mad at myself for not returning it as soon as I got it Read more",
        "author": "JENN M",
        "rating": 1.0,
        "date": "October 31, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Love this dress!",
        "body": "Beautiful dress! Read more",
        "author": "Tina",
        "rating": 5.0,
        "date": "December 1, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71jp1BApvUL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "3.0 out of 5 stars Much longer than it looks",
        "body": "The dress is wayyyyy longer than it appears in the photo. I’m 5’4” and it was down almost past my knees, not at all how it looks on the model. Read more",
        "author": "Marika Labash",
        "rating": 3.0,
        "date": "December 6, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Great for going out!",
        "body": "I purchased this for a bachelorette party and I got so many compliments! For reference, I am 5’4 and it was the perfect length! It was pretty comfortable, considering it as sequence, and I was impressed with the lack of friction in the armpit with a sequins! Overall, the product and material was a good quality! Read more",
        "author": "Megan Derrick",
        "rating": 5.0,
        "date": "December 3, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Dress Cocktail V Neck is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.",
  "about_this_item": "Womens Dress Cocktail V Neck is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.",
  "long_description": "Womens Dress Cocktail V Neck is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Red, Rose Red, Silver, Pink, Purple, Black (With Multicolor), Gold(with Multicolor), Black(with Gold Blue), Black, Champagne Gold, Green. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Dress Cocktail V Neck is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Red, Rose Red, Silver, Pink, Purple, Black (With Multicolor), Gold(with Multicolor), Black(with Gold Blue), Black, Champagne Gold, Green. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "a3f0badf-8a37-4170-ae47-66f674f2ceae",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a3f0badf-8a37-4170-ae47-66f674f2ceae/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a3f0badf-8a37-4170-ae47-66f674f2ceae/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/56600076-4bd1-43fb-8905-5fbdce8a824b.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "2fef1a10-7f82-4c8c-b86e-31f3a0f076fc",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2fef1a10-7f82-4c8c-b86e-31f3a0f076fc/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2fef1a10-7f82-4c8c-b86e-31f3a0f076fc/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/56600076-4bd1-43fb-8905-5fbdce8a824b.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Red": "https://m.media-amazon.com/images/I/417qaoM-3gL._AC_SR38,50_.jpg",
    "Rose Red": "https://m.media-amazon.com/images/I/41oDknQvdnL._AC_SR38,50_.jpg",
    "Silver": "https://m.media-amazon.com/images/I/412Ix1My6zL._AC_SR38,50_.jpg",
    "Pink": "https://m.media-amazon.com/images/I/41MXS70TEoL._AC_SR38,50_.jpg",
    "Purple": "https://m.media-amazon.com/images/I/41RCU6-2jnL._AC_SR38,50_.jpg",
    "Black (With Multicolor)": "https://m.media-amazon.com/images/I/41A-BNawOtL._AC_SR38,50_.jpg",
    "Gold(with Multicolor)": "https://m.media-amazon.com/images/I/41Xja+XCGyL._AC_SR38,50_.jpg",
    "Black(with Gold Blue)": "https://m.media-amazon.com/images/I/41+ylvv9z3L._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/41j8TJ2grSL._AC_SR38,50_.jpg",
    "Champagne Gold": "https://m.media-amazon.com/images/I/41J1ysaRifL._AC_SR38,50_.jpg",
    "Green": "https://m.media-amazon.com/images/I/41bOC9-+CVL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Red": "71RGHYiYrAL",
    "Rose Red": "712HYWMIulL",
    "Silver": "71Ocz46OEiL",
    "Pink": "71OPFNoDfCL",
    "Purple": "71U0VoVsoJL",
    "Black (With Multicolor)": "81Kkc5IHiuL",
    "Gold(with Multicolor)": "71HICa5tFRL",
    "Black(with Gold Blue)": "81AZIVOYBTL",
    "Black": "71sEzQKnAwL",
    "Champagne Gold": "712spNNP9kL",
    "Green": "71+n2K5o8yL"
  },
  "color_images": {
    "Red": [
      "https://m.media-amazon.com/images/I/71RGHYiYrAL._SL1500_.jpg"
    ],
    "Rose Red": [
      "https://m.media-amazon.com/images/I/712HYWMIulL._SL1500_.jpg"
    ],
    "Silver": [
      "https://m.media-amazon.com/images/I/71Ocz46OEiL._SL1500_.jpg"
    ],
    "Pink": [
      "https://m.media-amazon.com/images/I/71OPFNoDfCL._SL1500_.jpg"
    ],
    "Purple": [
      "https://m.media-amazon.com/images/I/71U0VoVsoJL._SL1500_.jpg"
    ],
    "Black (With Multicolor)": [
      "https://m.media-amazon.com/images/I/81Kkc5IHiuL._SL1500_.jpg"
    ],
    "Gold(with Multicolor)": [
      "https://m.media-amazon.com/images/I/71HICa5tFRL._SL1500_.jpg"
    ],
    "Black(with Gold Blue)": [
      "https://m.media-amazon.com/images/I/81AZIVOYBTL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/71sEzQKnAwL._SL1500_.jpg"
    ],
    "Champagne Gold": [
      "https://m.media-amazon.com/images/I/712spNNP9kL._SL1500_.jpg"
    ],
    "Green": [
      "https://m.media-amazon.com/images/I/71+n2K5o8yL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-formal-evening",
      "title": "Womens Maxi Dress Formal Evening",
      "price": 65.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51Dt7qcYrWL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-long-sleeve",
      "title": "Womens Maxi Dress Maxi Long Sleeve",
      "price": 17.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51pjsLMDJ9L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-sleeveless-cocktail",
      "title": "Womens Dress Sleeveless Cocktail",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/714sdX7CPtL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-evening",
      "title": "Womens Dress Evening",
      "price": 53.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51izlxewQ4L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-short-sleeve-evening-v-neck-formal",
      "title": "Womens Maxi Dress Short Sleeve Evening V Neck Formal",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61y+g6il2gL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-long-sleeve-boat-neck",
      "title": "Womens Maxi Dress Long Sleeve Boat Neck",
      "price": 148.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71VjdMRZFtL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-mermaid-formal-evening",
      "title": "Womens Maxi Dress Mermaid Formal Evening",
      "price": 84.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51Mq79ag8sL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-ruched-v-neck-cocktail-long-sleeve",
      "title": "Womens Maxi Dress Bodycon Ruched V Neck Cocktail Long Sleeve",
      "price": 39.19,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61gwEF51cHL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-off-shoulder-long-sleeve-bodycon",
      "title": "Womens Maxi Dress Off Shoulder Long Sleeve Bodycon",
      "price": 46.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51bYwuscm7L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-mermaid-formal",
      "title": "Womens Maxi Dress Long Sleeve Mermaid Formal",
      "price": 80.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/4144TFf2-NL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-mermaid-one-shoulder-maxi-formal",
      "title": "Womens Maxi Dress Mermaid One Shoulder Maxi Formal",
      "price": 72.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/6190LiY2i3L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-v-neck-long-sleeve",
      "title": "Womens Maxi Dress Cocktail V Neck Long Sleeve",
      "price": 45.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/81Ao8ojwo0L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-split-maxi-long-sleeve",
      "title": "Womens Maxi Dress Split Maxi Long Sleeve",
      "price": 18.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61tOVhv9IVL._SL1500_.jpg"
      ]
    }
  ]
}