{
  "id": "womens-maxi-dress-maxi-formal-bodycon-evening-sleeveless",
  "handle": "womens-maxi-dress-maxi-formal-bodycon-evening-sleeveless",
  "sku": "JC2205",
  "asin": "B0DRVDGCW8",
  "title": "Womens Maxi Dress Maxi Formal Bodycon Evening Sleeveless",
  "title_original": "Parthea Women's Summer Formal Wedding Guest Dresses Sleeveless Backless Long Elegant Evening Party Maxi Bodycon Dress",
  "brand": "Visit the Parthea Store",
  "price": 61.99,
  "social_proof": {
    "bought_past_month": 1203,
    "text": "1203+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/61s8qg6u1VL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61iQmHw5N4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61UHJoSQBQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/616et+jJMtL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51qLju5K3xL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61e3WYyYm3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51iis3FC4eL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51h5VaSOd9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61yxCAF4NKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51JbXOmphkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61SLnsCwSUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51LDGi0sPZL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/61s8qg6u1VL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61iQmHw5N4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61UHJoSQBQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/616et+jJMtL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51qLju5K3xL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61e3WYyYm3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51iis3FC4eL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51h5VaSOd9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61yxCAF4NKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51JbXOmphkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61SLnsCwSUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51LDGi0sPZL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Date First Available ‏": "‎ January 22, 2025",
    "ASIN ‏": "‎ B0DTPZN29W",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#65,833 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #229 in Women's Formal Dresses",
    "Customer Reviews": "4.2 4.2 out of 5 stars (105)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Darkgreen",
      "Red",
      "Wine",
      "Brown",
      "Navy",
      "White",
      "Blue",
      "Yellow",
      "Black"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.2,
    "count": 105,
    "customers_say": "Customers find the dress beautiful and well-made, with a perfect fit and good value for money. The color receives mixed feedback, with some saying it's perfect while others note it's pretty see-through. The material thickness receives negative feedback, with several customers describing it as thin. Generated from the text of customer reviews Select to learn more Beauty (17) Fit (10) Quality (9) Value for money (4) Color (4) Material (4) See through (5) Material thickness (4) 17 customers mention beauty, 17 positive, 0 negative 17 customers mention \"Beauty\" 17 positive 0 negative Customers find the dress very pretty. \" It is a beautiful dress , gorgeous light blue color and fit like a glove except for the length.... \" Read more \" This is very pretty dress . The material is stretchy but a also sheer. You can see the outline of bars/shapeware underneath.... \" Read more \" Gorgeous dress . I’m 5’7 and 195 pounds. Decided on the size 10-12 and it fits beautifully. Wearing to my sisters wedding in a few weeks. \" Read more \" I was sent an XL and I ordered a L. It is a very nice dress just too big! \" Read more 10 customers mention fit, 8 positive, 2 negative 10 customers mention \"Fit\" 8 positive 2 negative Customers are satisfied with how the dress fits, with one mentioning that the length is perfect. \" I really love the fit and material. Looks so expensive! \" Read more \" ...I’m 5’7 and 195 pounds. Decided on the size 10-12 and it fits beautifully . Wearing to my sisters wedding in a few weeks. \" Read more \" ...The material hugs your body is the most flattering way and the length is perfect ! I am 5’4 and curvy!... \" Read more \" I was sent an XL and I ordered a L. It is a very nice dress just too big ! \" Read more 9 customers mention quality, 7 positive, 2 negative 9 customers mention \"Quality\" 7 positive 2 negative Customers find the dress to be well-made. \" This dress is spectacular , I love it. Perfect size \" Read more \" Well made , thick material. Just wish the under layer was as long as the top layer \" Read more \" Perfect Wedding Guest Dress ... \" Read more \" Not worth the price, it’s cheap feeling and cheaply made . It looks cute but unless you’re using this as a costume, don’t order this. \" Read more 4 customers mention value for money, 3 positive, 1 negative 4 customers mention \"Value for money\" 3 positive 1 negative Customers find the dress offers good value for money. \" ...It was very comfortable and the color was perfect. It was a nice quality for the price .... \" Read more \" ... Great for the price ! \" Read more \" Not worth the price , it’s cheap feeling and cheaply made. It looks cute but unless you’re using this as a costume, don’t order this. \" Read more \" ...For the price point I loved this dress. Throw on some Shapeware underneath, you’re gonna be snatched and so freaking hot. I love this dress! \" Read more 4 customers mention color, 2 positive, 2 negative 4 customers mention \"Color\" 2 positive 2 negative Customers have mixed opinions about the dress's color, with some finding it perfect while another customer notes that the white version is very see-through. \" ...It was very comfortable and the color was perfect . It was a nice quality for the price.... \" Read more \" ...is gorgeous and looks elegant but unfortunately the white color is very see through !... \" Read more \" It is a beautiful dress, gorgeous light blue color and fit like a glove except for the length.... \" Read more \" When I received it, the sleeve was stained yellow and the bottom of the dress had dirt stains on it.... \" Read more 4 customers mention material, 2 positive, 2 negative 4 customers mention \"Material\" 2 positive 2 negative Customers have mixed opinions about the dress's material, with one customer noting it's a soft mesh that hugs the body, while another mentions there's extra fabric on the sides. \" ...The material hugs your body is the most flattering way and the length is perfect! I am 5’4 and curvy!... \" Read more \" ... Material was fitted but had nice stretch, super breathable fabric, and lightweight. I ordered this in white. \" Read more \" I really love the fit and material . Looks so expensive! \" Read more \" ...The fabric is a soft mesh so it’s pretty thin material and I did also notice there is some extra fabric on the sides that stick out a bit. \" Read more 5 customers mention see through, 1 positive, 4 negative 5 customers mention \"See through\" 1 positive 4 negative Customers mention that the dress is pretty see-through. \" Bought it for my wedding rehearsal dinner but it’s extremely see through . I returned the dress. \" Read more \" ...It’s a stretchy and a bit see through . Wear black undergarments. I wear XL 222lbs and 5’4 \" Read more \" So cute, fits perfectly. It’s a little see through so you’ll need to wear something under. Great for the price! \" Read more \" This is very pretty dress. The material is stretchy but a also sheer . You can see the outline of bars/shapeware underneath.... \" Read more 4 customers mention material thickness, 1 positive, 3 negative 4 customers mention \"Material thickness\" 1 positive 3 negative Customers find the dress material to be thin, with one mentioning it is see-through. \" Pity that this dress is so thin , so the quality isn’t quite there.... \" Read more \" ...The fabric is a soft mesh so it’s pretty thin material and I did also notice there is some extra fabric on the sides that stick out a bit. \" Read more \" Well made, thick material . Just wish the under layer was as long as the top layer \" Read more \" See through thin material ... \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Beautiful design that snugs the body comfortably",
        "body": "I really love the fit and material. Looks so expensive! Read more",
        "author": "Minhwi Kim",
        "rating": 5.0,
        "date": "December 13, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Buy the dress!!!",
        "body": "I’m not one to leave reviews on products but this dress deserves more than 5 stars! The material hugs your body is the most flattering way and the length is perfect! I am 5’4 and curvy! Even with my broad shoulders, I felt so feminine!! I love how it felt and received compliments all night long! Could not recommend more. Read more",
        "author": "Sonia Chino",
        "rating": 5.0,
        "date": "October 8, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/715P-ysuXjL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/61N9N9FmjAL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "4.0 out of 5 stars Cute dress but see through",
        "body": "The dress itself is gorgeous and looks elegant but unfortunately the white color is very see through! The fabric is a soft mesh so it’s pretty thin material and I did also notice there is some extra fabric on the sides that stick out a bit. Read more",
        "author": "Angel",
        "rating": 4.0,
        "date": "September 25, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars YESSSSS!!!",
        "body": "GIRLS!!!! let me tell you about the power of this dress. I know capes are so in, so you don’t have to break the bank to be in style with this purchase. For the price point I loved this dress. Throw on some Shapeware underneath, you’re gonna be snatched and so freaking hot. I love this dress! Read more",
        "author": "Madison toothman",
        "rating": 5.0,
        "date": "December 19, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "1.0 out of 5 stars Just ew",
        "body": "Not worth the price, it’s cheap feeling and cheaply made. It looks cute but unless you’re using this as a costume, don’t order this. Read more",
        "author": "They were cute but small.",
        "rating": 1.0,
        "date": "November 1, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Nice, but sheer. Dont get white.",
        "body": "Pity that this dress is so thin, so the quality isn’t quite there. If I didn’t get this in white I would probably have been okay with the sheerness as it is pretty see through. It’s a comfy elegant fit. The trails are lovely though. Read more",
        "author": "Tiffany",
        "rating": 3.0,
        "date": "August 10, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Best Dressed",
        "body": "I wore this dress to a wedding and received so many compliments! I would recommend shape wear - especially if you plan on eating heavy and don’t want your food baby to show. The bride requested that guests wear light colors, so I purchased the light blue, but I plan to order in other colors as well. Read more",
        "author": "Chrissy",
        "rating": 5.0,
        "date": "November 24, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/717JwI9QEtL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Perfect Wedding Guest Dress",
        "body": "This is very pretty dress. The material is stretchy but a also sheer. You can see the outline of bars/shapeware underneath. Its a bit low cut so most bras stick out the top. It was very comfortable and the color was perfect. It was a nice quality for the price. If you need a wedding guest dress or fancy event I highly recommend it. Read more",
        "author": "Erin Cooley",
        "rating": 5.0,
        "date": "June 27, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/81oUS1afqkL._SY88._SL1500_.jpg"
        ]
      }
    ]
  },
  "short_description": "Womens Maxi Dress Maxi Formal Bodycon Evening Sleeveless is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.",
  "about_this_item": "Womens Maxi Dress Maxi Formal Bodycon Evening Sleeveless is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.",
  "long_description": "Womens Maxi Dress Maxi Formal Bodycon Evening Sleeveless is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Darkgreen, Red, Wine, Brown, Navy, White, Blue, Yellow, Black. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Maxi Formal Bodycon Evening Sleeveless is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Darkgreen, Red, Wine, Brown, Navy, White, Blue, Yellow, Black. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "2e114d85-b964-427c-9b2b-6cc52ff835a2",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2e114d85-b964-427c-9b2b-6cc52ff835a2/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2e114d85-b964-427c-9b2b-6cc52ff835a2/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/9da43145-69e9-470d-a5eb-3774185d315c.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "977cdc04-4854-485e-889b-faae5e8a10de",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/977cdc04-4854-485e-889b-faae5e8a10de/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/977cdc04-4854-485e-889b-faae5e8a10de/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/9da43145-69e9-470d-a5eb-3774185d315c.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "06e112cd-3baa-4321-9d58-7fc8d4efc0f5",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/06e112cd-3baa-4321-9d58-7fc8d4efc0f5/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/06e112cd-3baa-4321-9d58-7fc8d4efc0f5/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/9da43145-69e9-470d-a5eb-3774185d315c.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "0c62b524-41d6-42f0-996f-67f97892e400",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0c62b524-41d6-42f0-996f-67f97892e400/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0c62b524-41d6-42f0-996f-67f97892e400/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/9da43145-69e9-470d-a5eb-3774185d315c.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "e5a7e7e7-b3eb-4544-8aab-ce71100aae90",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e5a7e7e7-b3eb-4544-8aab-ce71100aae90/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e5a7e7e7-b3eb-4544-8aab-ce71100aae90/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/9da43145-69e9-470d-a5eb-3774185d315c.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "79424b87-d7c1-4045-8067-b45c5df64f0f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/79424b87-d7c1-4045-8067-b45c5df64f0f/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/79424b87-d7c1-4045-8067-b45c5df64f0f/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/9da43145-69e9-470d-a5eb-3774185d315c.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "ef319324-6b51-4d3e-b83e-5d75582dced7",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ef319324-6b51-4d3e-b83e-5d75582dced7/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ef319324-6b51-4d3e-b83e-5d75582dced7/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/9da43145-69e9-470d-a5eb-3774185d315c.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "98a52788-1a82-45a7-94f7-e3016d4b37ba",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/98a52788-1a82-45a7-94f7-e3016d4b37ba/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/98a52788-1a82-45a7-94f7-e3016d4b37ba/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/9da43145-69e9-470d-a5eb-3774185d315c.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "98acb3d5-4c2a-4e92-ad54-9f3e3d8a5c32",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/98acb3d5-4c2a-4e92-ad54-9f3e3d8a5c32/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/98acb3d5-4c2a-4e92-ad54-9f3e3d8a5c32/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/9da43145-69e9-470d-a5eb-3774185d315c.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "300f0021-8383-46c1-8403-6c4084f56247",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/300f0021-8383-46c1-8403-6c4084f56247/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/300f0021-8383-46c1-8403-6c4084f56247/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/9da43145-69e9-470d-a5eb-3774185d315c.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "7e7827ae-15ae-4e2a-b031-b1ba0c2a0200",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7e7827ae-15ae-4e2a-b031-b1ba0c2a0200/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7e7827ae-15ae-4e2a-b031-b1ba0c2a0200/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/9da43145-69e9-470d-a5eb-3774185d315c.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "c5c49664-59b0-492a-8da8-8ff42499f8cd",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c5c49664-59b0-492a-8da8-8ff42499f8cd/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c5c49664-59b0-492a-8da8-8ff42499f8cd/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/9da43145-69e9-470d-a5eb-3774185d315c.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Darkgreen": "https://m.media-amazon.com/images/I/21phWa7iHUL._AC_SR38,50_.jpg",
    "Red": "https://m.media-amazon.com/images/I/31yfTaz0vAL._AC_SR38,50_.jpg",
    "Wine": "https://m.media-amazon.com/images/I/31AYyPmBe0L._AC_SR38,50_.jpg",
    "Brown": "https://m.media-amazon.com/images/I/31JYiPQnaiL._AC_SR38,50_.jpg",
    "Navy": "https://m.media-amazon.com/images/I/31PbDbQAmEL._AC_SR38,50_.jpg",
    "White": "https://m.media-amazon.com/images/I/31phm4Skv+L._AC_SR38,50_.jpg",
    "Blue": "https://m.media-amazon.com/images/I/3148NxgFTlL._AC_SR38,50_.jpg",
    "Yellow": "https://m.media-amazon.com/images/I/31-KMbRnKRL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/311hggMg2AL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Darkgreen": "51qLju5K3xL",
    "Red": "61e3WYyYm3L",
    "Wine": "51iis3FC4eL",
    "Brown": "51h5VaSOd9L",
    "Navy": "61yxCAF4NKL",
    "White": "51JbXOmphkL",
    "Blue": "61SLnsCwSUL",
    "Yellow": "51LDGi0sPZL",
    "Black": "61s8qg6u1VL"
  },
  "color_images": {
    "Darkgreen": [
      "https://m.media-amazon.com/images/I/51qLju5K3xL._SL1500_.jpg"
    ],
    "Red": [
      "https://m.media-amazon.com/images/I/61e3WYyYm3L._SL1500_.jpg"
    ],
    "Wine": [
      "https://m.media-amazon.com/images/I/51iis3FC4eL._SL1500_.jpg"
    ],
    "Brown": [
      "https://m.media-amazon.com/images/I/51h5VaSOd9L._SL1500_.jpg"
    ],
    "Navy": [
      "https://m.media-amazon.com/images/I/61yxCAF4NKL._SL1500_.jpg"
    ],
    "White": [
      "https://m.media-amazon.com/images/I/51JbXOmphkL._SL1500_.jpg"
    ],
    "Blue": [
      "https://m.media-amazon.com/images/I/61SLnsCwSUL._SL1500_.jpg"
    ],
    "Yellow": [
      "https://m.media-amazon.com/images/I/51LDGi0sPZL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/61s8qg6u1VL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-off-shoulder",
      "title": "Womens Maxi Dress Off Shoulder",
      "price": 112.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/718bcEDLmoL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-ruched-bodycon",
      "title": "Womens Maxi Dress Long Sleeve Ruched Bodycon",
      "price": 35.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/41fnCPUyfNL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-v-neck-long-sleeve",
      "title": "Womens Maxi Dress V Neck Long Sleeve",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/81352cAhoXL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-one-shoulder-evening-ruched",
      "title": "Womens Maxi Dress Long Sleeve One Shoulder Evening Ruched",
      "price": 99.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61mm6qjQ-uL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 126.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/714Cs9MTO9L._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress-v-neck-sleeveless",
      "title": "Womens Dress V Neck Sleeveless",
      "price": 31.27,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61d5+jUT-UL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-v-neck-long-sleeve-ruched",
      "title": "Womens Maxi Dress Bodycon V Neck Long Sleeve Ruched",
      "price": 36.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51TARubmowL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-ruched-formal-maxi-bodycon",
      "title": "Womens Maxi Dress Ruched Formal Maxi Bodycon",
      "price": 62.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61ipOhuw3WL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 48.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61W1l5DXSdL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Work",
      "images": [
        "https://m.media-amazon.com/images/I/81Q5KH4YWwL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-sleeveless-off-shoulder-formal-mermaid",
      "title": "Womens Maxi Dress Evening Sleeveless Off Shoulder Formal Mermaid",
      "price": 84.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51oY2+LIz2L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-sleeveless-off-shoulder",
      "title": "Womens Dress Sleeveless Off Shoulder",
      "price": 37.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61dMM-S4qXL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-bodycon-ruched",
      "title": "Womens Dress Bodycon Ruched",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61hdqlxRDYL._SL1500_.jpg"
      ]
    }
  ]
}