{
  "id": "womens-maxi-dress-short-sleeve",
  "handle": "womens-maxi-dress-short-sleeve",
  "sku": "JC3255",
  "asin": "B0DR8JKHSX",
  "title": "Womens Maxi Dress Short Sleeve",
  "title_original": "ZESICA Women‘s Summer Boho Floral Midi Dress 2026 Casual Short Sleeve Square Neck Flowy Beach Vacation Long Dress",
  "brand": "Visit the ZESICA Store",
  "price": 39.99,
  "social_proof": {
    "bought_past_month": 83,
    "text": "83+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/61SwapPeLuL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61kfzfmU06L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71iiEfoU1FL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/713K00XuqeL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81bsl1TkgIL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71SynzMQ1SL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81yd3IzLFrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71aTSVn6p2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71FiFcITkAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/616X9jpTv0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61rD7wXr72L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61x+hNbBmwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61BfB6KN3LL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/612tB5PBGjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61PIpPjzCIL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61kbv-hOfcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61c2CefKYsL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61fg7N6vUgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/615KQtN4D2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61EjLq4xr1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61CUlpK3RVL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/61SwapPeLuL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61kfzfmU06L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71iiEfoU1FL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/713K00XuqeL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81bsl1TkgIL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71SynzMQ1SL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81yd3IzLFrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71aTSVn6p2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71FiFcITkAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/616X9jpTv0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61rD7wXr72L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61x+hNbBmwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61BfB6KN3LL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/612tB5PBGjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61PIpPjzCIL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61kbv-hOfcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61c2CefKYsL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61fg7N6vUgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/615KQtN4D2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61EjLq4xr1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61CUlpK3RVL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Product Dimensions ‏": "‎ 1.97 x 0.79 x 0.39 inches; 3.53 ounces",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ December 23, 2024",
    "ASIN ‏": "‎ B0DR8F4NKF",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#17,661 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #127 in Women's Casual Dresses #180 in Women's Formal Dresses",
    "Customer Reviews": "4.4 4.4 out of 5 stars (794)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Wine",
      "Hotpink",
      "Blue",
      "Apricot",
      "Black",
      "Sage",
      "Dustyblue",
      "Pink",
      "White",
      "Purple",
      "Light Pink",
      "Caramel",
      "Green"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.4,
    "count": 794,
    "customers_say": "Customers find this dress feminine and flattering, particularly appreciating its perfect length and comfortable fit, with one noting it accommodates different body types. Moreover, the dress receives positive feedback for its material quality, with one customer highlighting its flowy fabric, and its versatility for various occasions like family photos and weddings. Additionally, customers love the color, with one mentioning it doesn't fade, and they appreciate its comfort, with one noting it includes pockets. Generated from the text of customer reviews Select to learn more Style (115) Quality (105) Fit (79) Comfort (60) Size (48) Color (41) Material quality (41) Flattering (37) 115 customers mention style, 109 positive, 6 negative 115 customers mention \"Style\" 109 positive 6 negative Customers find the dress pretty and feminine. \" Beautiful dress , the picture does not do justice to the detail. Very lightweight and good for those hot summer days. Breezy and comfortable.... \" Read more \" Why did you pick this product vs others?: Beautiful . It is lined inside the dress so no need for a slip.... \" Read more \" Got this for my bridal shower and it was so cute ! Good length and material. Fit great. Had to steam iron it prior to but it did t take long at all. \" Read more \" Super cute and great quality!! Wore it to a bridal shower and an engagement party. I was also pregnant in my first trimester and it was very comfy. \" Read more 105 customers mention quality, 96 positive, 9 negative 105 customers mention \"Quality\" 96 positive 9 negative Customers praise the dress's quality, finding it perfect for various occasions including family pictures, weddings, and fall events, with one customer mentioning it was ideal for a beach photo shoot. \" Great dress for a casual summer wedding. Very comfortable and modest. It was very light feeling but not too light that it felt cheap. \" Read more \" Dress met my expectations. It was true to size, good quality and looked flawless on. Used it for our engagement pictures and they turned out so cute!... \" Read more \" Super cute and great quality !! Wore it to a bridal shower and an engagement party. I was also pregnant in my first trimester and it was very comfy. \" Read more \" ... Great summer dress ! \" Read more 79 customers mention fit, 72 positive, 7 negative 79 customers mention \"Fit\" 72 positive 7 negative Customers like how the dress fits, with one mentioning it accommodates different body types and another noting it falls to the ankles nicely. \" ...We tried again in the light sage color and it was a perfect fit ! The light sage is beautiful, not see through and comfortable.... \" Read more \" ...I wanted a white flowy summary dress and this fits perfectly . The material is soft and the fit is great.... \" Read more \" Fit perfectly ! I’m usually a size 10 and medium fit perfectly. It’s also nursing friendly and maternity friendly which is an extra \" Read more \" This is a really nice dress. The fit was perfect , and I got a lot of great compliments when I wore it. \" Read more 60 customers mention comfort, 59 positive, 1 negative 60 customers mention \"Comfort\" 59 positive 1 negative Customers find the dress comfortable, with one mentioning it has pockets. \" ...It's flattering and I needed something that's comfortable and adjustable size wise postpartum. It's very stretchy and is easy to nurse in as well. \" Read more \" True to size, very comfortable . The material is heavy enough you don't need to wear a slip underneath. I loved the dress, it was great for a wedding. \" Read more \" Love this dress. Comfy and cute. Pockets!!! \" Read more \" ...This dress is the perfect outfit for any occasion. True to size and so comfortable , I forget I’m wearing a dress. LOL \" Read more 48 customers mention size, 42 positive, 6 negative 48 customers mention \"Size\" 42 positive 6 negative Customers like the dress's size, with several noting it's the perfect length, and one mentioning it works well for wider hips. \" Dress met my expectations. It was true to size , good quality and looked flawless on. Used it for our engagement pictures and they turned out so cute!... \" Read more \" Gorgeous dress! Very comfortable and perfect length . The material is great quality, and chest part is very stretchy for the ladies bigger chests.... \" Read more \" ...It’s also not see through & the length is perfect on my 5’9” frame! \" Read more \" Got this for my bridal shower and it was so cute! Good length and material. Fit great. Had to steam iron it prior to but it did t take long at all. \" Read more 41 customers mention color, 38 positive, 3 negative 41 customers mention \"Color\" 38 positive 3 negative Customers love the dress's color, particularly its beautiful white appearance, with one customer noting that it didn't fade. \" So cute! Color was perfect and not see through at all! Very pretty fit and flow to the dress. Wore to a wedding and got many compliments! \" Read more \" Great material, color and true to size. Will be purchasing another from this brand \" Read more \" Beautiful White Dress . \" Read more \" Why did you pick this product vs others?: Love the color and the length of the dress and it has pockets... \" Read more 41 customers mention material quality, 35 positive, 6 negative 41 customers mention \"Material quality\" 35 positive 6 negative Customers appreciate the dress's material quality, describing it as high quality with a nice feel. \" ...The fabric is soft and flowy. The elastic bodice was very comfortable. The embellished flowers on the fabric were subtle yet very nice.... \" Read more \" Got this for my bridal shower and it was so cute! Good length and material . Fit great. Had to steam iron it prior to but it did t take long at all. \" Read more \" Good material and felt really high quality. Big thing was it just didn't sit right on me.... \" Read more \" ...I am a 5’2” 130lbs and the size was good. Fabric is very nice , will get lots of wear out of this in the spring and summer. \" Read more 37 customers mention flattering, 30 positive, 7 negative 37 customers mention \"Flattering\" 30 positive 7 negative Customers find the dress flattering, with one mentioning it hides the tummy and another noting it doesn't hug the lower body. \" This dress can be dressed up for down. It's flattering and I needed something that's comfortable and adjustable size wise postpartum.... \" Read more \" I love this dress! It is so flattering and I think it would work well on all body types. It feels like great quality for the price point. \" Read more \" I absolutely loved wearing this dress to a wedding this weekend! Super flattering , comfortable material!... \" Read more \" ...While wearing this, I felt very confident; hides my tummy , my upper arms, fits well in the chest, etc.... \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Perfectly All White!",
        "body": "I purchased this dress, to wear on a cruise, for White Night. It was perfect and I received several compliments! I'm 5' 4\", weight about 140 and have a 34DDD bust. While wearing this, I felt very confident; hides my tummy, my upper arms, fits well in the chest, etc. I like the length as it was just above the ankles on me. It's feminine, light weight and it's not sheer like most white clothing is. While it cost a little more than I normally like to pay for clothing, I'm really glad I bought this dress. Read more",
        "author": "DolphinGirl",
        "rating": 5.0,
        "date": "November 19, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71dpGHuirNL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars perfect dress",
        "body": "very cute, i was looking for a longer dress for pictures we are going to be taking and it’s the perfect length. it fits nicely, for reference i am 5’4 and about 130lbs and ordered a small. it does have a little weight to it but definitely comfortable. Read more",
        "author": "Victoria",
        "rating": 5.0,
        "date": "October 15, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61JD4V20xXL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Good quality",
        "body": "So cute and fits great. I am a 5’2” 130lbs and the size was good. Fabric is very nice, will get lots of wear out of this in the spring and summer. Read more",
        "author": "Customer",
        "rating": 5.0,
        "date": "November 9, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Beautiful",
        "body": "This is a beautiful dress. I bought this dress for my sister, and the fit is lovely. She has a pear-shaped body, but it drapes really well, and the length isn't too long on her. It's a true midi dress on her 5'5\" frame. My only gripe is there's no inner lining, so if you buy a lighter color, it becomes slightly see through. Other than that, I would buy another one, but maybe in a darker color. Read more",
        "author": "Crystal Cho",
        "rating": 4.0,
        "date": "November 12, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Perfect for family photos!",
        "body": "This dress was perfect for our fall family photos! I ordered a size L in the apricot color and it was beautiful. I am 5’7”, 170lbs, soft belly (9 months postpartum) and this dress made me feel very pretty. I wore it with a nursing bra underneath but you could definitely wear it with a regular or no bra. It’s not see through at all and was so Comfortable! Highly recommend Read more",
        "author": "Jackie Panos",
        "rating": 5.0,
        "date": "November 26, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/81vZGW0JdEL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "3.0 out of 5 stars Pattern issue",
        "body": "Cute dress but the pattern is not very noticeable on the cleavage area. Also the material became very “rough” after steaming it. Wear and tear would definitely show after washing this a few times Read more",
        "author": "Anonymous",
        "rating": 3.0,
        "date": "November 29, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Comfortable & Flattering",
        "body": "The dress is super comfy! The stretchy top is great for any bust size and the body of the dress is surprisingly good quality. I love the color as well. The flutter sleeves are perfect as someone who has always been insecure about their upper arms! Lol. I’m 5’5 and 152lbs and I ordered the Medium in dark red. Read more",
        "author": "Lindsay",
        "rating": 5.0,
        "date": "December 12, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/718S-HmRGKL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/715lb4VCsDL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Great dress",
        "body": "Got this for my bridal shower and it was so cute! Good length and material. Fit great. Had to steam iron it prior to but it did t take long at all. Read more",
        "author": "Shelby Jordan",
        "rating": 5.0,
        "date": "November 9, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Short Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.",
  "about_this_item": "Womens Maxi Dress Short Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.",
  "long_description": "Womens Maxi Dress Short Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Wine, Hotpink, Blue, Apricot, Black, Sage, Dustyblue, Pink, White, Purple, Light Pink, Caramel, Green. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Short Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Wine, Hotpink, Blue, Apricot, Black, Sage, Dustyblue, Pink, White, Purple, Light Pink, Caramel, Green. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "b79d988f-95a1-4434-9337-55b9e93f934c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b79d988f-95a1-4434-9337-55b9e93f934c/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b79d988f-95a1-4434-9337-55b9e93f934c/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/1cdae205-6087-4b77-8eb7-4006d3e3a5ed.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "4811e44a-6b2a-4a60-bcf3-7e1d46009f18",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4811e44a-6b2a-4a60-bcf3-7e1d46009f18/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4811e44a-6b2a-4a60-bcf3-7e1d46009f18/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/1cdae205-6087-4b77-8eb7-4006d3e3a5ed.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "96e04bc5-30c0-44d9-8e75-e62474d7670d",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/96e04bc5-30c0-44d9-8e75-e62474d7670d/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/96e04bc5-30c0-44d9-8e75-e62474d7670d/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/1cdae205-6087-4b77-8eb7-4006d3e3a5ed.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "2f805720-74d3-46ff-852a-8a5f31df81db",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2f805720-74d3-46ff-852a-8a5f31df81db/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2f805720-74d3-46ff-852a-8a5f31df81db/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/1cdae205-6087-4b77-8eb7-4006d3e3a5ed.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "84d78d63-771f-4308-a9ab-1f77f17c1a9d",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/84d78d63-771f-4308-a9ab-1f77f17c1a9d/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/84d78d63-771f-4308-a9ab-1f77f17c1a9d/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/1cdae205-6087-4b77-8eb7-4006d3e3a5ed.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "3141bd56-93a7-48ef-8ded-ee4f944fafe7",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3141bd56-93a7-48ef-8ded-ee4f944fafe7/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3141bd56-93a7-48ef-8ded-ee4f944fafe7/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/1cdae205-6087-4b77-8eb7-4006d3e3a5ed.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "efffc345-47e6-406f-bfe5-167b8111646e",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/efffc345-47e6-406f-bfe5-167b8111646e/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/efffc345-47e6-406f-bfe5-167b8111646e/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/1cdae205-6087-4b77-8eb7-4006d3e3a5ed.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "9c07d5e1-024f-42d0-8877-939dcc42a894",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9c07d5e1-024f-42d0-8877-939dcc42a894/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9c07d5e1-024f-42d0-8877-939dcc42a894/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/1cdae205-6087-4b77-8eb7-4006d3e3a5ed.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "26407343-7a98-4961-b848-e2d3feeb04c4",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/26407343-7a98-4961-b848-e2d3feeb04c4/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/26407343-7a98-4961-b848-e2d3feeb04c4/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/1cdae205-6087-4b77-8eb7-4006d3e3a5ed.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "2103aea4-b761-4162-99d3-04df246b9893",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2103aea4-b761-4162-99d3-04df246b9893/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2103aea4-b761-4162-99d3-04df246b9893/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/1cdae205-6087-4b77-8eb7-4006d3e3a5ed.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "a1db4605-5b4a-4a5c-83cb-b1f24742363f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a1db4605-5b4a-4a5c-83cb-b1f24742363f/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a1db4605-5b4a-4a5c-83cb-b1f24742363f/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/1cdae205-6087-4b77-8eb7-4006d3e3a5ed.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "cc6ef074-bb2e-4b08-942d-b1d6f537a3ca",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/cc6ef074-bb2e-4b08-942d-b1d6f537a3ca/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/cc6ef074-bb2e-4b08-942d-b1d6f537a3ca/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/1cdae205-6087-4b77-8eb7-4006d3e3a5ed.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Wine": "https://m.media-amazon.com/images/I/41XiN0ACaYL._AC_SR38,50_.jpg",
    "Hotpink": "https://m.media-amazon.com/images/I/413Ih6NDfzL._AC_SR38,50_.jpg",
    "Blue": "https://m.media-amazon.com/images/I/317iIGQolVL._AC_SR38,50_.jpg",
    "Apricot": "https://m.media-amazon.com/images/I/318YQ8LuCxL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/316NP5KWbzL._AC_SR38,50_.jpg",
    "Sage": "https://m.media-amazon.com/images/I/313FoM0U-EL._AC_SR38,50_.jpg",
    "Dustyblue": "https://m.media-amazon.com/images/I/41cN+sEkeSL._AC_SR38,50_.jpg",
    "Pink": "https://m.media-amazon.com/images/I/41H3RSkhZZL._AC_SR38,50_.jpg",
    "White": "https://m.media-amazon.com/images/I/31v9c+iETuL._AC_SR38,50_.jpg",
    "Purple": "https://m.media-amazon.com/images/I/41hBWINcajL._AC_SR38,50_.jpg",
    "Light Pink": "https://m.media-amazon.com/images/I/31SEDsXTkPL._AC_SR38,50_.jpg",
    "Caramel": "https://m.media-amazon.com/images/I/41i4pQchY8L._AC_SR38,50_.jpg",
    "Green": "https://m.media-amazon.com/images/I/41hkz5yw7gL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Wine": "616X9jpTv0L",
    "Hotpink": "61rD7wXr72L",
    "Blue": "61x+hNbBmwL",
    "Apricot": "61BfB6KN3LL",
    "Black": "612tB5PBGjL",
    "Sage": "61PIpPjzCIL",
    "Dustyblue": "61kbv-hOfcL",
    "Pink": "61c2CefKYsL",
    "White": "61SwapPeLuL",
    "Purple": "61fg7N6vUgL",
    "Light Pink": "615KQtN4D2L",
    "Caramel": "61EjLq4xr1L",
    "Green": "61CUlpK3RVL"
  },
  "color_images": {
    "Wine": [
      "https://m.media-amazon.com/images/I/616X9jpTv0L._SL1500_.jpg"
    ],
    "Hotpink": [
      "https://m.media-amazon.com/images/I/61rD7wXr72L._SL1500_.jpg"
    ],
    "Blue": [
      "https://m.media-amazon.com/images/I/61x+hNbBmwL._SL1500_.jpg"
    ],
    "Apricot": [
      "https://m.media-amazon.com/images/I/61BfB6KN3LL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/612tB5PBGjL._SL1500_.jpg"
    ],
    "Sage": [
      "https://m.media-amazon.com/images/I/61PIpPjzCIL._SL1500_.jpg"
    ],
    "Dustyblue": [
      "https://m.media-amazon.com/images/I/61kbv-hOfcL._SL1500_.jpg"
    ],
    "Pink": [
      "https://m.media-amazon.com/images/I/61c2CefKYsL._SL1500_.jpg"
    ],
    "White": [
      "https://m.media-amazon.com/images/I/61SwapPeLuL._SL1500_.jpg"
    ],
    "Purple": [
      "https://m.media-amazon.com/images/I/61fg7N6vUgL._SL1500_.jpg"
    ],
    "Light Pink": [
      "https://m.media-amazon.com/images/I/615KQtN4D2L._SL1500_.jpg"
    ],
    "Caramel": [
      "https://m.media-amazon.com/images/I/61EjLq4xr1L._SL1500_.jpg"
    ],
    "Green": [
      "https://m.media-amazon.com/images/I/61CUlpK3RVL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-long-sleeve-evening",
      "title": "Womens Maxi Dress Long Sleeve Evening",
      "price": 80.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61VgahOOFhL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-v-neck-formal-long-sleeve",
      "title": "Womens Maxi Dress Bodycon V Neck Formal Long Sleeve",
      "price": 74.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51DTjtOSU7L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-sleeveless",
      "title": "Womens Maxi Dress Maxi Sleeveless",
      "price": 14.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/81lEDsT4+sL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-short-sleeve-v-neck-mermaid-evening",
      "title": "Womens Maxi Dress Short Sleeve V Neck Mermaid Evening",
      "price": 92.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61hHT7CUgRL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-short-sleeve-bodycon",
      "title": "Womens Dress Short Sleeve Bodycon",
      "price": 19.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/712Bs1orxjL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 145.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61TqENaLjiL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi",
      "title": "Womens Maxi Dress Maxi",
      "price": 62.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71zVhaS89ZL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-formal",
      "title": "Womens Maxi Dress Long Sleeve Formal",
      "price": 89.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61vsHnviwjL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 165.9,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71N1D-zbQHL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 36.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61Uh0mHFneL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-long-sleeve",
      "title": "Womens Maxi Dress Bodycon Long Sleeve",
      "price": 41.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61LYfcqqDNL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal",
      "title": "Womens Maxi Dress Formal",
      "price": 99.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51vSde8Jx3L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-bodycon-ruched",
      "title": "Womens Dress Bodycon Ruched",
      "price": 25.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61ZYZ+lXaKL._SL1500_.jpg"
      ]
    }
  ]
}