{
  "id": "womens-maxi-dress-cocktail-bodycon",
  "handle": "womens-maxi-dress-cocktail-bodycon",
  "sku": "JC3229",
  "asin": "B0DR7MTRZP",
  "title": "Womens Maxi Dress Cocktail Bodycon",
  "title_original": "ZESICA Women's 2026 Summer Mock Neck Casual Bodycon Dress Cap Sleeve Elegant Cocktail Party Long Midi Dresses",
  "brand": "Visit the ZESICA Store",
  "price": 39.99,
  "social_proof": {
    "bought_past_month": 107,
    "text": "107+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/51uHSouUIRL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61h7jsUNnpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ogWMX5SwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61f5LQW96xL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71zDc90-AqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71SzoNZCmAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61-ZT9EL6eL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ytMuyyWbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51c9NGwkfjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51ngNOW2AwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51uNkEP2eTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51z7R0FJTjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/510xqwPuYEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51EG2LPcWAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51jAwsOUo8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51mYwyUJDIL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51vAajfQ0eL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51CpqUDZf4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51ZLWnzwbGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51SkXM7vx8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51divbvjmyL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/51uHSouUIRL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61h7jsUNnpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ogWMX5SwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61f5LQW96xL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71zDc90-AqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71SzoNZCmAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61-ZT9EL6eL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ytMuyyWbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51c9NGwkfjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51ngNOW2AwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51uNkEP2eTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51z7R0FJTjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/510xqwPuYEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51EG2LPcWAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51jAwsOUo8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51mYwyUJDIL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51vAajfQ0eL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51CpqUDZf4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51ZLWnzwbGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51SkXM7vx8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51divbvjmyL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Product Dimensions ‏": "‎ 1.97 x 0.79 x 0.39 inches",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ December 23, 2024",
    "ASIN ‏": "‎ B0DR7PDL4J",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#30,477 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #192 in Women's Club & Night Out Dresses",
    "Customer Reviews": "4.3 4.3 out of 5 stars (473)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Sky",
      "Brown",
      "Apricot",
      "Rose",
      "Black",
      "Sage",
      "Coffee",
      "Dustyblue",
      "Deepgreen",
      "Navy",
      "Pink",
      "Greygreen",
      "Light Purple",
      "Green"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.3,
    "count": 473,
    "customers_say": "Customers find this dress classy and well-fitting, with one noting it's not restrictive. The dress receives positive feedback for its quality, comfort, and material thickness, with one customer highlighting its stretchiness and flattering wrap style. They appreciate the ideal size and length, and one mentions it works well for different body types. Customers like the color options, with one specifically praising the rich chocolate brown shade. Select to learn more Style Fit Quality Flattering Comfort Size Material thickness Color 94 customers mention \"Style\" 92 positive 2 negative Customers find the dress classy looking and very nice. \" Beautiful dress , fits true to size and fits really nice! Stretchy and the gathering in the waist hides imperfections. Got a lot of compliments\" Read more \"Exceeded my expectations! Beautiful modest flattering and comfortable. True to size. I bought a size medium 5’4 160lbs fit perfectly and comfortably.\" Read more \"...I got large because I like it oversize and its really so cute and elegant I am so happy with the purchase\" Read more \" Cute but not made well...\" Read more 77 customers mention \"Fit\" 65 positive 12 negative Customers are satisfied with how the dress fits, describing it as amazing and beautifully fitting. \"...Style and quality of material. Great fit , true to size. Love this dress. Highly recommend....\" Read more \"This dress is beautiful. Loved the Apricot color, and the fit was perfect . I ordered an \"S\" and it is true to size.\" Read more \" Perfect Fit ! Love the dress - super classy! Lots of compliments !\" Read more \" Flattering fit , heavy, drapey, stretchy fabric that makes this dress appear just like the photos. It’s not clingy and the colour is vivid....\" Read more 56 customers mention \"Quality\" 51 positive 5 negative Customers find the dress to be well-made and professional, with one customer noting that the stitching and edges are very good. \" Great dress ! Super cute on.. very elegant and flattering. Love it, perfect for my trip.\" Read more \" Nice dress , true to size. Very comfortable. Love the color and style.\" Read more \"Very classy, well made and the perfect color for fall. I'm 5'8, 130lbs and the medium fit perfect. You will love it too!\" Read more \"Absolutely classy and good quality . I will be ordering another color.\" Read more 40 customers mention \"Flattering\" 39 positive 1 negative Customers find the dress flattering, with one mentioning that it enhances all the right curves, while another notes it can be worn with both heels and flats. \"Exceeded my expectations! Beautiful modest flattering and comfortable. True to size. I bought a size medium 5’4 160lbs fit perfectly and comfortably.\" Read more \" Very flattering ! Love this dress, so much so that I got a second one in another color. Very forgiving. Not - see through....\" Read more \"I love this dress. Very comfortable and stretchy. And so flattering - I got a ton of compliments (especially on my waist looking small)!\" Read more \"...The fabric is stretchy and doesn’t wrinkle. It’s super flattering and can be dressed up or down.\" Read more 39 customers mention \"Comfort\" 38 positive 1 negative Customers find the dress comfortable, with one mentioning it is very forgiving. \"Very nice dress, runs true to size. It has a lot of stretch and comfortable . You can wear with heels or flats. Black is very classy, did not wrinkle.\" Read more \"I love this dress. Very comfortable and stretchy. And so flattering - I got a ton of compliments (especially on my waist looking small)!\" Read more \"Love the fabric! So comfortable and flattering. Recently postpartum friendly! I have 3 dresses from this brand and they are all amazing.\" Read more \"...It is so flattering, comfy , easy to take care of and looks more expensive than it is. I want to get it in every color!...\" Read more 36 customers mention \"Size\" 26 positive 10 negative Customers like the dress's size and length, with one mentioning it works well for various body types and another noting it's suitable for postpartum wear. \"Very pretty dress. Does hug the body. True to size . Ordered small, it fit my 110lb friend. Did run a bit long for us shorter people.\" Read more \"...The stitching and edges were very good and nice together. The dress was true to size as well as length I’m 5’6...\" Read more \"...Other colors ordered were new. Dress runs large .\" Read more \"Very nice dress, runs true to size . It has a lot of stretch and comfortable. You can wear with heels or flats. Black is very classy, did not wrinkle.\" Read more 35 customers mention \"Material thickness\" 25 positive 10 negative Customers like the material of the dress, describing it as thick and not thin, with one customer noting it's breathable. \"...I felt elegant. Nice light fabric \" Read more \"Runs a little small, but it is a nice dress with cool fabric .\" Read more \"style looks good, but fabric look cheap , it too long\" Read more \"Flattering, comfortable, material is breathable , but is full of wrinkles. I steamed the dress a few times. I received so many compliments....\" Read more 25 customers mention \"Color\" 25 positive 0 negative Customers like the color of the dress, particularly the green shade, with one customer noting its rich chocolate brown hue. \" Beautiful color , love the style, too bad is impossible to remove the wrinkles, and I hang the dresss in my bathroom and let the shower steam for 3...\" Read more \"This is a beautiful dress and the color looks great on me . It fits good, not overly tight. I love it....\" Read more \"...The color was so pretty but definitely want to add it in black to my wardrobe. The material makes this a great wear for hot or cool months....\" Read more \"Very classy, well made and the perfect color for fall . I'm 5'8, 130lbs and the medium fit perfect. You will love it too!\" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Versatile dress",
        "body": "Very nice dress, runs true to size. It has a lot of stretch and comfortable. You can wear with heels or flats. Black is very classy, did not wrinkle. Read more",
        "author": "ROBIN PONCE",
        "rating": 5.0,
        "date": "November 23, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Awesome dress!!",
        "body": "Beautiful and comfortable dress. I have one in green and black. Would definitely buy in other colors. High quality, stretchy material. For reference, 40 C-D bust and about 200lbs. Large fit very comfortable. If you want it to drape more, you could go with an XL. In the photo, black one is a large, green is an XL. Held up after washing. Layed flat to dry. No shrinkage. Read more",
        "author": "R. Michaels",
        "rating": 5.0,
        "date": "September 23, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71tqUuyd7DL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Need this dress",
        "body": "Beautiful - easy fitting, ultra comfortable dress! The brown is a beautiful decadent color! Can’t beat this price! Read more",
        "author": "JP",
        "rating": 5.0,
        "date": "December 5, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Dressy and fitting",
        "body": "I needed a dress for our cruise but also wanted something I could wear again for dressy events. This is a great dress. I would size up if you don’t want it to be snug on. Read more",
        "author": "Customer",
        "rating": 4.0,
        "date": "July 18, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Great elegant dress",
        "body": "Love this dress! If you are on the fence you should get it! It’s so elegant and fits great! The fabric and feel is also nice, it’s stretchy and fits my body great! Read more",
        "author": "Molly",
        "rating": 5.0,
        "date": "December 14, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars FIVE STARS!!",
        "body": "I’m obsessed with this dress, it is so comfortable and flattering. I am 5ft tall and have a boxy body type, but this dress was the perfect length for me AND gave me a lot of shape. I swear I’ve never felt more beautiful and sexy in another dress! I received so many compliments all night. I’m dying to be able to wear it to another event! Read more",
        "author": "Riley and Madi",
        "rating": 5.0,
        "date": "October 27, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61vxjD-JKQL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "3.0 out of 5 stars Nice dress, just not a good fit for me.",
        "body": "Had to return: This is a very nice dress for the right person, but it just didn’t look right on me. It will probably work fine for someone with a more voluptuous figure. Love the color. Read more",
        "author": "P.H.",
        "rating": 3.0,
        "date": "July 29, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Great dress! (So so fabric/quality)",
        "body": "It is a very flattering dress and fits well! However, the fabric balled up after one wash (on hand wash cycle). 5’11” size large for reference Read more",
        "author": "Customer",
        "rating": 4.0,
        "date": "October 20, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71EbTBCzHwL._SY88._SL1500_.jpg"
        ]
      }
    ]
  },
  "short_description": "Womens Maxi Dress Cocktail Bodycon is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.",
  "about_this_item": "Womens Maxi Dress Cocktail Bodycon is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.",
  "long_description": "Womens Maxi Dress Cocktail Bodycon is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Sky, Brown, Apricot, Rose, Black, Sage, Coffee, Dustyblue, Deepgreen, Navy, Pink, Greygreen, Light Purple, Green. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Cocktail Bodycon is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Sky, Brown, Apricot, Rose, Black, Sage, Coffee, Dustyblue, Deepgreen, Navy, Pink, Greygreen, Light Purple, Green. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "38592ec3-5b4b-4440-96dd-11b14e8d0eb6",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/38592ec3-5b4b-4440-96dd-11b14e8d0eb6/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/38592ec3-5b4b-4440-96dd-11b14e8d0eb6/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/2726654e-2bbe-426c-9119-456b1d850dcf.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "efa9f040-7402-41b7-9328-0b323570f34d",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/efa9f040-7402-41b7-9328-0b323570f34d/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/efa9f040-7402-41b7-9328-0b323570f34d/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/2726654e-2bbe-426c-9119-456b1d850dcf.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "4670b5b1-f163-4b47-b84e-362b6c62b45e",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4670b5b1-f163-4b47-b84e-362b6c62b45e/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4670b5b1-f163-4b47-b84e-362b6c62b45e/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/2726654e-2bbe-426c-9119-456b1d850dcf.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "287cea84-6796-4c9b-a05c-dd67df119e4f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/287cea84-6796-4c9b-a05c-dd67df119e4f/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/287cea84-6796-4c9b-a05c-dd67df119e4f/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/2726654e-2bbe-426c-9119-456b1d850dcf.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "1faa405e-4630-484e-b86b-a448043b746f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1faa405e-4630-484e-b86b-a448043b746f/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1faa405e-4630-484e-b86b-a448043b746f/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/2726654e-2bbe-426c-9119-456b1d850dcf.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "9a674f81-8b3d-4fe6-8a92-0373dd8fd646",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9a674f81-8b3d-4fe6-8a92-0373dd8fd646/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9a674f81-8b3d-4fe6-8a92-0373dd8fd646/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/2726654e-2bbe-426c-9119-456b1d850dcf.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "e4a4943d-5b22-4c06-9045-44e3b71c4723",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e4a4943d-5b22-4c06-9045-44e3b71c4723/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e4a4943d-5b22-4c06-9045-44e3b71c4723/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/2726654e-2bbe-426c-9119-456b1d850dcf.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "eb273768-06cb-48e1-8339-6334ec970137",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/eb273768-06cb-48e1-8339-6334ec970137/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/eb273768-06cb-48e1-8339-6334ec970137/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/2726654e-2bbe-426c-9119-456b1d850dcf.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "cb695430-325f-4f9c-be96-f115be91011d",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/cb695430-325f-4f9c-be96-f115be91011d/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/cb695430-325f-4f9c-be96-f115be91011d/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/2726654e-2bbe-426c-9119-456b1d850dcf.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "dc46399a-3de7-418e-bb25-b85323d62400",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/dc46399a-3de7-418e-bb25-b85323d62400/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/dc46399a-3de7-418e-bb25-b85323d62400/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/2726654e-2bbe-426c-9119-456b1d850dcf.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "1a466a63-3d21-4a6d-ab7e-bbf74cb3d874",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1a466a63-3d21-4a6d-ab7e-bbf74cb3d874/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1a466a63-3d21-4a6d-ab7e-bbf74cb3d874/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/2726654e-2bbe-426c-9119-456b1d850dcf.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "d0a89394-fed4-4171-8cac-74583bf6556c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d0a89394-fed4-4171-8cac-74583bf6556c/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d0a89394-fed4-4171-8cac-74583bf6556c/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/2726654e-2bbe-426c-9119-456b1d850dcf.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Sky": "https://m.media-amazon.com/images/I/31WZl+TYyWL._AC_SR38,50_.jpg",
    "Brown": "https://m.media-amazon.com/images/I/31HpJ4ek-3L._AC_SR38,50_.jpg",
    "Apricot": "https://m.media-amazon.com/images/I/31a5ehp7XiL._AC_SR38,50_.jpg",
    "Rose": "https://m.media-amazon.com/images/I/319r53Gyg6L._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31i3RgflGBL._AC_SR38,50_.jpg",
    "Sage": "https://m.media-amazon.com/images/I/31DX6M2DjFL._AC_SR38,50_.jpg",
    "Coffee": "https://m.media-amazon.com/images/I/31r5D3BjfTL._AC_SR38,50_.jpg",
    "Dustyblue": "https://m.media-amazon.com/images/I/31yAKfIAp7L._AC_SR38,50_.jpg",
    "Deepgreen": "https://m.media-amazon.com/images/I/31hc39a8htL._AC_SR38,50_.jpg",
    "Navy": "https://m.media-amazon.com/images/I/31MvOVenYNL._AC_SR38,50_.jpg",
    "Pink": "https://m.media-amazon.com/images/I/31H3bzZXr9L._AC_SR38,50_.jpg",
    "Greygreen": "https://m.media-amazon.com/images/I/312z4UEWABL._AC_SR38,50_.jpg",
    "Light Purple": "https://m.media-amazon.com/images/I/31L4YcS3kML._AC_SR38,50_.jpg",
    "Green": "https://m.media-amazon.com/images/I/31SwpOWG4CL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Sky": "51c9NGwkfjL",
    "Brown": "51ngNOW2AwL",
    "Apricot": "51uNkEP2eTL",
    "Rose": "51z7R0FJTjL",
    "Black": "51uHSouUIRL",
    "Sage": "510xqwPuYEL",
    "Coffee": "51EG2LPcWAL",
    "Dustyblue": "51jAwsOUo8L",
    "Deepgreen": "51mYwyUJDIL",
    "Navy": "51vAajfQ0eL",
    "Pink": "51CpqUDZf4L",
    "Greygreen": "51ZLWnzwbGL",
    "Light Purple": "51SkXM7vx8L",
    "Green": "51divbvjmyL"
  },
  "color_images": {
    "Sky": [
      "https://m.media-amazon.com/images/I/51c9NGwkfjL._SL1500_.jpg"
    ],
    "Brown": [
      "https://m.media-amazon.com/images/I/51ngNOW2AwL._SL1500_.jpg"
    ],
    "Apricot": [
      "https://m.media-amazon.com/images/I/51uNkEP2eTL._SL1500_.jpg"
    ],
    "Rose": [
      "https://m.media-amazon.com/images/I/51z7R0FJTjL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/51uHSouUIRL._SL1500_.jpg"
    ],
    "Sage": [
      "https://m.media-amazon.com/images/I/510xqwPuYEL._SL1500_.jpg"
    ],
    "Coffee": [
      "https://m.media-amazon.com/images/I/51EG2LPcWAL._SL1500_.jpg"
    ],
    "Dustyblue": [
      "https://m.media-amazon.com/images/I/51jAwsOUo8L._SL1500_.jpg"
    ],
    "Deepgreen": [
      "https://m.media-amazon.com/images/I/51mYwyUJDIL._SL1500_.jpg"
    ],
    "Navy": [
      "https://m.media-amazon.com/images/I/51vAajfQ0eL._SL1500_.jpg"
    ],
    "Pink": [
      "https://m.media-amazon.com/images/I/51CpqUDZf4L._SL1500_.jpg"
    ],
    "Greygreen": [
      "https://m.media-amazon.com/images/I/51ZLWnzwbGL._SL1500_.jpg"
    ],
    "Light Purple": [
      "https://m.media-amazon.com/images/I/51SkXM7vx8L._SL1500_.jpg"
    ],
    "Green": [
      "https://m.media-amazon.com/images/I/51divbvjmyL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-off-shoulder",
      "title": "Womens Maxi Dress Off Shoulder",
      "price": 129.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61wC5ifxGwL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-ruched-maxi-split-bodycon-high-split",
      "title": "Womens Maxi Dress Ruched Maxi Split Bodycon High Split",
      "price": 21.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61ygQxbpMiL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-sleeveless-bodycon",
      "title": "Womens Dress Sleeveless Bodycon",
      "price": 23.45,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61I+nA44lyL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-formal-maxi-off-shoulder-long-sleeve-cocktail",
      "title": "Womens Maxi Dress Bodycon Formal Maxi Off Shoulder Long Sleeve Cocktail",
      "price": 29.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61BkDrZjF1L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-ruched",
      "title": "Womens Maxi Dress Long Sleeve Ruched",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51Svqz8d6gL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 88.49,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61imYyqh0TL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-v-neck",
      "title": "Womens Dress V Neck",
      "price": 35.88,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61xktoXgNoL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-bodycon",
      "title": "Womens Dress Bodycon",
      "price": 74.49,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61YXJwU2G0L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail-short-sleeve",
      "title": "Womens Dress Cocktail Short Sleeve",
      "price": 36.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/51VJVq72XsL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-ruched-sleeveless-cocktail-split-bodycon-maxi",
      "title": "Womens Maxi Dress Ruched Sleeveless Cocktail Split Bodycon Maxi",
      "price": 51.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61HFY2CIRkL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-bodycon-formal-long-sleeve-cocktail",
      "title": "Womens Maxi Dress Maxi Bodycon Formal Long Sleeve Cocktail",
      "price": 89.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61Obg23nrhL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-maxi-one-shoulder-sleeveless",
      "title": "Womens Maxi Dress Formal Maxi One Shoulder Sleeveless",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51ePfLM7P+L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-mermaid-long-sleeve",
      "title": "Womens Maxi Dress Mermaid Long Sleeve",
      "price": 128.89,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51SrkBETNNL._SL1500_.jpg"
      ]
    }
  ]
}