{
  "id": "womens-dress-bodycon-boat-neck",
  "handle": "womens-dress-bodycon-boat-neck",
  "sku": "JC2701",
  "asin": "B0DR1V8XSB",
  "title": "Womens Dress Bodycon Boat Neck",
  "title_original": "Trendy Queen Womens Boat Neck Going Out Mini Dress Summer Party Club Bodycon Dresses",
  "brand": "Visit the Trendy Queen Store",
  "price": 29.99,
  "social_proof": {
    "bought_past_month": 1085,
    "text": "1085+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/61WEuVl80xL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/6116h8fHXkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61EqXpzEysL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61GvRJTXFrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51OVG7pssKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51g9ayP+ztL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61A1YyXfWSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61U-cXlbrQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ur6aetCUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61YVxf3HTUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61v4+yi9uGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61kProrct5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61bS4Dkrg9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/618vdzVsvDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61op4CCktYL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Mupmwg+rL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/617AsIhVh5L._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/61WEuVl80xL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/6116h8fHXkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61EqXpzEysL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61GvRJTXFrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51OVG7pssKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51g9ayP+ztL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61A1YyXfWSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61U-cXlbrQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ur6aetCUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61YVxf3HTUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61v4+yi9uGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61kProrct5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61bS4Dkrg9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/618vdzVsvDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61op4CCktYL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Mupmwg+rL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/617AsIhVh5L._SL1500_.jpg"
  ],
  "aplus_images": [
    "https://m.media-amazon.com/images/I/31piKjlQLBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31krjmXZdJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31y%2Brxii6sL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/311ZZusmT%2BL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31yIp%2Bv-HQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41C3wjQx35L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31x9NiC2FhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31Rgs5rUrkL._SL1500_.jpg"
  ],
  "description_images": [
    "https://m.media-amazon.com/images/I/31piKjlQLBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31krjmXZdJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31y%2Brxii6sL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/311ZZusmT%2BL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31yIp%2Bv-HQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41C3wjQx35L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31x9NiC2FhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31Rgs5rUrkL._SL1500_.jpg"
  ],
  "bullets": [],
  "specs": {
    "Item model number ‏": "‎ TRDNEZ0320",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ December 20, 2024",
    "ASIN ‏": "‎ B0DR1SNZZW",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#35,489 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #194 in Women's Club & Night Out Dresses #432 in Women's Casual Dresses",
    "Customer Reviews": "4.3 4.3 out of 5 stars (622)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Red",
      "Brown",
      "Pink",
      "White",
      "Cream",
      "Hot Pink",
      "Sage Green",
      "Black",
      "Dusty Blue",
      "Navy Blue",
      "Green",
      "Grey"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.3,
    "count": 622,
    "customers_say": "Customers find the dress beautiful and well-made, with a flattering fit that hugs curves and is stretchy. The style receives positive feedback, with one customer noting the boat neck adds a touch of class, while another mentions it pairs well with casual footwear like flip flops or sneakers. Customers disagree on whether the dress is true to size, with some reporting it runs small, and opinions vary on its sheerness, with some finding it not see-through while others say it's see-through. Generated from the text of customer reviews Select to learn more Style (58) Quality (34) Flattering (22) Comfort (21) Stretchiness (16) Fit (64) Sheerness (23) Size (20) 58 customers mention style, 56 positive, 2 negative 58 customers mention \"Style\" 56 positive 2 negative Customers find the dress cute and sexy without being too revealing, with one customer noting that the boat neck adds a touch of class, while another mentions it pairs well with casual footwear like flip flops or sneakers. \" ...It's super cute though, so if you're thinking about getting it go ahead but just make sure you order one size up. I promise you'll thank me later!!!!... \" Read more \" Cute but I recommend sizing up if you have a curvier build. \" Read more \" Cute dress ! You get a good dress for what you pay. It was not see through at all. It was a little bit of a tight fit, but thats the design.... \" Read more \" Beautiful dress . I ordered Large green. I am 5'6 and 175lbs. Material is nice. I did wear body suite under because cellulite does show a little.... \" Read more 34 customers mention quality, 32 positive, 2 negative 34 customers mention \"Quality\" 32 positive 2 negative Customers find the dress beautifully made and consider it the best dress ever, though some mention it is very cheap. \" This is a great dress . Love the neckline and the ruching on the sides. I have the black in a medium, and the khaki color in a small.... \" Read more \" ...a large would have still been too short but the dress itself is good quality . \" Read more \" Amazing dress \" Read more \" Nice Dress ... \" Read more 22 customers mention flattering, 22 positive, 0 negative 22 customers mention \"Flattering\" 22 positive 0 negative Customers find the dress flattering, noting that it hugs their curves and fits just right. One customer mentions that it perfectly sculpts their body. \" Super sexy and flattering . Material is thick. Fits true to size. I got a small. I’m 5’4” and ~145lbs. I’m mostly muscle not fat (covers face) \" Read more \" ...the photos, this thing hugs all of the curves of your body and is very flattering if you've got any kind of hourglass-y figure going on.... \" Read more \" This is a really flattering dress . It is heavy enough to hide bra and pantie lines without being too heavy.... \" Read more \" ...the material is not super thin and it is super flattering , \" Read more 21 customers mention comfort, 19 positive, 2 negative 21 customers mention \"Comfort\" 19 positive 2 negative Customers find the dress comfortable, with one specifically mentioning their love for the pink version. \" Most comfortable and flattering dress EVER!! The dress made me look hot and was comfortable to wear. The price was a STEAL!! \" Read more \" ...Everything I’ve bought is amazing quality. So soft. So comfortable . Never have any issues! Everything fits to size. \" Read more \" Loved it, super stretchy, comfy , I think double lined! Exactly fits like the picture! Not see through but obv white so limited undergarments!... \" Read more \" ...It's not see through and it's very comfortable . The price was extremely reasonable. \" Read more 16 customers mention stretchiness, 13 positive, 3 negative 16 customers mention \"Stretchiness\" 13 positive 3 negative Customers like the dress's stretchiness. \" it is stretchy , i would have sized down just for a more flawless fit! it is a great dress for a night out or a special event.... \" Read more \" super classy and flattering, really good thick and stretchy material ! looks and feels expensive love this dress.... \" Read more \" Loved it, super stretchy , comfy, I think double lined! Exactly fits like the picture! Not see through but obv white so limited undergarments!... \" Read more \" ...It hugs just right—snatched, but still breathable (shoutout to stretch fabric ).... \" Read more 64 customers mention fit, 44 positive, 20 negative 64 customers mention \"Fit\" 44 positive 20 negative Customers have mixed opinions about the dress's fit, with some finding it perfect and noting its good length, while others report it being too short. \" ...It's very cute and form fitting but definitely not true to size. I hope this helps someone.... \" Read more \" The absolute perfect to throw on little black dress. Great fit ! \" Read more \" ...I did end up returning because it was too tight and too short for my liking. I got a medium and for reference I am 5'4\" and weigh 147.... \" Read more \" Fits perfectly Nice material \" Read more 23 customers mention sheerness, 16 positive, 7 negative 23 customers mention \"Sheerness\" 16 positive 7 negative Customers have mixed opinions about the dress's sheerness, with some finding it opaque while others report it being see-through. \" Perfect dress for semi- formal night or a nice dinner. It's not see through and it's very comfortable. The price was extremely reasonable. \" Read more \" ... Not see through AT ALL . Material is thin so even if we had went on a walk in July, I would have been comfortable. Wonderful value for the cost.... \" Read more \" ...was that even with wearing a nude colored bra & underwear, it was see through , which ultimately lead to me returning the product.... \" Read more \" ...I bought it in 3 colors!! The white isn’t see through which is hard for a white dress!! It’s a thicker material and so soft and comfortable.... \" Read more 20 customers mention size, 7 positive, 13 negative 20 customers mention \"Size\" 7 positive 13 negative Customers have mixed opinions about the dress's sizing, with some finding it true to size while others report that it runs small. \" I wanted to love this, but it was WAY too small . I ordered my usual size and couldn’t even get it over my shoulders to pull it down.... \" Read more \" True to size . I did get some shape wear to even everything out. Helps but definitely not necessary! \" Read more \" ...The dress runs small . \" Read more \" Runs very small \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Amazing dress for a great deal!",
        "body": "So cute! I received so many compliments in this dress. It's VERY form fitting, and the color is perfect. What a deal!!! Read more",
        "author": "Elizabeth Danko",
        "rating": 5.0,
        "date": "December 10, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Nice Dress",
        "body": "Bought this for the GF and she loves it. Looks great in it too. This was a duplicate purchase with a black one too. The only thing she commented on was that it appears to run a little on the small size but it does stretch and hugs her curves nicely making it form fitting. Read more",
        "author": "Jpu535",
        "rating": 5.0,
        "date": "September 8, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Cute and cozy",
        "body": "Soft fabric, fits just right, and looks to be quality Read more",
        "author": "Kathleen",
        "rating": 4.0,
        "date": "October 7, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Little Black Dress Energy—On Point",
        "body": "This dress? Whew. Straight-up serve. The boat neck gives it a touch of class, while the bodycon fit brings all the sass. It hugs just right—snatched, but still breathable (shoutout to stretch fabric). Perfect for a night out, date night, or when you just feel like being that girl. The length is short, but not scandalous—just enough to show off the legs and keep it classy. Toss on some heels and gold hoops, and you're ready to shut down the room. If you're on the fence, hop off and add to cart. You won’t regret it. Read more",
        "author": "Tisha",
        "rating": 5.0,
        "date": "April 1, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Say yes!!",
        "body": "I ordered this dress last minute and it did not disappoint! Simple but elegant, tight but sophisticated. Ordered it for my engagement (yes I knew it was happening lol) and I could not have been happier. Not see through AT ALL. Material is thin so even if we had went on a walk in July, I would have been comfortable. Wonderful value for the cost. So glad I ordered this dress for one of the most important of days. Read more",
        "author": "Taylor King",
        "rating": 5.0,
        "date": "August 4, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71PzbCY-c3L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "1.0 out of 5 stars Sent to me worn",
        "body": "The media could not be loaded. I bought this dress yesterday and received it today. Upon opening it, it looks as if the dress has already been worn by someone else. This has never happened to me before and considering this is supposed to be a new item, this is extremely unsanitary. It has someone else’s hair as well as deodorant stains on it. I am extremely disappointed. Read more",
        "author": "Kayla Reid",
        "rating": 1.0,
        "date": "November 26, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/617RloiEO7L._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/61CSpCLvTdL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/611bg+lN1WL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/61AU3kcJ1VL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars A real show stopper!",
        "body": "YOWZA, this dress looks INCREDIBLE. Like, way hotter than I thought it would be. If you can't tell from the photos, this thing hugs all of the curves of your body and is very flattering if you've got any kind of hourglass-y figure going on. I must've missed the ruching in the photos when I ordered it, but I actually really like that detail. It keeps the dress from being too plain. The dress is on the shorter side-- It hit mid thigh for me, about 1/2\" below the ends of my fingertips for me, a 5'9\" girly. I ordered a medium because I wanted it to be fitted, and it doesn't slide up when I move around in it, so we love that. I've dance tested it, walked in heels, sat down and stood up multiple times, and it seems like it passes all of the \"could this be terribly embarrassing if I tried to do this in public and something went wrong\" tests for me. The material was a lot thicker/nicer than I anticipated it to be, and I didn't find it to be see-through at all, but I'd probably still wear some seamless flesh colored undies juuuuust in case. LOVE this dress. I'm tempted to buy it in more colors! Read more",
        "author": "Corinne",
        "rating": 5.0,
        "date": "April 11, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Size up if you need too",
        "body": "Looks good but not very stretchy Read more",
        "author": "Victoria O",
        "rating": 5.0,
        "date": "November 28, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Dress Bodycon Boat Neck is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.",
  "about_this_item": "Womens Dress Bodycon Boat Neck is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.",
  "long_description": "Womens Dress Bodycon Boat Neck is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Red, Brown, Pink, White, Cream, Hot Pink, Sage Green, Black, Dusty Blue, Navy Blue, Green, Grey. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Dress Bodycon Boat Neck is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/31piKjlQLBL._SL1500_.jpg",
      "alt": "Womens Dress Bodycon Boat Neck details image 1"
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/31krjmXZdJL._SL1500_.jpg",
      "alt": "Womens Dress Bodycon Boat Neck details image 2"
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/31y%2Brxii6sL._SL1500_.jpg",
      "alt": "Womens Dress Bodycon Boat Neck details image 3"
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/311ZZusmT%2BL._SL1500_.jpg",
      "alt": "Womens Dress Bodycon Boat Neck details image 4"
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Red, Brown, Pink, White, Cream, Hot Pink, Sage Green, Black, Dusty Blue, Navy Blue, Green, Grey. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/31yIp%2Bv-HQL._SL1500_.jpg",
      "alt": "Womens Dress Bodycon Boat Neck details image 5"
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "901cdda6-ef97-4f88-b9ae-26ad1afaf671",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/901cdda6-ef97-4f88-b9ae-26ad1afaf671/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/901cdda6-ef97-4f88-b9ae-26ad1afaf671/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/0d0a42ec-e94b-4e18-9bc7-ff4fbd1a5cde.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "749dc192-c7da-4f18-a586-875518643535",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/749dc192-c7da-4f18-a586-875518643535/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/749dc192-c7da-4f18-a586-875518643535/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/0d0a42ec-e94b-4e18-9bc7-ff4fbd1a5cde.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Red": "https://m.media-amazon.com/images/I/31AQoT2BabL._AC_SR38,50_.jpg",
    "Brown": "https://m.media-amazon.com/images/I/314iFgn-rQL._AC_SR38,50_.jpg",
    "Pink": "https://m.media-amazon.com/images/I/316UCopsurL._AC_SR38,50_.jpg",
    "White": "https://m.media-amazon.com/images/I/317YOug-TyL._AC_SR38,50_.jpg",
    "Cream": "https://m.media-amazon.com/images/I/31wQhdMm8qL._AC_SR38,50_.jpg",
    "Hot Pink": "https://m.media-amazon.com/images/I/31SBFUci4AL._AC_SR38,50_.jpg",
    "Sage Green": "https://m.media-amazon.com/images/I/31rxV0xZmuL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/310PyIpmQAL._AC_SR38,50_.jpg",
    "Dusty Blue": "https://m.media-amazon.com/images/I/312BqFuiB4L._AC_SR38,50_.jpg",
    "Navy Blue": "https://m.media-amazon.com/images/I/313YybHUv5L._AC_SR38,50_.jpg",
    "Green": "https://m.media-amazon.com/images/I/31ak5JuLUBL._AC_SR38,50_.jpg",
    "Grey": "https://m.media-amazon.com/images/I/31l5Z2MK7DL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Red": "61A1YyXfWSL",
    "Brown": "61U-cXlbrQL",
    "Pink": "61ur6aetCUL",
    "White": "61YVxf3HTUL",
    "Cream": "61v4+yi9uGL",
    "Hot Pink": "61kProrct5L",
    "Sage Green": "61bS4Dkrg9L",
    "Black": "61WEuVl80xL",
    "Dusty Blue": "618vdzVsvDL",
    "Navy Blue": "61op4CCktYL",
    "Green": "61Mupmwg+rL",
    "Grey": "617AsIhVh5L"
  },
  "color_images": {
    "Red": [
      "https://m.media-amazon.com/images/I/61A1YyXfWSL._SL1500_.jpg"
    ],
    "Brown": [
      "https://m.media-amazon.com/images/I/61U-cXlbrQL._SL1500_.jpg"
    ],
    "Pink": [
      "https://m.media-amazon.com/images/I/61ur6aetCUL._SL1500_.jpg"
    ],
    "White": [
      "https://m.media-amazon.com/images/I/61YVxf3HTUL._SL1500_.jpg"
    ],
    "Cream": [
      "https://m.media-amazon.com/images/I/61v4+yi9uGL._SL1500_.jpg"
    ],
    "Hot Pink": [
      "https://m.media-amazon.com/images/I/61kProrct5L._SL1500_.jpg"
    ],
    "Sage Green": [
      "https://m.media-amazon.com/images/I/61bS4Dkrg9L._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/61WEuVl80xL._SL1500_.jpg"
    ],
    "Dusty Blue": [
      "https://m.media-amazon.com/images/I/618vdzVsvDL._SL1500_.jpg"
    ],
    "Navy Blue": [
      "https://m.media-amazon.com/images/I/61op4CCktYL._SL1500_.jpg"
    ],
    "Green": [
      "https://m.media-amazon.com/images/I/61Mupmwg+rL._SL1500_.jpg"
    ],
    "Grey": [
      "https://m.media-amazon.com/images/I/617AsIhVh5L._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-formal-bodycon-cocktail-maxi-long-sleeve",
      "title": "Womens Maxi Dress Formal Bodycon Cocktail Maxi Long Sleeve",
      "price": 46.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/610r6Gi5q+L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-evening-one-shoulder-bodycon",
      "title": "Womens Dress Evening One Shoulder Bodycon",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61oVfV66vuL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening-v-neck-long-sleeve",
      "title": "Womens Maxi Dress Formal Evening V Neck Long Sleeve",
      "price": 89.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/51Ri6WY-AIL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-short-sleeve-cocktail-v-neck",
      "title": "Womens Dress Short Sleeve Cocktail V Neck",
      "price": 38.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/711qjQG4GEL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-ruched-bodycon-long-sleeve-maxi",
      "title": "Womens Maxi Dress Ruched Bodycon Long Sleeve Maxi",
      "price": 42.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/313QKmeVPqL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-maxi-v-neck",
      "title": "Womens Maxi Dress Maxi V Neck",
      "price": 45.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/718u-jSEcIL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-cocktail-long-sleeve-ruched",
      "title": "Womens Maxi Dress Bodycon Cocktail Long Sleeve Ruched",
      "price": 24.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/717Zzy6aDtL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-long-sleeve",
      "title": "Womens Maxi Dress Cocktail Long Sleeve",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71gBYOPR9WL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-cocktail-off-shoulder-ruched-long-sleeve",
      "title": "Womens Maxi Dress Bodycon Cocktail Off Shoulder Ruched Long Sleeve",
      "price": 34.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61EGWVy9WNL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-mermaid-formal",
      "title": "Womens Maxi Dress Mermaid Formal",
      "price": 94.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/51tD32RPJ+L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-sleeveless",
      "title": "Womens Maxi Dress Maxi Sleeveless",
      "price": 48.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61C7-A2R4HL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-one-shoulder-cocktail",
      "title": "Womens Dress One Shoulder Cocktail",
      "price": 42.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61wOHRqmGHL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 100.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61NxGq9x0zL._SL1500_.jpg"
      ]
    }
  ]
}