{
  "id": "womens-dress-ruched",
  "handle": "womens-dress-ruched",
  "sku": "JC3060",
  "asin": "B0DSPMGSG2",
  "title": "Womens Dress Ruched",
  "title_original": "Women Sexy Tube Top Silk Dress Strapless Ruched Waist Ruffle Tiered Layer Mini Dress Party Short Dresses",
  "brand": "Visit the YBSKG Store",
  "price": 35.98,
  "social_proof": {
    "bought_past_month": 1779,
    "text": "1779+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/61YDTNHdFaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71vi825xN3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71YZVtnGMSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71780yqbySL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61BZjNsaNdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71oq1W8FEKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61xYis917tL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ZDb-FMm7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61MXuO+v1fL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61DFsC3xW6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71IrTGNzXnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71zxnt1G4qL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61oIRlinawL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71BmjVOJT9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71kg6NjoSkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61QsDjnNJNL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71j-dj+PHhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71V2pc4Z93L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71k6m4tYCpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71vVYV+wV7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/6101UtSm7TL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61L0N18eEjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Sj4Ex3a1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Xh8-JHWTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71a2VdjZceL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71rqMxKp1IL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/719QiqUXEuL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61GVurHgAWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/717F65wmAML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71qJFWDZ9iL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61bW8frYbwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/715UBtlOwvL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71-jhBJpIzL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/617oaPWaE8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61p-v7nNRXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61FlFAV0l2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61StlN0aOrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61R0J347pGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61YkFAaEpKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Kim6OLghL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61A8ZOTZVYL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61S9iCjYnfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61wsJJtsHxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/612tqKZrSYL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61k5l6oOXJL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/61YDTNHdFaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71vi825xN3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71YZVtnGMSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71780yqbySL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61BZjNsaNdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71oq1W8FEKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61xYis917tL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ZDb-FMm7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61MXuO+v1fL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61DFsC3xW6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71IrTGNzXnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71zxnt1G4qL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61oIRlinawL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71BmjVOJT9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71kg6NjoSkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61QsDjnNJNL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71j-dj+PHhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71V2pc4Z93L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71k6m4tYCpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71vVYV+wV7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/6101UtSm7TL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61L0N18eEjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Sj4Ex3a1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Xh8-JHWTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71a2VdjZceL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71rqMxKp1IL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/719QiqUXEuL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61GVurHgAWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/717F65wmAML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71qJFWDZ9iL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61bW8frYbwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/715UBtlOwvL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71-jhBJpIzL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/617oaPWaE8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61p-v7nNRXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61FlFAV0l2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61StlN0aOrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61R0J347pGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61YkFAaEpKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Kim6OLghL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61A8ZOTZVYL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61S9iCjYnfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61wsJJtsHxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/612tqKZrSYL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61k5l6oOXJL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ January 10, 2025",
    "ASIN ‏": "‎ B0DSPKP8SW",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#41,611 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #511 in Women's Club & Night Out Dresses",
    "Customer Reviews": "4.3 4.3 out of 5 stars (234)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Light Blue",
      "Red",
      "Rose Red",
      "Pink",
      "White",
      "Black",
      "Light Yellow",
      "Green"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.3,
    "count": 234,
    "customers_say": "Customers find the dress cute, comfortable, and flattering, with one mentioning it has a European summer vibe. The material quality receives mixed feedback, with some saying it's nice while others find it cheap. Customers disagree on whether the dress runs true to size, with some reporting it's too short. The dress is not see-through according to multiple reviews. Generated from the text of customer reviews Select to learn more Look (22) Comfort (15) Color (9) Size (9) Flattering (6) Fit (31) Material quality (13) See through (7) 22 customers mention look, 20 positive, 2 negative 22 customers mention \"Look\" 20 positive 2 negative Customers find the dress very cute and amazing in quality, with one customer noting it has a European summer vibe. \" Very short and I’m 5’2”. Otherwise great material and cute dress \" Read more \" ...dress that can be easily dressed up or paired with tennis shoes for a cute , casual look. The length is perfect. \" Read more \" So cute ... \" Read more \" This is a very cute dress ! I only gave it 3 stars because of how short it was, I’m 5 ‘3 and 120 it fit like a shirt.... \" Read more 15 customers mention comfort, 15 positive, 0 negative 15 customers mention \"Comfort\" 15 positive 0 negative Customers find the dress comfortable. \" Very soft and comfortable . It's also very open and can easily fly up from underneath so will probably wear with spandex shorts under \" Read more \" ...Comfort: This is so comfy I will be wearing it again! Material quality: Material is not cheap! It is very good quality!... \" Read more \" ...it was comfy though. \" Read more \" ...Fits perfectly, the quality is amazing and very comfortable . \" Read more 9 customers mention color, 7 positive, 2 negative 9 customers mention \"Color\" 7 positive 2 negative Customers love the color of the dress. \" ...the material was soft and good quality for the price, and I loved the color for summer . \" Read more \" lol I love this dress! Everything about it. The length, color , style, fabric etc. I have a hard time finding mini dresses.... \" Read more \" ...Also love love love the color \" Read more \" ...The top is rather thin and because the color is light , your bra lines or stick-on padding lines will show slightly. The length was good.... \" Read more 9 customers mention size, 8 positive, 1 negative 9 customers mention \"Size\" 8 positive 1 negative Customers are satisfied with the dress's sizing, finding it true to size, with one customer mentioning it was perfect for their brother's sunset cruise. \" I am obsessed with this dress! It fits absolutely perfectly — true to size and super flattering.... \" Read more \" My daughter is absolutely in love with this dress. It's a perfect dress with the right color and size. \" Read more \" Got this dress for Nashville and it was perfect! True to size for sure and super sexy. You can never go wrong with a little black dress.... \" Read more \" Beautiful cocktail dress. Recommend to size down . \" Read more 6 customers mention flattering, 6 positive, 0 negative 6 customers mention \"Flattering\" 6 positive 0 negative Customers find the dress flattering. \" Very flattering and doesn't slip down. Wish there was a built in bra. \" Read more \" I wanted to love this. I do think it was flattering , but I will say unless you have the chest to keep this dress up-be warned.... \" Read more \" ...It fits absolutely perfectly — true to size and super flattering .... \" Read more \" This dress is so flattering and stretchy but comfy material! The fit is great, I ordered a size medium and I love the look of it! \" Read more 31 customers mention fit, 19 positive, 12 negative 31 customers mention \"Fit\" 19 positive 12 negative Customers have mixed opinions about the dress's length, with some finding it great while others say it's too short. \" ...I'm 5'3 and 135 pounds, I got a small. Fit perfectly . Would recommend! \" Read more \" This is SUPER short . I’m 5’4 and got a large (my usual size) and it barely covered all my bits and pieces.... \" Read more \" Fits true to size . So comfy. I am 5’4” 150lbs and got a size medium \" Read more \" ...It fit her perfectly and was very comfortable. \" Read more 13 customers mention material quality, 9 positive, 4 negative 13 customers mention \"Material quality\" 9 positive 4 negative Customers have mixed opinions about the dress's material quality, with some finding it nice while others describe it as cheap. \" I love the fabric and the cool-tone of the yellow dress. I ordered a S originally but returned for the XS so it would be a bit shorter.... \" Read more \" Nice fabric ; fit as expected. The top is rather thin and because the color is light, your bra lines or stick-on padding lines will show slightly.... \" Read more \" This was more like shiny spandex than the actual picture. I had to send back. Very cheap looking \" Read more \" ...this for exactly as you'd expect, and the material was very nice quality . I'm 5'3 and 135 pounds, I got a small. Fit perfectly. Would recommend! \" Read more 7 customers mention see through, 4 positive, 3 negative 7 customers mention \"See through\" 4 positive 3 negative Customers have mixed opinions about the dress's transparency, with some finding it not see-through, while one customer mentions it barely covers the body and another finds it unflattering. \" ...Flattering: Fabric is buttery not silky. It is not see through . Fabric softness: The material is so soft and light weight.... \" Read more \" ...i will be returning because it was extremely unflattering and j couldn’t even try to make it work on my body. it was comfy though. \" Read more \" ...You can never go wrong with a little black dress. Not see through at all and stays up very very well does not fall down. \" Read more \" A little see-through . Had to buy my daughter nipple-covers before I let her wear it in public. \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Alexis's Closet",
        "body": "5'4\" weight 130lbs This dress def gave me confidence that night! I loved being the bold blonde in the bright dress. Length: The dress is short enough to be considered mini but not so short that it's revealing. Flattering: Fabric is buttery not silky. It is not see through. Fabric softness: The material is so soft and light weight. Fit: The band rolled down a little but I was doing THE MOST in this dress! Comfort: This is so comfy I will be wearing it again! Material quality: Material is not cheap! It is very good quality! Read more",
        "author": "Alexis",
        "rating": 5.0,
        "date": "July 15, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/713e31P1vlL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71lbTVZOj7L._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71kHZ5ucK6L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Don't upsize if you're short!",
        "body": "Read the reviews, was told to upsize due to the dress being too short. My daughter is 5'5, 130lbs, bought a medium and a large in case it was too short since she has a small waist but more weight in the back. lol The size Medium fit her perfectly! Dress was stretchy and came to above her knees, super cute on her! Was not see through and price was great!! Will be returning the large!! Read more",
        "author": "Nicole",
        "rating": 5.0,
        "date": "October 13, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Soft fabric, fits well, but top is thin",
        "body": "Nice fabric; fit as expected. The top is rather thin and because the color is light, your bra lines or stick-on padding lines will show slightly. The length was good. Daughter wore this for an outdoor party and aside from her concern over the top, the length was modest enough. Read more",
        "author": "Natalie",
        "rating": 4.0,
        "date": "August 27, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Green dress",
        "body": "lol I love this dress! Everything about it. The length, color, style, fabric etc. I have a hard time finding mini dresses. They are usually long bc I am only 5’2 “ but this one was my perfect choice Read more",
        "author": "Carmen Wetzel",
        "rating": 5.0,
        "date": "November 27, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Length is too short",
        "body": "This is a very cute dress! I only gave it 3 stars because of how short it was, I’m 5 ‘3 and 120 it fit like a shirt. It does fit like a glove, but I look like I’m wearing a child’s dress because of the length being so ridiculous. I ordered a small btw. I ended up getting a medium and I can’t believe what a difference in length. Medium was too big! Guess there needs to be an in between size Read more",
        "author": "Jenn_amozne",
        "rating": 3.0,
        "date": "June 6, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Yessssss girl",
        "body": "I am obsessed with this dress! It fits absolutely perfectly — true to size and super flattering. The fabric feels soft and comfortable, yet structured enough to hold its shape all day. Read more",
        "author": "Jenn Nowak",
        "rating": 5.0,
        "date": "September 22, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Perfect for any occasion!",
        "body": "I bought this dress last minute for a bridal shower and I was so pleased with the purchase. It is extremely stretchy, so I would recommend sizing up for length. It was a bit shorter than I would like especially when I worse platform sandals. It’s extremely comfortable, and the material is lightweight. It’s not too tight, so the fit is flattering around the waist. I ordered a Small and I am 5’5”, 32” bust, 26” waist. I will probably get it in another color, but I will order a Medium so help with length. Read more",
        "author": "Pauli",
        "rating": 5.0,
        "date": "August 11, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/810hiVl3khL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "4.0 out of 5 stars Forgiving, cute, comfy",
        "body": "This dress is adorable! However, in other colors it may look like a workout dress but the black does a good job of hiding the legging material. I wore it the other night when I was feeling extremely bloated and it still looked really cute. It’s definitely on the shorter side (I’m 5’6) so you might want to consider shorts under it. Read more",
        "author": "Ariana",
        "rating": 4.0,
        "date": "July 15, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Dress Ruched is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.",
  "about_this_item": "Womens Dress Ruched is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.",
  "long_description": "Womens Dress Ruched is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Light Blue, Red, Rose Red, Pink, White, Black, Light Yellow, Green. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Dress Ruched is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Light Blue, Red, Rose Red, Pink, White, Black, Light Yellow, Green. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "9d840d14-a47d-4d4c-9712-be30941bbda9",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9d840d14-a47d-4d4c-9712-be30941bbda9/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9d840d14-a47d-4d4c-9712-be30941bbda9/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/d3aec7a6-4c77-43ec-9318-d824bbe696fc.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "44e05f15-fad6-42be-8d46-2c7ebf8f67c8",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/44e05f15-fad6-42be-8d46-2c7ebf8f67c8/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/44e05f15-fad6-42be-8d46-2c7ebf8f67c8/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/d3aec7a6-4c77-43ec-9318-d824bbe696fc.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "8bb78b7c-e87a-4397-b57c-499e4a5c427c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8bb78b7c-e87a-4397-b57c-499e4a5c427c/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8bb78b7c-e87a-4397-b57c-499e4a5c427c/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/d3aec7a6-4c77-43ec-9318-d824bbe696fc.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "f618eaef-fcf0-4c10-af3d-6c671a45744a",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f618eaef-fcf0-4c10-af3d-6c671a45744a/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f618eaef-fcf0-4c10-af3d-6c671a45744a/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/d3aec7a6-4c77-43ec-9318-d824bbe696fc.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "2bd4061f-a3b5-475d-8eda-1ee8ec5a13ce",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2bd4061f-a3b5-475d-8eda-1ee8ec5a13ce/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2bd4061f-a3b5-475d-8eda-1ee8ec5a13ce/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/d3aec7a6-4c77-43ec-9318-d824bbe696fc.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Light Blue": "https://m.media-amazon.com/images/I/41TfFI3vq0L._AC_SR38,50_.jpg",
    "Red": "https://m.media-amazon.com/images/I/31q33-0XHsL._AC_SR38,50_.jpg",
    "Rose Red": "https://m.media-amazon.com/images/I/41D3vKXdccL._AC_SR38,50_.jpg",
    "Pink": "https://m.media-amazon.com/images/I/41MhcijF-lL._AC_SR38,50_.jpg",
    "White": "https://m.media-amazon.com/images/I/415UPBBcxrL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31DZ+ZuRpkL._AC_SR38,50_.jpg",
    "Light Yellow": "https://m.media-amazon.com/images/I/311cX4iuPRL._AC_SR38,50_.jpg",
    "Green": "https://m.media-amazon.com/images/I/31g5aykQtUL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Light Blue": "61xYis917tL",
    "Red": "61DFsC3xW6L",
    "Rose Red": "61QsDjnNJNL",
    "Pink": "61L0N18eEjL",
    "White": "61GVurHgAWL",
    "Black": "61YDTNHdFaL",
    "Light Yellow": "617oaPWaE8L",
    "Green": "61Kim6OLghL"
  },
  "color_images": {
    "Light Blue": [
      "https://m.media-amazon.com/images/I/61xYis917tL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61ZDb-FMm7L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61MXuO+v1fL._SL1500_.jpg"
    ],
    "Red": [
      "https://m.media-amazon.com/images/I/61DFsC3xW6L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71IrTGNzXnL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71zxnt1G4qL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61oIRlinawL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71BmjVOJT9L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71kg6NjoSkL._SL1500_.jpg"
    ],
    "Rose Red": [
      "https://m.media-amazon.com/images/I/61QsDjnNJNL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71j-dj+PHhL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71V2pc4Z93L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71k6m4tYCpL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71vVYV+wV7L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/6101UtSm7TL._SL1500_.jpg"
    ],
    "Pink": [
      "https://m.media-amazon.com/images/I/61L0N18eEjL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71Sj4Ex3a1L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71Xh8-JHWTL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71a2VdjZceL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71rqMxKp1IL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/719QiqUXEuL._SL1500_.jpg"
    ],
    "White": [
      "https://m.media-amazon.com/images/I/61GVurHgAWL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/717F65wmAML._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71qJFWDZ9iL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61bW8frYbwL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/715UBtlOwvL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71-jhBJpIzL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/61YDTNHdFaL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71vi825xN3L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71YZVtnGMSL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71780yqbySL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61BZjNsaNdL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71oq1W8FEKL._SL1500_.jpg"
    ],
    "Light Yellow": [
      "https://m.media-amazon.com/images/I/617oaPWaE8L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61p-v7nNRXL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61FlFAV0l2L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61StlN0aOrL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61R0J347pGL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61YkFAaEpKL._SL1500_.jpg"
    ],
    "Green": [
      "https://m.media-amazon.com/images/I/61Kim6OLghL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61A8ZOTZVYL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61S9iCjYnfL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61wsJJtsHxL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/612tqKZrSYL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61k5l6oOXJL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-long-sleeve-v-neck",
      "title": "Womens Maxi Dress Long Sleeve V Neck",
      "price": 35.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61c+AgO3PGL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-split",
      "title": "Womens Dress Split",
      "price": 33.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71xNQJ9jv0L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-evening-v-neck-formal",
      "title": "Womens Maxi Dress Long Sleeve Evening V Neck Formal",
      "price": 73.97,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71j8C6aQKgL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-bodycon-long-sleeve",
      "title": "Womens Maxi Dress Cocktail Bodycon Long Sleeve",
      "price": 36.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51d0VG13YRL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-long-sleeve",
      "title": "Womens Maxi Dress Bodycon Long Sleeve",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51ZahJl9lYL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress-sleeveless-bodycon-ruched",
      "title": "Womens Dress Sleeveless Bodycon Ruched",
      "price": 42.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/61h8nvJmO0L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-maxi",
      "title": "Womens Maxi Dress Long Sleeve Maxi",
      "price": 33.29,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51Z7G4x4yEL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-off-shoulder-long-sleeve",
      "title": "Womens Maxi Dress Off Shoulder Long Sleeve",
      "price": 54.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71Ij3RfAevL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-long-sleeve-maxi",
      "title": "Womens Maxi Dress Bodycon Long Sleeve Maxi",
      "price": 14.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/5122JE3lxEL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi",
      "title": "Womens Maxi Dress Maxi",
      "price": 8.95,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61vF2-+OmxL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-off-shoulder-formal-maxi-cocktail",
      "title": "Womens Maxi Dress Evening Off Shoulder Formal Maxi Cocktail",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71MkXE9OeJL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-formal-long-sleeve",
      "title": "Womens Maxi Dress Evening Formal Long Sleeve",
      "price": 89.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51-DeL2MGRL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-formal",
      "title": "Womens Maxi Dress Maxi Formal",
      "price": 99.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61b59bSvt3L._SL1500_.jpg"
      ]
    }
  ]
}