{
  "id": "womens-dress-sleeveless-formal",
  "handle": "womens-dress-sleeveless-formal",
  "sku": "JC1240",
  "asin": "B0DS1P3FQV",
  "title": "Womens Dress Sleeveless Formal",
  "title_original": "BTFBM Women Tank Midi Dress Summer Crewneck Sleeveless Pleated A Line Business Casual Formal Sweater Spring Dresses 2026",
  "brand": "Visit the BTFBM Store",
  "price": 43.99,
  "social_proof": {
    "bought_past_month": 213,
    "text": "213+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/61+8Z+wL4qL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71EFQz1eX5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ZGYwyg40L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/716XrI4IULL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81oXmIwvTXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71S9A5bIA9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Uw2j7YhoL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71DDWMrKgqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ZMFFtYcqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71jhpugNiDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71epnK6df7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71BdhdMErSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71TqXX94GQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/712vA2NJBBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71r3ZMQxXRL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/710keamWOsL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71a2MckB6jL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/711TlMOf29L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61h3AfDdcHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71UBXr6WrWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ZzMl1bcJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71kRg23f4xL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71pPiuixGML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71OefPUXkdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71sa-R2mdJL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/61+8Z+wL4qL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71EFQz1eX5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ZGYwyg40L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/716XrI4IULL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81oXmIwvTXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71S9A5bIA9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Uw2j7YhoL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71DDWMrKgqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ZMFFtYcqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71jhpugNiDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71epnK6df7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71BdhdMErSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71TqXX94GQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/712vA2NJBBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71r3ZMQxXRL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/710keamWOsL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71a2MckB6jL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/711TlMOf29L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61h3AfDdcHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71UBXr6WrWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ZzMl1bcJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71kRg23f4xL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71pPiuixGML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71OefPUXkdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71sa-R2mdJL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Package Dimensions ‏": "‎ 13.87 x 11.65 x 1.03 inches; 1.1 Pounds",
    "Item model number ‏": "‎ BT610",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ February 12, 2025",
    "ASIN ‏": "‎ B0DS1Q3NWB",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#31,082 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #291 in Women's Casual Dresses",
    "Customer Reviews": "4.4 4.4 out of 5 stars (339)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Sky Blue",
      "Brown",
      "Burgundy",
      "Apricot",
      "Army Green",
      "Black",
      "Camel",
      "Brick Red",
      "Dark Green",
      "Rose Red",
      "Lake Blue",
      "Navy",
      "Pink",
      "White",
      "Purple",
      "Royal Blue",
      "Mist Green",
      "Blue Grey"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.4,
    "count": 339,
    "customers_say": "Customers find this dress attractive, with one noting it looks fabulous without ironing, and many appreciating its good quality knit construction. The dress fits beautifully and is comfortable, with one customer highlighting its slimming horizontal sweater pattern. Customers like the fabric, with one mentioning it's suitable for fall and winter weather, and they appreciate its versatility, being perfect for both everyday wear and special events. Generated from the text of customer reviews Select to learn more Attractive (43) Fit (38) Quality (37) Comfort (26) Flattering (26) Fabric quality (23) Color (16) Wearability (15) 43 customers mention attractive, 43 positive, 0 negative 43 customers mention \"Attractive\" 43 positive 0 negative Customers find the dress attractive, describing it as chic, feminine, and of nice quality, with one customer noting it looks fabulous without ironing and another mentioning its seaside country club vibe. \" This is a beautiful dress and very well-made. It is a little heavy for a sleeveless dress and would certainly be better in cooler climates.... \" Read more \" I love this dress is classy and comfortable fits great and looks great I got it in black and loved it so much I ordered it in the beige I’m 5’1” and... \" Read more \" Very cute dress that can be dressed up but already has a seaside country clubs vibe. Does wrinkle, but not as bad as other dresses from this brand.... \" Read more \" Pretty dress . Color is exceptional \" Read more 38 customers mention fit, 33 positive, 5 negative 38 customers mention \"Fit\" 33 positive 5 negative Customers find the dress fits beautifully, with one mentioning its perfect length and another noting its small pleated skirt. \" Great fit . Heavy material not flimsy at all. Form fitting and like the waist band. Great tea length \" Read more \" Love the fit of this dress it was flattering and absolutely terrific for my event. \" Read more \" I love this dress! It fits beautifully - clings where I want it to and not where I don't. It's super feminine, yet simple.... \" Read more \" ...Can wear to work or elsewhere. Good fabric, nice stretch. Fits well and flattering. \" Read more 37 customers mention quality, 37 positive, 0 negative 37 customers mention \"Quality\" 37 positive 0 negative Customers praise the dress's quality, describing it as a good quality knit dress that is well-made. \" Nice dress . I wore this for Easter and the material is pretty thick and very comfortable and stretchy. The sizing it good and I loved the color.... \" Read more \" I get complements on the dress all the time at work. Is a great dress and plan on getting in more colors!! \" Read more \" Why did you pick this product vs others?: These dresses are well made , fit beautifully, wash well, are thick enough to hold their shape and... \" Read more \" ...It was very flattering. The quality is good and heavy, the length and cut is nice, if anything, I got an XL which might have been too big and didn’t... \" Read more 26 customers mention comfort, 26 positive, 0 negative 26 customers mention \"Comfort\" 26 positive 0 negative Customers find the dress comfortable. \" ...Need a last minute dress- this is a good one. Quality is good, comfortable and has some forgiving stretch to it. \" Read more \" Very comfortable & well made dress. The material is not sheer. I ordered the black color in large. It was the perfect length & fit great.... \" Read more \" This dress so comfy and hangs nice on the body. I would order another color if I had the funds. \" Read more \" Got a lot of compliments on this. Very comfortable material .... \" Read more 26 customers mention flattering, 24 positive, 2 negative 26 customers mention \"Flattering\" 24 positive 2 negative Customers find the dress flattering, with one mentioning that its horizontal sweater pattern is slimming. \" ...Surprisingly good quality and very flattering . I’m 5’4 and the length falls at the top of my ankle. I’m going to buy a few more colors. \" Read more \" Love the fit of this dress it was flattering and absolutely terrific for my event. \" Read more \" Flattering dress that is versatile. \" Read more \" Quality material and figure flattering . This can be dressed up with necklace. Wore it to a wedding and received many compliments. \" Read more 23 customers mention fabric quality, 23 positive, 0 negative 23 customers mention \"Fabric quality\" 23 positive 0 negative Customers appreciate the fabric of the dress, describing it as soft and luxurious, with one customer noting it's suitable for fall and winter weather. \" Great fabric and colors , i’m 5’1 so it was too long for me and had to return it. \" Read more \" ...The fabric is a premium, stretchy material that feels luxurious and looks high-end. It drapes elegantly and is incredibly flattering.... \" Read more \" I love how this dress feels . It has just the right amount of weight and spandex. Hugs very nicely, and I like the skirt length and flow.... \" Read more \" Very comfortable & well made dress. The material is not sheer . I ordered the black color in large. It was the perfect length & fit great.... \" Read more 16 customers mention color, 15 positive, 1 negative 16 customers mention \"Color\" 15 positive 1 negative Customers like the dress's colors, particularly the navy blue and white options, with one customer describing it as a pretty plain navy blue dress. \" Perfect weight for Florida and true navy color ! Everything in pic is Amazon bought; dress, dark navy shoes and coordinating shawl/scarf.... \" Read more \" ... Gorgeous color , as pictured. Fits figure very well \" Read more \" ...The sizing it good and I loved the color . Good value for money \" Read more \" Love it! Great fit, great color . The material is interesting but very nice! \" Read more 15 customers mention wearability, 15 positive, 0 negative 15 customers mention \"Wearability\" 15 positive 0 negative Customers find the dress versatile for different occasions, with one mentioning it can be dressed up for a wedding or dressed down for casual wear, while another notes it's perfect for corporate events. \" It is so nice to have a versatile dress that you can dress up or down . It is figure flattering, flowy and very comfortable.... \" Read more \" I'm going to order all of the colors, looks great on and perfect to wear to work . I 5'2\" with a big bust and belly and still very flattering.... \" Read more \" Dress is a hit! Comfortable, chic, perfect for a spring brunch or a summer party.... \" Read more \" ...Hugs very nicely, and I like the skirt length and flow. Is a great piece for layering . \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Classy and Flattering",
        "body": "I have this dress in 3 colors. It’s very classy looking. Can wear to work or elsewhere. Good fabric, nice stretch. Fits well and flattering. Read more",
        "author": "Sports Mom",
        "rating": 5.0,
        "date": "December 13, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61C88c5rQzL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Very flattering, soft, comfortable",
        "body": "This dress is fabulous! So attractive. I decided to size up so any extra bulges wouldn’t show. I usually wear a small but size up on fitted dresses. I purchased the green and it is a soft sage color. Can be worn with a belt or not. Very comfortable! Read more",
        "author": "Customer",
        "rating": 5.0,
        "date": "August 12, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars An elegant dress at an affordable price",
        "body": "I haven’t worn it but only tried it on, and it was really a nice fit and look. It looks and feels more expensive than it is. The dress flows nicely from a gathered bodice. The color is a pleasing periwinkle blue. The fabric and stitching are good quality. I highly recommend. Read more",
        "author": "KaJo365",
        "rating": 5.0,
        "date": "September 23, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars White is a bit see through",
        "body": "This dress is okay. The weight of the material is nice but the white is a bit see through. It also runs a bit big. I usually wear a medium but could size down for sure. I am returning this dress. Read more",
        "author": "Pennyworths Deals",
        "rating": 4.0,
        "date": "May 27, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars My New Favorite Dress - Feels Luxurious, Looks Amazing!",
        "body": "I am absolutely thrilled with this navy tank dress! From the moment I took it out of the package, I could tell it was high quality – the fabric is wonderfully soft and thick, giving it a truly luxurious feel that you'd expect from a much more expensive brand. Once on, the dress falls beautifully and is incredibly flattering to the shape. It just drapes nicely without clinging, creating a very elegant silhouette. I've worn it several times already and have received many compliments each time! It's also extremely comfortable, making it perfect for everyday wear or dressing up. I would highly recommend this dress to anyone looking for a versatile and chic piece. I would (and likely will!) repurchase this in other colors. For reference, I am 5'5\" and 130 lbs, and the Small fit perfectly. Read more",
        "author": "BACON237",
        "rating": 5.0,
        "date": "July 20, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Classy, flattering and v comfortable",
        "body": "Love this dress. Classy. Fit perfectly. I am 5’2” 118 lbs. Can be dressed up or down. Very soft ribbed knit. Read more",
        "author": "Debra A, Loche",
        "rating": 5.0,
        "date": "October 28, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars A very good and useful basic for multiple seasons.",
        "body": "I love how this dress feels. It has just the right amount of weight and spandex. Hugs very nicely, and I like the skirt length and flow. Is a great piece for layering. Read more",
        "author": "LHW",
        "rating": 5.0,
        "date": "December 17, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars BTFBM MIDI DRESS",
        "body": "Did not like it in me so I gave it to my daughter and it looks great on her. Material was nice. Just didnt like the style on me. Read more",
        "author": "Netha",
        "rating": 3.0,
        "date": "December 16, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Dress Sleeveless Formal is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.",
  "about_this_item": "Womens Dress Sleeveless Formal is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.",
  "long_description": "Womens Dress Sleeveless Formal is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Sky Blue, Brown, Burgundy, Apricot, Army Green, Black, Camel, Brick Red, Dark Green, Rose Red, Lake Blue, Navy, Pink, White. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Dress Sleeveless Formal is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Sky Blue, Brown, Burgundy, Apricot, Army Green, Black, Camel, Brick Red, Dark Green, Rose Red, Lake Blue, Navy, Pink, White. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "9e75c15f-5501-4ae8-a649-c700190ac75b",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9e75c15f-5501-4ae8-a649-c700190ac75b/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9e75c15f-5501-4ae8-a649-c700190ac75b/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/2726654e-2bbe-426c-9119-456b1d850dcf.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "25dc1080-a8ba-4ba7-935a-9f6257454a6c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/25dc1080-a8ba-4ba7-935a-9f6257454a6c/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/25dc1080-a8ba-4ba7-935a-9f6257454a6c/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/2726654e-2bbe-426c-9119-456b1d850dcf.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "71621f78-5d1b-4a67-a88c-a39dcfb6c7f0",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/71621f78-5d1b-4a67-a88c-a39dcfb6c7f0/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/71621f78-5d1b-4a67-a88c-a39dcfb6c7f0/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/2726654e-2bbe-426c-9119-456b1d850dcf.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "84f2266c-6bd4-4eb8-8822-e9f0f4296282",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/84f2266c-6bd4-4eb8-8822-e9f0f4296282/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/84f2266c-6bd4-4eb8-8822-e9f0f4296282/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/2726654e-2bbe-426c-9119-456b1d850dcf.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "d79d7458-4fc5-4bad-9ff3-63c9a1d29551",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d79d7458-4fc5-4bad-9ff3-63c9a1d29551/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d79d7458-4fc5-4bad-9ff3-63c9a1d29551/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/2726654e-2bbe-426c-9119-456b1d850dcf.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "6f0946ff-84ba-41ab-b32f-a39eb3661115",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6f0946ff-84ba-41ab-b32f-a39eb3661115/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6f0946ff-84ba-41ab-b32f-a39eb3661115/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/2726654e-2bbe-426c-9119-456b1d850dcf.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "1af6b2ca-0953-4f68-a4b9-d56fad3b5ac0",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1af6b2ca-0953-4f68-a4b9-d56fad3b5ac0/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1af6b2ca-0953-4f68-a4b9-d56fad3b5ac0/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/2726654e-2bbe-426c-9119-456b1d850dcf.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "63c54263-b7aa-4ed0-a8e4-1e548f5e8d13",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/63c54263-b7aa-4ed0-a8e4-1e548f5e8d13/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/63c54263-b7aa-4ed0-a8e4-1e548f5e8d13/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/2726654e-2bbe-426c-9119-456b1d850dcf.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "73a72496-4dc0-4b0b-90c8-9f3f7892c3c3",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/73a72496-4dc0-4b0b-90c8-9f3f7892c3c3/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/73a72496-4dc0-4b0b-90c8-9f3f7892c3c3/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/2726654e-2bbe-426c-9119-456b1d850dcf.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "8757d054-ae1b-4b3f-b354-d811ce295542",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8757d054-ae1b-4b3f-b354-d811ce295542/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8757d054-ae1b-4b3f-b354-d811ce295542/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/2726654e-2bbe-426c-9119-456b1d850dcf.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "e2bd391c-dbba-4f28-afa4-09275abd730c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e2bd391c-dbba-4f28-afa4-09275abd730c/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e2bd391c-dbba-4f28-afa4-09275abd730c/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/2726654e-2bbe-426c-9119-456b1d850dcf.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "ec146dcd-00fe-4767-9bb0-2ebb3c6b9d07",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ec146dcd-00fe-4767-9bb0-2ebb3c6b9d07/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ec146dcd-00fe-4767-9bb0-2ebb3c6b9d07/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/2726654e-2bbe-426c-9119-456b1d850dcf.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Sky Blue": "https://m.media-amazon.com/images/I/31Mu2gupelL._AC_SR38,50_.jpg",
    "Brown": "https://m.media-amazon.com/images/I/316V+TVErML._AC_SR38,50_.jpg",
    "Burgundy": "https://m.media-amazon.com/images/I/31LnagZvM2L._AC_SR38,50_.jpg",
    "Apricot": "https://m.media-amazon.com/images/I/31JM3pNWhYL._AC_SR38,50_.jpg",
    "Army Green": "https://m.media-amazon.com/images/I/31ZVYHvRWJL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31fVLHrh6NL._AC_SR38,50_.jpg",
    "Camel": "https://m.media-amazon.com/images/I/31XzOrQle0L._AC_SR38,50_.jpg",
    "Brick Red": "https://m.media-amazon.com/images/I/31and0hx9kL._AC_SR38,50_.jpg",
    "Dark Green": "https://m.media-amazon.com/images/I/31SZLOCS4-L._AC_SR38,50_.jpg",
    "Rose Red": "https://m.media-amazon.com/images/I/31mrO3bGcfL._AC_SR38,50_.jpg",
    "Lake Blue": "https://m.media-amazon.com/images/I/317fhw8s81L._AC_SR38,50_.jpg",
    "Navy": "https://m.media-amazon.com/images/I/31m65eB4TSL._AC_SR38,50_.jpg",
    "Pink": "https://m.media-amazon.com/images/I/31-tz7EDGkL._AC_SR38,50_.jpg",
    "White": "https://m.media-amazon.com/images/I/313kIFk0ugL._AC_SR38,50_.jpg",
    "Purple": "https://m.media-amazon.com/images/I/31JWI6vVlZL._AC_SR38,50_.jpg",
    "Royal Blue": "https://m.media-amazon.com/images/I/31bO5z5x3RL._AC_SR38,50_.jpg",
    "Mist Green": "https://m.media-amazon.com/images/I/31s6cpr+4OL._AC_SR38,50_.jpg",
    "Blue Grey": "https://m.media-amazon.com/images/I/31N0Y5ie3JL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Sky Blue": "71ZMFFtYcqL",
    "Brown": "71jhpugNiDL",
    "Burgundy": "71epnK6df7L",
    "Apricot": "71BdhdMErSL",
    "Army Green": "71TqXX94GQL",
    "Black": "61+8Z+wL4qL",
    "Camel": "712vA2NJBBL",
    "Brick Red": "71r3ZMQxXRL",
    "Dark Green": "710keamWOsL",
    "Rose Red": "71a2MckB6jL",
    "Lake Blue": "711TlMOf29L",
    "Navy": "61h3AfDdcHL",
    "Pink": "71UBXr6WrWL",
    "White": "61ZzMl1bcJL",
    "Purple": "71kRg23f4xL",
    "Royal Blue": "71pPiuixGML",
    "Mist Green": "71OefPUXkdL",
    "Blue Grey": "71sa-R2mdJL"
  },
  "color_images": {
    "Sky Blue": [
      "https://m.media-amazon.com/images/I/71ZMFFtYcqL._SL1500_.jpg"
    ],
    "Brown": [
      "https://m.media-amazon.com/images/I/71jhpugNiDL._SL1500_.jpg"
    ],
    "Burgundy": [
      "https://m.media-amazon.com/images/I/71epnK6df7L._SL1500_.jpg"
    ],
    "Apricot": [
      "https://m.media-amazon.com/images/I/71BdhdMErSL._SL1500_.jpg"
    ],
    "Army Green": [
      "https://m.media-amazon.com/images/I/71TqXX94GQL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/61+8Z+wL4qL._SL1500_.jpg"
    ],
    "Camel": [
      "https://m.media-amazon.com/images/I/712vA2NJBBL._SL1500_.jpg"
    ],
    "Brick Red": [
      "https://m.media-amazon.com/images/I/71r3ZMQxXRL._SL1500_.jpg"
    ],
    "Dark Green": [
      "https://m.media-amazon.com/images/I/710keamWOsL._SL1500_.jpg"
    ],
    "Rose Red": [
      "https://m.media-amazon.com/images/I/71a2MckB6jL._SL1500_.jpg"
    ],
    "Lake Blue": [
      "https://m.media-amazon.com/images/I/711TlMOf29L._SL1500_.jpg"
    ],
    "Navy": [
      "https://m.media-amazon.com/images/I/61h3AfDdcHL._SL1500_.jpg"
    ],
    "Pink": [
      "https://m.media-amazon.com/images/I/71UBXr6WrWL._SL1500_.jpg"
    ],
    "White": [
      "https://m.media-amazon.com/images/I/61ZzMl1bcJL._SL1500_.jpg"
    ],
    "Purple": [
      "https://m.media-amazon.com/images/I/71kRg23f4xL._SL1500_.jpg"
    ],
    "Royal Blue": [
      "https://m.media-amazon.com/images/I/71pPiuixGML._SL1500_.jpg"
    ],
    "Mist Green": [
      "https://m.media-amazon.com/images/I/71OefPUXkdL._SL1500_.jpg"
    ],
    "Blue Grey": [
      "https://m.media-amazon.com/images/I/71sa-R2mdJL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-sleeveless-v-neck-split-maxi-cocktail",
      "title": "Womens Maxi Dress Sleeveless V Neck Split Maxi Cocktail",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/61YT6HmofvL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-sleeveless-maxi-v-neck",
      "title": "Womens Maxi Dress Sleeveless Maxi V Neck",
      "price": 42.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/6152O0FEYiL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-bodycon",
      "title": "Womens Maxi Dress Long Sleeve Bodycon",
      "price": 42.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51WYC8TquDL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-ruched-bodycon-formal-cocktail-long-sleeve",
      "title": "Womens Maxi Dress Maxi Ruched Bodycon Formal Cocktail Long Sleeve",
      "price": 56.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/51HFt7oTd4L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 42.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61RUb2Rhb2L._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-cocktail-formal-maxi-long-sleeve",
      "title": "Womens Maxi Dress Cocktail Formal Maxi Long Sleeve",
      "price": 45.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61NXa9j1ztL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-bodycon-long-sleeve",
      "title": "Womens Maxi Dress Maxi Bodycon Long Sleeve",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51xY-nVpN9L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-bodycon-cocktail",
      "title": "Womens Maxi Dress Long Sleeve Bodycon Cocktail",
      "price": 29.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71uLDl8TnLL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-formal-one-shoulder",
      "title": "Womens Maxi Dress Evening Formal One Shoulder",
      "price": 69.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/619Po5TvLvL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-v-neck-long-sleeve-ruched",
      "title": "Womens Maxi Dress Bodycon V Neck Long Sleeve Ruched",
      "price": 29.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61ljVFmZp3L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening-v-neck",
      "title": "Womens Maxi Dress Formal Evening V Neck",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Wedding Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/51N19olLrFL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail-formal-bodycon-ruched-evening",
      "title": "Womens Dress Cocktail Formal Bodycon Ruched Evening",
      "price": 55.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/51qWSPFqHRL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-off-shoulder-v-neck-formal",
      "title": "Womens Maxi Dress Evening Off Shoulder V Neck Formal",
      "price": 89.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71H1Q7tFSyL._SL1500_.jpg"
      ]
    }
  ]
}