{
  "id": "womens-dress-v-neck",
  "handle": "womens-dress-v-neck",
  "sku": "JC1398",
  "asin": "B0DS29MXLX",
  "title": "Womens Dress V Neck",
  "title_original": "Dokotoo Denim Dress for Women Summer Casual Babydoll 2026 V Neck 3/4 Puff Sleeve Jean Dresses",
  "brand": "Visit the Dokotoo Store",
  "price": 45.98,
  "social_proof": {
    "bought_past_month": 269,
    "text": "269+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/71SFGefD8VL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81NCgQKkefL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61lkOezPpiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61gg1I2XNwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61UTR8P3PzL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71zbzUdCrHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61x8ot7cLQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71OoqX0i0FL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/711UfSOJJdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71SYgZNVKvL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Ack2d166L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71IZKd9GjYL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71WelSlbxhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71PkbRDmKtL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71lwh5iJC1L._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/71SFGefD8VL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81NCgQKkefL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61lkOezPpiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61gg1I2XNwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61UTR8P3PzL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71zbzUdCrHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61x8ot7cLQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71OoqX0i0FL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/711UfSOJJdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71SYgZNVKvL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Ack2d166L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71IZKd9GjYL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71WelSlbxhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71PkbRDmKtL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71lwh5iJC1L._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ January 31, 2025",
    "ASIN ‏": "‎ B0DS2BPTDT",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#40,051 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #359 in Women's Casual Dresses",
    "Customer Reviews": "4.3 4.3 out of 5 stars (352)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Red",
      "Ashleigh Blue",
      "Beau Blue",
      "Khaki",
      "White",
      "Sail Blue",
      "Star Blue",
      "Carbon Grey",
      "Real Teal",
      "Green"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.3,
    "count": 352,
    "customers_say": "Customers love this denim dress's style, with one noting its pretty denim color, and appreciate its versatility as a transition piece from summer to fall that can be dressed up or down. The dress is well-made, comfortable, and features a great length that hits above the knee, with one customer noting it's perfect for large chests. While some customers find it true to size, others mention it runs slightly big. Generated from the text of customer reviews Select to learn more Style (62) Fit (57) Quality (53) Comfort (26) Versatility (23) Length (21) Material quality (16) Size (24) 62 customers mention style, 60 positive, 2 negative 62 customers mention \"Style\" 60 positive 2 negative Customers find the dress cute, with one mentioning its pretty denim color and another appreciating its A-line style. \" This dress is so cute but a bit too short for an older woman. Perfect denim fun and casual style for the fall. Pair with boots or fashion sneakers. \" Read more \" Cute dress ! Great fabric and length. The large was recommended. It looked nice, however, it was very loose so I could have bought a medium.... \" Read more \" Very cute dress , true to size. Fabric has the perfect weight. True to size, I'm 5'6 175lbs and I ordered a medium. \" Read more \" Wore this to Megan Maroney with my daughter. Super cute. Stylish and comfortable. Also like the fit and arm coverage as well.... \" Read more 57 customers mention fit, 43 positive, 14 negative 57 customers mention \"Fit\" 43 positive 14 negative Customers find the dress fits well, particularly noting it accommodates larger chests and is roomy. One customer mentions it comes just above the knees. \" Cute dress. Fits well and as expected. Got lots of compliments. Wish it had pockets. \" Read more \" Great fit , soft material \" Read more \" ...Perfect for the occasion I bought it for and was such a flattering fit !! Material was soft as well. \" Read more \" This literally fits like a potato sack . If you're into that, this is for you. Maybe if I ordered my true US size it would have fit better?... \" Read more 53 customers mention quality, 52 positive, 1 negative 53 customers mention \"Quality\" 52 positive 1 negative Customers find the dress well-made and appreciate it as a great denim piece that's their favorite to wear. \" Love this dress ! Fits perfect, washes well, quality denim material, boots or sandals to compliment! \" Read more \" So flattering! Great dress . Just received it last night and I’m wearing it to church today. Generous fit but that is the style. It truly flows.... \" Read more \" Well made . Had a bit of a smell but not horrid. Cute dress. Can’t wait to wear with tights and boots. Fits as desired! Flattering. \" Read more \" This was for my daughter. It was the perfect dress to have casual cuteness in a hurry. The fit was accurate, color was casual yet dressy.... \" Read more 26 customers mention comfort, 26 positive, 0 negative 26 customers mention \"Comfort\" 26 positive 0 negative Customers find the dress comfortable. \" Wore this to Megan Maroney with my daughter. Super cute. Stylish and comfortable . Also like the fit and arm coverage as well.... \" Read more \" Beautiful denim dress. So very comfortable and stylish. The material is good quality. Came out beautifully after washing. \" Read more \" ...It made me smile to keep the size L - it’s still roomy and comfy ! Order it, it’s a great value for a dress you can wear year round in most places! \" Read more \" Beautiful comfortable dress \" Read more 23 customers mention versatility, 23 positive, 0 negative 23 customers mention \"Versatility\" 23 positive 0 negative Customers find the dress versatile, noting it can be dressed up or down and serves as a great transition piece from summer to fall. \" This Is a great versatile dress for running errans Lincoln, going to the movie. You can dress it up or down. They \" Read more \" This is a great dress for spring ! The quality is better than expected for the price.... \" Read more \" Cutest dress I have ordered on Amazon. Can dress up or down by changing from heals to casual sandals or sneaker.... \" Read more \" Love it. Dress up or dress down . \" Read more 21 customers mention length, 17 positive, 4 negative 21 customers mention \"Length\" 17 positive 4 negative Customers like the dress's length, noting it's not too long, with one customer mentioning it hits at the knee. \" ... Love the length and because it’s a line my hips are not accentuated. Even though I am of senior age, I am not ready to wear clothes... \" Read more \" Good quality and not too short (l’m 5’7”). I air dry instead of using the dryer. Very stylish. One of my favorite dresses. \" Read more \" ...It is the perfect length (I am 5'3) and it comes just above my knees and the sleeves are a great length and are not tight. \" Read more \" Cute dress! Great fabric and length . The large was recommended. It looked nice, however, it was very loose so I could have bought a medium.... \" Read more 16 customers mention material quality, 15 positive, 1 negative 16 customers mention \"Material quality\" 15 positive 1 negative Customers like the material of the dress. \" Cute dress! Great fabric and length. The large was recommended. It looked nice, however, it was very loose so I could have bought a medium.... \" Read more \" True to size very flattering the material relax fit really pretty denim color \" Read more \" Great material , adorable fit... \" Read more \" ...You can layer tank or long sleeve shirt or turtleneck. Fabric is really nice . Not stiff or scratchy. Be prepared for many compliments.... \" Read more 24 customers mention size, 16 positive, 8 negative 24 customers mention \"Size\" 16 positive 8 negative Customers have mixed experiences with the dress sizing, with some finding it true to size while others report that it runs slightly big. \" Very cute dress, true to size . Fabric has the perfect weight. True to size, I'm 5'6 175lbs and I ordered a medium. \" Read more \" Very cute! Got lots of compliments when I wore it to a shower. Runs slightly big .... \" Read more \" Love the dress true to size \" Read more \" Product was exactly as described. It does run true to size , maybe even a little on the large size. If you’re between sizes, order down. \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Love the dress - flattering, roomy & modest",
        "body": "Very cute dress! I ordered 2 - one in a L (a med. blue color) and this one in an XL (the darkest blue one). The XL was too big so I returned it and kept the L. My usual size in tops and dresses varies from L to XL but usually more an XL because I don’t like anything fitted to show my “mom bod” lol. The denim is normal denim weight - not the thin denim but it’s not too stiff. Love the length (almost to my knees - I’m 5’5). It made me smile to keep the size L - it’s still roomy and comfy! Order it, it’s a great value for a dress you can wear year round in most places! Read more",
        "author": "Melinda",
        "rating": 5.0,
        "date": "November 4, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Great denim dress!",
        "body": "Wore this to Megan Maroney with my daughter. Super cute. Stylish and comfortable. Also like the fit and arm coverage as well. Great overall find in the denim dress category. I am 5’9 and the length is good too! Covers all the things without any peekaboos. Read more",
        "author": "Stephanie H Deller",
        "rating": 5.0,
        "date": "December 15, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/81L3VUzNtxL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "4.0 out of 5 stars Lovely Jumper.",
        "body": "Well made. Had a bit of a smell but not horrid. Cute dress. Can’t wait to wear with tights and boots. Fits as desired! Flattering. Read more",
        "author": "BK",
        "rating": 4.0,
        "date": "October 4, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Stylish and Comfortable.",
        "body": "I love this dress! It pairs perfectly with boots and looks so cute! The length is great, not too short for work. The denim is lighter than jeans, so that is a nice plus. It was very comfortable and I received many compliments when I wore it. Also, the price was reasonable. Read more",
        "author": "KDawgTeach",
        "rating": 5.0,
        "date": "November 6, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Flattering dress. I’m going back for another color as well!",
        "body": "So flattering! Great dress. Just received it last night and I’m wearing it to church today. Generous fit but that is the style. It truly flows. Nice medium weight fabric. This dress can be accessorized to take you anywhere. Dress it up with nice shoes and jewelry to take you out for the night or throw on some sandals or tennis shoes for daytime. Fabric does not have any stretch other than the elastic cuffs but with the flowing cut, it isn’t necessary. It fits just above the knee. I think I’m going to purchase another color as well. I like it that much! Read more",
        "author": "TWJ",
        "rating": 5.0,
        "date": "October 19, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Adorable dress!",
        "body": "Dress was true to size and color. Extremely modest in length, but not too long. The dress was cute but also extremely comfortable due to the stretch. Read more",
        "author": "Jon Bachtold",
        "rating": 3.0,
        "date": "November 3, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Love. Love. Love. 10/10",
        "body": "The media could not be loaded. Streamed it straight out of the bag and wore it right away—it's absolutely adorable! The fabric has a nice medium-weight denim-like feel: substantial but not heavy, super comfortable, and it drapes beautifully. No wrinkles after unpacking, which was a huge plus. I usually order a medium in dresses, but I ordered a size small—it’s perfect, and the quality feels really premium. The only thing that would make it even better is if it had pockets, functional ones would be a game-changer! Highly recommend if you're looking for a cute, comfy everyday dress with a bit of structure. Read more",
        "author": "Kathryn Harrison",
        "rating": 5.0,
        "date": "December 17, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71cGpi6x6mL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Versatile Dress",
        "body": "Cute. Looks great with tights & knee-hi riding boots. Elastic at sleeve bottom was way too big, had to take in. Otherwise fit true to size. Versatile outfit maker like a great pair of jeans but in dress form. Read more",
        "author": "Kay123",
        "rating": 5.0,
        "date": "November 5, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Dress V Neck is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.",
  "about_this_item": "Womens Dress V Neck is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.",
  "long_description": "Womens Dress V Neck is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Red, Ashleigh Blue, Beau Blue, Khaki, White, Sail Blue, Star Blue, Carbon Grey, Real Teal, Green. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Dress V Neck is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Red, Ashleigh Blue, Beau Blue, Khaki, White, Sail Blue, Star Blue, Carbon Grey, Real Teal, Green. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "cb456b82-a51a-4661-b138-6a3f716a84c5",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/cb456b82-a51a-4661-b138-6a3f716a84c5/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/cb456b82-a51a-4661-b138-6a3f716a84c5/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/e0460fe0-84a9-4e86-bf44-7419c763116a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "d03572d5-16a1-4531-8941-3c4b42838ebb",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d03572d5-16a1-4531-8941-3c4b42838ebb/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d03572d5-16a1-4531-8941-3c4b42838ebb/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/e0460fe0-84a9-4e86-bf44-7419c763116a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "a56da450-d31a-4eb3-b73e-9862a0aa0123",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a56da450-d31a-4eb3-b73e-9862a0aa0123/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a56da450-d31a-4eb3-b73e-9862a0aa0123/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/e0460fe0-84a9-4e86-bf44-7419c763116a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "3f7832d2-004a-49e1-bb96-e21b424bbda2",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3f7832d2-004a-49e1-bb96-e21b424bbda2/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3f7832d2-004a-49e1-bb96-e21b424bbda2/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/e0460fe0-84a9-4e86-bf44-7419c763116a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "7e1713bd-84a5-479f-b1a9-e0b53152420e",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7e1713bd-84a5-479f-b1a9-e0b53152420e/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7e1713bd-84a5-479f-b1a9-e0b53152420e/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/e0460fe0-84a9-4e86-bf44-7419c763116a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "383eb4b5-dbb1-4490-a46e-ded17101e7d0",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/383eb4b5-dbb1-4490-a46e-ded17101e7d0/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/383eb4b5-dbb1-4490-a46e-ded17101e7d0/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/e0460fe0-84a9-4e86-bf44-7419c763116a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "eee3adba-47bd-43d3-a42a-9b00a858558f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/eee3adba-47bd-43d3-a42a-9b00a858558f/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/eee3adba-47bd-43d3-a42a-9b00a858558f/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/e0460fe0-84a9-4e86-bf44-7419c763116a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "f232d978-87ca-4bf2-b0e0-79cced7588c0",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f232d978-87ca-4bf2-b0e0-79cced7588c0/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f232d978-87ca-4bf2-b0e0-79cced7588c0/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/e0460fe0-84a9-4e86-bf44-7419c763116a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "bff7b2fb-4203-4a38-89c3-abd860257e99",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bff7b2fb-4203-4a38-89c3-abd860257e99/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bff7b2fb-4203-4a38-89c3-abd860257e99/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/e0460fe0-84a9-4e86-bf44-7419c763116a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "fa50b958-d8ec-4c9f-b173-815e74b8d3fc",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/fa50b958-d8ec-4c9f-b173-815e74b8d3fc/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/fa50b958-d8ec-4c9f-b173-815e74b8d3fc/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/e0460fe0-84a9-4e86-bf44-7419c763116a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "6bcee5e7-dff2-41aa-871d-902756d2d276",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6bcee5e7-dff2-41aa-871d-902756d2d276/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6bcee5e7-dff2-41aa-871d-902756d2d276/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/e0460fe0-84a9-4e86-bf44-7419c763116a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "6955c6b6-a77d-4174-9f0f-3a79f07d8c01",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6955c6b6-a77d-4174-9f0f-3a79f07d8c01/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6955c6b6-a77d-4174-9f0f-3a79f07d8c01/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/e0460fe0-84a9-4e86-bf44-7419c763116a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Red": "https://m.media-amazon.com/images/I/41-Sj2KQDbL._AC_SR38,50_.jpg",
    "Ashleigh Blue": "https://m.media-amazon.com/images/I/41H8lwuB0AL._AC_SR38,50_.jpg",
    "Beau Blue": "https://m.media-amazon.com/images/I/411bFRCoV4L._AC_SR38,50_.jpg",
    "Khaki": "https://m.media-amazon.com/images/I/41S-EhmP7+L._AC_SR38,50_.jpg",
    "White": "https://m.media-amazon.com/images/I/41poYdybFoL._AC_SR38,50_.jpg",
    "Sail Blue": "https://m.media-amazon.com/images/I/412IVMApHEL._AC_SR38,50_.jpg",
    "Star Blue": "https://m.media-amazon.com/images/I/41SKpbPOBML._AC_SR38,50_.jpg",
    "Carbon Grey": "https://m.media-amazon.com/images/I/41OVF9rG5JL._AC_SR38,50_.jpg",
    "Real Teal": "https://m.media-amazon.com/images/I/418g1NyaT8L._AC_SR38,50_.jpg",
    "Green": "https://m.media-amazon.com/images/I/41-2qmlT85L._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Red": "61x8ot7cLQL",
    "Ashleigh Blue": "71OoqX0i0FL",
    "Beau Blue": "711UfSOJJdL",
    "Khaki": "71SYgZNVKvL",
    "White": "61Ack2d166L",
    "Sail Blue": "71SFGefD8VL",
    "Star Blue": "71IZKd9GjYL",
    "Carbon Grey": "71WelSlbxhL",
    "Real Teal": "71PkbRDmKtL",
    "Green": "71lwh5iJC1L"
  },
  "color_images": {
    "Red": [
      "https://m.media-amazon.com/images/I/61x8ot7cLQL._SL1500_.jpg"
    ],
    "Ashleigh Blue": [
      "https://m.media-amazon.com/images/I/71OoqX0i0FL._SL1500_.jpg"
    ],
    "Beau Blue": [
      "https://m.media-amazon.com/images/I/711UfSOJJdL._SL1500_.jpg"
    ],
    "Khaki": [
      "https://m.media-amazon.com/images/I/71SYgZNVKvL._SL1500_.jpg"
    ],
    "White": [
      "https://m.media-amazon.com/images/I/61Ack2d166L._SL1500_.jpg"
    ],
    "Sail Blue": [
      "https://m.media-amazon.com/images/I/71SFGefD8VL._SL1500_.jpg"
    ],
    "Star Blue": [
      "https://m.media-amazon.com/images/I/71IZKd9GjYL._SL1500_.jpg"
    ],
    "Carbon Grey": [
      "https://m.media-amazon.com/images/I/71WelSlbxhL._SL1500_.jpg"
    ],
    "Real Teal": [
      "https://m.media-amazon.com/images/I/71PkbRDmKtL._SL1500_.jpg"
    ],
    "Green": [
      "https://m.media-amazon.com/images/I/71lwh5iJC1L._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-formal-cocktail-ruched-maxi-sleeveless-bodycon",
      "title": "Womens Maxi Dress Formal Cocktail Ruched Maxi Sleeveless Bodycon",
      "price": 48.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51lcEKwzt8L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 99.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51MWKDRcToL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal",
      "title": "Womens Maxi Dress Formal",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51eAiny1x-L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-ruched-formal-maxi-bodycon",
      "title": "Womens Maxi Dress Ruched Formal Maxi Bodycon",
      "price": 62.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61ipOhuw3WL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail",
      "title": "Womens Dress Cocktail",
      "price": 37.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61+EOqv4F9L._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 26.45,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/713OuBdQBYL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 564.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/614g9yo8opL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-cocktail-maxi-split",
      "title": "Womens Maxi Dress Formal Cocktail Maxi Split",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61G8RF1nKaL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-formal",
      "title": "Womens Dress Formal",
      "price": 89.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51Ba9fw8pTL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-split-sleeveless-cocktail-bodycon",
      "title": "Womens Dress Split Sleeveless Cocktail Bodycon",
      "price": 27.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51OoLUBGjtL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 79.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Wedding Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/51nJyQaIwAL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-mermaid",
      "title": "Womens Maxi Dress Cocktail Mermaid",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51QRiCCVj+L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening-bodycon-short-sleeve",
      "title": "Womens Maxi Dress Formal Evening Bodycon Short Sleeve",
      "price": 63.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61whKp-35lL._SL1500_.jpg"
      ]
    }
  ]
}