{
  "id": "womens-dress-cocktail-v-neck-bodycon",
  "handle": "womens-dress-cocktail-v-neck-bodycon",
  "sku": "JC2194",
  "asin": "B0DTYY3SW3",
  "title": "Womens Dress Cocktail V Neck Bodycon",
  "title_original": "OZICERD Bodycon Halter Mini Dresses for Women Going Out Club Dress Backless V Neck Summer Short Dress Cocktail Party Dresses",
  "brand": "Visit the OZICERD Store",
  "price": 19.95,
  "social_proof": {
    "bought_past_month": 118,
    "text": "118+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/611HBMEYCCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ePD4wFZRL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71b1pa-q8KL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/6197yReGG-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71j3lFL7MZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71byoziR9-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Nm9uZ2CDL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/611HBMEYCCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ePD4wFZRL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71b1pa-q8KL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/6197yReGG-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71j3lFL7MZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71byoziR9-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Nm9uZ2CDL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ February 17, 2025",
    "Manufacturer ‏": "‎ OZICERD",
    "ASIN ‏": "‎ B0DTYVJ94J",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#89,946 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #569 in Women's Club & Night Out Dresses",
    "Customer Reviews": "4.0 4.0 out of 5 stars (138)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Black"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.0,
    "count": 138,
    "customers_say": "Customers find the dress cute and soft, with nice material and good value for money. However, the fit receives mixed feedback, with some finding it nice while others say it's too long. Moreover, the quality is also mixed, with some praising it while others find it low quality. Additionally, the material thickness receives negative feedback, with several customers noting it's relatively thin. Generated from the text of customer reviews Select to learn more Style (10) Material quality (7) Value for money (6) Soft fabric (5) Fit (15) Quality (14) Flattering (6) Material thickness (9) 10 customers mention style, 8 positive, 2 negative 10 customers mention \"Style\" 8 positive 2 negative Customers find the dress cute. \" It is cute , sexy, and material is comfy. But there is no hold to it like spandex or anything to help shape body. \" Read more \" cute dress , fit well and true to size i would say. very comfy and stretchy and good material. would recommend \" Read more \" Very thin material, but it's super sexy and fits perfect.... \" Read more \" ...dress is stretchy, but the material was relatively thin and did not meet my expectations . It was also shorter than I expected being a short woman.... \" Read more 7 customers mention material quality, 5 positive, 2 negative 7 customers mention \"Material quality\" 5 positive 2 negative Customers like the material of the dress. \" The fabric is nice , but the I wouldn't reccomend if you have a short torso. The top ended up being very baggy on me. \" Read more \" Excellent fit and material . Highly recommend. \" Read more \" Cheap material , not well made. Do not buy! \" Read more \" Size medium, fit great, enough stretch, value for money, material was good enough , and it’s not a one time wear.... \" Read more 6 customers mention value for money, 5 positive, 1 negative 6 customers mention \"Value for money\" 5 positive 1 negative Customers find the dress offers good value for money, with one mentioning it's trendy without being expensive. \" Size medium, fit great, enough stretch, value for money , material was good enough, and it’s not a one time wear.... \" Read more \" ...I like switching up my style, and this dress is cute and trendy without being expensive .... \" Read more \" Low quality but you get what you pay for. Appreciated the price and efficiency for sure. \" Read more \" ...It fits extra small, material is soft. It wasnt too expensive , but a little overpriced for the quality. \" Read more 5 customers mention soft fabric, 5 positive, 0 negative 5 customers mention \"Soft fabric\" 5 positive 0 negative Customers like the soft fabric of the dress. \" ...Due to that, it makes it see through. The fabric is soft and a little stretchy. Fine for a night out but don’t take flash pictures lol \" Read more \" The other reviews were correct. It fits extra small, material is soft . It wasnt too expensive, but a little overpriced for the quality. \" Read more \" Super cute and soft but doesn’t have much shape, you’ve gotta have the shape yourself because it won’t do anything for you otherwise \" Read more \" ...The fabric is soft and feels sturdy, i wish there was an XS size, if you find a size that fits i would definitely recommend! \" Read more 15 customers mention fit, 10 positive, 5 negative 15 customers mention \"Fit\" 10 positive 5 negative Customers have mixed experiences with how the dress fits, with some finding it perfect while others report it being too long. \" I got a size small as a person that’s 130lbs but will say it fit amazing and will definitely recommend!! \" Read more \" ...It was also shorter than I expected being a short woman.... \" Read more \" Fits very nicely but it’s very thin material. Due to that, it makes it see through. The fabric is soft and a little stretchy.... \" Read more \" The other reviews were correct. It fits extra small , material is soft. It wasnt too expensive, but a little overpriced for the quality. \" Read more 14 customers mention quality, 9 positive, 5 negative 14 customers mention \"Quality\" 9 positive 5 negative Customers have mixed opinions about the dress's quality, with some finding it great while others describe it as low quality. \" ...The fabric is soft and a little stretchy. Fine for a night out but don’t take flash pictures lol \" Read more \" Low quality but you get what you pay for. Appreciated the price and efficiency for sure. \" Read more \" great quality but i am 5’0 and 100lbs and it’s definitely roomy and too long on me, it reaches to about my knees.... \" Read more \" Good quality and comfortable dress \" Read more 6 customers mention flattering, 4 positive, 2 negative 6 customers mention \"Flattering\" 4 positive 2 negative Customers have mixed opinions about how flattering the dress is, with some finding it attractive while others disagree. \" ...Overall, it was flattering and the material is soft, but I did end up going with something else and returning this.... \" Read more \" ...Quality sucked and just not flattering at all \" Read more \" ...It hugs your curves in all the right places , and doesn't leave much to the imagination.... \" Read more \" This really complimented my body well . \" Read more 9 customers mention material thickness, 2 positive, 7 negative 9 customers mention \"Material thickness\" 2 positive 7 negative Customers mention that the dress material is relatively thin. \" Fits very nicely but it’s very thin material . Due to that, it makes it see through. The fabric is soft and a little stretchy.... \" Read more \" Cute, but the material is really thin and has no structure. Thin as a T-shirt would not recommend. \" Read more \" ...back there, it might’ve been uncomfortable and since the fabric isn’t super thick , it could get a little see-through if stretched too much.... \" Read more \" Thin Material ... \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Cute and flattering, but not for every body type",
        "body": "I got this dress and overall, I think it’s lovely! I’ve recently lost some weight, so the fit was flattering in some areas. I ordered a size small, and while it fit well on top, it was a bit too tight around the butt. If I were even slightly curvier back there, it might’ve been uncomfortable and since the fabric isn’t super thick, it could get a little see-through if stretched too much. I did consider sizing up to a medium, but I know it would have been too loose in the chest area, so I stuck with the small. It’s one of those dresses where the fit really depends on where your curves are. That said, for the price, it’s a great seasonal piece. I don’t expect it to last forever, but that’s okay I like switching up my style, and this dress is cute and trendy without being expensive. If you’re looking for something longer-lasting or made with thicker material, you might want to go with a higher-end option. But for something stylish and affordable, this dress is a solid choice! Read more",
        "author": "kayluvxb",
        "rating": 5.0,
        "date": "September 13, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/51fFKpifSuL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars good dress",
        "body": "cute dress, fit well and true to size i would say. very comfy and stretchy and good material. would recommend Read more",
        "author": "kayla highcove",
        "rating": 5.0,
        "date": "November 4, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Spice it up! Perfect dress to throw on and go out!",
        "body": "Size medium, fit great, enough stretch, value for money, material was good enough, and it’s not a one time wear. Look how I made it more flattering with a belt. Read more",
        "author": "Iman l",
        "rating": 4.0,
        "date": "July 24, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61R0ZQgVajL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "3.0 out of 5 stars Meh - keep your expectations realistic",
        "body": "Bought this dress and was a bit disappointed. The dress is stretchy, but the material was relatively thin and did not meet my expectations. It was also shorter than I expected being a short woman. Overall, it was flattering and the material is soft, but I did end up going with something else and returning this. Keep your expectations mid to low if you purchase and it would probably work out fine for you. I don’t often buy clothes online because it is always so hard to tell but I did end up sending this dress back. Read more",
        "author": "Kelly D.",
        "rating": 3.0,
        "date": "June 25, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Perfect fit",
        "body": "Excellent fit and material. Highly recommend. Read more",
        "author": "Siddharth “Sid” Arora",
        "rating": 5.0,
        "date": "November 24, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "1.0 out of 5 stars Size runs larger than posted.",
        "body": "I’m a small petite girl who doesn’t have much for a chest or butt if I’m being honest, I bought this for an after party thinking a small would be perfect! I was wrong however, the small size fits more like a medium/large because of the stretch in the material. This dress is NOT for your typical 5’4 inches girlie who is very petite. Read more",
        "author": "Elizabeth Stewart",
        "rating": 1.0,
        "date": "October 17, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars GORGEOUS DRESS - Absolutely Love It",
        "body": "THIS DRESS IS EVERYTHING!!! I wore this for a date night with my boyfriend, and it did not disappoint! It hugs your curves in all the right places, and doesn't leave much to the imagination. You might not be able to wear a bra with it, but that wasn't an issue for me. Read more",
        "author": "Peyton Leaves Honest Reviews",
        "rating": 5.0,
        "date": "November 4, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Review",
        "body": "Amazing Read more",
        "author": "Eric Williams",
        "rating": 5.0,
        "date": "December 20, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Dress Cocktail V Neck Bodycon is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.",
  "about_this_item": "Womens Dress Cocktail V Neck Bodycon is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.",
  "long_description": "Womens Dress Cocktail V Neck Bodycon is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Black. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Dress Cocktail V Neck Bodycon is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Black. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "9d426ff3-c1cc-45b2-bfb6-92e32b05d4cd",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9d426ff3-c1cc-45b2-bfb6-92e32b05d4cd/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9d426ff3-c1cc-45b2-bfb6-92e32b05d4cd/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/b0cf3dbd-8603-4cce-8ef6-6ee2504bd39b.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "cd906368-035b-4345-91fd-f9f98b691fd5",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/cd906368-035b-4345-91fd-f9f98b691fd5/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/cd906368-035b-4345-91fd-f9f98b691fd5/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/b0cf3dbd-8603-4cce-8ef6-6ee2504bd39b.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Black": "https://m.media-amazon.com/images/I/31YsuJkWMLL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Black": "611HBMEYCCL"
  },
  "color_images": {
    "Black": [
      "https://m.media-amazon.com/images/I/611HBMEYCCL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-bodycon-long-sleeve-maxi-cocktail",
      "title": "Womens Maxi Dress Bodycon Long Sleeve Maxi Cocktail",
      "price": 47.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/81Qz5s7t1VL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-ruched",
      "title": "Womens Maxi Dress Long Sleeve Ruched",
      "price": 49.29,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61P6bkbQawL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-bodycon",
      "title": "Womens Dress Bodycon",
      "price": 30.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71Br1mzvDtL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-long-sleeve-v-neck",
      "title": "Womens Maxi Dress Formal Long Sleeve V Neck",
      "price": 75.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51UUQZK5oPL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-long-sleeve",
      "title": "Womens Maxi Dress Bodycon Long Sleeve",
      "price": 41.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61LYfcqqDNL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress-bodycon-ruched-one-shoulder-sleeveless",
      "title": "Womens Dress Bodycon Ruched One Shoulder Sleeveless",
      "price": 41.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/41COm0lfS4L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi",
      "title": "Womens Maxi Dress Maxi",
      "price": 139.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71EaaZYvteL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-v-neck-sleeveless",
      "title": "Womens Dress V Neck Sleeveless",
      "price": 31.27,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61d5+jUT-UL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-mermaid-formal",
      "title": "Womens Maxi Dress Mermaid Formal",
      "price": 85.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/612O0Y9cPuL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-ruched-one-shoulder",
      "title": "Womens Dress Ruched One Shoulder",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/81LCaVMIvTL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-split",
      "title": "Womens Dress Split",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61PPeTKsusL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 149.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Wedding Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/61jF7Q3ybJL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-formal-evening",
      "title": "Womens Maxi Dress Long Sleeve Formal Evening",
      "price": 84.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/81CsI4q6KXL._SL1500_.jpg"
      ]
    }
  ]
}