{
  "id": "womens-dress-sleeveless",
  "handle": "womens-dress-sleeveless",
  "sku": "JC3163",
  "asin": "B0DTDJZCSY",
  "title": "Womens Dress Sleeveless",
  "title_original": "YMDUCH Women's Summer Sleeveless Crew Neck Backless A-line Mini Party Prom Dress",
  "brand": "Visit the YMDUCH Store",
  "price": 38.99,
  "social_proof": {
    "bought_past_month": 658,
    "text": "658+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/71h38kyippL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81uTIlfjSML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81jSYIri+6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81kzf5ofDXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81jQHfiePJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81lLFnAj06L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81JDvmPW6bL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81gfGG7RASL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61RStwrj0YL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61LTOzyh1eL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71JKWWMuaVL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71JkwexSJaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71bmRB-CePL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61DWkvx2hKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ecW-W3EJL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/71h38kyippL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81uTIlfjSML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81jSYIri+6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81kzf5ofDXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81jQHfiePJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81lLFnAj06L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81JDvmPW6bL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81gfGG7RASL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61RStwrj0YL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61LTOzyh1eL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71JKWWMuaVL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71JkwexSJaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71bmRB-CePL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61DWkvx2hKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ecW-W3EJL._SL1500_.jpg"
  ],
  "aplus_images": [
    "https://m.media-amazon.com/images/I/31sQUod6faL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31P0CcQlqjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31QaUFWI88L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31Mzy6fbhzL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31UTZyIFdyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31%2BL61aD-EL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31Jr2K3tBlL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31D5g3Aau1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31KdJ1fFfIL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31p-59jzhVL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31jKuk8elxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31I1PJnCMlL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31GyukSONNL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31kQb3jT0XL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31L78CmA38L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/319FWEUVJYL._SL1500_.jpg"
  ],
  "description_images": [
    "https://m.media-amazon.com/images/I/31sQUod6faL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31P0CcQlqjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31QaUFWI88L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31Mzy6fbhzL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31UTZyIFdyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31%2BL61aD-EL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31Jr2K3tBlL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31D5g3Aau1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31KdJ1fFfIL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31p-59jzhVL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31jKuk8elxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31I1PJnCMlL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31GyukSONNL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31kQb3jT0XL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31L78CmA38L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/319FWEUVJYL._SL1500_.jpg"
  ],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ January 18, 2025",
    "ASIN ‏": "‎ B0DTDJCW46",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#24,477 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #129 in Women's Club & Night Out Dresses",
    "Customer Reviews": "4.3 4.3 out of 5 stars (315)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Red",
      "Winered",
      "Navy",
      "Pink",
      "White",
      "Blue",
      "Black",
      "Orange"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.3,
    "count": 315,
    "customers_say": "Customers love the dress's sleeveless crew neck design, with one noting how the backless detail adds allure, and appreciate its decent manufacturing and thick stretchy material. The dress fits well, with one customer mentioning it's stretchy to accommodate different body types, and customers find it perfect for special occasions and date nights. While some it's true to size, others find it runs big. Generated from the text of customer reviews Select to learn more Beauty (42) Quality (29) Fit (28) Material quality (18) Material thickness (14) Wearability (14) Stretchiness (12) Size (15) 42 customers mention beauty, 40 positive, 2 negative 42 customers mention \"Beauty\" 40 positive 2 negative Customers find the dress gorgeous and excellent in quality, with one customer noting its sleeveless crew neck design is effortlessly chic, while another mentions how the backless detail adds a perfect touch of allure. \" This dress is beautiful . I wore it for my graduation in August. I really love this dress. It’s a little bit stretch and true to the size.... \" Read more \" ...when ordering but to my surprise-the dress is well made and simple yet cute . \" Read more \" ...The material is also thick and soft. It is a beautiful dress and I have gotten so many compliments on it. This was a great purchase I must say. \" Read more \" Very pretty , fit perfectly and the material is nice and stretchy, perfect length as well! RB \" Read more 29 customers mention quality, 26 positive, 3 negative 29 customers mention \"Quality\" 26 positive 3 negative Customers love this summer sleeveless dress and find it to be decently manufactured. \" Nice dress BUT it BLEEDS color! Comfortable fit, stretchy. As mentioned, the color bled all over my white expensive bag.... \" Read more \" Amazing Dress . Material not cheap at all. One advice, purchase one size down for perfect fit. I bought my size and had to return for a smaller size.... \" Read more \" Amazing quality and fit for the price! It is so comfortable, well made ! Thick enough front panel that you can easily go bra less, if you want.... \" Read more \" Poor quality . \" Read more 28 customers mention fit, 25 positive, 3 negative 28 customers mention \"Fit\" 25 positive 3 negative Customers like how the dress fits, with one mentioning it hugs the waist perfectly and another noting it's stretchy to accommodate different body types. \" Beautiful dress ! Very lightweight fabric perfect fit and very comfortable! \" Read more \" Very pretty, fit perfectly and the material is nice and stretchy, perfect length as well! RB \" Read more \" This dress fits like a dream ! It hugs the waist perfectly and flares out in a classy, structured way.... \" Read more \" FIT MY DAUGHTER LIKE A GLOVE ! SHE WORE IT FOR GRADUATION! \" Read more 18 customers mention material quality, 15 positive, 3 negative 18 customers mention \"Material quality\" 15 positive 3 negative Customers like the material of the dress, with one mentioning it's a polyester blend. \" ...The dress came in on time, the material is nice and stretchy and is flattering in the stomach area, I weight 245 and am 5’4 and carry weight in my... \" Read more \" Amazing fit and I love the feel of the fabric !! I will wear this again and again \" Read more \" The fabric was perfect and thick. \" Read more \" ...I love the dress so much,and the fabric is of good quality . \" Read more 14 customers mention material thickness, 13 positive, 1 negative 14 customers mention \"Material thickness\" 13 positive 1 negative Customers like the dress's material thickness, with some noting it is thick and stretchy. \" Dress is amazing quality. It’s thick , very well made, and just the right length. Great for formal spring / summertime events.... \" Read more \" LOVE ! Fit like a glove ! Not see through at all ! Thick fabric . \" Read more \" ...I went braless and didn't need any nip coverage since the fabric was thick enough . But I'm also on the smaller side of the b cup girlies.... \" Read more \" ...The material is also thick and soft. It is a beautiful dress and I have gotten so many compliments on it. This was a great purchase I must say. \" Read more 14 customers mention wearability, 14 positive, 0 negative 14 customers mention \"Wearability\" 14 positive 0 negative Customers find the dress suitable for various occasions, including formal spring and summertime events, special occasions, and date nights. One customer mentions it can be dressed up with heels, while another notes it can be kept casual with sandals and a sunhat. \" ...It’s versatile enough to dress up with heels and jewelry or keep casual with sandals and a sunhat.... \" Read more \" Very comfy and slimming. Perfect for a date night out \" Read more \" Love love love this dress!!! So comfortable and you can wear it anywhere . Material is excellent quality and it’s very flattering. Must Buy!! \" Read more \" ...The fabric drapes nicely and the design is very flattering. Perfect for special occasions . Love it \" Read more 12 customers mention stretchiness, 12 positive, 0 negative 12 customers mention \"Stretchiness\" 12 positive 0 negative Customers like the dress's stretchiness. \" ...The dress came in on time, the material is nice and stretchy and is flattering in the stomach area, I weight 245 and am 5’4 and carry weight in my... \" Read more \" ...Better fit. Dress has stretch to it . \" Read more \" ...The dress it fits perfectly and the material has a nice stretch to it. The material is also thick and soft.... \" Read more \" ...red is vibrant, and the fit is perfect true to size and has good amount of stretch to it . Light, comfy, and flattering. Love it! \" Read more 15 customers mention size, 9 positive, 6 negative 15 customers mention \"Size\" 9 positive 6 negative Customers have mixed opinions about the dress's size, with some finding it perfect and not too long, while others report it being way too small and running big. \" ... Perfect length . Not too short, not too long. The hem is at my fingertips. Seriously love this dress so much! \" Read more \" Super cute, good material, a little short in the back \" Read more \" Size down . \" Read more \" ...The dress was not as pictured and 4 sizes too small \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Amazing dress",
        "body": "It’s is exactly what was shared. I did the Amazon fit check based on my weight and height and it actually helped. The dress it fits perfectly and the material has a nice stretch to it. The material is also thick and soft. It is a beautiful dress and I have gotten so many compliments on it. This was a great purchase I must say. Read more",
        "author": "Stacy",
        "rating": 5.0,
        "date": "July 30, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars LOVE THIS DRESS!!",
        "body": "This dress is beautiful. I wore it for my graduation in August. I really love this dress. It’s a little bit stretch and true to the size. Got a lot of compliments. Love love love it!!! Read more",
        "author": "Judith",
        "rating": 5.0,
        "date": "November 18, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars I liked",
        "body": "Beautiful and elegant dress. The fabric drapes nicely and the design is very flattering. Perfect for special occasions. Love it Read more",
        "author": "Angel Alberto Laguna Pérez",
        "rating": 5.0,
        "date": "December 17, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Dress",
        "body": "Fit perfectly. And the material was so soft and stretchy Read more",
        "author": "Hannah Berens",
        "rating": 4.0,
        "date": "July 22, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Adorable!",
        "body": "The dress is a so cute. The material is thick and a good weight. I am 5’7 and the length was good for a dress for a party. It was too small for me, but if I had been a thinner person I would have loved it! Read more",
        "author": "Christy McElhaney",
        "rating": 5.0,
        "date": "December 5, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "1.0 out of 5 stars More sporty quality less going out",
        "body": "Poor quality. Read more",
        "author": "Jaque Bryant",
        "rating": 1.0,
        "date": "December 22, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Dress Bleeds",
        "body": "Nice dress BUT it BLEEDS color! Comfortable fit, stretchy. As mentioned, the color bled all over my white expensive bag. I also tried to remove spilled makeup from the dress but no luck and the color bled all over the rag. This dress is hand-wash only so no luck bringing it to the cleaners. I’m 175lbs and ordered a large. Hid my mom pooch ok. Would have rated higher if I didn’t have to worry about removing color from my bag. I think the price was ok, not a dollar more. Material is solid, not sheer. Read more",
        "author": "Tee1",
        "rating": 3.0,
        "date": "August 6, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Such a Cute and Comfy Dress! I loved it!",
        "body": "I looooove this little sassy dress!! Bought it for my bday dinner and it was a hit. I purchased a Med. I'm 5'4, 170lbs and it hit perfectly in length (not too short and not long) and it was Very comfortable. The material was kind of like a scuba suit and it was stretchy allow you to just pull it over the head. There is a low back, so consider that. I went braless and didn't need any nip coverage since the fabric was thick enough. But I'm also on the smaller side of the b cup girlies. The color was perfect for me because I had a lipstick in mind to complement and that worked out perfectly. The red is a maroon. I may order it again in black just to have a LBD on deck for any given occasion because it's going to work for anything you want to look cute and spicy for. Read more",
        "author": "Akilah Jones",
        "rating": 5.0,
        "date": "August 11, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Dress Sleeveless is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.",
  "about_this_item": "Womens Dress Sleeveless is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.",
  "long_description": "Womens Dress Sleeveless is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Red, Winered, Navy, Pink, White, Blue, Black, Orange. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Dress Sleeveless is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/31sQUod6faL._SL1500_.jpg",
      "alt": "Womens Dress Sleeveless details image 1"
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/31P0CcQlqjL._SL1500_.jpg",
      "alt": "Womens Dress Sleeveless details image 2"
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/31QaUFWI88L._SL1500_.jpg",
      "alt": "Womens Dress Sleeveless details image 3"
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/31Mzy6fbhzL._SL1500_.jpg",
      "alt": "Womens Dress Sleeveless details image 4"
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Red, Winered, Navy, Pink, White, Blue, Black, Orange. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/31UTZyIFdyL._SL1500_.jpg",
      "alt": "Womens Dress Sleeveless details image 5"
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "5ca2b76d-1d23-461a-929f-06102326b195",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5ca2b76d-1d23-461a-929f-06102326b195/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5ca2b76d-1d23-461a-929f-06102326b195/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "77f7bf76-5adc-4863-a459-e3dec5958dda",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/77f7bf76-5adc-4863-a459-e3dec5958dda/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/77f7bf76-5adc-4863-a459-e3dec5958dda/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "21f15c84-8baa-4b2c-b5df-a6a24b30b672",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/21f15c84-8baa-4b2c-b5df-a6a24b30b672/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/21f15c84-8baa-4b2c-b5df-a6a24b30b672/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "69ff1755-3cfe-4545-9f2c-e3382691d5c4",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/69ff1755-3cfe-4545-9f2c-e3382691d5c4/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/69ff1755-3cfe-4545-9f2c-e3382691d5c4/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "11810a18-4658-44c6-bc95-dfbad986edc2",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/11810a18-4658-44c6-bc95-dfbad986edc2/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/11810a18-4658-44c6-bc95-dfbad986edc2/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "10e5aaa3-c235-490d-b30d-6d2f14cf9b44",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/10e5aaa3-c235-490d-b30d-6d2f14cf9b44/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/10e5aaa3-c235-490d-b30d-6d2f14cf9b44/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "887b8e50-942b-4b7c-bba9-d8350f79a525",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/887b8e50-942b-4b7c-bba9-d8350f79a525/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/887b8e50-942b-4b7c-bba9-d8350f79a525/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "dfa72cf4-eaf5-4a15-a363-a02896bd32e2",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/dfa72cf4-eaf5-4a15-a363-a02896bd32e2/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/dfa72cf4-eaf5-4a15-a363-a02896bd32e2/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "da6b789d-321c-4cc5-900e-e64e376fd00e",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/da6b789d-321c-4cc5-900e-e64e376fd00e/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/da6b789d-321c-4cc5-900e-e64e376fd00e/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "da82cb63-5a6a-452f-bc6e-595709b8a9b6",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/da82cb63-5a6a-452f-bc6e-595709b8a9b6/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/da82cb63-5a6a-452f-bc6e-595709b8a9b6/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "c1140a1f-8c4e-435f-ad91-9fbabc70e262",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c1140a1f-8c4e-435f-ad91-9fbabc70e262/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c1140a1f-8c4e-435f-ad91-9fbabc70e262/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "a4d261cf-94b7-4c0f-a3a7-29b0ee1949fc",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a4d261cf-94b7-4c0f-a3a7-29b0ee1949fc/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a4d261cf-94b7-4c0f-a3a7-29b0ee1949fc/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Red": "https://m.media-amazon.com/images/I/31PORDpZBUL._AC_SR38,50_.jpg",
    "Winered": "https://m.media-amazon.com/images/I/31+pD9ti4PL._AC_SR38,50_.jpg",
    "Navy": "https://m.media-amazon.com/images/I/31Vc19rFzXL._AC_SR38,50_.jpg",
    "Pink": "https://m.media-amazon.com/images/I/31WwqzDi1mL._AC_SR38,50_.jpg",
    "White": "https://m.media-amazon.com/images/I/31pBnWIyRNL._AC_SR38,50_.jpg",
    "Blue": "https://m.media-amazon.com/images/I/31l+2lH6EuL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31C8amq21bL._AC_SR38,50_.jpg",
    "Orange": "https://m.media-amazon.com/images/I/31my5Ty-CnL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Red": "71h38kyippL",
    "Winered": "61RStwrj0YL",
    "Navy": "61LTOzyh1eL",
    "Pink": "71JKWWMuaVL",
    "White": "71JkwexSJaL",
    "Blue": "71bmRB-CePL",
    "Black": "61DWkvx2hKL",
    "Orange": "71ecW-W3EJL"
  },
  "color_images": {
    "Red": [
      "https://m.media-amazon.com/images/I/71h38kyippL._SL1500_.jpg"
    ],
    "Winered": [
      "https://m.media-amazon.com/images/I/61RStwrj0YL._SL1500_.jpg"
    ],
    "Navy": [
      "https://m.media-amazon.com/images/I/61LTOzyh1eL._SL1500_.jpg"
    ],
    "Pink": [
      "https://m.media-amazon.com/images/I/71JKWWMuaVL._SL1500_.jpg"
    ],
    "White": [
      "https://m.media-amazon.com/images/I/71JkwexSJaL._SL1500_.jpg"
    ],
    "Blue": [
      "https://m.media-amazon.com/images/I/71bmRB-CePL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/61DWkvx2hKL._SL1500_.jpg"
    ],
    "Orange": [
      "https://m.media-amazon.com/images/I/71ecW-W3EJL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-one-shoulder-long-sleeve-maxi-formal",
      "title": "Womens Maxi Dress One Shoulder Long Sleeve Maxi Formal",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51osX5ku23L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 29.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/714NKRHRX2L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-sleeveless-formal-cocktail-v-neck-evening",
      "title": "Womens Maxi Dress Sleeveless Formal Cocktail V Neck Evening",
      "price": 72.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61q-2Wqi91L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail-bodycon-v-neck-sleeveless-ruched",
      "title": "Womens Dress Cocktail Bodycon V Neck Sleeveless Ruched",
      "price": 43.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51K9NAs7S1L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-long-sleeve",
      "title": "Womens Maxi Dress Cocktail Long Sleeve",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61rn8pl8A6L._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress-formal",
      "title": "Womens Dress Formal",
      "price": 74.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/517I6+Y980L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 10.95,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/81VSldp0TJL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 199.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/51rRJcl6flL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-v-neck-long-sleeve-bodycon",
      "title": "Womens Maxi Dress V Neck Long Sleeve Bodycon",
      "price": 30.59,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Sweaters > Pullovers",
      "images": [
        "https://m.media-amazon.com/images/I/71a0x4LTzmL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-ruched-bodycon-formal-cocktail-long-sleeve",
      "title": "Womens Maxi Dress Maxi Ruched Bodycon Formal Cocktail Long Sleeve",
      "price": 56.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/51HFt7oTd4L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-mermaid",
      "title": "Womens Maxi Dress Evening Mermaid",
      "price": 108.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51a9Odw5waL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail",
      "title": "Womens Dress Cocktail",
      "price": 34.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/81SP-ORh7dL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-sleeveless-cocktail-bodycon",
      "title": "Womens Dress Sleeveless Cocktail Bodycon",
      "price": 36.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61NaDgRQ-DL._SL1500_.jpg"
      ]
    }
  ]
}