{
  "id": "womens-dress-cocktail-short-sleeve-ruched",
  "handle": "womens-dress-cocktail-short-sleeve-ruched",
  "sku": "JC2596",
  "asin": "B0DXK9XTWD",
  "title": "Womens Dress Cocktail Short Sleeve Ruched",
  "title_original": "SOLY HUX Women's Plus Size Dress Off The Shoulder Short Sleeve Ruched A Line Flared Cocktail Party Short Dresses",
  "brand": "Visit the SOLY HUX Store",
  "price": 39.99,
  "social_proof": {
    "bought_past_month": 290,
    "text": "290+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/51EAoXP7IGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51hiCFZUT0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81CdF4vunCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81UtDPYFrhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81pAzifLgcL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/51EAoXP7IGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51hiCFZUT0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81CdF4vunCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81UtDPYFrhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81pAzifLgcL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ February 18, 2025",
    "ASIN ‏": "‎ B0DXKL29L9",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#141,287 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #357 in Women's Cocktail Dresses",
    "Customer Reviews": "3.1 3.1 out of 5 stars (33)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Solid Black"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 3.1,
    "count": 33,
    "customers_say": "Customers find the dress has a perfect fit and appreciate its stretchy top. However, the material quality receives negative feedback, with one customer describing it as paper-like. Moreover, the dress's shape is problematic, with multiple customers reporting issues with how it sits on the body. Additionally, customers disagree on whether the dress is flattering. Generated from the text of customer reviews Select to learn more Fit (5) Stretchiness (4) Flattering (4) Material quality (7) Shape (7) Quality (5) 5 customers mention fit, 4 positive, 1 negative 5 customers mention \"Fit\" 4 positive 1 negative Customers are satisfied with how the dress fits, with one mentioning it has plenty of room. \" ...Had hoped it would look cute on, but it is not flattering. True to size , but the style wasn't what I expected \" Read more \" This dress is absolutely beautiful! The fit is perfect and the shape is just stunning. It highlights my figure in all the right places.... \" Read more \" Great fit . Nice material. The cut and style was very flattering. The stretch was good on top. The flare on the bottom was appropriate. Nice length.... \" Read more \" ...shape, honestly I should have gone down a size but the sleeves would probably not fit right .... \" Read more 4 customers mention stretchiness, 3 positive, 1 negative 4 customers mention \"Stretchiness\" 3 positive 1 negative Customers like the dress's stretchiness, particularly noting that the top is super stretchy. \" ...There are two types of material, but I'm not mad. The top is super stretchy with tons of room..great for apple shape, honestly I should have gone... \" Read more \" ...The material is very stretchy , but the sleeves are too which resulted in the “bow” effect to look baggy, slouchy, and took away from the effect of... \" Read more \" Daughter loved her dress ! Stretchy , wish bow was more firm but othan than that we loved the dress. \" Read more \" ...Nice material. The cut and style was very flattering. The stretch was good on top . The flare on the bottom was appropriate. Nice length.... \" Read more 4 customers mention flattering, 2 positive, 2 negative 4 customers mention \"Flattering\" 2 positive 2 negative Customers have mixed opinions about how flattering the dress is, with one customer noting it highlights their figure in all the right places. \" ...It highlights my figure in all the right places . I got so many compliments — I truly love it! \" Read more \" ...Had hoped it would look cute on, but it is not flattering . True to size, but the style wasn't what I expected \" Read more \" Great fit. Nice material. The cut and style was very flattering . The stretch was good on top. The flare on the bottom was appropriate. Nice length.... \" Read more \" ...stretchy, but the sleeves are too which resulted in the “ bow” effect to look baggy , slouchy, and took away from the effect of it looking like a bow... \" Read more 7 customers mention material quality, 1 positive, 6 negative 7 customers mention \"Material quality\" 1 positive 6 negative Customers have mixed opinions about the dress's material quality, with some appreciating the cotton linen combination in the skirt, while others find it feels cheap and almost like paper. \" ...The fabric feels cheap . Im glad I tried it on before my event. Definitely returning and finding something else. \" Read more \" One star, because at least the dress is a dress? It’s tablecloth material , like costume clothes material. The bow isn’t a bow, it’s more of a….... \" Read more \" Cheap material . Nothing like the picture. Not worth $30. Would not recommend \" Read more \" ...of the top and midsection, the bottom was disappointingly thin— almost like paper . The quality simply isn't acceptable.... \" Read more 7 customers mention shape, 2 positive, 5 negative 7 customers mention \"Shape\" 2 positive 5 negative Customers report issues with the dress's shape, noting that it doesn't sit as shown in the picture and has problems with the bow and shoulder line. \" ...the sleeves are too which resulted in the “bow” effect to look baggy, slouchy , and took away from the effect of it looking like a bow on the... \" Read more \" ...The top part won't lay right if you have large breasts. (C and Up) The fabric feels cheap. Im glad I tried it on before my event.... \" Read more \" This dress is absolutely beautiful! The fit is perfect and the shape is just stunning . It highlights my figure in all the right places.... \" Read more \" ...The bow doesn't lay correctly for my body shape. There are two types of material, but I'm not mad.... \" Read more 5 customers mention quality, 1 positive, 4 negative 5 customers mention \"Quality\" 1 positive 4 negative Customers express dissatisfaction with the dress's quality. \" This dress sucks . It was nothing like the picture. In the photo, they make the sleeves look like they’ll sit as such but they don’t.... \" Read more \" This dress has super static cling even with attempts at trying to get rid of it. The top part won't lay right if you have large breasts.... \" Read more \" ...The quality simply isn't acceptable . Additionally, the color mismatch is glaring; the two shades of black are noticeably different.... \" Read more \" Terrible quality ... \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Perfect fit!",
        "body": "Great fit. Nice material. The cut and style was very flattering. The stretch was good on top. The flare on the bottom was appropriate. Nice length. Just above the knee. Will be worn again. Read more",
        "author": "Customer",
        "rating": 5.0,
        "date": "October 26, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "1.0 out of 5 stars NOPE",
        "body": "This dress has super static cling even with attempts at trying to get rid of it. The top part won't lay right if you have large breasts. (C and Up) The fabric feels cheap. Im glad I tried it on before my event. Definitely returning and finding something else. Read more",
        "author": "MadxChess",
        "rating": 1.0,
        "date": "December 5, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Gorgeous and Flattering",
        "body": "This dress is absolutely beautiful! The fit is perfect and the shape is just stunning. It highlights my figure in all the right places. I got so many compliments — I truly love it! Read more",
        "author": "Cynthia",
        "rating": 5.0,
        "date": "July 15, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars This is meant for apple shape babes",
        "body": "Reference: 5'4, pear/hourglass shape, wide hips, 250lbs, 38DD. Not obsessed. I have a Christmas party in a few weeks and even with the poor reviews, I envisioned this dress for it. While, this may be for someone, it unfortunately is not for me. The bow doesn't lay correctly for my body shape. There are two types of material, but I'm not mad. The top is super stretchy with tons of room..great for apple shape, honestly I should have gone down a size but the sleeves would probably not fit right. Don't not buy and try it, because of you don't have a chest or broad shoulders, you may look amazing. I would not give a 1 because there are things I do like, like the drop waist and stretch ..also if your hips/butt got a little volume, it is a little shorter in the back. I planned on wearing black tights with it anyways. Read more",
        "author": "Cassandra",
        "rating": 3.0,
        "date": "November 13, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71LI2wPTmiL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "1.0 out of 5 stars Keep searching",
        "body": "One star, because at least the dress is a dress? It’s tablecloth material, like costume clothes material. The bow isn’t a bow, it’s more of a…. Drape, a shawl if you will. Bought this for Christmas photos, used it as a napkin. Read more",
        "author": "Lakelynn",
        "rating": 1.0,
        "date": "December 12, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "2.0 out of 5 stars THE PRICE DOESN'T MATCH THE QUALITY",
        "body": "This dress sucks. It was nothing like the picture. In the photo, they make the sleeves look like they’ll sit as such but they don’t. The material is very stretchy, but the sleeves are too which resulted in the “bow” effect to look baggy, slouchy, and took away from the effect of it looking like a bow on the shoulders. I’m really disappointed I didn’t like it because I got it to wear for my graduation and will now have to return it & find something to wear at home! WAS NEVER WORTH $45! Read more",
        "author": "Customer",
        "rating": 2.0,
        "date": "June 13, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Stretchy",
        "body": "Daughter loved her dress ! Stretchy, wish bow was more firm but othan than that we loved the dress. Read more",
        "author": "Addie",
        "rating": 5.0,
        "date": "July 22, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "1.0 out of 5 stars Unflattering",
        "body": "Believe the reviews, the off-the-shoulder panel does not have structure like shown in the picture. The shoulder line is droopy. Had hoped it would look cute on, but it is not flattering. True to size, but the style wasn't what I expected Read more",
        "author": "Customer",
        "rating": 1.0,
        "date": "November 18, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Dress Cocktail Short Sleeve Ruched is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.",
  "about_this_item": "Womens Dress Cocktail Short Sleeve Ruched is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.",
  "long_description": "Womens Dress Cocktail Short Sleeve Ruched is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Solid Black. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Dress Cocktail Short Sleeve Ruched is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Solid Black. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "src": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/ac0cb415-2962-488c-84a5-014808b7d683.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG&quot;,&quot;videoSrc&quot;:&quot;https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/ac0cb415-2962-488c-84a5-014808b7d683.mp4/productVideoOptimized.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/ac0cb415-2962-488c-84a5-014808b7d683.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG&quot;,&quot;videoSrc&quot;:&quot;https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/ac0cb415-2962-488c-84a5-014808b7d683.mp4/productVideoOptimized.mp4"
        }
      ]
    },
    {
      "src": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/ac0cb415-2962-488c-84a5-014808b7d683.mp4/productVideoOptimized.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/ac0cb415-2962-488c-84a5-014808b7d683.mp4/productVideoOptimized.mp4"
        }
      ]
    },
    {
      "src": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/ac0cb415-2962-488c-84a5-014808b7d683.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/ac0cb415-2962-488c-84a5-014808b7d683.mp4"
        }
      ]
    },
    {
      "src": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/d5f09704-30de-48e8-9e54-b2d78d6a6922.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG&quot;,&quot;videoSrc&quot;:&quot;https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/d5f09704-30de-48e8-9e54-b2d78d6a6922.mp4/productVideoOptimized.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/d5f09704-30de-48e8-9e54-b2d78d6a6922.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG&quot;,&quot;videoSrc&quot;:&quot;https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/d5f09704-30de-48e8-9e54-b2d78d6a6922.mp4/productVideoOptimized.mp4"
        }
      ]
    },
    {
      "src": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/d5f09704-30de-48e8-9e54-b2d78d6a6922.mp4/productVideoOptimized.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/d5f09704-30de-48e8-9e54-b2d78d6a6922.mp4/productVideoOptimized.mp4"
        }
      ]
    },
    {
      "src": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/d5f09704-30de-48e8-9e54-b2d78d6a6922.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/d5f09704-30de-48e8-9e54-b2d78d6a6922.mp4"
        }
      ]
    },
    {
      "src": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/c164585e-c8a0-4f85-a600-62a40232faa3.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG&quot;,&quot;videoSrc&quot;:&quot;https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/c164585e-c8a0-4f85-a600-62a40232faa3.mp4/productVideoOptimized.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/c164585e-c8a0-4f85-a600-62a40232faa3.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG&quot;,&quot;videoSrc&quot;:&quot;https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/c164585e-c8a0-4f85-a600-62a40232faa3.mp4/productVideoOptimized.mp4"
        }
      ]
    },
    {
      "src": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/c164585e-c8a0-4f85-a600-62a40232faa3.mp4/productVideoOptimized.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/c164585e-c8a0-4f85-a600-62a40232faa3.mp4/productVideoOptimized.mp4"
        }
      ]
    },
    {
      "src": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/c164585e-c8a0-4f85-a600-62a40232faa3.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/c164585e-c8a0-4f85-a600-62a40232faa3.mp4"
        }
      ]
    },
    {
      "src": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/24a15b98-27fc-4634-a532-118015a0e30e.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG&quot;,&quot;videoSrc&quot;:&quot;https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/24a15b98-27fc-4634-a532-118015a0e30e.mp4/productVideoOptimized.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/24a15b98-27fc-4634-a532-118015a0e30e.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG&quot;,&quot;videoSrc&quot;:&quot;https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/24a15b98-27fc-4634-a532-118015a0e30e.mp4/productVideoOptimized.mp4"
        }
      ]
    },
    {
      "src": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/24a15b98-27fc-4634-a532-118015a0e30e.mp4/productVideoOptimized.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/24a15b98-27fc-4634-a532-118015a0e30e.mp4/productVideoOptimized.mp4"
        }
      ]
    },
    {
      "src": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/24a15b98-27fc-4634-a532-118015a0e30e.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/24a15b98-27fc-4634-a532-118015a0e30e.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Solid Black": "https://m.media-amazon.com/images/I/316w+C3TcoL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Solid Black": "51EAoXP7IGL"
  },
  "color_images": {
    "Solid Black": [
      "https://m.media-amazon.com/images/I/51EAoXP7IGL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/51hiCFZUT0L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81CdF4vunCL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81UtDPYFrhL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81pAzifLgcL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 84.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51UpL1lmMJL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-maxi-bodycon-long-sleeve-formal-ruched",
      "title": "Womens Maxi Dress Cocktail Maxi Bodycon Long Sleeve Formal Ruched",
      "price": 64.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51rp1FtyHmL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-maxi",
      "title": "Womens Maxi Dress Bodycon Maxi",
      "price": 40.17,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/41bSqtJhKaL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-bodycon-split-ruched-off-shoulder",
      "title": "Womens Dress Bodycon Split Ruched Off Shoulder",
      "price": 38.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/41JjYcPgcpL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening",
      "title": "Womens Maxi Dress Formal Evening",
      "price": 74.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61V7vD83vuL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-evening-formal",
      "title": "Womens Maxi Dress Evening Formal",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Lingerie, Sleep & Lounge > Sleep & Lounge > Nightgowns & Sleepshirts",
      "images": [
        "https://m.media-amazon.com/images/I/51zDkNUpRCL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-formal-short-sleeve-cocktail-v-neck-maxi",
      "title": "Womens Maxi Dress Evening Formal Short Sleeve Cocktail V Neck Maxi",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61AaE2eUMIL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-formal-maxi",
      "title": "Womens Maxi Dress Long Sleeve Formal Maxi",
      "price": 57.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61HzhJOJQJL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-v-neck",
      "title": "Womens Maxi Dress V Neck",
      "price": 45.83,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61XQWCITzNL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-sleeveless-v-neck-mermaid",
      "title": "Womens Maxi Dress Sleeveless V Neck Mermaid",
      "price": 98.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/619RXI5CEML._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-maxi",
      "title": "Womens Maxi Dress Bodycon Maxi",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61NzfdgpOML._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-sleeveless-cocktail-v-neck-bodycon-ruched",
      "title": "Womens Dress Sleeveless Cocktail V Neck Bodycon Ruched",
      "price": 45.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61d6j+j8sjL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-sleeveless",
      "title": "Womens Maxi Dress Maxi Sleeveless",
      "price": 42.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/814ZyJJ1oAL._SL1500_.jpg"
      ]
    }
  ]
}