{
  "id": "womens-maxi-dress-sleeveless-maxi-bodycon",
  "handle": "womens-maxi-dress-sleeveless-maxi-bodycon",
  "sku": "JC2392",
  "asin": "B0DXKSNHPW",
  "title": "Womens Maxi Dress Sleeveless Maxi Bodycon",
  "title_original": "REORIA Women's Summer Cowl Neck Mesh Sleeveless Tank Dress Sexy Double Lined Bodycon Maxi Long Dresses",
  "brand": "Visit the REORIA Store",
  "price": 49.97,
  "social_proof": {
    "bought_past_month": 1784,
    "text": "1784+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/51TlDBbXqGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/617jO0Xk3mL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81YrA1lpiDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71K5Sb49F4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71a2evwazLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/710vzPVGRlL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61fY2biiFNL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61MXqyYo7DL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/816dYG5OE3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71pyaoh0umL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ir12jA3lL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71K+2dy8A0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61b1hmMesbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61N5pDhv9uL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81rHnjDgcuL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71OHNNsKrWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/716V0-kCYkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71OcHXH8OgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61CcMGIeU4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61RyeqHxkGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81l-LOSZDxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Bz-XgG6wL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71PG-u3u+SL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71-rJRBLarL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51EQonv+wBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51uCBEIVZTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/815MUQtO+1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71-aj8yO9PL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71X9rDRULUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61JrS2oWNGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61tYCsSnRVL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Arj6-67OL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81EWaELjkSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/718zygyYgoL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/710TrKAmMfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ueHJ8CuFL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/51TlDBbXqGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/617jO0Xk3mL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81YrA1lpiDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71K5Sb49F4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71a2evwazLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/710vzPVGRlL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61fY2biiFNL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61MXqyYo7DL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/816dYG5OE3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71pyaoh0umL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ir12jA3lL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71K+2dy8A0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61b1hmMesbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61N5pDhv9uL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81rHnjDgcuL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71OHNNsKrWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/716V0-kCYkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71OcHXH8OgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61CcMGIeU4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61RyeqHxkGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81l-LOSZDxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Bz-XgG6wL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71PG-u3u+SL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71-rJRBLarL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51EQonv+wBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51uCBEIVZTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/815MUQtO+1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71-aj8yO9PL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71X9rDRULUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61JrS2oWNGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61tYCsSnRVL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Arj6-67OL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81EWaELjkSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/718zygyYgoL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/710TrKAmMfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ueHJ8CuFL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ February 18, 2025",
    "ASIN ‏": "‎ B0DXJXL2XF",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#72,105 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #271 in Women's Formal Dresses #883 in Women's Casual Dresses",
    "Customer Reviews": "4.4 4.4 out of 5 stars (150)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Brown",
      "Khaki",
      "Burgundy",
      "Dew",
      "Black",
      "Deep Grey"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.4,
    "count": 150,
    "customers_say": "Customers find this dress to be a perfect wedding guest outfit, with one noting it looks more expensive than its price. The dress is stretchy and comfortable, with one customer mentioning it provides plenty of room for a bump. They appreciate its versatility, noting it can be dressed up or down for different occasions, and one customer specifically mentions it's great for dancing. Select to learn more Look Quality Fit Flattering Comfort Stretchy material Dress versatility Fabric quality 26 customers mention \"Look\" 24 positive 2 negative Customers find the dress cute and elegant, with one mentioning it looks far more expensive than it is. \"This beautiful dress is worth grabbing....\" Read more \"This dress is so cute and flattering. It’s very comfortable too, and would be great for a girls night or date! The material is very soft! Great buy!\" Read more \"...Makes you feel beautiful , sexy and very confident!\" Read more \"This is dress is so cute and the material is comfortable and stretchy....\" Read more 20 customers mention \"Quality\" 18 positive 2 negative Customers find the dress to be of great quality, particularly noting it's perfect for wedding guest attire, with one customer mentioning it's ideal for a girls night or date. \"True to size. Super stretchy. Great quality . Doesn’t wrinkle. Makes you look great!!\" Read more \"Beautiful dress, really good quality !\" Read more \"Super comfortable, nice and strong fabric, I’m 5’8 and got an xl and it was a perfect length....\" Read more \" Perfect Wedding Guest Dress – Even 7 Months Pregnant!...\" Read more 19 customers mention \"Fit\" 18 positive 1 negative Customers are satisfied with how the dress fits, with one mentioning that the stretchy material provides a perfect fit. \"...A dress for any occasion. It fits perfectly , as it's stretchy for a perfect fit. Good quality material and excellent price.\" Read more \"Very cute, flattering fit and is nice quality for the price. You can definitely dress it up or down for event flexibility.\" Read more \"...Looks more expensive than it is. Very form fitting , if that’s what you’re seeking. I loved it, and had many compliments on it!\" Read more \"This dress surprised me. It is soft, comfortable, form fitting , flattering, and feels like quality material....\" Read more 18 customers mention \"Flattering\" 16 positive 2 negative Customers find the dress flattering, with one mentioning how it hugs the body in all the right places. \"This is absolutely so flattering . Also incredibly comfortable and hugs you and all the right places my mom ended up buying one too.\" Read more \"This dress is so cute and flattering . It’s very comfortable too, and would be great for a girls night or date! The material is very soft! Great buy!\" Read more \" Very flattering !! Material is stretchy. Only having a hard time finding a good shapewear to go with it. Otherwise, absolutely love it!...\" Read more \" Hugs you in all the right places \" Read more 15 customers mention \"Comfort\" 15 positive 0 negative Customers find the dress comfortable. \"This dress surprised me. It is soft, comfortable , form fitting, flattering, and feels like quality material....\" Read more \"So flattering & comfy ! Loved wearing this to an outdoor/summer wedding....\" Read more \"This dress is so cute and flattering. It’s very comfortable too, and would be great for a girls night or date! The material is very soft! Great buy!\" Read more \"...awards show - this can truly be dressed up or dressed down and it's so comfy . Also accentuated the bump perfectly.\" Read more 12 customers mention \"Stretchy material\" 12 positive 0 negative Customers like the dress's stretchy material. \"...What I loved most is how stretchy and forgiving it is it gave me plenty of room for my bump without feeling tight or uncomfortable.\" Read more \"... Super stretchy . As I used it for a baby shower. It’s lightweight but material is thick enough that’s it’s not see through. It has a nice neck drape.\" Read more \"...I wore this in a wedding and I was the maid of honor. Very stretchy so great for dancing in. I am 5’6” and about 170 lbs and I got the large....\" Read more \"...The burgundy red is flattering along with the neck line. The material was stretchy , but tight and hugs your body in all the right places!...\" Read more 9 customers mention \"Dress versatility\" 9 positive 0 negative Customers appreciate the dress's versatility, noting it can be dressed up or down for different occasions, with one customer mentioning it's great for dancing. \"Good quality material and excellent price. A dress for any occasion . It fits perfectly, as it's stretchy for a perfect fit....\" Read more \"...I think its a cute elegant dress. Can be dressed up or down !\" Read more \"...Very stretchy so great for dancing in . I am 5’6” and about 170 lbs and I got the large. It is not see through or wrinkly....\" Read more \"...love this dress for both more upscale events but it can also be dressed down ....\" Read more 9 customers mention \"Fabric quality\" 7 positive 2 negative Customers like the fabric quality of the dress, particularly noting its perfect material and sheer texture. \" Good quality material and excellent price. A dress for any occasion. It fits perfectly, as it's stretchy for a perfect fit....\" Read more \"Obsessed with this dress! The fabric is so nice , it sucks you right in. So so flattering!\" Read more \" Material was perfect and light weight, nice underlining also....\" Read more \"Cute look but material was not my favorite . I ended up returning\" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Flattering, Comfortable Dress That Looks Far More Expensive Than It Is",
        "body": "I wore this full-length maroon dress to a friend’s wedding, and I could not believe how comfortable it was. The fabric feels like soft pajama material, yet it looks so elegant. It has a slip underneath with a lightweight mesh overlay that gives it a beautiful flow and high-quality feel. The scoop neck is flattering, and the fit was perfect for me as someone who is fairly postpartum. It is not super tight, but still very flattering and easy to move in. I received so many compliments throughout the night, and no one would ever guess how affordable it was. I will admit I return a lot of clothing on Amazon, but this dress is a keeper. In fact, I may even consider buying it in more colors because it is that good. Read more",
        "author": "Taryn",
        "rating": 5.0,
        "date": "September 6, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71pkAh12r6L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Affordable formal/wedding guest dress!",
        "body": "Such a cute, affordable dress—especially for a wedding or formal event! The burgundy red is flattering along with the neck line. The material was stretchy, but tight and hugs your body in all the right places! It is reasonably thick and not see through. I ordered a size small and am 5’4, 130lbs for reference. Read more",
        "author": "Alicia Walker",
        "rating": 5.0,
        "date": "July 21, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71h5M+SzVyL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars So cute and great quality, sucks you in",
        "body": "This is absolutely so flattering. Also incredibly comfortable and hugs you and all the right places my mom ended up buying one too. Read more",
        "author": "Shelby",
        "rating": 5.0,
        "date": "December 2, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Worth grabbing!",
        "body": "This beautiful dress is worth grabbing. It’s double lined I used a lace under for an extra touch but the length is prefect where you won’t be tripping over it. Super stretchy. As I used it for a baby shower. It’s lightweight but material is thick enough that’s it’s not see through. It has a nice neck drape. Read more",
        "author": "Lis",
        "rating": 5.0,
        "date": "September 29, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/51OlJ3fp4gL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "3.0 out of 5 stars Fits nice, weird odor that won’t go away.",
        "body": "although the dress is beautiful, the dress had a weird skunky odor when taken out of the packaging. I received another dress in a different package from the same seller that also had the odor. After several washes it still smells. Read more",
        "author": "Sarah Benson",
        "rating": 3.0,
        "date": "October 10, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Not for flat chest girlys",
        "body": "Super cute dress just not for the flat chested girlys, im having to get mine altard in the bust area. the quality is great not see through, i did get black tho and its lightweight easy to move in, it stretches if needed. but if u have a small chest like me i wouldnt buy it Read more",
        "author": "Karalynne Antaya",
        "rating": 4.0,
        "date": "July 26, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars ThE dress.",
        "body": "This dress surprised me. It is soft, comfortable, form fitting, flattering, and feels like quality material. I got it as a back up dress and ended up using it instead because I really liked the fit when I tried it on. I am 5’ and the bottom hem hit just below my ankles so the length was perfect for me with a little heel. 10/10 would recommend! Read more",
        "author": "MissLou",
        "rating": 5.0,
        "date": "October 13, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Selfie",
        "body": "Super comfortable, nice and strong fabric, I’m 5’8 and got an xl and it was a perfect length. It is not see through it has a sheer fabric and underneath a solid fabric. Read more",
        "author": "Bianca",
        "rating": 5.0,
        "date": "December 1, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/816u7JpFD0L._SY88._SL1500_.jpg"
        ]
      }
    ]
  },
  "short_description": "Womens Maxi Dress Sleeveless Maxi Bodycon is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.",
  "about_this_item": "Womens Maxi Dress Sleeveless Maxi Bodycon is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.",
  "long_description": "Womens Maxi Dress Sleeveless Maxi Bodycon is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Brown, Khaki, Burgundy, Dew, Black, Deep Grey. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Sleeveless Maxi Bodycon is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Brown, Khaki, Burgundy, Dew, Black, Deep Grey. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "a5ba5822-f793-42ff-9bdd-5ef8124e7614",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a5ba5822-f793-42ff-9bdd-5ef8124e7614/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a5ba5822-f793-42ff-9bdd-5ef8124e7614/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/9da43145-69e9-470d-a5eb-3774185d315c.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "bcace41d-d552-43a0-9909-16a38878435e",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bcace41d-d552-43a0-9909-16a38878435e/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bcace41d-d552-43a0-9909-16a38878435e/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/9da43145-69e9-470d-a5eb-3774185d315c.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "f6603997-407e-46e6-8ea5-12d6881b0287",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f6603997-407e-46e6-8ea5-12d6881b0287/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f6603997-407e-46e6-8ea5-12d6881b0287/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/9da43145-69e9-470d-a5eb-3774185d315c.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "1f4c88d9-aa93-453f-a021-9c186f98de21",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1f4c88d9-aa93-453f-a021-9c186f98de21/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1f4c88d9-aa93-453f-a021-9c186f98de21/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/9da43145-69e9-470d-a5eb-3774185d315c.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "59c99b0b-9cde-4be9-a253-09a24541e5d4",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/59c99b0b-9cde-4be9-a253-09a24541e5d4/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/59c99b0b-9cde-4be9-a253-09a24541e5d4/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/9da43145-69e9-470d-a5eb-3774185d315c.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "270f903d-1cdc-4295-8320-2267cd90ec53",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/270f903d-1cdc-4295-8320-2267cd90ec53/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/270f903d-1cdc-4295-8320-2267cd90ec53/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/9da43145-69e9-470d-a5eb-3774185d315c.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "9e208038-70ca-497d-a5ca-0fe3a5eb703c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9e208038-70ca-497d-a5ca-0fe3a5eb703c/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9e208038-70ca-497d-a5ca-0fe3a5eb703c/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/9da43145-69e9-470d-a5eb-3774185d315c.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "f071c003-d104-4bda-bbd7-d081fccf38e5",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f071c003-d104-4bda-bbd7-d081fccf38e5/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f071c003-d104-4bda-bbd7-d081fccf38e5/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/9da43145-69e9-470d-a5eb-3774185d315c.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "e8ba3b8d-2329-4c1b-94ad-e935aa3e3df4",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e8ba3b8d-2329-4c1b-94ad-e935aa3e3df4/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e8ba3b8d-2329-4c1b-94ad-e935aa3e3df4/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/9da43145-69e9-470d-a5eb-3774185d315c.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "028df26a-bc93-4306-82c9-5735150150b8",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/028df26a-bc93-4306-82c9-5735150150b8/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/028df26a-bc93-4306-82c9-5735150150b8/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/9da43145-69e9-470d-a5eb-3774185d315c.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "8e1f0596-d5af-43b0-bd2e-2be44d0dca22",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8e1f0596-d5af-43b0-bd2e-2be44d0dca22/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8e1f0596-d5af-43b0-bd2e-2be44d0dca22/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/9da43145-69e9-470d-a5eb-3774185d315c.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "48d8017e-ee3c-48ec-ae5a-964b3650ae83",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/48d8017e-ee3c-48ec-ae5a-964b3650ae83/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/48d8017e-ee3c-48ec-ae5a-964b3650ae83/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/9da43145-69e9-470d-a5eb-3774185d315c.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Brown": "https://m.media-amazon.com/images/I/31BhNM+RicL._AC_SR38,50_.jpg",
    "Khaki": "https://m.media-amazon.com/images/I/21PiJ6h9CNL._AC_SR38,50_.jpg",
    "Burgundy": "https://m.media-amazon.com/images/I/31AnCq+w+WL._AC_SR38,50_.jpg",
    "Dew": "https://m.media-amazon.com/images/I/217KPxp7-kL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31l2istEuAL._AC_SR38,50_.jpg",
    "Deep Grey": "https://m.media-amazon.com/images/I/31zXc9bhkXL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Brown": "61fY2biiFNL",
    "Khaki": "61b1hmMesbL",
    "Burgundy": "61CcMGIeU4L",
    "Dew": "51EQonv+wBL",
    "Black": "51TlDBbXqGL",
    "Deep Grey": "61tYCsSnRVL"
  },
  "color_images": {
    "Brown": [
      "https://m.media-amazon.com/images/I/61fY2biiFNL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61MXqyYo7DL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/816dYG5OE3L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71pyaoh0umL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71ir12jA3lL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71K+2dy8A0L._SL1500_.jpg"
    ],
    "Khaki": [
      "https://m.media-amazon.com/images/I/61b1hmMesbL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61N5pDhv9uL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81rHnjDgcuL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71OHNNsKrWL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/716V0-kCYkL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71OcHXH8OgL._SL1500_.jpg"
    ],
    "Burgundy": [
      "https://m.media-amazon.com/images/I/61CcMGIeU4L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61RyeqHxkGL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81l-LOSZDxL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71Bz-XgG6wL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71PG-u3u+SL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71-rJRBLarL._SL1500_.jpg"
    ],
    "Dew": [
      "https://m.media-amazon.com/images/I/51EQonv+wBL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/51uCBEIVZTL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/815MUQtO+1L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71-aj8yO9PL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71X9rDRULUL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61JrS2oWNGL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/51TlDBbXqGL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/617jO0Xk3mL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81YrA1lpiDL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71K5Sb49F4L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71a2evwazLL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/710vzPVGRlL._SL1500_.jpg"
    ],
    "Deep Grey": [
      "https://m.media-amazon.com/images/I/61tYCsSnRVL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61Arj6-67OL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81EWaELjkSL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/718zygyYgoL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/710TrKAmMfL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71ueHJ8CuFL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-boat-neck-long-sleeve",
      "title": "Womens Maxi Dress Boat Neck Long Sleeve",
      "price": 29.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51Jm7sZ4nyL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail-evening",
      "title": "Womens Dress Cocktail Evening",
      "price": 44.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61Q-pqILlHL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-off-shoulder-formal-mermaid",
      "title": "Womens Maxi Dress Evening Off Shoulder Formal Mermaid",
      "price": 75.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51wI9ETVYDL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-short-sleeve-v-neck",
      "title": "Womens Dress Short Sleeve V Neck",
      "price": 33.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51eKnVmgsuL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71kDK7UBNnL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 227.85,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61i9FzgfXpL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-cocktail-maxi",
      "title": "Womens Maxi Dress Bodycon Cocktail Maxi",
      "price": 38.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61yhPYgMlWL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-mermaid-off-shoulder",
      "title": "Womens Maxi Dress Mermaid Off Shoulder",
      "price": 134.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61mr0w2Md+L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-formal",
      "title": "Womens Dress Formal",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61o5kzGtIvL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-evening-cocktail",
      "title": "Womens Dress Evening Cocktail",
      "price": 29.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/71LVQRkZKwL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-evening",
      "title": "Womens Maxi Dress Long Sleeve Evening",
      "price": 73.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51YP0DM7HPL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-long-sleeve-evening-formal",
      "title": "Womens Maxi Dress Cocktail Long Sleeve Evening Formal",
      "price": 46.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/6190eiFreBL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 117.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/81CtK1yhbfL._SL1500_.jpg"
      ]
    }
  ]
}