{
  "id": "womens-maxi-dress-formal-split-maxi-cocktail",
  "handle": "womens-maxi-dress-formal-split-maxi-cocktail",
  "sku": "JC2082",
  "asin": "B0DZ21NJ2R",
  "title": "Womens Maxi Dress Formal Split Maxi Cocktail",
  "title_original": "MUSHARE Women's Square Neck Sexy Split Cocktail Party Maxi Long Formal Dress",
  "brand": "MUSHARE",
  "price": 59.99,
  "social_proof": {
    "bought_past_month": 457,
    "text": "457+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/61IlruYfr4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51F-SsoDLyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51hDMKGMYlL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/612goCdmWfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61h0v9D3W4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/5115tsEnMHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51DiHTvxxlL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/610NrIZuNdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61UKMbysIfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61RBnnq+wZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61qFHsm7N+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51V5LdSWFWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/511BEzA3LdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61I3wVrGlmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51AeZCrFOQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51UGy8XmvzL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61q+vVVYpVL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51p0oMXygnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51dgpn-0LiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61TbS7o8H2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51sH7k8qg5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61k9w7f1A1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61EZXMS839L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61zIK3VFg7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51bynpwxbYL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61LKrOZOesL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51gb0oKJRGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51wcPlzeGhL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/61IlruYfr4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51F-SsoDLyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51hDMKGMYlL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/612goCdmWfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61h0v9D3W4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/5115tsEnMHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51DiHTvxxlL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/610NrIZuNdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61UKMbysIfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61RBnnq+wZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61qFHsm7N+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51V5LdSWFWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/511BEzA3LdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61I3wVrGlmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51AeZCrFOQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51UGy8XmvzL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61q+vVVYpVL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51p0oMXygnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51dgpn-0LiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61TbS7o8H2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51sH7k8qg5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61k9w7f1A1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61EZXMS839L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61zIK3VFg7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51bynpwxbYL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61LKrOZOesL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51gb0oKJRGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51wcPlzeGhL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ March 3, 2025",
    "ASIN ‏": "‎ B0DZ1XTKB9",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#55,185 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #177 in Women's Formal Dresses",
    "Customer Reviews": "4.2 4.2 out of 5 stars (231)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Red",
      "Teal Color",
      "Purple",
      "Burgundy",
      "Magenta",
      "Royal Blue",
      "Black",
      "Navy Blue",
      "Green"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.2,
    "count": 231,
    "customers_say": "Customers find the dress gorgeous, comfortable, and suitable for formal events, with positive feedback about its quality and stretchiness. The fit receives mixed reviews, with some finding it perfect while others say it runs like a potato frock. The material quality and fabric weight also get mixed reactions - while some appreciate the nice weight, others note it's heavier than expected. Select to learn more Elegance Quality Comfort Formality Stretchiness Fit Material quality Fabric weight 40 customers mention \"Elegance\" 38 positive 2 negative Customers find the dress gorgeous and sexy, particularly appreciating its color. \" Beautiful dress ! Love the double split seam but it only shows when you walk! Fits perfectly and is long enough! I’m 6’0 and it is ankle length on me!\" Read more \"The dress is beautiful , and the quality is better than expected. The dress has some stretch to it and holds everything together nicely....\" Read more \"This dress is beautiful and fits great. I wore it to a wedding that I was a maid of honor in....\" Read more \"...The square neckline and slit definitely give it a classy , sexy vibe, which is great for a cocktail or formal event....\" Read more 23 customers mention \"Quality\" 22 positive 1 negative Customers find the dress to be of good quality, exceeding their expectations. \" Great dress ! It was perfect for a hot summer event. And was a great price compared to similar ones at clothing stores.\" Read more \"Wore this as a bridesmaid dress. Super comfy and good quality at a great price. Very stretchy so if between sizes I would size down....\" Read more \"Very pretty dress, well made , just a little long for the outdoor event for me.\" Read more \"...Regardless of that, this is a lovely dress and fits true to size.\" Read more 19 customers mention \"Comfort\" 17 positive 2 negative Customers find the dress comfortable. \"...This dress is perfect! The material is thick, comfortable , has a little stretch, and the cut is flattering....\" Read more \"Beautiful dress and very comfortable ! The material feels nice, though it’s a bit longer than expected. Still looks elegant and flattering.\" Read more \"Wore this as a bridesmaid dress. Super comfy and good quality at a great price. Very stretchy so if between sizes I would size down....\" Read more \"fits beautifully. 5ft 8 around 190 . cup size dd . material is soft and comfy . I bought...\" Read more 16 customers mention \"Formality\" 13 positive 3 negative Customers find the dress suitable for formal events, with one mentioning it was a hit at a black tie wedding. \"Absolute perfect fit. Looks wonderful and dressy casual . Had to reorder a smaller size. I’ll review with pictures once the smaller size comes in.\" Read more \" Used as bridesmaid dresses and worked great!!!\" Read more \"Great dress! It was perfect for a hot summer event . And was a great price compared to similar ones at clothing stores.\" Read more \"I can’t wait to wear this again. Such a great find for a classic formal dress . Prices at an amazing value and great quality gown....\" Read more 15 customers mention \"Stretchiness\" 12 positive 3 negative Customers like the dress's stretchiness. \"...The material has a nice weight to it—soft, stretchy , and comfortable without feeling cheap....\" Read more \"...The dress has some stretch to it and holds everything together nicely. I'm very short but it wasn't too long, perfect with heels.\" Read more \"...This dress is perfect! The material is thick, comfortable, has a little stretch , and the cut is flattering....\" Read more \"I ordered a Small and Medium- 130 LbS/5’2/36B the material is stretchy - I kept the Small but if they had XS I probably would have ordered it too...\" Read more 44 customers mention \"Fit\" 29 positive 15 negative Customers have mixed opinions about the dress's fit, with some finding it perfect while others say it runs like a potato frock or is too long. \" Nice fit , bought for our family reunion banquet it was a sneaker ball theme. Due to the slight Spandex material I could have went a1 size down.\" Read more \"The dress is beautiful, but it was to long and dragging on the floor. I liked that the fabric was thick and no see through.\" Read more \"...Comfortable, especially to have to wear for several hours. Fits true to size .\" Read more \"...I’m 5’6, 120lbs & it fit like a glove . Length was perfect with flats or a little heel. I got a lot of compliments.\" Read more 16 customers mention \"Material quality\" 10 positive 6 negative Customers have mixed opinions about the dress's material quality, with some finding it acceptable and noting it's thick, while others mention it's not as expected. \" Material is thick and well made. Great value for the cost. The length was perfect for my daughter who is 5’8”.\" Read more \"This isn't as dressy as the listing makes it seem. The material is cheap feeling . I don't like the style of the neckline. Looks like a tank top....\" Read more \"...I liked that the fabric was thick and no see through.\" Read more \"...I didn’t like how it had two slits in the dress. The material was good quality but felt a little heavy.\" Read more 13 customers mention \"Fabric weight\" 7 positive 6 negative Customers have mixed opinions about the fabric weight of the dress, with some appreciating its nice weight while others find it heavier than expected. \"...The material has a nice weight to it—soft, stretchy, and comfortable without feeling cheap....\" Read more \"...The fabric is heavier than expected and it does give a more casual appearance than I was going for....\" Read more \"Very comfortable, color was perfect and pretty. Dress wasn’t too heavy and good quality, wore this for my senior prom and loved it!\" Read more \"...The material is also a lot thicker than expected kind of heavier material . It’s a decent option for the price.\" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars ⭐️⭐️⭐️⭐️⭐️ Elegant and Chic – Perfect for Special Occasions!",
        "body": "The media could not be loaded. This dress is absolutely gorgeous! The square neckline is so flattering and gives it a modern, elegant look, while the slit adds just the right touch of sophistication and a little bit of drama. I wore it to a cocktail party and received compliments all night. The material has a nice weight to it—soft, stretchy, and comfortable without feeling cheap. It hugs in all the right places but still allows you to move and sit easily (which is always a plus for a long dress!). The length was perfect with heels, and the slit made it easy to walk in. Sizing was spot on for me—I ordered my usual size and it fit like a glove. If you’re in between sizes, I’d suggest going with your larger size for the best fit. Overall, this is a stunning, versatile dress that works beautifully for weddings, parties, or any formal occasion. It looks and feels way more expensive than it is. Highly recommend! Read more",
        "author": "StyledWithPaws",
        "rating": 5.0,
        "date": "September 7, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61DK4AQ9ACL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Perfect!",
        "body": "This dress is beautiful and fits great. I wore it to a wedding that I was a maid of honor in. It has a nice stretch to it and isn’t ridiculously long. I’m 5’2 and it was the perfect length with 3 inch heels. Color is accurate also. Would recommend! Read more",
        "author": "Sierra Eggers",
        "rating": 5.0,
        "date": "October 8, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71phJJ6pNLL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "4.0 out of 5 stars Nice dress!",
        "body": "Great fit, super comfy and sexy. The size was spot on. The material is stretchy but not see through. Read more",
        "author": "heather",
        "rating": 4.0,
        "date": "October 14, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Pretty Dress, But Some Issues",
        "body": "The dress looks very elegant and the color was exactly as pictured. The square neckline and slit definitely give it a classy, sexy vibe, which is great for a cocktail or formal event. However, the fit was a bit off for me it was tight in the bust and loose around the waist, so it didn’t quite flatter my shape the way I hoped. The material is also a lot thicker than expected kind of heavier material. It’s a decent option for the price. Read more",
        "author": "Veronica",
        "rating": 3.0,
        "date": "October 22, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Beautiful and Elegant",
        "body": "Fit perfect, just to the floor as in the picture. Right out of package, was not wrinkled at all. Substantial fabric weight and shapely. I bought this to perform in as a vocalist in a group and paired it with a black scarf with silver sparkles and some bling. No fuss - just put this on, added accessories and looked incredibly elegant! Also it swung beautifully with my light dance moves. Read more",
        "author": "Deborah Edelen",
        "rating": 5.0,
        "date": "December 1, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Formal",
        "body": "Wonderful fit and very comfortable great for a nice formal party. It’s tight in the waist and wide bottomed with a slit up both sides. And it’s a perfect teal Read more",
        "author": "Dana",
        "rating": 5.0,
        "date": "November 8, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Great dress",
        "body": "Love. Love. Love. Definitely not for shorter girlies as I am 5'9 and still felt like it was too long, even with heels. Fit is great though. Comfortable to wear. Read more",
        "author": "Christina M. Jimenez",
        "rating": 5.0,
        "date": "December 18, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "1.0 out of 5 stars No",
        "body": "This is not true to size. It runs rather large and fits very unattractive and I have an hourglass, evenly distributed shape. I will say the color was beautiful but it simply fit like a potato frock. Read more",
        "author": "Catherine Habel",
        "rating": 1.0,
        "date": "June 12, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Formal Split Maxi Cocktail is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.",
  "about_this_item": "Womens Maxi Dress Formal Split Maxi Cocktail is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.",
  "long_description": "Womens Maxi Dress Formal Split Maxi Cocktail is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Red, Teal Color, Purple, Burgundy, Magenta, Royal Blue, Black, Navy Blue, Green. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Formal Split Maxi Cocktail is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Red, Teal Color, Purple, Burgundy, Magenta, Royal Blue, Black, Navy Blue, Green. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "86e6dcba-ed0a-4f35-8f6e-cdac8f09bbd5",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/86e6dcba-ed0a-4f35-8f6e-cdac8f09bbd5/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/86e6dcba-ed0a-4f35-8f6e-cdac8f09bbd5/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/c883ec2e-96dd-4be3-81a3-bcceea86c256.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "af920498-a1e9-457d-88f5-6a53cc5a7cb5",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/af920498-a1e9-457d-88f5-6a53cc5a7cb5/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/af920498-a1e9-457d-88f5-6a53cc5a7cb5/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/c883ec2e-96dd-4be3-81a3-bcceea86c256.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "0e6ed456-3a06-433f-b2f6-ba9328edf43c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0e6ed456-3a06-433f-b2f6-ba9328edf43c/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0e6ed456-3a06-433f-b2f6-ba9328edf43c/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/c883ec2e-96dd-4be3-81a3-bcceea86c256.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "9be1a106-5779-4332-b3a8-41e5ded0c3fe",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9be1a106-5779-4332-b3a8-41e5ded0c3fe/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9be1a106-5779-4332-b3a8-41e5ded0c3fe/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/c883ec2e-96dd-4be3-81a3-bcceea86c256.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "d80e5a6b-75b7-4c33-b81e-89abf1e893c2",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d80e5a6b-75b7-4c33-b81e-89abf1e893c2/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d80e5a6b-75b7-4c33-b81e-89abf1e893c2/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/c883ec2e-96dd-4be3-81a3-bcceea86c256.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "ce31f035-f69f-468c-9763-b197ef851f77",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ce31f035-f69f-468c-9763-b197ef851f77/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ce31f035-f69f-468c-9763-b197ef851f77/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/c883ec2e-96dd-4be3-81a3-bcceea86c256.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Red": "https://m.media-amazon.com/images/I/315p-6Yjz7L._AC_SR38,50_.jpg",
    "Teal Color": "https://m.media-amazon.com/images/I/31VhEqLD0CL._AC_SR38,50_.jpg",
    "Purple": "https://m.media-amazon.com/images/I/31Rjz5EAiML._AC_SR38,50_.jpg",
    "Burgundy": "https://m.media-amazon.com/images/I/31f0ZlyIJjL._AC_SR38,50_.jpg",
    "Magenta": "https://m.media-amazon.com/images/I/312mW9pYY0L._AC_SR38,50_.jpg",
    "Royal Blue": "https://m.media-amazon.com/images/I/31jy1cF1xWL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31iVBJhXgKL._AC_SR38,50_.jpg",
    "Navy Blue": "https://m.media-amazon.com/images/I/31egwi24rZL._AC_SR38,50_.jpg",
    "Green": "https://m.media-amazon.com/images/I/31HxDKwL4ML._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Red": "61h0v9D3W4L",
    "Teal Color": "610NrIZuNdL",
    "Purple": "61qFHsm7N+L",
    "Burgundy": "61I3wVrGlmL",
    "Magenta": "61q+vVVYpVL",
    "Royal Blue": "61TbS7o8H2L",
    "Black": "61IlruYfr4L",
    "Navy Blue": "61EZXMS839L",
    "Green": "61LKrOZOesL"
  },
  "color_images": {
    "Red": [
      "https://m.media-amazon.com/images/I/61h0v9D3W4L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/5115tsEnMHL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/51DiHTvxxlL._SL1500_.jpg"
    ],
    "Teal Color": [
      "https://m.media-amazon.com/images/I/610NrIZuNdL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61UKMbysIfL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61RBnnq+wZL._SL1500_.jpg"
    ],
    "Purple": [
      "https://m.media-amazon.com/images/I/61qFHsm7N+L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/51V5LdSWFWL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/511BEzA3LdL._SL1500_.jpg"
    ],
    "Burgundy": [
      "https://m.media-amazon.com/images/I/61I3wVrGlmL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/51AeZCrFOQL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/51UGy8XmvzL._SL1500_.jpg"
    ],
    "Magenta": [
      "https://m.media-amazon.com/images/I/61q+vVVYpVL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/51p0oMXygnL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/51dgpn-0LiL._SL1500_.jpg"
    ],
    "Royal Blue": [
      "https://m.media-amazon.com/images/I/61TbS7o8H2L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/51sH7k8qg5L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61k9w7f1A1L._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/61IlruYfr4L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/51F-SsoDLyL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/51hDMKGMYlL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/612goCdmWfL._SL1500_.jpg"
    ],
    "Navy Blue": [
      "https://m.media-amazon.com/images/I/61EZXMS839L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61zIK3VFg7L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/51bynpwxbYL._SL1500_.jpg"
    ],
    "Green": [
      "https://m.media-amazon.com/images/I/61LKrOZOesL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/51gb0oKJRGL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/51wcPlzeGhL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress-boat-neck-sleeveless",
      "title": "Womens Dress Boat Neck Sleeveless",
      "price": 17.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61SFuyqwwlL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-sleeveless",
      "title": "Womens Maxi Dress Maxi Sleeveless",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61sIwpCMuOL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-ruched-sleeveless-maxi-cocktail",
      "title": "Womens Maxi Dress Bodycon Ruched Sleeveless Maxi Cocktail",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51KEafj4npL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71A9J9Mc3aL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-off-shoulder-formal-evening",
      "title": "Womens Maxi Dress Off Shoulder Formal Evening",
      "price": 87.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/510dPCPvFrL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-bodycon",
      "title": "Womens Maxi Dress Bodycon",
      "price": 35.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/61JixFiTaIL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 199.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61wJ9Ifdn2L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-ruched-long-sleeve",
      "title": "Womens Maxi Dress Bodycon Ruched Long Sleeve",
      "price": 29.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71D0M7OhasL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-mermaid-one-shoulder-long-sleeve",
      "title": "Womens Maxi Dress Formal Mermaid One Shoulder Long Sleeve",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61SY5TgSXnL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail-formal",
      "title": "Womens Dress Cocktail Formal",
      "price": 45.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/51qGStN7UEL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-sleeveless-maxi-bodycon",
      "title": "Womens Maxi Dress Sleeveless Maxi Bodycon",
      "price": 49.97,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51TlDBbXqGL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-bodycon-ruched-long-sleeve",
      "title": "Womens Maxi Dress Cocktail Bodycon Ruched Long Sleeve",
      "price": 41.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/41Szm0KzP5L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-v-neck-long-sleeve",
      "title": "Womens Maxi Dress Maxi V Neck Long Sleeve",
      "price": 47.89,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71RP0nW-z6L._SL1500_.jpg"
      ]
    }
  ]
}