{
  "id": "womens-maxi-dress-sleeveless-formal",
  "handle": "womens-maxi-dress-sleeveless-formal",
  "sku": "JC3067",
  "asin": "B0F1YGFYB6",
  "title": "Womens Maxi Dress Sleeveless Formal",
  "title_original": "Women Summer Halter Dress Low Cut Sleeveless A Line Tulle Swing Flowy Tea Length Dress Corset Prom Formal Ball Gowns",
  "brand": "Yeenily",
  "price": 56.99,
  "social_proof": {
    "bought_past_month": 592,
    "text": "592+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/610l4zBj+0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81FzHkBvzRL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71xk6qQTUrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/7158vRw9lxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61M1LOjTUXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Nzu8DxhSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61n4bIcU0UL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61qJ64TVGTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/614AyMZQjrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61rJNvvvR+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51dXt+9EFKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61S7wYmN9BL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61JuT9HmBjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61KJBTp9+vL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/615AcZQCTyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/615YYhZ2LbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61hVoMNZ7GL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61hA8zmH77L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71F7DPDo7RL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61CFGb-0rZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71x+yr1VuBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71QS7vbUEFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81oYHOR9t2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61iBS2QpiTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/617wvC8Iq8L._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/610l4zBj+0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81FzHkBvzRL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71xk6qQTUrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/7158vRw9lxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61M1LOjTUXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Nzu8DxhSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61n4bIcU0UL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61qJ64TVGTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/614AyMZQjrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61rJNvvvR+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51dXt+9EFKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61S7wYmN9BL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61JuT9HmBjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61KJBTp9+vL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/615AcZQCTyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/615YYhZ2LbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61hVoMNZ7GL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61hA8zmH77L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71F7DPDo7RL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61CFGb-0rZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71x+yr1VuBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71QS7vbUEFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81oYHOR9t2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61iBS2QpiTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/617wvC8Iq8L._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Item model number ‏": "‎ fashion",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ March 19, 2025",
    "ASIN ‏": "‎ B0F1YBQY3P",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#79,555 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #164 in Women's Cocktail Dresses #308 in Women's Formal Dresses",
    "Customer Reviews": "4.1 4.1 out of 5 stars (93)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Red",
      "White",
      "Black",
      "Light Purple"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.1,
    "count": 93,
    "customers_say": "Customers find the dress beautiful, with one noting the details look even better in person, and appreciate that it fits true to size and is not see-through. Moreover, the material is awesome, the color is perfect, and they consider it good value for money, particularly noting it's perfect for bachelorette parties. However, comfort receives mixed feedback, with some finding it comfortable while others say it's itchy. Select to learn more Quality Size Fabric quality Color Value for money Dress size See through Comfort 19 customers mention \"Quality\" 17 positive 2 negative Customers find the dress beautiful, with one noting that the details look even better in person. \" Cute ! The purple is so light it’s almost white - not see through or anything, just be mindful of how it photographs....\" Read more \"Needed some ironing and some fluffing and then it's a beautiful dress . Recommend putting another peti coat under it to get some serious fluff\" Read more \" Beautiful , I loved it, I felt like Cinderella on my 60th birthday party. Dress very elegant but yet simple\" Read more \" Perfect dress for my brothers wedding fit perfect, great style, good stretch, great fabric not see through perfect length, great price & very...\" Read more 15 customers mention \"Size\" 11 positive 4 negative Customers find the dress fits true to size, with one mentioning it can be adjusted for a tighter waist, and another noting it flatters all body types. \"...Style gives fifties and fits true to size . Rather low cut for large chest so be mindful if you need to wear a bra it might be hard to find....\" Read more \" Sooo flattering , wore this twice this summer for two all black attire weddings and got so many compliments!\" Read more \"...I’m 5’7, the dress was above my knees and there was no tulle, also had stains like it was warn and returned.\" Read more \"This dress fit so cute !! Wore it for a wedding and got a couple compliments. Very comfy\" Read more 8 customers mention \"Fabric quality\" 6 positive 2 negative Customers like the fabric of the dress, with one mentioning its fluffing material. \"...for my brothers wedding fit perfect, great style, good stretch, great fabric not see through perfect length, great price & very durable love this...\" Read more \"The material is awesome and it fit well....\" Read more \"Absolutely horrible dress. Fabric was super cheap and smelt so bad. It was super itchy and felt like a Halloween costume. Do not buy.\" Read more \"...The quality exceeded my expectations — the fabric was sturdy and not see-through, and the details were beautiful in person....\" Read more 5 customers mention \"Color\" 4 positive 1 negative Customers like the color of the dress, with one mentioning that the purple shade is very light. \"Exactly what I wanted. True to size. Vibrant color \" Read more \"But this is A BEAUTIFUL Dress!!!! Color is perfect . Fits true to size. Look the movement and flow....\" Read more \"...is high quality and I liked the tulle skirt it had under - the color was a pretty , lite purple or lilac...\" Read more \"The colors were off . Did not look as pictured, but the tulle was nice....\" Read more 4 customers mention \"Value for money\" 4 positive 0 negative Customers find the dress offers good value for money. \"...style, good stretch, great fabric not see through perfect length, great price & very durable love this dress\" Read more \"... Worth the cost !\" Read more \"...so comfortable, the size fit perfectly and it was definitely value for the money . I bought the black\" Read more \"...Fabric is a touch plastic-y, not soft but not overtly cheap either. Style gives fifties and fits true to size....\" Read more 3 customers mention \"Dress size\" 3 positive 0 negative Customers find the dress suitable for bachelorette parties, with one mentioning it was perfect for their daughter's event. \"The dress for my daughter perfectly , she wore it for her 16th birthday ❤️ it was so comfortable, the size fit perfectly and it was definitely value...\" Read more \" Used for my wedding reception , the top was a bit big on me because I have a smaller chest but other than that it was beautiful! Worth the cost!\" Read more \"This dress is perfect for bachelorette parties , tea, parties, and the wedding after party....\" Read more 3 customers mention \"See through\" 3 positive 0 negative Customers appreciate that the dress is not see-through. \"Cute! The purple is so light it’s almost white - not see through or anything , just be mindful of how it photographs....\" Read more \"...The quality exceeded my expectations — the fabric was sturdy and not see-through , and the details were beautiful in person....\" Read more \"...wedding fit perfect, great style, good stretch, great fabric not see through perfect length, great price & very durable love this dress\" Read more 7 customers mention \"Comfort\" 4 positive 3 negative Customers have mixed opinions about the dress's comfort, with some finding it comfortable while others describe it as itchy. \"We use this for my sister’s bachelorette she looks so beautiful. Dress is comfortable fit to size the quality is perfect\" Read more \"...One side the seams are completely off from the other side. Was so itchy ....\" Read more \"...Wore it for a wedding and got a couple compliments. Very comfy \" Read more \"...Fabric was super cheap and smelt so bad. It was super itchy and felt like a Halloween costume. Do not buy.\" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Loved this dress",
        "body": "Perfect dress for my brothers wedding fit perfect, great style, good stretch, great fabric not see through perfect length, great price & very durable love this dress Read more",
        "author": "Qveentrophy",
        "rating": 5.0,
        "date": "November 12, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71g9YMpb0mL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Cute!!",
        "body": "This dress fit so cute!! Wore it for a wedding and got a couple compliments. Very comfy Read more",
        "author": "Emily Rodriguez",
        "rating": 5.0,
        "date": "December 2, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61dDGcdpffL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "4.0 out of 5 stars Worth it!",
        "body": "Used for my wedding reception, the top was a bit big on me because I have a smaller chest but other than that it was beautiful! Worth the cost! Read more",
        "author": "Tiffany Jacobs",
        "rating": 4.0,
        "date": "October 15, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/714MAgOMLFL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Yes ma'am!",
        "body": "But this is A BEAUTIFUL Dress!!!! Color is perfect. Fits true to size. Look the movement and flow. It's resizable with lots of support for my buddy sisters. Material and thickness is wonderful! GET THE DRESS! Read more",
        "author": "Melaney Scott",
        "rating": 5.0,
        "date": "October 21, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "1.0 out of 5 stars Not as pictured",
        "body": "The colors were off. Did not look as pictured, but the tulle was nice. Read more",
        "author": "Krystal Jane",
        "rating": 1.0,
        "date": "June 20, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Pretty in Lilac",
        "body": "Wore this dress to celebrate my 50th birthday. I wanted it to be like a fun prom or Quinceanera dress , to mark this milestone, I wore it with a crown. It was perfect! I love the halter straps and the adjustable pull strings in the back. I am petite , but curvy, and it allowed me to adjust the waist to make it tighter. I also love how affordable it was - The material is high quality and I liked the tulle skirt it had under - the color was a pretty , lite purple or lilac For reference , I am 36 DD chest, 26” waist, 38 “ hips, 4’11” (115 pounds) the length was aboit 3” from my knees (tea length) I ordered a small Read more",
        "author": "Darlene Flores",
        "rating": 5.0,
        "date": "October 30, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71BLUqjxdfL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/81TARHy0csL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71s6jMPkppL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/81dwqrkYTHL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/81jkdRyYJlL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "3.0 out of 5 stars Very cute but not for me",
        "body": "Cute! The purple is so light it’s almost white - not see through or anything, just be mindful of how it photographs. The material is heavy and the underskirt gives it a good flare shape. Fabric is a touch plastic-y, not soft but not overtly cheap either. Style gives fifties and fits true to size. Rather low cut for large chest so be mindful if you need to wear a bra it might be hard to find. Not for what I needed but someone else might find this perfect, especially for the price. Read more",
        "author": "Cami",
        "rating": 3.0,
        "date": "October 18, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars OBSESSED",
        "body": "So when I bought this dress there were no other reviews. I was hesitant to buy it because I NEEDED a dress for my graduation ceremony. This dress surpassed my expectations for a dress from Amazon!! It is so beautiful and I love it so so much. For references I am 5’3 and 115 lbs. My right hip had a small defect in the sewing where it was higher then the left. It was only noticeable if you were intentionally inspecting the dress though. The halter neck strap had hurt my neck after a few hours but it was bearable when I loosened the straps a bit. The dress has fluffing material under the dress already so there is no need to buy a hoop skirt and it does have a corset back. There is also a zipper under the left arm that travels from under the armpit to the top of your hip. It can in good condition too! I had to steam the dress and all the wrinkles from the packaging came out. Okay, hear me out! I never write reviews but this is now my favorite dress. While the dress does NOT have pockets( an award winning factor) it made me feel like a princess at my high school graduation ceremony while I gave my speeches and for the photo shoot!! Read more",
        "author": "MRose",
        "rating": 5.0,
        "date": "May 17, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/713MsxTrCXL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71sPXAmlGbL._SY88._SL1500_.jpg"
        ]
      }
    ]
  },
  "short_description": "Womens Maxi Dress Sleeveless Formal is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.",
  "about_this_item": "Womens Maxi Dress Sleeveless Formal is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.",
  "long_description": "Womens Maxi Dress Sleeveless Formal is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Red, White, Black, Light Purple. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Sleeveless Formal is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Red, White, Black, Light Purple. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "d1b593fc-6a39-47b5-a17f-136281d81e7c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d1b593fc-6a39-47b5-a17f-136281d81e7c/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d1b593fc-6a39-47b5-a17f-136281d81e7c/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "f1382cb9-7016-44e3-92ab-72f58eb71895",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f1382cb9-7016-44e3-92ab-72f58eb71895/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f1382cb9-7016-44e3-92ab-72f58eb71895/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Red": "https://m.media-amazon.com/images/I/31tumsdr75L._AC_SR38,50_.jpg",
    "White": "https://m.media-amazon.com/images/I/319rVZZcj1L._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31LaM8XcMCL._AC_SR38,50_.jpg",
    "Light Purple": "https://m.media-amazon.com/images/I/31LcH73eGSL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Red": "61Nzu8DxhSL",
    "White": "610l4zBj+0L",
    "Black": "51dXt+9EFKL",
    "Light Purple": "61hA8zmH77L"
  },
  "color_images": {
    "Red": [
      "https://m.media-amazon.com/images/I/61Nzu8DxhSL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61n4bIcU0UL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61qJ64TVGTL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/614AyMZQjrL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61rJNvvvR+L._SL1500_.jpg"
    ],
    "White": [
      "https://m.media-amazon.com/images/I/610l4zBj+0L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81FzHkBvzRL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71xk6qQTUrL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/7158vRw9lxL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61M1LOjTUXL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/51dXt+9EFKL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61S7wYmN9BL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61JuT9HmBjL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61KJBTp9+vL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/615AcZQCTyL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/615YYhZ2LbL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61hVoMNZ7GL._SL1500_.jpg"
    ],
    "Light Purple": [
      "https://m.media-amazon.com/images/I/61hA8zmH77L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71F7DPDo7RL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61CFGb-0rZL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71x+yr1VuBL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71QS7vbUEFL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81oYHOR9t2L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61iBS2QpiTL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/617wvC8Iq8L._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress-sleeveless",
      "title": "Womens Dress Sleeveless",
      "price": 27.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/714+pDb6hQL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-sleeveless-bodycon-cocktail-ruched",
      "title": "Womens Maxi Dress Formal Sleeveless Bodycon Cocktail Ruched",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61QKbSfRhtL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 62.49,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71Qz-wZTPSL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-bodycon-v-neck",
      "title": "Womens Dress Bodycon V Neck",
      "price": 19.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/61Rkuu-QsuL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail-ruched",
      "title": "Womens Dress Cocktail Ruched",
      "price": 139.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/71rSQ4dCFEL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-long-sleeve-ruched-bodycon-cocktail",
      "title": "Womens Maxi Dress Long Sleeve Ruched Bodycon Cocktail",
      "price": 29.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61a1SNbl57L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-formal",
      "title": "Womens Maxi Dress Evening Formal",
      "price": 94.88,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61Cx1k0YHiL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-sleeveless",
      "title": "Womens Dress Sleeveless",
      "price": 45.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71BX5zX+c8L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-long-sleeve-ruched",
      "title": "Womens Maxi Dress Bodycon Long Sleeve Ruched",
      "price": 23.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51SEh6bl+oL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-maxi",
      "title": "Womens Maxi Dress Formal Maxi",
      "price": 74.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61Q047q7RjL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-ruched-bodycon-long-sleeve-cocktail",
      "title": "Womens Maxi Dress Ruched Bodycon Long Sleeve Cocktail",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51y+kPKhl4L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71lg4uNJNjL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-mermaid-evening-formal-long-sleeve",
      "title": "Womens Maxi Dress Mermaid Evening Formal Long Sleeve",
      "price": 89.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/617AQwGzPJL._SL1500_.jpg"
      ]
    }
  ]
}