{
  "id": "womens-dress-v-neck",
  "handle": "womens-dress-v-neck",
  "sku": "JC2122",
  "asin": "B0F249HB2C",
  "title": "Womens Dress V Neck",
  "title_original": "OFEEFAN Summer Dresses for Women 2025 V Neck T Shirt Casual Mini Dresses Tie Waist Sundresses with Pockets",
  "brand": "Visit the OFEEFAN Store",
  "price": 19.99,
  "social_proof": {
    "bought_past_month": 155,
    "text": "155+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/615dowAZsGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/717Dj2wPEiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61u69EtZpML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71SzCZDRP0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/617Bor6VVQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71am6QgxOqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71vuTQjCFbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81EQUendR3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81q6smP4X7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71H3r0sEUTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71E+VgVkpaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81vLJptvOyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81bspU+n2XL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81vGYRAd44L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Tbh0W2LaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81kRdygvNfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ulFRn-BDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ysT3RWpjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81mxRWA0mfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91rtbT42HlL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81EHNHvtrDL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/615dowAZsGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/717Dj2wPEiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61u69EtZpML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71SzCZDRP0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/617Bor6VVQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71am6QgxOqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71vuTQjCFbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81EQUendR3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81q6smP4X7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71H3r0sEUTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71E+VgVkpaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81vLJptvOyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81bspU+n2XL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81vGYRAd44L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Tbh0W2LaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81kRdygvNfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ulFRn-BDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ysT3RWpjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81mxRWA0mfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91rtbT42HlL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81EHNHvtrDL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ April 30, 2025",
    "ASIN ‏": "‎ B0F6YLYWSC",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#7,421 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #32 in Women's Casual Dresses",
    "Customer Reviews": "4.3 4.3 out of 5 stars (1,297)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Pink Blue",
      "Blue White",
      "Black Colored Flower",
      "Leopard Print",
      "Purplish Red",
      "Blue",
      "Floral Blue",
      "Brown Black",
      "Black",
      "Boho",
      "Black White",
      "Grey Pink",
      "Blue Flower",
      "White",
      "Floral 1",
      "Beige Print",
      "Blue Leaf"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.3,
    "count": 1297,
    "customers_say": "Customers find the dress comfortable, particularly noting it's suitable for hot climates, and appreciate its style, with one mentioning it creates a casual yet put-together look. The dress receives positive feedback for its material quality, with customers noting it's made of cotton and feels nice to wear. They like its fit, softness, and true-to-size nature, and one customer mentions it works well as a swimsuit cover-up. Opinions about the length are mixed, with some finding it perfect while others say it's too short. Generated from the text of customer reviews Select to learn more Style (140) Fit (136) Comfort (135) Quality (110) Material quality (58) Soft material (50) Size (49) Length (52) 140 customers mention style, 135 positive, 5 negative 140 customers mention \"Style\" 135 positive 5 negative Customers like the dress's style, finding it cute with a pretty pattern, and one customer mentions it has a casual yet put-together look. \" Cute , but the skirt part is a bit see-through so I had to buy white slip shorts to go underneath, so that's why I'm only giving 4 stars instead of 5. \" Read more \" ...I’m planning on taking this on vacation with me. It’s super cute very comfortable and just the right length. Love the pockets. Casual and fun \" Read more \" ...I bought the blue small floral print. It is very cute . I think I will also buy it in another color since it fits so well.... \" Read more \" So cute and fits perfect WITH POCKETS. love dress quality and fit. Drawback being fading after washing. \" Read more 136 customers mention fit, 120 positive, 16 negative 136 customers mention \"Fit\" 120 positive 16 negative Customers like how the dress fits. \" Great fit ! I’m 5’2” and the length is perfect. Also the fabric is nice for a simple dress. From reviews I hung it to dry after washing.... \" Read more \" This dress is comfortable, nice choice of colors and prints, fits true to size and is washable. Follow the directions. \" Read more \" ...It did not smell, so I washed it immediately. It washed up nicely and fits well so I am keeping the dress. Just thought you should know.... \" Read more \" ...I wanted more pink less peach. Fits great . The fabric is a good weight for summer. \" Read more 135 customers mention comfort, 133 positive, 2 negative 135 customers mention \"Comfort\" 133 positive 2 negative Customers find the dress comfortable, particularly noting it is suitable for hot climates. \" Black, size small. Very soft and comfortable . I wish the elastic waist a little looser, but that's just a personal fit preference. Will keep! \" Read more \" ...I’m planning on taking this on vacation with me. It’s super cute very comfortable and just the right length. Love the pockets. Casual and fun \" Read more \" My go to “lazy, but put together” Summer outfit. Super flattering and comfy . I throw wedges on and wear it out, or flip flops and run errands.... \" Read more \" This dress is so comfortable ! I am between a medium and a small. I ordered a small and it fits perfectly. The length is just right.... \" Read more 110 customers mention quality, 100 positive, 10 negative 110 customers mention \"Quality\" 100 positive 10 negative Customers find the dress to be of excellent quality, describing it as very nice and awesome for summer wear, with one customer noting it works well as a swimsuit cover-up. \" ...Very versatile. Good quality too! I got the black and it feels like a thick version of your favorite t shirt. Not sheer at all and it has pockets! \" Read more \" Love it! Love it! Love it! Great dress and so comfortable. I got 2 of them. \" Read more \" Nice dress . A little shorter than I like but fits nicely \" Read more \" Size small. Love this dress ! Fit is true to size and very comfortable. Would recommend! \" Read more 58 customers mention material quality, 42 positive, 16 negative 58 customers mention \"Material quality\" 42 positive 16 negative Customers love the material of the dress, noting it is cotton and feels nice to wear. One customer mentions that the fabric is perfect for late summer, while another appreciates how it allows the dress to hang nicely. \" Looks as described but the waist draw is just unflattering. Good material and color. Good weiggt for summer \" Read more \" Nice material and design, but too short for me. I’m nearly 6’ tall and the skirt is more of a mini skirt. Returning for a refund. \" Read more \" Horrible quality- almost see through. It’s spandex \" Read more \" Great fit. Great color, material and design. Love the pockets the tie strings. Did not find it see-through at all!... \" Read more 50 customers mention soft material, 49 positive, 1 negative 50 customers mention \"Soft material\" 49 positive 1 negative Customers appreciate the dress's soft material, with one describing it as silky and another noting its smooth texture. \" Not sure how the fabric will wash but its soft , and its \"nightgown-comfy\"! Sort of thick no-see thru as the crimson or purple-ish is very pretty tho!... \" Read more \" This dress is so comfortable. The material is soft and a good quality. I wore it to teach in and received many compliments.... \" Read more \" Super cute easy dress. Soft material , fit my size16-18 curves. I'm 5'7\" but still is an appropriate length on me.... \" Read more \" ...I feel like my butt was on display for everyone. Super soft , very light weight and pretty color and not see through.... \" Read more 49 customers mention size, 37 positive, 12 negative 49 customers mention \"Size\" 37 positive 12 negative Customers find the dress runs true to size, with one mentioning it works well for petite customers. \" ...The fit was perfect, true to size , and super comfortable. The material feels light and breathable, which is exactly what I wanted for hot days.... \" Read more \" Runs really big \" Read more \" Order true to size ..style & fit perfect \" Read more \" Dress is fine but size down !... \" Read more 52 customers mention length, 30 positive, 22 negative 52 customers mention \"Length\" 30 positive 22 negative Customers have mixed opinions about the dress's length, with some finding it perfect while others say it's a bit short. \" ...It's very comfortable and a perfect length . I receive so many compliments on the dress and people are shocked at the quality.... \" Read more \" Very short . Fits more like a mini dress. I’m 5’10 and it’s way too short for me. Fabric is nice. Wish it worked. \" Read more \" This dress is the perfect summer dress cute, comfy not too short and very true to size.... \" Read more \" Very very short . Does not fit like image and I am only 5’4”. Returned. \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars MAD CUTE",
        "body": "This dress is the perfect summer dress cute, comfy not too short and very true to size. Material is soft and a good weight not see through but not too heavy. the color I This dress is the perfect summer outfit. it's cute, comfy, and not too short. It fits very true to size. The material is soft and of good weight; it's not see-through but also not too heavy. I got it in black, and I highly recommend this dress!got is black . Highly recommend this dress. Read more",
        "author": "jessica alston",
        "rating": 5.0,
        "date": "August 23, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Super cute dress!",
        "body": "Fit was perfect. Soft material. Comfortable. I’m 5ft 1inch. It might be an inch longer on me than in the photo. If you are someone that wants it a little shorter you pull the cinched area a little higher. Waist cinching is drawstring, so you can adjust as you wish. Washed and dried with no issues. Its Flattering and stylish. Hangs nicely, Not clingy. Could dress up or down. Read more",
        "author": "Customer",
        "rating": 5.0,
        "date": "November 24, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Lightweight Spring Dress Comfy & Cute",
        "body": "I ordered the purple/maroon color for my mom and it's just as pretty in person. It is soft but lightweight so it is good for summer and spring. The fit was perfect, true to size, and super comfortable. The material feels light and breathable, which is exactly what I wanted for hot days. For the price, the quality is honestly better than I expected. Definitely happy with this purchase! Read more",
        "author": "Maria G",
        "rating": 4.0,
        "date": "October 5, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Great little casual dress",
        "body": "Great vacation dress. I’m planning on taking this on vacation with me. It’s super cute very comfortable and just the right length. Love the pockets. Casual and fun Read more",
        "author": "Diana W.",
        "rating": 5.0,
        "date": "November 24, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Just not a good fit for me right now - but very cute",
        "body": "I was on the fence about returning this. It is very cute and I love the color but for me the fit wasn't right. But honestly I think it was me - maybe an xs would have been perfect so I can not say anything negative about this. Good material and very comfortable. Read more",
        "author": "stacy knutson",
        "rating": 3.0,
        "date": "December 3, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Beautiful and comfortable",
        "body": "I ordered a large. I am between a med/lg depending on the style. It fits perfectly. The colors are vibrant and beautiful. The fabric is extremely comfortable. I will reorder in a variety of colors. Read more",
        "author": "Keith Weeman",
        "rating": 5.0,
        "date": "December 11, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Comfortable fit!",
        "body": "Dress was soft and very comfortable (blue-green) . Dress fits TTS! I ordered for a cruise in November and it was PERFECT! Great quality!! I ordered 2 dresses for my trip ( honeymoon ).. The white dress I never got to wear due to having a small hole in the front! We got back today from trip and went to do a return and I can’t due to return time has “ closed”. Was pretty bummed out not getting to wear the white dress ! Read more",
        "author": "Brittany",
        "rating": 5.0,
        "date": "November 17, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Vibrant Print - easy to dress up or dress down",
        "body": "This dress is a nice print and very vibrant colors. It's also a style that can be dressed up with a fancier sandal or dressed down with a more casual shoe so easily something that could go from a summer christening to a casual get together - very versatile. The material is on the thinner side which is what you want for summer but it's not sheer so it's not see-through. It has a nice give and a bit of stretch to the fabric. It does look like it would hold up to a delicate wash and line dry. It is a bit short so if you are self conscious I'd recommend a pair of bike shorts underneath. Read more",
        "author": "Heidi Kozubal",
        "rating": 4.0,
        "date": "October 11, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Dress V Neck is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.",
  "about_this_item": "Womens Dress V Neck is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.",
  "long_description": "Womens Dress V Neck is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Pink Blue, Blue White, Black Colored Flower, Leopard Print, Purplish Red, Blue, Floral Blue, Brown Black, Black, Boho, Black White, Grey Pink, Blue Flower, White. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Dress V Neck is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Pink Blue, Blue White, Black Colored Flower, Leopard Print, Purplish Red, Blue, Floral Blue, Brown Black, Black, Boho, Black White, Grey Pink, Blue Flower, White. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "150ab0b6-153a-4acb-87db-bc94b1d5d6c6",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/150ab0b6-153a-4acb-87db-bc94b1d5d6c6/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/150ab0b6-153a-4acb-87db-bc94b1d5d6c6/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "6278333e-158c-4cf9-9250-a7e0d38f3894",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6278333e-158c-4cf9-9250-a7e0d38f3894/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6278333e-158c-4cf9-9250-a7e0d38f3894/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "5a5c224a-9e57-4d29-b063-7fa40c00f2a7",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5a5c224a-9e57-4d29-b063-7fa40c00f2a7/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5a5c224a-9e57-4d29-b063-7fa40c00f2a7/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "f571f3c7-8c27-466b-81f7-01cb787c8d01",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f571f3c7-8c27-466b-81f7-01cb787c8d01/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f571f3c7-8c27-466b-81f7-01cb787c8d01/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "462fcaab-4207-46da-b90b-f0b141f65955",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/462fcaab-4207-46da-b90b-f0b141f65955/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/462fcaab-4207-46da-b90b-f0b141f65955/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "e7083ebe-0ce0-4643-9e7d-f92a41d77e3c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e7083ebe-0ce0-4643-9e7d-f92a41d77e3c/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e7083ebe-0ce0-4643-9e7d-f92a41d77e3c/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "718f46ed-272e-4364-b30e-858da6715bc7",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/718f46ed-272e-4364-b30e-858da6715bc7/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/718f46ed-272e-4364-b30e-858da6715bc7/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "b646d8c2-2d1c-4186-9fe6-4cc892c77708",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b646d8c2-2d1c-4186-9fe6-4cc892c77708/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b646d8c2-2d1c-4186-9fe6-4cc892c77708/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "5767501f-19bc-4a2d-9438-964defb5bd8f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5767501f-19bc-4a2d-9438-964defb5bd8f/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5767501f-19bc-4a2d-9438-964defb5bd8f/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "f52e1df1-ca30-439a-9f68-45f8dd66d3d3",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f52e1df1-ca30-439a-9f68-45f8dd66d3d3/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f52e1df1-ca30-439a-9f68-45f8dd66d3d3/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "8294e38d-dbc7-49ee-8133-d0281bb2251b",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8294e38d-dbc7-49ee-8133-d0281bb2251b/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8294e38d-dbc7-49ee-8133-d0281bb2251b/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "df9885ab-d568-4f50-8989-54ba1df3d5bb",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/df9885ab-d568-4f50-8989-54ba1df3d5bb/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/df9885ab-d568-4f50-8989-54ba1df3d5bb/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Pink Blue": "https://m.media-amazon.com/images/I/41axwClfVbL._AC_SR38,50_.jpg",
    "Blue White": "https://m.media-amazon.com/images/I/316zd4ESpmL._AC_SR38,50_.jpg",
    "Black Colored Flower": "https://m.media-amazon.com/images/I/518UDMqqEUL._AC_SR38,50_.jpg",
    "Leopard Print": "https://m.media-amazon.com/images/I/51hd70uCNDL._AC_SR38,50_.jpg",
    "Purplish Red": "https://m.media-amazon.com/images/I/31Lw20wyqEL._AC_SR38,50_.jpg",
    "Blue": "https://m.media-amazon.com/images/I/310xyRuTwkL._AC_SR38,50_.jpg",
    "Floral Blue": "https://m.media-amazon.com/images/I/51tRxfglw-L._AC_SR38,50_.jpg",
    "Brown Black": "https://m.media-amazon.com/images/I/41SAHz8La6L._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31uIvGjfxzL._AC_SR38,50_.jpg",
    "Boho": "https://m.media-amazon.com/images/I/51NOZm0KFPL._AC_SR38,50_.jpg",
    "Black White": "https://m.media-amazon.com/images/I/31e84lPdRhL._AC_SR38,50_.jpg",
    "Grey Pink": "https://m.media-amazon.com/images/I/410cjIo4TrL._AC_SR38,50_.jpg",
    "Blue Flower": "https://m.media-amazon.com/images/I/41KA43gWLgL._AC_SR38,50_.jpg",
    "White": "https://m.media-amazon.com/images/I/31GMmhqJd0L._AC_SR38,50_.jpg",
    "Floral 1": "https://m.media-amazon.com/images/I/410oq6NluBL._AC_SR38,50_.jpg",
    "Beige Print": "https://m.media-amazon.com/images/I/51Hl7I4p06L._AC_SR38,50_.jpg",
    "Blue Leaf": "https://m.media-amazon.com/images/I/51abwXbAPvL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Pink Blue": "71am6QgxOqL",
    "Blue White": "71vuTQjCFbL",
    "Black Colored Flower": "81EQUendR3L",
    "Leopard Print": "81q6smP4X7L",
    "Purplish Red": "71H3r0sEUTL",
    "Blue": "71E+VgVkpaL",
    "Floral Blue": "81vLJptvOyL",
    "Brown Black": "81bspU+n2XL",
    "Black": "615dowAZsGL",
    "Boho": "81vGYRAd44L",
    "Black White": "71Tbh0W2LaL",
    "Grey Pink": "81kRdygvNfL",
    "Blue Flower": "71ulFRn-BDL",
    "White": "71ysT3RWpjL",
    "Floral 1": "81mxRWA0mfL",
    "Beige Print": "91rtbT42HlL",
    "Blue Leaf": "81EHNHvtrDL"
  },
  "color_images": {
    "Pink Blue": [
      "https://m.media-amazon.com/images/I/71am6QgxOqL._SL1500_.jpg"
    ],
    "Blue White": [
      "https://m.media-amazon.com/images/I/71vuTQjCFbL._SL1500_.jpg"
    ],
    "Black Colored Flower": [
      "https://m.media-amazon.com/images/I/81EQUendR3L._SL1500_.jpg"
    ],
    "Leopard Print": [
      "https://m.media-amazon.com/images/I/81q6smP4X7L._SL1500_.jpg"
    ],
    "Purplish Red": [
      "https://m.media-amazon.com/images/I/71H3r0sEUTL._SL1500_.jpg"
    ],
    "Blue": [
      "https://m.media-amazon.com/images/I/71E+VgVkpaL._SL1500_.jpg"
    ],
    "Floral Blue": [
      "https://m.media-amazon.com/images/I/81vLJptvOyL._SL1500_.jpg"
    ],
    "Brown Black": [
      "https://m.media-amazon.com/images/I/81bspU+n2XL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/615dowAZsGL._SL1500_.jpg"
    ],
    "Boho": [
      "https://m.media-amazon.com/images/I/81vGYRAd44L._SL1500_.jpg"
    ],
    "Black White": [
      "https://m.media-amazon.com/images/I/71Tbh0W2LaL._SL1500_.jpg"
    ],
    "Grey Pink": [
      "https://m.media-amazon.com/images/I/81kRdygvNfL._SL1500_.jpg"
    ],
    "Blue Flower": [
      "https://m.media-amazon.com/images/I/71ulFRn-BDL._SL1500_.jpg"
    ],
    "White": [
      "https://m.media-amazon.com/images/I/71ysT3RWpjL._SL1500_.jpg"
    ],
    "Floral 1": [
      "https://m.media-amazon.com/images/I/81mxRWA0mfL._SL1500_.jpg"
    ],
    "Beige Print": [
      "https://m.media-amazon.com/images/I/91rtbT42HlL._SL1500_.jpg"
    ],
    "Blue Leaf": [
      "https://m.media-amazon.com/images/I/81EHNHvtrDL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-formal-cocktail-ruched-maxi-sleeveless-bodycon",
      "title": "Womens Maxi Dress Formal Cocktail Ruched Maxi Sleeveless Bodycon",
      "price": 48.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51lcEKwzt8L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 99.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51MWKDRcToL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal",
      "title": "Womens Maxi Dress Formal",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51eAiny1x-L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-ruched-formal-maxi-bodycon",
      "title": "Womens Maxi Dress Ruched Formal Maxi Bodycon",
      "price": 62.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61ipOhuw3WL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail",
      "title": "Womens Dress Cocktail",
      "price": 37.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61+EOqv4F9L._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 26.45,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/713OuBdQBYL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 564.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/614g9yo8opL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-cocktail-maxi-split",
      "title": "Womens Maxi Dress Formal Cocktail Maxi Split",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61G8RF1nKaL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-formal",
      "title": "Womens Dress Formal",
      "price": 89.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51Ba9fw8pTL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-split-sleeveless-cocktail-bodycon",
      "title": "Womens Dress Split Sleeveless Cocktail Bodycon",
      "price": 27.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51OoLUBGjtL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 79.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Wedding Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/51nJyQaIwAL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-mermaid",
      "title": "Womens Maxi Dress Cocktail Mermaid",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51QRiCCVj+L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening-bodycon-short-sleeve",
      "title": "Womens Maxi Dress Formal Evening Bodycon Short Sleeve",
      "price": 63.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61whKp-35lL._SL1500_.jpg"
      ]
    }
  ]
}