{
  "id": "womens-maxi-dress-cocktail-formal-maxi-long-sleeve",
  "handle": "womens-maxi-dress-cocktail-formal-maxi-long-sleeve",
  "sku": "JC2761",
  "asin": "B0F297J7G3",
  "title": "Womens Maxi Dress Cocktail Formal Maxi Long Sleeve",
  "title_original": "Verdusa Women's Floral Mesh Maxi Dresses Long Sleeve Elegant Formal Fall Wedding Guest Dress Cocktail Holiday Dresses",
  "brand": "Visit the Verdusa Store",
  "price": 45.99,
  "social_proof": {
    "bought_past_month": 1444,
    "text": "1444+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/61NXa9j1ztL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71NtLKcDVRL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71x0yRO08-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71jnWCk3kHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71rrzmom2oL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/712LpMPRYxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61bgI5z+tOL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Xa53bwaOL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61lZehUsaIL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/617nKsUDLJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61hwpWoda6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Y2KEeen3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/713hfJ6iIZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/6136do1rtqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61wYgd-pJwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61fza1HySFL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/61NXa9j1ztL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71NtLKcDVRL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71x0yRO08-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71jnWCk3kHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71rrzmom2oL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/712LpMPRYxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61bgI5z+tOL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Xa53bwaOL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61lZehUsaIL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/617nKsUDLJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61hwpWoda6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Y2KEeen3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/713hfJ6iIZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/6136do1rtqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61wYgd-pJwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61fza1HySFL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ March 24, 2025",
    "ASIN ‏": "‎ B0F29F2CGC",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#10,847 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #58 in Women's Club & Night Out Dresses",
    "Customer Reviews": "4.3 4.3 out of 5 stars (150)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Black and Pink",
      "Wine Red",
      "Pink",
      "Brown and Black",
      "Polkadot",
      "Dark Blue",
      "Leopard",
      "Black",
      "Yellow Black",
      "Black and Red",
      "Black and Green"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.3,
    "count": 150,
    "customers_say": "Customers find the dress fits slim to the body and is perfect for fall and winter weddings. The dress is well-made, comfortable, and flattering, with one customer noting it hugs in all the right places. The fabric quality receives mixed feedback, with some customers finding it nice while others describe it as cheap. Select to learn more Fit Style Quality Comfort Flattering Size Dress size Fabric quality 35 customers mention \"Fit\" 26 positive 9 negative Customers like how the dress fits, noting that it is slim to the body and has a perfect length. \"As described. Fit well . I am 5'3\", 125.lbs and the small was a perfect fit. I will update after wash to share insight on material after wash....\" Read more \"...The fit is great very slimming. Fits true to size and would highly recommend.\" Read more \"Planning on taking it back. It was too big on me and the mesh feels cheap\" Read more \"...fit for me, very flattering; fitted to show off your figure but not too tight . Looks stunning! So looking forward to wearing this dress!...\" Read more 26 customers mention \"Style\" 25 positive 1 negative Customers find the dress looks great and is dressy enough for special occasions, with one customer noting its effortless elegance. \" Beautiful dress . Don’t hesitate to buy this. I’m 5’5” and 160 pounds and I ordered a Large. Fit perfect, room to wiggle....\" Read more \" Super cute and stretchy material!\" Read more \"...The dress itself was so cute though!! The liner is comfortable and plenty stretchy. The mesh is stretchy and not itchy....\" Read more \" Cheap looking - returned\" Read more 25 customers mention \"Quality\" 25 positive 0 negative Customers find the dress well made and of perfect quality. \" Great Dress - no pockets...\" Read more \" Perfect dress . Came exactly as it looks in picture. Lots of compliments!!!!\" Read more \" Love this dress . Very light weight. I bought an XL and normally use a size 14. I am 5'5\" and the length is perfect.\" Read more \"...The dress seems to be well made and good quality . Unfortunately I’ll have to return.\" Read more 18 customers mention \"Comfort\" 18 positive 0 negative Customers find the dress comfortable, with one mentioning its light fabric and another noting its forgiving nature. \"Love this dress! fits well and is comfortable . Fabric was stretchy but not too clingy. This will be great for the fall wedding I am attending....\" Read more \"I got so many compliments!! It was also SO comfortable because I could wear a regular bra and still achieved a chic and classy look!\" Read more \"So cute & comfy . Highly recommend\" Read more \"...Fit perfect, room to wiggle. It was very comfortable and beautiful.\" Read more 9 customers mention \"Flattering\" 9 positive 0 negative Customers find the dress flattering, with one mentioning that it hugs in all the right places. \"...Perfect fit for me, very flattering ; fitted to show off your figure but not too tight. Looks stunning! So looking forward to wearing this dress!...\" Read more \"Loved this but just not as dressy as I needed, but flattering \" Read more \"The most flattering dress I own. I worship spanks for extra support didn't really need them.\" Read more \"Perfect dress, figure flattering .\" Read more 7 customers mention \"Size\" 6 positive 1 negative Customers find the dress runs true to size, with one mentioning it's particularly suitable for tall women. \"Beautiful dress good quality nice stretch. I would recommend. True to size !\" Read more \"Love! I got so many compliments! Not too big and not too small. Quality was good! Color looks just like the color!\" Read more \"Cheap mesh, size down !...\" Read more \" Seems true to size ; very classy...\" Read more 5 customers mention \"Dress size\" 5 positive 0 negative Customers find the dress suitable for fall and winter weddings, with one mentioning it's great for daytime events. \"Beautiful dress, perfect for a fall or winter wedding . Great low price!\" Read more \"...Fabric was stretchy but not too clingy. This will be great for the fall wedding I am attending. It's not too tight but looks fitted....\" Read more \"Very comfortable dress. Dressy enough for a special occasion yet casual enough for just dressing nice.\" Read more \"Very flattering. Great dress for fall and winter daytime event . I would get in more patterns\" Read more 6 customers mention \"Fabric quality\" 3 positive 3 negative Customers have mixed opinions about the fabric quality of the dress, with some finding it nice while others mention issues with the material being sheer and thin. \"...Length was perfect. Fabric was nice ....\" Read more \"...The material is sheer , but there is an under piece that comes with, that fits slim to your body. It does have stretch to it....\" Read more \" Great fabric , chic look, great fit and length! Dress it up or down for different occasions. Good price! I recommend it!...\" Read more \"...The inner slip is way too short and the outer material is really thin . I had to send back...\" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Great Dress - no pockets",
        "body": "Love this dresses. I am a 38H and it fit well and looked great. The under dress is more fitted and gives a hint of shape wear while the outer shear covering is a little looser. This dress is very forgiving. Be careful, I snagged mine on a chair screw and it ripped a big hole. I would order this again for sure! Read more",
        "author": "ShananD",
        "rating": 5.0,
        "date": "December 6, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Perfect dress",
        "body": "Just Buy It!!!! Amazing dress fits perfectly, flattery, sexy, effortless elegance and lightweight. Guaranteed to get many compliments. I weigh 123 pounds and got small size. Perfect fit. Read more",
        "author": "opionated",
        "rating": 5.0,
        "date": "November 15, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Seems true to size; very classy",
        "body": "I absolutely love this dress! Purchased for party celebrating recently married couple. Perfect fit for me, very flattering; fitted to show off your figure but not too tight. Looks stunning! So looking forward to wearing this dress! I am 5’4 112 lbs; purchased XSmall in black with khaki/brown flower design. Read more",
        "author": "Pam Williams",
        "rating": 4.0,
        "date": "September 24, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Perfect. Exactly what I was looking for!",
        "body": "Love this dress! fits well and is comfortable. Fabric was stretchy but not too clingy. This will be great for the fall wedding I am attending. It's not too tight but looks fitted. The style is great. I recommend this dress. Looks pretty versatile as well. Read more",
        "author": "Eleanor Lilliquist",
        "rating": 5.0,
        "date": "September 12, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Love This Dress!",
        "body": "This dress is exactly what I was hoping for -- fitted but not too tight, lightweight (could definitely wear on cooler spring/summer evenings), and very flattering. I'm 5'5\" and 142 pounds, and a Medium fits perfectly. I do wish it was slightly longer so that I could wear heels with it, but it'll still work for me and I'm overall thrilled with it. Great dress for the price! Read more",
        "author": "LeeChristopher",
        "rating": 5.0,
        "date": "December 16, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Fit",
        "body": "Beautiful dress, but more suited to a taller and slender person, and maybe spring or summer. Read more",
        "author": "Donna M",
        "rating": 3.0,
        "date": "November 2, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Attractive & comfortable",
        "body": "Happy with this purchase. Certainly a dress you can dress up and down. Comfortable and you can wash and hand to dry and is just as new and dries faily fast, too. Although long sleeves you can till use for a night out on mid 70s temperature and if its cooler you can use it with a nice shawl or coat. Read more",
        "author": "Teresa DeJesus Arcay",
        "rating": 5.0,
        "date": "December 12, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars This dress is a must buy!!",
        "body": "Yeah, I am 5'4\". I weigh 135. I bought a size medium. It was an absolute perfect fit. The quality of this dress is perfect. Absolutely perfect. This is a dress that you would wear to an engagement party, wedding or any kind of party really, it is a beautiful dress. The material is sheer, but there is an under piece that comes with, that fits slim to your body. It does have stretch to it. Very pleased with this dress. Read more",
        "author": "Bebe",
        "rating": 5.0,
        "date": "October 17, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Cocktail Formal Maxi Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.",
  "about_this_item": "Womens Maxi Dress Cocktail Formal Maxi Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.",
  "long_description": "Womens Maxi Dress Cocktail Formal Maxi Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Black and Pink, Wine Red, Pink, Brown and Black, Polkadot, Dark Blue, Leopard, Black, Yellow Black, Black and Red, Black and Green. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Cocktail Formal Maxi Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Black and Pink, Wine Red, Pink, Brown and Black, Polkadot, Dark Blue, Leopard, Black, Yellow Black, Black and Red, Black and Green. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "3ec11b51-8289-4edd-8394-b3df28b1aa56",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3ec11b51-8289-4edd-8394-b3df28b1aa56/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3ec11b51-8289-4edd-8394-b3df28b1aa56/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/5135ab24-461e-4424-bc6c-cc94e3e56f1e.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "d86889fe-9b27-49e8-8113-96808034b9c9",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d86889fe-9b27-49e8-8113-96808034b9c9/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d86889fe-9b27-49e8-8113-96808034b9c9/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/5135ab24-461e-4424-bc6c-cc94e3e56f1e.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "6cf9db8e-2cec-4749-bbce-c5b7b5405662",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6cf9db8e-2cec-4749-bbce-c5b7b5405662/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6cf9db8e-2cec-4749-bbce-c5b7b5405662/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/5135ab24-461e-4424-bc6c-cc94e3e56f1e.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "7e6c34f4-74e3-4768-bb7c-052e41deb1dc",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7e6c34f4-74e3-4768-bb7c-052e41deb1dc/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7e6c34f4-74e3-4768-bb7c-052e41deb1dc/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/5135ab24-461e-4424-bc6c-cc94e3e56f1e.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "531bb55f-d5a2-491a-bda0-5d22b714fd9d",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/531bb55f-d5a2-491a-bda0-5d22b714fd9d/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/531bb55f-d5a2-491a-bda0-5d22b714fd9d/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/5135ab24-461e-4424-bc6c-cc94e3e56f1e.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "faeeaa59-e0af-4a62-8278-f60b26d9b69f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/faeeaa59-e0af-4a62-8278-f60b26d9b69f/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/faeeaa59-e0af-4a62-8278-f60b26d9b69f/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/5135ab24-461e-4424-bc6c-cc94e3e56f1e.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "c290bd7c-0c5f-4084-afc8-2168e56cb514",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c290bd7c-0c5f-4084-afc8-2168e56cb514/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c290bd7c-0c5f-4084-afc8-2168e56cb514/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/5135ab24-461e-4424-bc6c-cc94e3e56f1e.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "93090a7e-2769-432d-806f-7d6111a4a1f7",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/93090a7e-2769-432d-806f-7d6111a4a1f7/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/93090a7e-2769-432d-806f-7d6111a4a1f7/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/5135ab24-461e-4424-bc6c-cc94e3e56f1e.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "48e68a33-44f5-4e2f-b30f-2e925aa2541a",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/48e68a33-44f5-4e2f-b30f-2e925aa2541a/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/48e68a33-44f5-4e2f-b30f-2e925aa2541a/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/5135ab24-461e-4424-bc6c-cc94e3e56f1e.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "ca7c3dbf-82d2-4e8c-8c4a-a049200e14eb",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ca7c3dbf-82d2-4e8c-8c4a-a049200e14eb/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ca7c3dbf-82d2-4e8c-8c4a-a049200e14eb/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/5135ab24-461e-4424-bc6c-cc94e3e56f1e.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "12028ac0-1841-496d-b9ba-5b643e98d2bd",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/12028ac0-1841-496d-b9ba-5b643e98d2bd/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/12028ac0-1841-496d-b9ba-5b643e98d2bd/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/5135ab24-461e-4424-bc6c-cc94e3e56f1e.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "1da8c09d-0ea0-4765-a329-89127d2d5c72",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1da8c09d-0ea0-4765-a329-89127d2d5c72/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1da8c09d-0ea0-4765-a329-89127d2d5c72/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/5135ab24-461e-4424-bc6c-cc94e3e56f1e.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Black and Pink": "https://m.media-amazon.com/images/I/31KA8VrFtjL._AC_SR38,50_.jpg",
    "Wine Red": "https://m.media-amazon.com/images/I/41IvrxdTsPL._AC_SR38,50_.jpg",
    "Pink": "https://m.media-amazon.com/images/I/31-PHQ4NJdL._AC_SR38,50_.jpg",
    "Brown and Black": "https://m.media-amazon.com/images/I/31pLW8v3lJL._AC_SR38,50_.jpg",
    "Polkadot": "https://m.media-amazon.com/images/I/41IjzAI4hEL._AC_SR38,50_.jpg",
    "Dark Blue": "https://m.media-amazon.com/images/I/41UYTmiS-bL._AC_SR38,50_.jpg",
    "Leopard": "https://m.media-amazon.com/images/I/41cVkOqUZIL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31IWV35+dKL._AC_SR38,50_.jpg",
    "Yellow Black": "https://m.media-amazon.com/images/I/416ygo7xXPL._AC_SR38,50_.jpg",
    "Black and Red": "https://m.media-amazon.com/images/I/31FnkfPw9QL._AC_SR38,50_.jpg",
    "Black and Green": "https://m.media-amazon.com/images/I/31Pil5bHPHL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Black and Pink": "61bgI5z+tOL",
    "Wine Red": "71Xa53bwaOL",
    "Pink": "61lZehUsaIL",
    "Brown and Black": "617nKsUDLJL",
    "Polkadot": "61hwpWoda6L",
    "Dark Blue": "61Y2KEeen3L",
    "Leopard": "713hfJ6iIZL",
    "Black": "61NXa9j1ztL",
    "Yellow Black": "6136do1rtqL",
    "Black and Red": "61wYgd-pJwL",
    "Black and Green": "61fza1HySFL"
  },
  "color_images": {
    "Black and Pink": [
      "https://m.media-amazon.com/images/I/61bgI5z+tOL._SL1500_.jpg"
    ],
    "Wine Red": [
      "https://m.media-amazon.com/images/I/71Xa53bwaOL._SL1500_.jpg"
    ],
    "Pink": [
      "https://m.media-amazon.com/images/I/61lZehUsaIL._SL1500_.jpg"
    ],
    "Brown and Black": [
      "https://m.media-amazon.com/images/I/617nKsUDLJL._SL1500_.jpg"
    ],
    "Polkadot": [
      "https://m.media-amazon.com/images/I/61hwpWoda6L._SL1500_.jpg"
    ],
    "Dark Blue": [
      "https://m.media-amazon.com/images/I/61Y2KEeen3L._SL1500_.jpg"
    ],
    "Leopard": [
      "https://m.media-amazon.com/images/I/713hfJ6iIZL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/61NXa9j1ztL._SL1500_.jpg"
    ],
    "Yellow Black": [
      "https://m.media-amazon.com/images/I/6136do1rtqL._SL1500_.jpg"
    ],
    "Black and Red": [
      "https://m.media-amazon.com/images/I/61wYgd-pJwL._SL1500_.jpg"
    ],
    "Black and Green": [
      "https://m.media-amazon.com/images/I/61fza1HySFL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-maxi",
      "title": "Womens Maxi Dress Maxi",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61KzjUOF2ML._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 389.55,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/717dKlwUK-L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-bodycon-short-sleeve",
      "title": "Womens Dress Bodycon Short Sleeve",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61a6bHOzK-L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 306.6,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71Ft5nN+8XL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-v-neck-maxi-bodycon-split-formal-evening",
      "title": "Womens Maxi Dress V Neck Maxi Bodycon Split Formal Evening",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61ll5FCrhKL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 65.3,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61QpvdnCQrL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-off-shoulder",
      "title": "Womens Maxi Dress Off Shoulder",
      "price": 93.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Wedding Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/61PI-IhW3vL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-bodycon",
      "title": "Womens Dress Bodycon",
      "price": 63.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/81E+d6sRToL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-long-sleeve-cocktail",
      "title": "Womens Maxi Dress Formal Long Sleeve Cocktail",
      "price": 45.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71fBy5PUN3L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi",
      "title": "Womens Maxi Dress Maxi",
      "price": 46.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71uK+kza0zL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-off-shoulder-evening",
      "title": "Womens Maxi Dress Formal Off Shoulder Evening",
      "price": 54.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61XzdxMMIDL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 32.9,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71fgPjPacdL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 95.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/518gFQySK9L._SL1500_.jpg"
      ]
    }
  ]
}