{
  "id": "womens-maxi-dress-long-sleeve-bodycon-cocktail",
  "handle": "womens-maxi-dress-long-sleeve-bodycon-cocktail",
  "sku": "JC1090",
  "asin": "B0F5HTBBZ1",
  "title": "Womens Maxi Dress Long Sleeve Bodycon Cocktail",
  "title_original": "ANRABESS Women Long Sleeve Mock Neck Bodycon Mini Dress 2025 Fall Ribbed Slim Fit Pencil Cocktail Club Night Dresses",
  "brand": "Visit the ANRABESS Store",
  "price": 29.99,
  "social_proof": {
    "bought_past_month": 86,
    "text": "86+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/71uLDl8TnLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/715xmG-GYEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71kn-QbzPqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71gUMdzZTLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71qdSRzuxdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71+TLuj3GYL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71JFgVoI8BL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71F2eCzYeEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71-TE99G13L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71S94zIWXeL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/7177Nb0PvXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/713KDFZUctL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/712sFX8f-xL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71HW-uT603L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71a+Jy51UaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71aKxraR7lL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71g2Ngljy1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71iKH5GaPEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71OyTrdef-L._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/71uLDl8TnLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/715xmG-GYEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71kn-QbzPqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71gUMdzZTLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71qdSRzuxdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71+TLuj3GYL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71JFgVoI8BL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71F2eCzYeEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71-TE99G13L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71S94zIWXeL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/7177Nb0PvXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/713KDFZUctL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/712sFX8f-xL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71HW-uT603L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71a+Jy51UaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71aKxraR7lL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71g2Ngljy1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71iKH5GaPEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71OyTrdef-L._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ April 18, 2025",
    "ASIN ‏": "‎ B0F5HWC79P",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#9,195 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #31 in Women's Club & Night Out Dresses",
    "Customer Reviews": "4.7 4.7 out of 5 stars (127)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Light Brown",
      "Deep Green",
      "Blue",
      "Deep Brown",
      "Army Green",
      "Hot Pink",
      "Black",
      "Navy Blue",
      "Dark Red",
      "Red",
      "Pink",
      "Purple",
      "Teal",
      "Green"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.7,
    "count": 127,
    "customers_say": "Customers find the dress fits well, with one mentioning it's perfect for wearing with opaque tights. The dress receives positive feedback for its style, comfort, and softness, with one customer noting its thin material. Customers describe it as flattering, with one mentioning it relaxes and contours to the body, and appreciate its good stretch and beautiful color. Select to learn more Fit Style Comfort Softness Stretchiness Flattering Material quality Color 32 customers mention \"Fit\" 26 positive 6 negative Customers like how the dress fits, noting it's just the right length and has a sexy silhouette, with one customer mentioning it's perfect for wearing with opaque tights. \"Fits so nicely. Exactly what I wanted. Not too short that it will ride up. appropriate but sexy & truly a bodycon. Warm enough for winter....\" Read more \"...I am a 4 pants normally and ordered a medium. Perfect fit and length. Love!\" Read more \" Fits to size ! Super comfy and sexy at the same time!\" Read more \"Texture was soft and i loved the fit . It wasnt see through, but not heavy either. It stretched but was form fitting....\" Read more 27 customers mention \"Style\" 26 positive 1 negative Customers like the dress's style, describing it as a sexy body con that looks exactly like the picture. \"Such a cute dress, great quality Love the black color Great for date night are going out\" Read more \" Super cute ! Very thick! The tiniest bit too long for what I needed but it was fine. I made it work....\" Read more \"What a simple, but stunning dress this is! I absolutely love the purple color and the body hugging fit of this dress....\" Read more \"Fits to size! Super comfy and sexy at the same time!\" Read more 14 customers mention \"Comfort\" 13 positive 1 negative Customers find the dress comfortable and cozy. \" Comfortable and soft thin material, but wayyy longer than the photo shows. Thankfully you can push it up a little bit but still an awkward look....\" Read more \"These are super comfy and fit perfectly for a body on dress....\" Read more \"Excellent! Curvy, super stretchy, comfy , not too hot but warm layer, thin but opaque....\" Read more \" So cozy and beautiful! I have in the forest green and bright blue. The inside is sort of brushed so it’s like a light sweater dress....\" Read more 10 customers mention \"Softness\" 10 positive 0 negative Customers find the dress soft, with one mentioning it has a thin material. \"This dress is so perfect for Fall! It's soft , but not super thick. However, it's slightly forgiving because it's ribbed....\" Read more \"Great-fitting. Sleek. Dress feels nice - good quality. Too tight around my neck - but this is a personal preference. Makes me itchy.\" Read more \"Best dress ever. The material is not cheap, thick and buttery soft . I am a 4 pants normally and ordered a medium. Perfect fit and length. Love!\" Read more \"Comfortable and soft thin material , but wayyy longer than the photo shows. Thankfully you can push it up a little bit but still an awkward look....\" Read more 9 customers mention \"Stretchiness\" 7 positive 2 negative Customers like the dress's stretchiness. \"Excellent! Curvy, super stretchy , comfy, not too hot but warm layer, thin but opaque....\" Read more \"...Super soft, ribbed material great stretch . The neck is a perfect length.\" Read more \"...Ordered a size medium and the fabric was slightly loose but very stretchy and forgiving\" Read more \"...It has no stretch stretching to it something that would stretch out as soon as you put it on returning it.\" Read more 8 customers mention \"Flattering\" 8 positive 0 negative Customers find the dress flattering, with one mentioning how it hugs every curve and another noting how it relaxes and contours to the body. \"This dress is so comfortable, soft and flattering . Absolutely love it! 5’ tall, 117 pounds and size small.\" Read more \"...It hugs in all the right places and I'm 5'0\" tall and curvy and I feel super sexy in it. I bought red, black and maroon....\" Read more \"Love this color on my skin. I am 5’7 190 very curvy and this dress hugs every curve . Fitted and just the right length....\" Read more \"...It stretches a lot, but it relaxes and contours to your body , for a snug and sexy fit. It's mid thigh and above, for a revealing look at your legs....\" Read more 7 customers mention \"Material quality\" 6 positive 1 negative Customers like the material of the dress, with one mentioning its ribbed texture and another noting it's true to size. \"...Super soft, ribbed material great stretch. The neck is a perfect length.\" Read more \"The material is fabulous . It is so soft on my skin. I think it’s a flattering fit for anyone.\" Read more \"...It will definitely show rolls if you have them, but quality of fabric is great , not see through at all....\" Read more \"Best dress ever. The material is not cheap , thick and buttery soft. I am a 4 pants normally and ordered a medium. Perfect fit and length. Love!\" Read more 6 customers mention \"Color\" 5 positive 1 negative Customers like the dress's color, describing it as beautiful. \"...I got the forest green one and the color is absolutely beautiful ! I believe this dress will get a lot of action this Fall. I love it!...\" Read more \"What a simple, but stunning dress this is! I absolutely love the purple color and the body hugging fit of this dress....\" Read more \" Love this color on my skin . I am 5’7 190 very curvy and this dress hugs every curve. Fitted and just the right length....\" Read more \"Such a cute dress, great quality Love the black color Great for date night are going out\" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars What a simple, but stunning dress this is!",
        "body": "What a simple, but stunning dress this is! I absolutely love the purple color and the body hugging fit of this dress. It stretches a lot, but it relaxes and contours to your body, for a snug and sexy fit. It's mid thigh and above, for a revealing look at your legs. The long sleeves add more of the pretty purple, or whatever color it is, to the dress. It's very comfortable on your skin, as far as the material goes. I've worn this dress with my favorite pair of silky and shiny nude pantyhose and pair of high heeled sandals and felt exquisitely feminine and sexy for the entire time I had it on. This is a quality dress, and it is definitely going to be worn often. Read more",
        "author": "Lenny S.",
        "rating": 5.0,
        "date": "November 17, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Stylish and flattering!",
        "body": "This dress is so perfect for Fall! It's soft, but not super thick. However, it's slightly forgiving because it's ribbed. I got the forest green one and the color is absolutely beautiful! I believe this dress will get a lot of action this Fall. I love it! I'm 5'9 and it falls about mid thigh on me. So, it's not too short for those with longer legs like me. Overall, I like the quality of it and I feel secure wearing it. If you are on the fence, I would definitely get it, especially if you can catch it on sale. Read more",
        "author": "Amber N. Bennett",
        "rating": 5.0,
        "date": "October 4, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Great staple",
        "body": "A really nice little dress for a great price! Worm to my nieces wedding. The length was perfect and short, but stayed down over my butt (I did wear tights) the whole night. The fit was nice, forgiving, and comfortable. I’m positive I’ll be wearing this often. Read more",
        "author": "H & M",
        "rating": 5.0,
        "date": "December 19, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Best dress",
        "body": "Distress is definitely a must have perfect length doesn’t feel like it rides up. Super soft, ribbed material great stretch. The neck is a perfect length. Read more",
        "author": "Patricia lynch",
        "rating": 5.0,
        "date": "November 5, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Cozy and Versatile",
        "body": "So cozy and beautiful! I have in the forest green and bright blue. The inside is sort of brushed so it’s like a light sweater dress. I wear a long plaid flannel vest over the green and a long black sleeveless blazer over the blue with fleece lined black tights and boots and they’re perfect. I’m not quite confident enough to wear without a layer over them but they are more forgiving than I expected. They are the perfect length for me to wear with opaque tights. And they don’t ride up! I’m thinking of buying another color. I highly recommend! Read more",
        "author": "Elle",
        "rating": 5.0,
        "date": "November 20, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Buying in every color ❤️",
        "body": "Love this color on my skin. I am 5’7 190 very curvy and this dress hugs every curve. Fitted and just the right length. Good quality and worth the money. Looks just like the picture Read more",
        "author": "Brooke",
        "rating": 5.0,
        "date": "December 16, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Longer than pictured",
        "body": "Comfortable and soft thin material, but wayyy longer than the photo shows. Thankfully you can push it up a little bit but still an awkward look. Ordered a size medium and the fabric was slightly loose but very stretchy and forgiving Read more",
        "author": "Brian V.",
        "rating": 4.0,
        "date": "October 16, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Good fit and decent quality",
        "body": "Fits well. Basic ribbed t materal...not too thin...comfortable Ordered a small. Fits perfectly Im 5 6 135lb Read more",
        "author": "mountain girl",
        "rating": 5.0,
        "date": "December 12, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Long Sleeve Bodycon Cocktail is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.",
  "about_this_item": "Womens Maxi Dress Long Sleeve Bodycon Cocktail is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.",
  "long_description": "Womens Maxi Dress Long Sleeve Bodycon Cocktail is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Light Brown, Deep Green, Blue, Deep Brown, Army Green, Hot Pink, Black, Navy Blue, Dark Red, Red, Pink, Purple, Teal, Green. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Long Sleeve Bodycon Cocktail is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Light Brown, Deep Green, Blue, Deep Brown, Army Green, Hot Pink, Black, Navy Blue, Dark Red, Red, Pink, Purple, Teal, Green. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "5ea715e9-abe5-4b98-8905-a909be6ec14e",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5ea715e9-abe5-4b98-8905-a909be6ec14e/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5ea715e9-abe5-4b98-8905-a909be6ec14e/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "fad2d7cf-2896-41d4-813c-2d0fd5f2d2ae",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/fad2d7cf-2896-41d4-813c-2d0fd5f2d2ae/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/fad2d7cf-2896-41d4-813c-2d0fd5f2d2ae/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "5b7d445c-04e7-4c8b-b249-218cd3b7363e",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5b7d445c-04e7-4c8b-b249-218cd3b7363e/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5b7d445c-04e7-4c8b-b249-218cd3b7363e/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "d5258ee3-a34f-434e-8b1c-36d2fdf9ae51",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d5258ee3-a34f-434e-8b1c-36d2fdf9ae51/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d5258ee3-a34f-434e-8b1c-36d2fdf9ae51/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "77aa585b-c21b-4995-a571-20d6f24473fd",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/77aa585b-c21b-4995-a571-20d6f24473fd/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/77aa585b-c21b-4995-a571-20d6f24473fd/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "8c16eec0-bd17-4632-8c43-b485e8875026",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8c16eec0-bd17-4632-8c43-b485e8875026/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8c16eec0-bd17-4632-8c43-b485e8875026/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Light Brown": "https://m.media-amazon.com/images/I/313zO-XIaIL._AC_SR38,50_.jpg",
    "Deep Green": "https://m.media-amazon.com/images/I/311RUr3L-ML._AC_SR38,50_.jpg",
    "Blue": "https://m.media-amazon.com/images/I/31P+0Rqr-nL._AC_SR38,50_.jpg",
    "Deep Brown": "https://m.media-amazon.com/images/I/31AOQn-DHyL._AC_SR38,50_.jpg",
    "Army Green": "https://m.media-amazon.com/images/I/31y2MCoCBrL._AC_SR38,50_.jpg",
    "Hot Pink": "https://m.media-amazon.com/images/I/313dJCrxkWL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31ZxdjhgjBL._AC_SR38,50_.jpg",
    "Navy Blue": "https://m.media-amazon.com/images/I/31ug-Jyrc8L._AC_SR38,50_.jpg",
    "Dark Red": "https://m.media-amazon.com/images/I/31BoRln7F9L._AC_SR38,50_.jpg",
    "Red": "https://m.media-amazon.com/images/I/31S7QXsuSIL._AC_SR38,50_.jpg",
    "Pink": "https://m.media-amazon.com/images/I/31cgktDn7RL._AC_SR38,50_.jpg",
    "Purple": "https://m.media-amazon.com/images/I/31d-BPm-9oL._AC_SR38,50_.jpg",
    "Teal": "https://m.media-amazon.com/images/I/315bFBgj1eL._AC_SR38,50_.jpg",
    "Green": "https://m.media-amazon.com/images/I/31jfqAb429L._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Light Brown": "71JFgVoI8BL",
    "Deep Green": "71F2eCzYeEL",
    "Blue": "71-TE99G13L",
    "Deep Brown": "71S94zIWXeL",
    "Army Green": "7177Nb0PvXL",
    "Hot Pink": "713KDFZUctL",
    "Black": "71uLDl8TnLL",
    "Navy Blue": "712sFX8f-xL",
    "Dark Red": "71HW-uT603L",
    "Red": "71a+Jy51UaL",
    "Pink": "71aKxraR7lL",
    "Purple": "71g2Ngljy1L",
    "Teal": "71iKH5GaPEL",
    "Green": "71OyTrdef-L"
  },
  "color_images": {
    "Light Brown": [
      "https://m.media-amazon.com/images/I/71JFgVoI8BL._SL1500_.jpg"
    ],
    "Deep Green": [
      "https://m.media-amazon.com/images/I/71F2eCzYeEL._SL1500_.jpg"
    ],
    "Blue": [
      "https://m.media-amazon.com/images/I/71-TE99G13L._SL1500_.jpg"
    ],
    "Deep Brown": [
      "https://m.media-amazon.com/images/I/71S94zIWXeL._SL1500_.jpg"
    ],
    "Army Green": [
      "https://m.media-amazon.com/images/I/7177Nb0PvXL._SL1500_.jpg"
    ],
    "Hot Pink": [
      "https://m.media-amazon.com/images/I/713KDFZUctL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/71uLDl8TnLL._SL1500_.jpg"
    ],
    "Navy Blue": [
      "https://m.media-amazon.com/images/I/712sFX8f-xL._SL1500_.jpg"
    ],
    "Dark Red": [
      "https://m.media-amazon.com/images/I/71HW-uT603L._SL1500_.jpg"
    ],
    "Red": [
      "https://m.media-amazon.com/images/I/71a+Jy51UaL._SL1500_.jpg"
    ],
    "Pink": [
      "https://m.media-amazon.com/images/I/71aKxraR7lL._SL1500_.jpg"
    ],
    "Purple": [
      "https://m.media-amazon.com/images/I/71g2Ngljy1L._SL1500_.jpg"
    ],
    "Teal": [
      "https://m.media-amazon.com/images/I/71iKH5GaPEL._SL1500_.jpg"
    ],
    "Green": [
      "https://m.media-amazon.com/images/I/71OyTrdef-L._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress-cocktail",
      "title": "Womens Dress Cocktail",
      "price": 46.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Work",
      "images": [
        "https://m.media-amazon.com/images/I/61ju9TGzrxL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-formal-long-sleeve-evening",
      "title": "Womens Maxi Dress Maxi Formal Long Sleeve Evening",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51enCkUtvSL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 488.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51N1tcj3+xL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-formal",
      "title": "Womens Maxi Dress Evening Formal",
      "price": 69.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61yX3yOIgtL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-bodycon-cocktail-ruched",
      "title": "Womens Dress Bodycon Cocktail Ruched",
      "price": 48.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/41HDWfS-KSL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-maxi-long-sleeve",
      "title": "Womens Maxi Dress Maxi Long Sleeve",
      "price": 54.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71f0FMahfhL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-sleeveless",
      "title": "Womens Dress Sleeveless",
      "price": 35.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/712AuHdrG3L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-cocktail-maxi",
      "title": "Womens Maxi Dress Bodycon Cocktail Maxi",
      "price": 38.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61yhPYgMlWL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-sleeveless-v-neck",
      "title": "Womens Dress Sleeveless V Neck",
      "price": 12.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/815jjeATxuL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail",
      "title": "Womens Dress Cocktail",
      "price": 38.39,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Work",
      "images": [
        "https://m.media-amazon.com/images/I/51sOK3uET9L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-v-neck-formal-mermaid",
      "title": "Womens Maxi Dress Evening V Neck Formal Mermaid",
      "price": 94.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51zxpq9T3zL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 598.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61SlmGgMn+L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening-mermaid",
      "title": "Womens Maxi Dress Formal Evening Mermaid",
      "price": 69.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51pmd5nMc3L._SL1500_.jpg"
      ]
    }
  ]
}