{
  "id": "womens-dress-evening",
  "handle": "womens-dress-evening",
  "sku": "JC1948",
  "asin": "B0F6K43HPL",
  "title": "Womens Dress Evening",
  "title_original": "Memoriesea Women's Elegant Square Neck Swing A Line Wedding Evening Party Midi Dress",
  "brand": "Visit the Memoriesea Store",
  "price": 53.99,
  "social_proof": {
    "bought_past_month": 61,
    "text": "61+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/51izlxewQ4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71hMANQjW4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ymf561gxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81IDDXy7qeL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71F6KScVhwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81kTQGVaN3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51b+0FSgThL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61x6EI+gAdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51KIaW7Yu6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/519V4uQZ1YL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51XOFncEbnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51OY3pWZocL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51XHQhrfHKL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/51izlxewQ4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71hMANQjW4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ymf561gxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81IDDXy7qeL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71F6KScVhwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81kTQGVaN3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51b+0FSgThL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61x6EI+gAdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51KIaW7Yu6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/519V4uQZ1YL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51XOFncEbnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51OY3pWZocL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51XHQhrfHKL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Product Dimensions ‏": "‎ 6.3 x 4.72 x 0.39 inches; 1.54 Pounds",
    "Item model number ‏": "‎ ME108",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ April 26, 2025",
    "ASIN ‏": "‎ B0F6JWWP8W",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#13,628 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #17 in Women's Formal Dresses",
    "Customer Reviews": "4.1 4.1 out of 5 stars (144)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Red",
      "Brown",
      "Burgundy",
      "Apricot",
      "Black",
      "Navyblue"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.1,
    "count": 144,
    "customers_say": "Customers find the dress gorgeous and well-made, with great material and soft, comfortable feel. The fit and flattering aspects receive mixed feedback - while some say it's a great fit, others find it too large, and while some find it flattering, others say it's not. The material thickness is also mixed, with several customers noting it's very thick. Select to learn more Beauty Material quality Quality Comfort Softness Fit Flattering Material thickness 34 customers mention \"Beauty\" 33 positive 1 negative Customers find the dress gorgeous, with one mentioning it received many compliments. \"...fit a more tighter i should've gotten a size down but this is a beautiful dress i love the color , softness of the dress its stretchy so lightweight...\" Read more \" Beautiful and good quality dress but it did not fit nicely on me. I need to size down and will repurchase in a S.\" Read more \" Very nice dress . Adjustable straps but no zipper. Material is maybe scuba material so it has a little weight to it but really nice. Fits well....\" Read more \"...square meckline and A- Line swing style create such flattering, elegant silhouette .the material feels soft and so many compliments,it is confortable...\" Read more 18 customers mention \"Material quality\" 14 positive 4 negative Customers like the material of the dress, with one mentioning it is very heavy. \"Beautiful classy dress. The material is great and heavy. The dress fits like the picture not too tight or too loose. Perfect for a formal occasion\" Read more \" Great material got many compliments\" Read more \"Fabulous dress great quality fabric \" Read more \"Did not flatter, fabric was odd and stiff. Would recommend trying it because for someone with no curve it could be stunning....\" Read more 18 customers mention \"Quality\" 18 positive 0 negative Customers find the dress to be well-made and of amazing quality. \" Great dress ...\" Read more \" Great quality but not as photo...\" Read more \"The dress was great , stretchy comfortable material. I am 5”10 and size 16 and the XL fit perfect.\" Read more \" Fabulous dress great quality fabric\" Read more 13 customers mention \"Comfort\" 13 positive 0 negative Customers find the dress comfortable. \"...It’s classy, comfortable , and moves gracefully when you walk or dance. Perfect for weddings, evening parties, or any special event....\" Read more \" Very comfortable . I love the material, very stretchy. Would definitely order different colors!! I love the red....\" Read more \"Wow, it was so pretty. The material was not itchy and felt good on my skin.10/10\" Read more \"This dress is gorgeous, fits amazing, and is super comfortable . 10/10. Buy the dress, you won't regret it!\" Read more 13 customers mention \"Softness\" 12 positive 1 negative Customers find the dress soft and comfortable to wear. \"This dress is perfect, true to size. Very thick material, but soft and elegant. Not see through. Held up well in washer and dryer.\" Read more \"...Line swing style create such flattering,elegant silhouette.the material feels soft and so many compliments,it is confortable or any special event....\" Read more \"...As a midsize and short girlie this dress flattered me and felt good on . The fabric is thick and the skirt just flows so nicely!...\" Read more \"Wow, it was so pretty. The material was not itchy and felt good on my skin .10/10\" Read more 28 customers mention \"Fit\" 19 positive 9 negative Customers have mixed opinions about the dress's fit, with some finding it great while others report it being too large. \"Beautiful dress, fits well ...material is a little heavy but recommend for a formal event...\" Read more \"Came in good time. The dress fit like a glove . The length was perfect and it shaped nicely to the body. Definitely worth it.\" Read more \"...The area around the chest and the straps were a bit loose but I was able to make it work.\" Read more \"...color commands attention without being too loud, and the fit is incredibly flattering it hugs in all the right places and still allows for movement...\" Read more 20 customers mention \"Flattering\" 12 positive 8 negative Customers have mixed opinions about the dress's appearance, with some finding it flattering while others disagree. \"...the event and i was not disappointed at all the fit is beautiful and flattering for my body shape lenght is so modest for my occasion fabric is...\" Read more \"This is the dress that was sent to us. It is not flattering at all and doesn’t have any similar features to the dress we thought we were buying.\" Read more \"Absolutely stunning! It was so flattering ! The design is great. If you have a bit of a flabby stomach know that it hugs you well. Adjustable straps!...\" Read more \"...Very heavy in bottom, very thin in midriff area, so not super flattering .\" Read more 15 customers mention \"Material thickness\" 10 positive 5 negative Customers have mixed opinions about the dress's material thickness, with several noting it is very thick, while one customer mentions it is very thin in the midriff area. \"...The fabric is thick and the skirt just flows so nicely! One of my fav dresses I’ve gotten from amazon!\" Read more \"Love it! The material is pretty thick , so make sure you don’t get it for an event during the summer....\" Read more \"So beautiful. The dress is weighty and the material is thick . It is very flattering. I am 5’4” and 180lbs. My bust is or 36 DDD....\" Read more \"XL Heavy thick material Very soft 10/10\" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Beautiful and Affordable Option",
        "body": "Good quality fabric, it's thick, soft and comfortable. The cut would be flattering on all sizes and body shapes. My only complaint is it runs a little large. I ordered an XL and am on the higher end of the XL weight range. The area around the chest and the straps were a bit loose but I was able to make it work. Read more",
        "author": "Taylor Q",
        "rating": 5.0,
        "date": "November 24, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Beautiful ❤️❤️",
        "body": "The media could not be loaded. This red dress is an absolute showstopper The bold color commands attention without being too loud, and the fit is incredibly flattering it hugs in all the right places and still allows for movement and comfort. The fabric feels luxurious against the skin and has just the right amount of stretch. Whether you’re wearing it for a formal event or a romantic night out, this dress brings confidence and elegance. I received so many compliments, and I genuinely felt like the best-dressed person in the room. Highly recommend if you’re looking to turn heads Read more",
        "author": "Betchiva Chaleston",
        "rating": 5.0,
        "date": "September 28, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61v5Lh6TFpL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/61tJCOG1b7L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Great Dress",
        "body": "This dress is perfect, true to size. Very thick material, but soft and elegant. Not see through. Held up well in washer and dryer. Read more",
        "author": "Samantha",
        "rating": 5.0,
        "date": "November 17, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Gorgeous, comfy, but big & heavy",
        "body": "My body specs are 41 x 35 x 51, 5’7.5, ~220lb, size 14/16, bra size 38C. I ordered the XL and it is pretty dang big. The top is super flappy and pretty sure a push up bra would not fix it. But when I say this dress *feels good*….i mean it. The fabric is thick like a super nice pair of sweatpants or super silky crew neck sweatshirt. I’d feel secure even if I weren’t wearing shapewear. Not see-through at all. But super heavy and maybe not a great summer dress. The hip details are insanely beautiful, evenly pleated, and so flattering. The front bodice is super slimming against the hip detail contrast. This won’t work for the event I need it for but I’m considering ordering a large just to try and keep it on hand if I end up loving it (which I think I might…) Read more",
        "author": "sjc",
        "rating": 4.0,
        "date": "August 7, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/51Pu3Nur9vL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/41YBqfCLRLL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/510HH0jYQbL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/41qdC1I3qCL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Stunning",
        "body": "Beautiful classy dress. The material is great and heavy. The dress fits like the picture not too tight or too loose. Perfect for a formal occasion Read more",
        "author": "Fernanda Navarro",
        "rating": 5.0,
        "date": "November 13, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "2.0 out of 5 stars Try your luck",
        "body": "First and foremost, i got someone’s RETURN, it was still makeup stained. Secondly, it was easily and XL, and i ordered S. Thirdly, it was silk, which does NOT match description. Fourth, there is a slit in the leg, also not in the description and fifth and lastly, it was way past floor length, a lot of fabric dragging. I did not receive the dress I ordered at all, they were 2 completely different dresses. So, needless to say, i will be returning this immediately. — After returning the first dress and receiving the second as I really needed this dress and had to re-order it, I will say second time I did get the correct dress. The quality was very good definitely a heavier, material and thicker than expected but in a good way. I could honestly have seen myself enjoy enjoying this dress, however, for me, it did run a little large, so I have to return it again Read more",
        "author": "Amanda Dixon",
        "rating": 2.0,
        "date": "October 12, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Cute, but weird fit.",
        "body": "Cute, but fit weird on the boobs. Very warm! I was sweating like crazy! It is very stretchy. Ended up getting destroyed in the wash. Read more",
        "author": "Customer",
        "rating": 3.0,
        "date": "October 31, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Exceeded my expectations",
        "body": "I love everything about this dress. Perfect fit, perfect length, and the quality of it is amazing! I plan on ordering more dresses in different colors. Read more",
        "author": "J.Jackson",
        "rating": 5.0,
        "date": "December 16, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71HWryjXhnL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/719nFnIqaJL._SY88._SL1500_.jpg"
        ]
      }
    ]
  },
  "short_description": "Womens Dress Evening is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.",
  "about_this_item": "Womens Dress Evening is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.",
  "long_description": "Womens Dress Evening is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Red, Brown, Burgundy, Apricot, Black, Navyblue. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Dress Evening is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Red, Brown, Burgundy, Apricot, Black, Navyblue. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "836fb2b0-d550-42b3-a147-298896706b3f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/836fb2b0-d550-42b3-a147-298896706b3f/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/836fb2b0-d550-42b3-a147-298896706b3f/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "85f836a4-8cc0-4b66-8157-195942089e9d",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/85f836a4-8cc0-4b66-8157-195942089e9d/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/85f836a4-8cc0-4b66-8157-195942089e9d/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Red": "https://m.media-amazon.com/images/I/31vgxGw+LRL._AC_SR38,50_.jpg",
    "Brown": "https://m.media-amazon.com/images/I/31x8xXKvZvL._AC_SR38,50_.jpg",
    "Burgundy": "https://m.media-amazon.com/images/I/31ErNPvawzL._AC_SR38,50_.jpg",
    "Apricot": "https://m.media-amazon.com/images/I/31Iya1S4IHL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31qm3u0pM+L._AC_SR38,50_.jpg",
    "Navyblue": "https://m.media-amazon.com/images/I/31MfJR16GXL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Red": "51KIaW7Yu6L",
    "Brown": "519V4uQZ1YL",
    "Burgundy": "51XOFncEbnL",
    "Apricot": "51OY3pWZocL",
    "Black": "51izlxewQ4L",
    "Navyblue": "51XHQhrfHKL"
  },
  "color_images": {
    "Red": [
      "https://m.media-amazon.com/images/I/51KIaW7Yu6L._SL1500_.jpg"
    ],
    "Brown": [
      "https://m.media-amazon.com/images/I/519V4uQZ1YL._SL1500_.jpg"
    ],
    "Burgundy": [
      "https://m.media-amazon.com/images/I/51XOFncEbnL._SL1500_.jpg"
    ],
    "Apricot": [
      "https://m.media-amazon.com/images/I/51OY3pWZocL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/51izlxewQ4L._SL1500_.jpg"
    ],
    "Navyblue": [
      "https://m.media-amazon.com/images/I/51XHQhrfHKL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-formal-evening-v-neck",
      "title": "Womens Maxi Dress Formal Evening V Neck",
      "price": 87.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/610WAm5DnhL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-v-neck",
      "title": "Womens Dress V Neck",
      "price": 48.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61zrW5DvIeL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-long-sleeve",
      "title": "Womens Maxi Dress Maxi Long Sleeve",
      "price": 51.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/716+ABkyJTL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-v-neck",
      "title": "Womens Dress V Neck",
      "price": 36.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61y1kzGaLhL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening",
      "title": "Womens Maxi Dress Formal Evening",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61kmZ5xI4yL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 159.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/81dEbovGxbL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-mermaid-v-neck-evening-long-sleeve-formal",
      "title": "Womens Maxi Dress Mermaid V Neck Evening Long Sleeve Formal",
      "price": 74.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51aRFq9R6lL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/51lIams4plL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-one-shoulder-formal",
      "title": "Womens Maxi Dress Evening One Shoulder Formal",
      "price": 80.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61bIBAuKIZL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 324.43,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/41gTuGV5SBL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-v-neck-long-sleeve",
      "title": "Womens Maxi Dress V Neck Long Sleeve",
      "price": 48.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71FS3ys4A-L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-v-neck-long-sleeve",
      "title": "Womens Maxi Dress V Neck Long Sleeve",
      "price": 44.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71tzkJbbfxL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 43.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/611H2dG3jvL._SL1500_.jpg"
      ]
    }
  ]
}