{
  "id": "womens-maxi-dress-long-sleeve",
  "handle": "womens-maxi-dress-long-sleeve",
  "sku": "JC1160",
  "asin": "B0F6BTBJCN",
  "title": "Womens Maxi Dress Long Sleeve",
  "title_original": "BerryGo Womens Long Sleeve Mini Dress Casual A Line Flowy Loose Vacation Party Babydoll Fall Short Dresses with Pocket",
  "brand": "Visit the BerryGo Store",
  "price": 44.98,
  "social_proof": {
    "bought_past_month": 944,
    "text": "944+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/81+PWHqLTjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71gaHsYmclL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/813MfXjtKvL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81HSKMMHELL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81VjiMxgG6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/8173I41BMML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/818hemT6oxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81oorOlgh7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/812tzA7yhOL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81DmTOX2j-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/815zyH7tuQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81dv+ZnNKdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81dhqcmYDYL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81KfxadL2NL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81t69mOSh2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81dMMQzaNqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81sru4riojL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81sWWOEvnuL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/81+PWHqLTjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71gaHsYmclL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/813MfXjtKvL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81HSKMMHELL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81VjiMxgG6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/8173I41BMML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/818hemT6oxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81oorOlgh7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/812tzA7yhOL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81DmTOX2j-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/815zyH7tuQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81dv+ZnNKdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81dhqcmYDYL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81KfxadL2NL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81t69mOSh2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81dMMQzaNqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81sru4riojL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81sWWOEvnuL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ April 25, 2025",
    "ASIN ‏": "‎ B0F6CC11V2",
    "Best Sellers Rank": "#95,887 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #1,290 in Women's Casual Dresses",
    "Customer Reviews": "4.5 4.5 out of 5 stars (95)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Blue",
      "Apricot",
      "Black",
      "Navy Blue",
      "Dark Green",
      "Light Blue",
      "Lake Blue",
      "Wine Red",
      "White",
      "Caramel",
      "Rust Red",
      "Green",
      "Chocolate Brown"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.5,
    "count": 95,
    "customers_say": "Customers find the dress beautiful, with one mentioning its shadow patterning, and appreciate its nice fit that hits around the knees. The dress is comfortable, made of light material with an interesting texture, and comes in various colors. Customers describe it as flattering, with one noting it has a bigger middle area. Generated from the text of customer reviews Select to learn more Quality (26) Fit (18) Comfort (8) Material thickness (7) Color (6) Flattering (6) Size (5) Fabric softness (4) 26 customers mention quality, 25 positive, 1 negative 26 customers mention \"Quality\" 25 positive 1 negative Customers find the dress beautiful, with one mentioning its attractive shadow patterning. \" Great dress . Wore to a casual wedding- worked great. \" Read more \" This dress was super cute and fit really well. It was a little different color than I was expecting, so I ended up returning it.... \" Read more \" ...I saw this thought it's cute and in the brides color, so let's try it. It isn't thick material so it perfect.... \" Read more \" Beautiful , comfortable and true to size! \" Read more 18 customers mention fit, 16 positive, 2 negative 18 customers mention \"Fit\" 16 positive 2 negative Customers like how the dress fits, with one mentioning it hits around their knees. \" I love this dress! Fits true to size . It’s so pretty. Got many compliments while wearing it. \" Read more \" Great dress for the quality and fit \" Read more \" Lots of compliments, pockets, good fit ! Fabric isn’t super soft but it’s an interesting texture \" Read more \" This is an absolutely stunning dress! The fit is so flattering ! The fabric is lightweight but sturdy and the shadow patterning is beautiful.... \" Read more 8 customers mention comfort, 8 positive, 0 negative 8 customers mention \"Comfort\" 8 positive 0 negative Customers find the dress comfortable. \" Wedding guest dress. Perfect fit and flair. Easy to wear, comfortable and many compliments.... \" Read more \" Great style and comfy . \" Read more \" ...A good length even for a taller woman like myself. Super comfortable and the texture is too cute. Worth the money! \" Read more \" Beautiful dress and very comfortable . Bought this for my daughter and she loves it \" Read more 7 customers mention material thickness, 5 positive, 2 negative 7 customers mention \"Material thickness\" 5 positive 2 negative Customers appreciate the dress's material thickness, noting that it is light and not thick. \" ...The fit is so flattering! The fabric is lightweight but sturdy and the shadow patterning is beautiful.... \" Read more \" ...Easy to wear, comfortable and many compliments. Material was perfect for a beautiful Minnesota September day. \" Read more \" Not impressed with this dress. Material looks cheap . BerryGo color in person looks little dull. \" Read more \" ...is exactly as pictured, beautiful deep emerald green, and the material is light and flowy but thick enough so it’s not see-through!... \" Read more 6 customers mention color, 5 positive, 1 negative 6 customers mention \"Color\" 5 positive 1 negative Customers like the dress's color, with one mentioning it comes in several options. \" The color is exactly as pictured , beautiful deep emerald green, and the material is light and flowy but thick enough so it’s not see-through!... \" Read more \" Very cute dress! Color of the cream nice and it has a good fit and quality to it.... \" Read more \" ...Not me! I love everything about this dress, it's long enough, comes on several colors .... \" Read more \" Beautiful color and fit... \" Read more 6 customers mention flattering, 6 positive, 0 negative 6 customers mention \"Flattering\" 6 positive 0 negative Customers find the dress flattering. \" ...The dress is very flattering and hits just right. The length is appropriate for work settings if you aren't squatting down a lot.... \" Read more \" This dress is so flattering and cute! It is comfortable and fits true to size. \" Read more \" Such a pretty flattering dress !! \" Read more \" ...is a little loose but fits comfortably; it hits the knee, and is very flattering —fits beautifully with the cinched waist! \" Read more 5 customers mention size, 5 positive, 0 negative 5 customers mention \"Size\" 5 positive 0 negative Customers like the dress's size, with one mentioning it has a bigger middle area. \" This dress is so cute! And the quality is fantastic! It is true to size , I am usually a size 4 and I got a small and it fit great! \" Read more \" Such a cute dress for family photos for my 20-year-old! She loved it! Size , quality, and value were great! \" Read more \" Flattering, especially if you have a bigger middle area . \" Read more \" ...Not bad with wrinkles. The fit is perfect as I am 5’3. True to size . \" Read more 4 customers mention fabric softness, 3 positive, 1 negative 4 customers mention \"Fabric softness\" 3 positive 1 negative Customers appreciate the dress's soft material and interesting texture. \" Very nice and soft material ! Not bad with wrinkles. The fit is perfect as I am 5’3. True to size. \" Read more \" ...Super comfortable and the texture is too cute . Worth the money! \" Read more \" Lots of compliments, pockets, good fit! Fabric isn’t super soft but it’s an interesting texture \" Read more \" ...Fabric isn’t super soft but it’s an interesting texture \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Beautiful!",
        "body": "Fit well! Very flowy and stretchy. A good length even for a taller woman like myself. Super comfortable and the texture is too cute. Worth the money! Read more",
        "author": "Bri",
        "rating": 5.0,
        "date": "November 11, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Great dress!!!",
        "body": "This is an absolutely adorable dress. I am 5'3 and its hard to find a dress thats not too long. This dress hits around my knees and gives me a waist. Super cute, don't regret buying it for one second. Read more",
        "author": "Dittosmom",
        "rating": 5.0,
        "date": "December 16, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Beautiful color and fit",
        "body": "The color on this dress is more of a periwinkle, but its gorgeous. The dress is very flattering and hits just right. The length is appropriate for work settings if you aren't squatting down a lot. The only complaint I have is that the sleeves feel a bit tight by the armpits. Read more",
        "author": "KC",
        "rating": 4.0,
        "date": "September 3, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Love",
        "body": "I have to say, I've been trying to find a style of dress that would look nice on me for a wedding. I saw this thought it's cute and in the brides color, so let's try it. It isn't thick material so it perfect. I'm looking forward to putting it on and getting all dressed up for the wedding. Now I need to make a few comments: 1st - I'm 62, so no spring chicken but I also hate dressing like an old lady. 2nd - I have lost 70 lbs and love that I can finally fit into dresses that look good without the huge print that for some reason everyone seems to think overweight women want to wear. Not me! I love everything about this dress, it's long enough, comes on several colors. If you even remotely like it, try it, you won't be disappointed. Read more",
        "author": "Danna Fox",
        "rating": 5.0,
        "date": "October 4, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71OQVnXnc0L._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71lzBL+Nq2L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Cute!",
        "body": "This dress is so cute! And the quality is fantastic! It is true to size, I am usually a size 4 and I got a small and it fit great! Read more",
        "author": "Taylor",
        "rating": 5.0,
        "date": "November 5, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Wedding Guest Dress",
        "body": "Wedding guest dress. Perfect fit and flair. Easy to wear, comfortable and many compliments. Material was perfect for a beautiful Minnesota September day. Read more",
        "author": "Donna Plumbo",
        "rating": 5.0,
        "date": "October 22, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Buy it!",
        "body": "This is an absolutely stunning dress! The fit is so flattering! The fabric is lightweight but sturdy and the shadow patterning is beautiful. The fabric is flowy but not clingy and washes/dries beautifully! It travels well also - no wrinkles after being in a suitcase! I consistently wear an XL in Maurice’s and Old Navy so I got an XL. It is slightly more snug than the other two brands. I am 5’3” tall and 193 lbs with a 29” inseam. This dress hits me right at the top of my knee. Read more",
        "author": "MrsMaddawg4",
        "rating": 5.0,
        "date": "October 6, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/614x8euNcHL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71InRJc3d1L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Cute and comfy!",
        "body": "Such a cute dress for family photos for my 20-year-old! She loved it! Size, quality, and value were great! Read more",
        "author": "leighill",
        "rating": 5.0,
        "date": "November 3, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.",
  "about_this_item": "Womens Maxi Dress Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.",
  "long_description": "Womens Maxi Dress Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Blue, Apricot, Black, Navy Blue, Dark Green, Light Blue, Lake Blue, Wine Red, White, Caramel, Rust Red, Green, Chocolate Brown. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Blue, Apricot, Black, Navy Blue, Dark Green, Light Blue, Lake Blue, Wine Red, White, Caramel, Rust Red, Green, Chocolate Brown. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "2b9bd3bb-6ca2-4b69-a21f-fec91989cea8",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2b9bd3bb-6ca2-4b69-a21f-fec91989cea8/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2b9bd3bb-6ca2-4b69-a21f-fec91989cea8/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "9bd3a293-ae68-4b95-8648-6ccbd24aef65",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9bd3a293-ae68-4b95-8648-6ccbd24aef65/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9bd3a293-ae68-4b95-8648-6ccbd24aef65/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "c5d9b806-2de8-4283-8ab8-6b7b5df4004a",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c5d9b806-2de8-4283-8ab8-6b7b5df4004a/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c5d9b806-2de8-4283-8ab8-6b7b5df4004a/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "97768fbb-1538-4106-a9f8-2e9c36d5fe06",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/97768fbb-1538-4106-a9f8-2e9c36d5fe06/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/97768fbb-1538-4106-a9f8-2e9c36d5fe06/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "77d8f49e-c515-4a63-b3d8-85f332dc6576",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/77d8f49e-c515-4a63-b3d8-85f332dc6576/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/77d8f49e-c515-4a63-b3d8-85f332dc6576/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "f5b34e8e-1570-4c5b-a227-0f07ab22736c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f5b34e8e-1570-4c5b-a227-0f07ab22736c/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f5b34e8e-1570-4c5b-a227-0f07ab22736c/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Blue": "https://m.media-amazon.com/images/I/41hUcYWCQcL._AC_SR38,50_.jpg",
    "Apricot": "https://m.media-amazon.com/images/I/41xqtpmOR4L._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/41hYdMRzYNL._AC_SR38,50_.jpg",
    "Navy Blue": "https://m.media-amazon.com/images/I/41n9i7q9WAL._AC_SR38,50_.jpg",
    "Dark Green": "https://m.media-amazon.com/images/I/41M5wQ50nwL._AC_SR38,50_.jpg",
    "Light Blue": "https://m.media-amazon.com/images/I/41K3nztNXNL._AC_SR38,50_.jpg",
    "Lake Blue": "https://m.media-amazon.com/images/I/41bn5DFkDhL._AC_SR38,50_.jpg",
    "Wine Red": "https://m.media-amazon.com/images/I/41JSEgKYFDL._AC_SR38,50_.jpg",
    "White": "https://m.media-amazon.com/images/I/41gL6NNARhL._AC_SR38,50_.jpg",
    "Caramel": "https://m.media-amazon.com/images/I/412VhFhFo8L._AC_SR38,50_.jpg",
    "Rust Red": "https://m.media-amazon.com/images/I/41fQT5LrZwL._AC_SR38,50_.jpg",
    "Green": "https://m.media-amazon.com/images/I/418NcuSi7DL._AC_SR38,50_.jpg",
    "Chocolate Brown": "https://m.media-amazon.com/images/I/41UfzmO5AeL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Blue": "818hemT6oxL",
    "Apricot": "81oorOlgh7L",
    "Black": "81+PWHqLTjL",
    "Navy Blue": "812tzA7yhOL",
    "Dark Green": "81DmTOX2j-L",
    "Light Blue": "815zyH7tuQL",
    "Lake Blue": "81dv+ZnNKdL",
    "Wine Red": "81dhqcmYDYL",
    "White": "81KfxadL2NL",
    "Caramel": "81t69mOSh2L",
    "Rust Red": "81dMMQzaNqL",
    "Green": "81sru4riojL",
    "Chocolate Brown": "81sWWOEvnuL"
  },
  "color_images": {
    "Blue": [
      "https://m.media-amazon.com/images/I/818hemT6oxL._SL1500_.jpg"
    ],
    "Apricot": [
      "https://m.media-amazon.com/images/I/81oorOlgh7L._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/81+PWHqLTjL._SL1500_.jpg"
    ],
    "Navy Blue": [
      "https://m.media-amazon.com/images/I/812tzA7yhOL._SL1500_.jpg"
    ],
    "Dark Green": [
      "https://m.media-amazon.com/images/I/81DmTOX2j-L._SL1500_.jpg"
    ],
    "Light Blue": [
      "https://m.media-amazon.com/images/I/815zyH7tuQL._SL1500_.jpg"
    ],
    "Lake Blue": [
      "https://m.media-amazon.com/images/I/81dv+ZnNKdL._SL1500_.jpg"
    ],
    "Wine Red": [
      "https://m.media-amazon.com/images/I/81dhqcmYDYL._SL1500_.jpg"
    ],
    "White": [
      "https://m.media-amazon.com/images/I/81KfxadL2NL._SL1500_.jpg"
    ],
    "Caramel": [
      "https://m.media-amazon.com/images/I/81t69mOSh2L._SL1500_.jpg"
    ],
    "Rust Red": [
      "https://m.media-amazon.com/images/I/81dMMQzaNqL._SL1500_.jpg"
    ],
    "Green": [
      "https://m.media-amazon.com/images/I/81sru4riojL._SL1500_.jpg"
    ],
    "Chocolate Brown": [
      "https://m.media-amazon.com/images/I/81sWWOEvnuL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress-cocktail-bodycon",
      "title": "Womens Dress Cocktail Bodycon",
      "price": 47.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61NfEwzl3xL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-one-shoulder-maxi-formal",
      "title": "Womens Maxi Dress Evening One Shoulder Maxi Formal",
      "price": 69.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/5150AIQL4eL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail",
      "title": "Womens Dress Cocktail",
      "price": 103.54,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61JApwce25L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-formal-bodycon-evening-sleeveless",
      "title": "Womens Maxi Dress Maxi Formal Bodycon Evening Sleeveless",
      "price": 61.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61s8qg6u1VL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 158.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71PmRANW40L._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress-bodycon-split-ruched-off-shoulder",
      "title": "Womens Dress Bodycon Split Ruched Off Shoulder",
      "price": 38.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/41JjYcPgcpL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 95.61,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Work",
      "images": [
        "https://m.media-amazon.com/images/I/71hVgSIB1jL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 138.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51PZNrlyY9L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-split-evening-formal",
      "title": "Womens Maxi Dress Split Evening Formal",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51BZ1BqPx8L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 65.97,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/81wr8PDg55L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-v-neck",
      "title": "Womens Dress V Neck",
      "price": 82.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/710bSTpZ9hL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 278.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/91YXeyW506L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening-long-sleeve",
      "title": "Womens Maxi Dress Formal Evening Long Sleeve",
      "price": 87.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61nnk+flvaL._SL1500_.jpg"
      ]
    }
  ]
}