{
  "id": "womens-maxi-dress-cocktail-maxi",
  "handle": "womens-maxi-dress-cocktail-maxi",
  "sku": "JC3065",
  "asin": "B0F6MJ5WFQ",
  "title": "Womens Maxi Dress Cocktail Maxi",
  "title_original": "Women Strapless Floral Dress with Sarf Mesh Tube Maxi Dress Summer Cocktail Wedding Guest",
  "brand": "Visit the GUCURIN Store",
  "price": 40.99,
  "social_proof": {
    "bought_past_month": 208,
    "text": "208+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/71zhmeSQkaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71IFl4wSO0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71RnbR4GD6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Aq--pOTPL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71jmdPy-9TL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/719dy9KzP9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61itI403vcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/5136t7ci3GL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/518gQ+lqRAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Q4CTxPDuL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/71zhmeSQkaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71IFl4wSO0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71RnbR4GD6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Aq--pOTPL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71jmdPy-9TL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/719dy9KzP9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61itI403vcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/5136t7ci3GL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/518gQ+lqRAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Q4CTxPDuL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Date First Available ‏": "‎ April 28, 2025",
    "ASIN ‏": "‎ B0F6MFJRDK",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#56,019 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #175 in Women's Formal Dresses",
    "Customer Reviews": "4.0 4.0 out of 5 stars (112)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Red",
      "Pink Floral",
      "Yellow",
      "Light Yellow",
      "Orange"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.0,
    "count": 112,
    "customers_say": "Customers find the dress beautiful, comfortable, and perfect for weddings, with one noting it's suitable for four-course dinners. The dress fits well and receives positive feedback for its quality. The fabric quality receives mixed reviews, with several customers describing it as cheap. While some it's not see-through, others disagree. Customers report mobility issues, with one mentioning the under layer riding up throughout the evening. Select to learn more Looks good Fit Comfort Quality Wedding dress Fabric quality See through Mobility 21 customers mention \"Looks good\" 18 positive 3 negative Customers find the dress beautiful, with one mentioning its stunning details and another appreciating the cute slanted bottom seam. \"It’s cute , but a lot more white than it looks on the picture. Not great for wedding guest\" Read more \"Soooo comfy! And so so cute . Definitely buy! I’m 5’5, 150lbs and got the medium, fit perfect.\" Read more \" Gorgeous dress . Just like the picture\" Read more \"This dress is absolutely beautiful !...\" Read more 15 customers mention \"Fit\" 13 positive 2 negative Customers are satisfied with how the dress fits. \"...I ordered a M and it fit perfectly . I traveled with it and no wrinkles when I got it out of my bag! Great value\" Read more \"...The fit of the dress was perfect , had plenty stretch for dancing and the four course dinner....\" Read more \"...It fits true to size and is really flattering, even after hours of dancing and sitting. Honestly, this is the best dress I’ve ever bought on Amazon....\" Read more \"...People were shocked it’s from Amazon. Fit true to size , had some stretch. Deff recommend as a last minute wedding guest dress !\" Read more 9 customers mention \"Comfort\" 9 positive 0 negative Customers find the dress comfortable, with one mentioning it didn't cause irritation on their inner arms. \"...print is beautiful in person, and the fabric is super stretchy and comfortable — it moves with you and feels amazing on....\" Read more \"...I’m about 5’6 and 138 lbs. Also very comfy and breathable. Not see through\" Read more \"Was actually really comfortable and felt like good quality. I’m 5’7” and had on 4in heels ordered a M\" Read more \"So cute and comfy !...\" Read more 9 customers mention \"Quality\" 8 positive 1 negative Customers find the dress to be of good quality, with one mentioning it works well as a wedding guest dress. \"...Wasn’t see through and is good quality ! Hugged my body very nice\" Read more \" Amazing !!! So beautiful and got so many compliments. I got a size small but I could’ve gone smaller for around my boob area. I’m 5’4”. 115lbs.\" Read more \"Was actually really comfortable and felt like good quality . I’m 5’7” and had on 4in heels ordered a M\" Read more \"Material is really cheap, but from afar it’s good . Got lots of compliments when worn!\" Read more 7 customers mention \"Wedding dress\" 5 positive 2 negative Customers find this dress suitable for weddings, particularly as a fall wedding guest outfit, with one customer noting it's perfect for a villa/sunset setting. \"Love it! Perfect for the wedding I am going to!\" Read more \"...True to size. It could pass at a formal wedding —the top trim could looks cheap, but the neck scarf elevates it. The slanted bottom seam is cute!...\" Read more \"It’s cute, but a lot more white than it looks on the picture. Not great for wedding guest\" Read more \"Wore this dress to a wedding in Italy and it was perfect with the villa/sunset !...\" Read more 10 customers mention \"Fabric quality\" 5 positive 5 negative Customers have mixed opinions about the fabric quality of the dress, with several noting that the material feels cheap. \"Pretty dress in very Low quality fabric . I returned it. It might work for a very thin teenage girl, otherwise, all imperfections show through.\" Read more \"...Yellow was good. A lighter yellow. Fabric was cheap and no give.\" Read more \"...I ordered a small and it fits super lose. Cute color and fabric but very cheap looking.\" Read more \" Material is really cheap , but from afar it’s good. Got lots of compliments when worn!\" Read more 9 customers mention \"See through\" 6 positive 3 negative Customers have mixed opinions about the dress's transparency, with some finding it not see-through while others disagree. \"Loved this dress! Great material and not see through ! And great quality for the price\" Read more \" See through ! Not a good look as a wedding guest. Yellow was good. A lighter yellow. Fabric was cheap and no give.\" Read more \"... Wasn’t see through and is good quality! Hugged my body very nice\" Read more \"...Simple quality, pretty thick there is an underlining . I ordered a M and it fit perfectly....\" Read more 7 customers mention \"Mobility\" 2 positive 5 negative Customers report mobility issues with the dress, mentioning that the scarf keeps falling, the under layer rides up, and the chest area falls down, making it uncomfortable to wear all day. \"Dupe dress from an online boutique. The under layer kept riding up all evening which was annoying, so the sheer top layer was only covering my toosh...\" Read more \"...I had a little trouble keeping the top up (but that’s normal for me lol) I wore it to a wedding and was able to dance and move around with plenty of...\" Read more \"...in person, and the fabric is super stretchy and comfortable — it moves with you and feels amazing on....\" Read more \"...Only downfall is that the chest of the dress falls down and no sticking part if not wearing a bra.\" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Obsessed!",
        "body": "This dress is absolutely beautiful! The only downside was that the scarf kept falling and was hard to keep on all night, but overall the dress is really comfortable and very flattering! Simple quality, pretty thick there is an underlining. I ordered a M and it fit perfectly. I traveled with it and no wrinkles when I got it out of my bag! Great value Read more",
        "author": "Natalee Guerra",
        "rating": 5.0,
        "date": "October 29, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71M7V-Ea7pL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars BY FAR MY FAVORITE DRESS EVER",
        "body": "This dress is absolutely perfect! I wore it to a wedding and got soooo many compliments all night. The floral print is beautiful in person, and the fabric is super stretchy and comfortable — it moves with you and feels amazing on. It fits true to size and is really flattering, even after hours of dancing and sitting. Honestly, this is the best dress I’ve ever bought on Amazon. I’m already thinking about ordering it in another color! Read more",
        "author": "Casey Kresge",
        "rating": 5.0,
        "date": "November 4, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61LgHK8pQ4L._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/51039FQBoGL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "1.0 out of 5 stars Dress Came Worn",
        "body": "The dress looks so cute but it came worn which was very disappointing as I ordered it last minute for a wedding. The tag was removed, the bottom of the dress was all ripped up and dirty, and it smelled of body odor. Read more",
        "author": "Erica Froude",
        "rating": 1.0,
        "date": "September 28, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71Hqg89pieL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "4.0 out of 5 stars Gorgeous dress",
        "body": "Not gonna lie I was shocked how well this fit. Could’ve went for an XS just to fill in the room in the torso area otherwise it fit so good. I’m about 5’6 and 138 lbs. Also very comfy and breathable. Not see through Read more",
        "author": "corri stearnes",
        "rating": 4.0,
        "date": "September 10, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61lnCI3u73L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Love Love Love",
        "body": "Very flattering dress. I am 5’5 and about 160lbs and it fit about perfect! I had a little trouble keeping the top up (but that’s normal for me lol) I wore it to a wedding and was able to dance and move around with plenty of mobility. Wasn’t see through and is good quality! Hugged my body very nice Read more",
        "author": "makenzie kincade",
        "rating": 5.0,
        "date": "October 2, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/81gvexmM1wL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "3.0 out of 5 stars Cheap feel, looks good",
        "body": "Material is really cheap, but from afar it’s good. Got lots of compliments when worn! Read more",
        "author": "serena r. parker",
        "rating": 3.0,
        "date": "September 5, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61bhsvy67uL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Strapless Floral Dress",
        "body": "Wore this dress to a wedding in Italy and it was perfect with the villa/sunset! The fit of the dress was perfect, had plenty stretch for dancing and the four course dinner. It was very soft and did not cause any irritation on my inner arms like more stiff dresses do. Read more",
        "author": "AB",
        "rating": 5.0,
        "date": "October 26, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71BzOb3oa4L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Bridal shower dress!",
        "body": "Fits great! True to size Read more",
        "author": "Steffanie K.",
        "rating": 5.0,
        "date": "December 6, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Cocktail Maxi is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.",
  "about_this_item": "Womens Maxi Dress Cocktail Maxi is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.",
  "long_description": "Womens Maxi Dress Cocktail Maxi is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Red, Pink Floral, Yellow, Light Yellow, Orange. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Cocktail Maxi is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Red, Pink Floral, Yellow, Light Yellow, Orange. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "e092c22d-7237-437f-9f55-162b025c8851",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e092c22d-7237-437f-9f55-162b025c8851/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e092c22d-7237-437f-9f55-162b025c8851/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/552b0439-6111-44e5-a207-24971b1cbf4a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "e26d13cb-ed1b-4653-b2e5-de398205bd5e",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e26d13cb-ed1b-4653-b2e5-de398205bd5e/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e26d13cb-ed1b-4653-b2e5-de398205bd5e/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/552b0439-6111-44e5-a207-24971b1cbf4a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Red": "https://m.media-amazon.com/images/I/31Ml2NIyoSL._AC_SR38,50_.jpg",
    "Pink Floral": "https://m.media-amazon.com/images/I/31CLoEh6Y6L._AC_SR38,50_.jpg",
    "Yellow": "https://m.media-amazon.com/images/I/214xIfsuhgL._AC_SR38,50_.jpg",
    "Light Yellow": "https://m.media-amazon.com/images/I/21n9j2vMOJL._AC_SR38,50_.jpg",
    "Orange": "https://m.media-amazon.com/images/I/315L9tovqJL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Red": "61itI403vcL",
    "Pink Floral": "71zhmeSQkaL",
    "Yellow": "5136t7ci3GL",
    "Light Yellow": "518gQ+lqRAL",
    "Orange": "61Q4CTxPDuL"
  },
  "color_images": {
    "Red": [
      "https://m.media-amazon.com/images/I/61itI403vcL._SL1500_.jpg"
    ],
    "Pink Floral": [
      "https://m.media-amazon.com/images/I/71zhmeSQkaL._SL1500_.jpg"
    ],
    "Yellow": [
      "https://m.media-amazon.com/images/I/5136t7ci3GL._SL1500_.jpg"
    ],
    "Light Yellow": [
      "https://m.media-amazon.com/images/I/518gQ+lqRAL._SL1500_.jpg"
    ],
    "Orange": [
      "https://m.media-amazon.com/images/I/61Q4CTxPDuL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress-cocktail-evening-sleeveless",
      "title": "Womens Dress Cocktail Evening Sleeveless",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/718HS4c0RwL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-sleeveless",
      "title": "Womens Maxi Dress Evening Sleeveless",
      "price": 45.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/615V4-js0hL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-maxi",
      "title": "Womens Maxi Dress Evening Maxi",
      "price": 14.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/81CIc2WXCaL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/81X+CwE5TWL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-v-neck-long-sleeve",
      "title": "Womens Maxi Dress Cocktail V Neck Long Sleeve",
      "price": 45.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/81Ao8ojwo0L._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress-evening-formal-v-neck-short-sleeve",
      "title": "Womens Dress Evening Formal V Neck Short Sleeve",
      "price": 89.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71Mt6CmIPDL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 51.29,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61PiBYMUlgL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-cocktail-maxi",
      "title": "Womens Maxi Dress Evening Cocktail Maxi",
      "price": 53.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/7159yS7bA1L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-bodycon-cocktail",
      "title": "Womens Dress Bodycon Cocktail",
      "price": 55.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61k-qoz2M6L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-v-neck-formal-short-sleeve-evening",
      "title": "Womens Maxi Dress V Neck Formal Short Sleeve Evening",
      "price": 80.49,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/71SZD4oXn1L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-v-neck-long-sleeve-ruched",
      "title": "Womens Maxi Dress Bodycon V Neck Long Sleeve Ruched",
      "price": 36.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51TARubmowL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71q7jQuq5DL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-bodycon",
      "title": "Womens Maxi Dress Maxi Bodycon",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/613O0ptHerL._SL1500_.jpg"
      ]
    }
  ]
}