{
  "id": "womens-maxi-dress-long-sleeve-v-neck",
  "handle": "womens-maxi-dress-long-sleeve-v-neck",
  "sku": "JC2442",
  "asin": "B0F7R38GYG",
  "title": "Womens Maxi Dress Long Sleeve V Neck",
  "title_original": "SAMPEEL Womens V Neck Long Sleeve Fall Dresses Baby Doll Casual Sweater Dress Fashion Clothes",
  "brand": "Visit the SAMPEEL Store",
  "price": 29.99,
  "social_proof": {
    "bought_past_month": 1491,
    "text": "1491+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/71xZmLU6QwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/7182UO4YUpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ZZZT7LWWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71FzrPNMA8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71MDHIcDfSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71EwyKVM4ZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81pynLDLTDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81fUWwGYykL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81PZb4sgAvL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71OhJWIWpeL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71kjFkX1n6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81FAvwikE5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81NqJB86E4L._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/71xZmLU6QwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/7182UO4YUpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ZZZT7LWWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71FzrPNMA8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71MDHIcDfSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71EwyKVM4ZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81pynLDLTDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81fUWwGYykL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81PZb4sgAvL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71OhJWIWpeL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71kjFkX1n6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81FAvwikE5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81NqJB86E4L._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ July 31, 2025",
    "ASIN ‏": "‎ B0FKMQBFVX",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#9,405 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #54 in Women's Casual Dresses",
    "Customer Reviews": "4.4 4.4 out of 5 stars (218)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Brown",
      "Blue",
      "Burgundy",
      "Fuchsia",
      "Apricot",
      "Black",
      "Caramel",
      "Green"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.4,
    "count": 218,
    "customers_say": "Customers find this dress comfortable and well-fitting, with one noting it hits above the knee. They describe it as super soft and cute, with great quality and multiple color options. Customers consider it a must-have for fall and winter, and appreciate its warmth, with one mentioning it's fairly thick. Select to learn more Comfort Fit Style Softness Quality Color Fall/winter wear Warmth 30 customers mention \"Comfort\" 30 positive 0 negative Customers find the dress comfortable. \"Soft and comfortable . Received several requests as to where I got it. Adorable on and easy to dress up or down depending on your activity.\" Read more \"...It is soft and comfy and the fit and flare style gives it a nice shape and structure....\" Read more \"...Was very comfortable , fit well, looked great and very affordable.\" Read more \"Super soft. Fits as described. Very comfy . Would definitely buy this again.\" Read more 29 customers mention \"Fit\" 25 positive 4 negative Customers are satisfied with how the dress fits, noting that the length is just right and one customer mentions it hits above the knee. \"This dress is very comfortable and fits great . It can be casual or dressy depending on your accessories I liked it so much I ordered it in black also\" Read more \" Great fit ! Beautiful color! I am 5’1 length was great!\" Read more \"Not super thick, fits true to size , comfortable and has pockets!\" Read more \"...Made the perfect holiday outfit for family photos this year! Fits as described and good quality!\" Read more 26 customers mention \"Style\" 25 positive 1 negative Customers find the dress cute, with one mentioning its ribbed style and another noting it's suitable for work. \" Cute and love that it has pockets, just a tad short\" Read more \"...I paired today for work with brown tights and boots. Very cute . I like shoulder accents and band around the wrists. I think it is an excellent value....\" Read more \"So comfortable and stylish ! Made the perfect holiday outfit for family photos this year! Fits as described and good quality!\" Read more \"This dress is super cute . It’s very thick so I won’t be wearing it until it’s much cooler. Definitely keeping this one....\" Read more 15 customers mention \"Softness\" 15 positive 0 negative Customers find the dress super soft and describe it as a great autumn piece. \" Soft and comfortable. Received several requests as to where I got it. Adorable on and easy to dress up or down depending on your activity.\" Read more \"Like the color, like the weight of fabric, very soft . Like the v-neckline. Dislike skirt portion is layers, pieces of fabric similar to ruffles.\" Read more \"Fits perfect. Super soft . I ordered a small. Hits me right above the knee and I am 5’1” about 120. Looks cute with knee high boots. IT HAS POCKETS.\" Read more \"Ultra comfy very soft fabric and warm\" Read more 14 customers mention \"Quality\" 12 positive 2 negative Customers find the dress to be of great quality. \" Nice dress I can’t remember what size I bought but I should have sized down one. It’s a beautiful color and it’s super comfy!...\" Read more \" Great dress , got so many compliments. True to size. I like the stretch of it. Very comfortable.\" Read more \"...The color was a little lighter than expected as well. Great quality , just not the dress for me....\" Read more \"So comfortable and stylish! Made the perfect holiday outfit for family photos this year! Fits as described and good quality!\" Read more 13 customers mention \"Color\" 11 positive 2 negative Customers love the color of the dress, with one mentioning it comes in several options. \"...It’s a beautiful color and it’s super comfy! It’s looks great with boots\" Read more \" Love the color , fit and feel of the fabric. I wear it with leggings.\" Read more \"...I did not find the material thin at all. Great texture and color . I paired today for work with brown tights and boots. Very cute....\" Read more \" Like the color , like the weight of fabric, very soft. Like the v-neckline. Dislike skirt portion is layers, pieces of fabric similar to ruffles.\" Read more 13 customers mention \"Fall/winter wear\" 13 positive 0 negative Customers find this dress suitable for fall and winter, with one mentioning it works well for indoor holiday events. \"This dress is very comfortable and fits great. It can be casual or dressy depending on your accessories I liked it so much I ordered it in black also\" Read more \" Perfect for our family pictures !\" Read more \"This dress is going to be great for fall and winter . It is a of a heavier weight and quality than I anticipated for the price....\" Read more \"Super comfy!! Perfect for holidays ! Now my go to dress! Follow size chart.\" Read more 10 customers mention \"Warmth\" 9 positive 1 negative Customers find the dress warm, with one mentioning it is fairly thick. \"Very comfy and warm . Length is just right! Greta for the holiday season.\" Read more \"Love the fit. Dress is warm but not extremely heavy fabric. Looks great with tights. Got lots of compliments on it.\" Read more \"Love it. Fits great, also keeps you warm .\" Read more \"It exceeded my expectations. The fabric is very comfortable and warm to wear , the fit is perfect, and it has pockets!...\" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Great dress for the cooler months!",
        "body": "This dress is going to be great for fall and winter. It is a of a heavier weight and quality than I anticipated for the price. The fit was true to size for me based on the chart provided by the manufacturer. It is soft and comfy and the fit and flare style gives it a nice shape and structure. It also has a small puff sleeve at the shoulder that is feminine and pretty. I can't wait to wear it, I think I'm going to get some good value out of it! It's casual enough to be versatile and it was a good price too. I got the green, it is a nice muted color. Read more",
        "author": "Kristin C",
        "rating": 5.0,
        "date": "September 4, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Amazing!",
        "body": "It exceeded my expectations. The fabric is very comfortable and warm to wear, the fit is perfect, and it has pockets! The size is as advertised, so you can buy it without hesitation! Read more",
        "author": "Luana",
        "rating": 5.0,
        "date": "December 9, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71dUF8LFBdL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "4.0 out of 5 stars Would recommend.",
        "body": "Cute and comfortable. Can be dressed up or down. Read more",
        "author": "BaconPancakesMakingBaconPancakes",
        "rating": 4.0,
        "date": "October 24, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Nice dress for fall/winter",
        "body": "Nice material, feels and looks decent quality. I’m 5’5” and 165 postpartum and got the large and it fits well. The green color is nice I got it so I can wear for Christmas but it’s not a true Christmas type green so it will look great in the fall as well Read more",
        "author": "Emily",
        "rating": 5.0,
        "date": "December 23, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars All around great value!",
        "body": "Pre washed it in cool water, hung to dry as I do all of my laundry. Was very comfortable, fit well, looked great and very affordable. Read more",
        "author": "Judy Yuhas",
        "rating": 5.0,
        "date": "December 4, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Cute design however......",
        "body": "Nice design, comes in several colors, however the material is almost see through. Definitely would not be able to withstand the cold winter of any midwestern state located in the US. You'll need another layer underneath. A long ankle length coat with warm boots would also do the trick. Buy this dress and keep shopping for thick tights and then you'll be good to go. \"If you live in a cold winter environment\" Read more",
        "author": "M M of Milwaukee",
        "rating": 3.0,
        "date": "September 10, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Fall Must Have!",
        "body": "Love this dress! I was pleasantly surprised by this sweater dress. I read a review that said it was very thin. I did not find the material thin at all. Great texture and color. I paired today for work with brown tights and boots. Very cute. I like shoulder accents and band around the wrists. I think it is an excellent value. Can be worn with leggings also. I would definitely order again. I ordered the caramel color. It is true to size. Also has handy pockets. It is a must have for fall and winter! Read more",
        "author": "Paula Foster",
        "rating": 5.0,
        "date": "October 15, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Length",
        "body": "Very comfy and warm. Length is just right! Greta for the holiday season. Read more",
        "author": "Isabel",
        "rating": 5.0,
        "date": "December 3, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Long Sleeve V Neck is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.",
  "about_this_item": "Womens Maxi Dress Long Sleeve V Neck is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.",
  "long_description": "Womens Maxi Dress Long Sleeve V Neck is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Brown, Blue, Burgundy, Fuchsia, Apricot, Black, Caramel, Green. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Long Sleeve V Neck is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Brown, Blue, Burgundy, Fuchsia, Apricot, Black, Caramel, Green. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "4eade96c-28fa-4da3-9c05-2f6644c0b205",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4eade96c-28fa-4da3-9c05-2f6644c0b205/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4eade96c-28fa-4da3-9c05-2f6644c0b205/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "e7a400de-6f7c-4428-ae5b-75d33fab29a2",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e7a400de-6f7c-4428-ae5b-75d33fab29a2/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e7a400de-6f7c-4428-ae5b-75d33fab29a2/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "7fe572d9-c67a-41d8-a505-d54416dd2bf8",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7fe572d9-c67a-41d8-a505-d54416dd2bf8/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7fe572d9-c67a-41d8-a505-d54416dd2bf8/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "6b44b0de-8413-4635-b768-ea6a419b8ecf",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6b44b0de-8413-4635-b768-ea6a419b8ecf/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6b44b0de-8413-4635-b768-ea6a419b8ecf/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "30b904dc-368b-4c4d-a1d7-02ac43e9eb5b",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/30b904dc-368b-4c4d-a1d7-02ac43e9eb5b/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/30b904dc-368b-4c4d-a1d7-02ac43e9eb5b/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "0a1fce66-38dd-4f48-9671-ff6b5f3956e5",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0a1fce66-38dd-4f48-9671-ff6b5f3956e5/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0a1fce66-38dd-4f48-9671-ff6b5f3956e5/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "7172491f-1e39-4928-a903-42c7ef26a99f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7172491f-1e39-4928-a903-42c7ef26a99f/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7172491f-1e39-4928-a903-42c7ef26a99f/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "eacd14b6-16c6-49ac-9d28-6798a4b3c731",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/eacd14b6-16c6-49ac-9d28-6798a4b3c731/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/eacd14b6-16c6-49ac-9d28-6798a4b3c731/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "79dde171-f46b-42ba-a0a6-c540fcc60c12",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/79dde171-f46b-42ba-a0a6-c540fcc60c12/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/79dde171-f46b-42ba-a0a6-c540fcc60c12/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "a1745f93-a7b6-429c-b5f1-58b3fa25d3c7",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a1745f93-a7b6-429c-b5f1-58b3fa25d3c7/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a1745f93-a7b6-429c-b5f1-58b3fa25d3c7/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "74e688b9-a1b0-4893-8a62-6df4ca731ae1",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/74e688b9-a1b0-4893-8a62-6df4ca731ae1/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/74e688b9-a1b0-4893-8a62-6df4ca731ae1/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "dad022b2-f2ef-4c90-b84e-ff43926e8d8d",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/dad022b2-f2ef-4c90-b84e-ff43926e8d8d/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/dad022b2-f2ef-4c90-b84e-ff43926e8d8d/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Brown": "https://m.media-amazon.com/images/I/41eNhq4DI1L._AC_SR38,50_.jpg",
    "Blue": "https://m.media-amazon.com/images/I/41EEnO0GScL._AC_SR38,50_.jpg",
    "Burgundy": "https://m.media-amazon.com/images/I/31IIENuRHxL._AC_SR38,50_.jpg",
    "Fuchsia": "https://m.media-amazon.com/images/I/41RWahmgvbL._AC_SR38,50_.jpg",
    "Apricot": "https://m.media-amazon.com/images/I/41rgkMyk-oL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/416hpNd2-xL._AC_SR38,50_.jpg",
    "Caramel": "https://m.media-amazon.com/images/I/41PM8KysTDL._AC_SR38,50_.jpg",
    "Green": "https://m.media-amazon.com/images/I/41McX4cT0AL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Brown": "81pynLDLTDL",
    "Blue": "81fUWwGYykL",
    "Burgundy": "71xZmLU6QwL",
    "Fuchsia": "81PZb4sgAvL",
    "Apricot": "71OhJWIWpeL",
    "Black": "71kjFkX1n6L",
    "Caramel": "81FAvwikE5L",
    "Green": "81NqJB86E4L"
  },
  "color_images": {
    "Brown": [
      "https://m.media-amazon.com/images/I/81pynLDLTDL._SL1500_.jpg"
    ],
    "Blue": [
      "https://m.media-amazon.com/images/I/81fUWwGYykL._SL1500_.jpg"
    ],
    "Burgundy": [
      "https://m.media-amazon.com/images/I/71xZmLU6QwL._SL1500_.jpg"
    ],
    "Fuchsia": [
      "https://m.media-amazon.com/images/I/81PZb4sgAvL._SL1500_.jpg"
    ],
    "Apricot": [
      "https://m.media-amazon.com/images/I/71OhJWIWpeL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/71kjFkX1n6L._SL1500_.jpg"
    ],
    "Caramel": [
      "https://m.media-amazon.com/images/I/81FAvwikE5L._SL1500_.jpg"
    ],
    "Green": [
      "https://m.media-amazon.com/images/I/81NqJB86E4L._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 41.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71gLnAI8qnL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-ruched-evening-high-split-split",
      "title": "Womens Maxi Dress Maxi Ruched Evening High Split Split",
      "price": 72.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71omaPs6UqL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-short-sleeve-evening",
      "title": "Womens Dress Short Sleeve Evening",
      "price": 89.88,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61vi9CZReDL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-formal-cocktail-evening",
      "title": "Womens Dress Formal Cocktail Evening",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71ctK4kwdWL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 45.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/712FTzeTFLL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-formal-mermaid-evening-ruched",
      "title": "Womens Maxi Dress Formal Mermaid Evening Ruched",
      "price": 74.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61qHc0kmHEL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 37.79,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51WFZKRzSdL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 43.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Work",
      "images": [
        "https://m.media-amazon.com/images/I/81JXmyg5QfL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-sleeveless-split-formal-cocktail-v-neck",
      "title": "Womens Maxi Dress Sleeveless Split Formal Cocktail V Neck",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/51jHZEGYXHL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-ruched",
      "title": "Womens Maxi Dress Long Sleeve Ruched",
      "price": 49.29,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61P6bkbQawL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-one-shoulder-maxi-long-sleeve",
      "title": "Womens Maxi Dress One Shoulder Maxi Long Sleeve",
      "price": 45.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61UljfUsK4L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-long-sleeve-evening-formal",
      "title": "Womens Maxi Dress Cocktail Long Sleeve Evening Formal",
      "price": 46.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/6190eiFreBL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-formal-long-sleeve-evening",
      "title": "Womens Maxi Dress Maxi Formal Long Sleeve Evening",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51enCkUtvSL._SL1500_.jpg"
      ]
    }
  ]
}