{
  "id": "womens-maxi-dress-cocktail-long-sleeve-bodycon",
  "handle": "womens-maxi-dress-cocktail-long-sleeve-bodycon",
  "sku": "JC1103",
  "asin": "B0F7KCLRYB",
  "title": "Womens Maxi Dress Cocktail Long Sleeve Bodycon",
  "title_original": "ANRABESS Womens Fall Long Sleeve Short Dress Rib Knit 2025 Fashion Basic Slim Fit Party Cocktail Night Bodycon Mini Dresses",
  "brand": "Visit the ANRABESS Store",
  "price": 29.99,
  "social_proof": {
    "bought_past_month": 91,
    "text": "91+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/714yg-qAdoL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81vUaSBK4+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81sfqiG6keL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71WgvPDAWLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71GDD9xxY9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81FA7RpdYAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/815DCfdNsXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81rkHBBu8tL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81ft-fc6RdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71pbcteqDsL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81V1e7VKwzL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71cVgPATvhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81VYvO3ZloL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81jOEkSRn3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81hFNHmWdtL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/717QalKXxXL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/714yg-qAdoL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81vUaSBK4+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81sfqiG6keL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71WgvPDAWLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71GDD9xxY9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81FA7RpdYAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/815DCfdNsXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81rkHBBu8tL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81ft-fc6RdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71pbcteqDsL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81V1e7VKwzL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71cVgPATvhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81VYvO3ZloL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81jOEkSRn3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81hFNHmWdtL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/717QalKXxXL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ May 6, 2025",
    "ASIN ‏": "‎ B0F7KGK1ZG",
    "Best Sellers Rank": "#7,792 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #18 in Women's Club & Night Out Dresses",
    "Customer Reviews": "4.6 4.6 out of 5 stars (173)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Red",
      "Brown",
      "Khaki",
      "Deep Green",
      "Blue",
      "Burgundy",
      "Dark Grey",
      "Army Green",
      "Hot Pink",
      "Black",
      "Navy Blue"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.6,
    "count": 173,
    "customers_say": "Customers find the dress well-made, soft, and flattering, with one noting it highlights natural curves without feeling tight or fussy. They appreciate its versatility, with one mentioning it can be dressed up or down, and another noting it can be worn with various shoes and boots. The dress receives positive feedback for its length, with one customer mentioning it shows off legs without being too short, and its style, with one describing it as having a quietly elegant vibe. Generated from the text of customer reviews Select to learn more Fit (37) Soft fabric (19) Quality (17) Comfort (16) Style (14) Length (10) Versatility (10) Flattering (9) 37 customers mention fit, 35 positive, 2 negative 37 customers mention \"Fit\" 35 positive 2 negative Customers like how the dress fits, with one mentioning it highlights natural curves without being tight or fussy. \" This dress is very flattering. It is also very form fitting , and a little more snug than I would prefer. It is warm, and has a nice lining inside. \" Read more \" Super cute and soft. It's fitted but not too tight. This is one of my new staple black dress!! \" Read more \" Bought this dress super last minute. It fits like a glove . Perfect simple dress. Good quality. True to size. \" Read more \" I love this dress. Its the perfect length, not too tight , so comfortable. The material is very breathable and not see through.... \" Read more 19 customers mention soft fabric, 19 positive, 0 negative 19 customers mention \"Soft fabric\" 19 positive 0 negative Customers like the soft fabric of the dress, with one mentioning its fleece lining feel and another appreciating its texture. \" I am 5’2”, 100 pounds - the xs fit is perfect. It’s soft and comfy for slightly cooler Florida weather. Well made with quality fabric and finish. \" Read more \" I love this dress! It fits perfectly and is so soft and cozy! I can't wait to wear it out! I'm 5'4 138 lbs and I ordered my usual size a small. \" Read more \" True to size, fabric is super soft , and the sleeves are actually long enough!... \" Read more \" ...I feel like it accentuates your curves and the fabric is butter soft ! I definitely am going to order more colors! You will not regret this purchase!!... \" Read more 17 customers mention quality, 16 positive, 1 negative 17 customers mention \"Quality\" 16 positive 1 negative Customers find the dress to be well-made and of good quality. \" Great dress ! Nice and soft inside and fits so nice \" Read more \" ...It’s soft and comfy for slightly cooler Florida weather. Well made with quality fabric and finish. \" Read more \" So flattering! And nice and cozy thanks to the lining. I usually wear a small, but got x-small so it's very form fitting \" Read more \" LOVE!!! This dress is amazing ! I am 5’4” 138lbs and ordered a small. Definitely true to size.... \" Read more 16 customers mention comfort, 16 positive, 0 negative 16 customers mention \"Comfort\" 16 positive 0 negative Customers find the dress comfortable and cozy. \" ...She said it was really soft and comfortable . \" Read more \" I love this dress! It fits perfectly and is so soft and cozy ! I can't wait to wear it out! I'm 5'4 138 lbs and I ordered my usual size a small. \" Read more \" ...It’s form-fitting but still comfortable to move in . The sleeves are a nice length and the dress looks great with a jacket or cardigan.... \" Read more \" I love this dress. Its the perfect length, not too tight, so comfortable . The material is very breathable and not see through.... \" Read more 14 customers mention style, 14 positive, 0 negative 14 customers mention \"Style\" 14 positive 0 negative Customers find the dress cute, with one mentioning it has a quietly elegant vibe. \" This dress is cute and perfect for fall. The ribbed fabric is thicker than I expected, so it feels a bit more structured and not see-through.... \" Read more \" Super cute dress , I want it in more colors! Super flattering red color for the holiday season!... \" Read more \" It's a beautiful dress and my fiancee loves it \" Read more \" Very soft and so sexy ! I wore with knee highs as a dress and also as a long shirt with bell bottoms and a white puffer vest! So cute! \" Read more 10 customers mention length, 10 positive, 0 negative 10 customers mention \"Length\" 10 positive 0 negative Customers like the dress's length, with several noting that the sleeves are long enough. One customer mentions it shows off their legs without being too short, while another notes it can be adjusted by pulling it up or down. \" ...me until late pregnancy - I'm shorter frame as well, it is the perfect length and not super long like you would expect - especially with sizing up.... \" Read more \" Fits as it should, feels light and cool. Sleeve length is perfect and fits over my hips perfectly! Also the length is great.... \" Read more \" ...It’s form-fitting but still comfortable to move in. The sleeves are a nice length and the dress looks great with a jacket or cardigan.... \" Read more \" True to size, fabric is super soft, and the sleeves are actually long enough !... \" Read more 10 customers mention versatility, 10 positive, 0 negative 10 customers mention \"Versatility\" 10 positive 0 negative Customers find the dress versatile, with one mentioning it can be dressed up or down, while another notes it pairs well with various shoes and boots. \" Loved the quality, stretchiness you could dress it up or dress it down . \" Read more \" This dress is cute and perfect for fall . The ribbed fabric is thicker than I expected, so it feels a bit more structured and not see-through.... \" Read more \" ...Fairly warm and slightly thicker material so it’s great for winter ! \" Read more \" ...It is super versatile and you can dress it up with boots and shoulder bag, or I’ve also dressed it down with sneakers and jean jacket.... \" Read more 9 customers mention flattering, 9 positive, 0 negative 9 customers mention \"Flattering\" 9 positive 0 negative Customers find the dress flattering, with one mentioning it accentuates curves. \" This dress is very flattering . It is also very form fitting, and a little more snug than I would prefer. It is warm, and has a nice lining inside. \" Read more \" Very flattering dress . Im 5'7\", 125lbs, 32DD, 25in waist. I bought the XS. Fit is great. Can be pulled longer or scrunched up for a shorter fit.... \" Read more \" ...Definitely true to size. I feel like it accentuates your curves and the fabric is butter soft! I definitely am going to order more colors!... \" Read more \" ...Soft, stretchy and flattering to the figure ! I totally love it!!! \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Soft, Stretchy, and Stylish",
        "body": "This dress is cute and perfect for fall. The ribbed fabric is thicker than I expected, so it feels a bit more structured and not see-through. It’s form-fitting but still comfortable to move in. The sleeves are a nice length and the dress looks great with a jacket or cardigan.Great little basic for the season. Read more",
        "author": "Yesenia Romero",
        "rating": 5.0,
        "date": "December 7, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Love this casual “little black dress”",
        "body": "I am 5’2”, 100 pounds - the xs fit is perfect. It’s soft and comfy for slightly cooler Florida weather. Well made with quality fabric and finish. Read more",
        "author": "MommyL",
        "rating": 5.0,
        "date": "November 17, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Fitted and flattering not sheer",
        "body": "Dress is great if you liked a fitted dresses, cones on many colors, material is not thin. Very comfortable, you can pull up or down for length, not sheer, sturdy material love the style Read more",
        "author": "Lori",
        "rating": 5.0,
        "date": "November 10, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71Mq3q8gQoL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars So hot! And comfy!",
        "body": "This dress is both casual looking and super hot. Your man will love it. It’s short and fitted. Read more",
        "author": "Heather",
        "rating": 5.0,
        "date": "November 17, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61MNm-gTjWL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "4.0 out of 5 stars It’s nice",
        "body": "The dress was nice it fit perfectly, I liked the texture of the dress and it was stretchy Read more",
        "author": "Melanie Earl",
        "rating": 4.0,
        "date": "December 3, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Love this dress for all occasions",
        "body": "I love this dress. Its the perfect length, not too tight, so comfortable. The material is very breathable and not see through. The sizing is definitely true to size. You can wear it in a more causal setting or dress it up, very versatile Read more",
        "author": "Customer",
        "rating": 5.0,
        "date": "November 10, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Very flattering",
        "body": "So flattering! And nice and cozy thanks to the lining. I usually wear a small, but got x-small so it's very form fitting Read more",
        "author": "Caleb and Savanna",
        "rating": 5.0,
        "date": "December 13, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71oxtNjexAL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Super comfy",
        "body": "Super cute and soft. It's fitted but not too tight. This is one of my new staple black dress!! Read more",
        "author": "Mom of boys",
        "rating": 5.0,
        "date": "November 11, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Cocktail Long Sleeve Bodycon is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.",
  "about_this_item": "Womens Maxi Dress Cocktail Long Sleeve Bodycon is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.",
  "long_description": "Womens Maxi Dress Cocktail Long Sleeve Bodycon is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Red, Brown, Khaki, Deep Green, Blue, Burgundy, Dark Grey, Army Green, Hot Pink, Black, Navy Blue. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Cocktail Long Sleeve Bodycon is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Red, Brown, Khaki, Deep Green, Blue, Burgundy, Dark Grey, Army Green, Hot Pink, Black, Navy Blue. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "672589f3-03fe-43bf-9dbf-a57e5e1132fc",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/672589f3-03fe-43bf-9dbf-a57e5e1132fc/embedded.cc.default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/672589f3-03fe-43bf-9dbf-a57e5e1132fc/embedded.cc.default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/195ac649-05ac-46a3-ba50-0205b5e765b3.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "63752206-0af6-4f6a-9fb2-2a8ec497aedf",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/63752206-0af6-4f6a-9fb2-2a8ec497aedf/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/63752206-0af6-4f6a-9fb2-2a8ec497aedf/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/195ac649-05ac-46a3-ba50-0205b5e765b3.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "da5073f2-0f72-41dd-a81f-66c845bb6c3c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/da5073f2-0f72-41dd-a81f-66c845bb6c3c/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/da5073f2-0f72-41dd-a81f-66c845bb6c3c/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/195ac649-05ac-46a3-ba50-0205b5e765b3.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "faeab103-ae11-45d5-9400-9543d0fbbfca",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/faeab103-ae11-45d5-9400-9543d0fbbfca/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/faeab103-ae11-45d5-9400-9543d0fbbfca/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/195ac649-05ac-46a3-ba50-0205b5e765b3.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "7bb520f2-61d2-424c-a245-24b695a7b9ec",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7bb520f2-61d2-424c-a245-24b695a7b9ec/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7bb520f2-61d2-424c-a245-24b695a7b9ec/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/195ac649-05ac-46a3-ba50-0205b5e765b3.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "e617fd38-1e0b-451c-819e-7ac8372c80ed",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e617fd38-1e0b-451c-819e-7ac8372c80ed/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e617fd38-1e0b-451c-819e-7ac8372c80ed/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/195ac649-05ac-46a3-ba50-0205b5e765b3.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "c0482bf4-98aa-4ddc-bcff-baa72d28eb21",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c0482bf4-98aa-4ddc-bcff-baa72d28eb21/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c0482bf4-98aa-4ddc-bcff-baa72d28eb21/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/195ac649-05ac-46a3-ba50-0205b5e765b3.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "3eae49d0-fa0a-4e3a-9b67-44f9d5aee38d",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3eae49d0-fa0a-4e3a-9b67-44f9d5aee38d/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3eae49d0-fa0a-4e3a-9b67-44f9d5aee38d/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/195ac649-05ac-46a3-ba50-0205b5e765b3.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "402fb423-1135-4651-84b6-c2863ffcf7da",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/402fb423-1135-4651-84b6-c2863ffcf7da/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/402fb423-1135-4651-84b6-c2863ffcf7da/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/195ac649-05ac-46a3-ba50-0205b5e765b3.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "26cc6842-c3a6-47b8-8bd6-76017c0b6e22",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/26cc6842-c3a6-47b8-8bd6-76017c0b6e22/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/26cc6842-c3a6-47b8-8bd6-76017c0b6e22/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/195ac649-05ac-46a3-ba50-0205b5e765b3.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "38f3343c-6396-4294-9e10-52f86170f652",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/38f3343c-6396-4294-9e10-52f86170f652/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/38f3343c-6396-4294-9e10-52f86170f652/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/195ac649-05ac-46a3-ba50-0205b5e765b3.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "044aac17-7603-4ea9-973e-ffddbcfccba3",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/044aac17-7603-4ea9-973e-ffddbcfccba3/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/044aac17-7603-4ea9-973e-ffddbcfccba3/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/195ac649-05ac-46a3-ba50-0205b5e765b3.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Red": "https://m.media-amazon.com/images/I/41iwIWy9qlL._AC_SR38,50_.jpg",
    "Brown": "https://m.media-amazon.com/images/I/41hp2aQZRSL._AC_SR38,50_.jpg",
    "Khaki": "https://m.media-amazon.com/images/I/41wQQRCSgVL._AC_SR38,50_.jpg",
    "Deep Green": "https://m.media-amazon.com/images/I/31xlfW2OXlL._AC_SR38,50_.jpg",
    "Blue": "https://m.media-amazon.com/images/I/419nocJLuDL._AC_SR38,50_.jpg",
    "Burgundy": "https://m.media-amazon.com/images/I/41sPrZvd9tL._AC_SR38,50_.jpg",
    "Dark Grey": "https://m.media-amazon.com/images/I/315jl98uzaL._AC_SR38,50_.jpg",
    "Army Green": "https://m.media-amazon.com/images/I/31Pce51oJ8L._AC_SR38,50_.jpg",
    "Hot Pink": "https://m.media-amazon.com/images/I/41GhtikfxkL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31LZqr7AS0L._AC_SR38,50_.jpg",
    "Navy Blue": "https://m.media-amazon.com/images/I/31lrYScJSeL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Red": "815DCfdNsXL",
    "Brown": "81rkHBBu8tL",
    "Khaki": "81ft-fc6RdL",
    "Deep Green": "71pbcteqDsL",
    "Blue": "81V1e7VKwzL",
    "Burgundy": "71cVgPATvhL",
    "Dark Grey": "81VYvO3ZloL",
    "Army Green": "81jOEkSRn3L",
    "Hot Pink": "81hFNHmWdtL",
    "Black": "714yg-qAdoL",
    "Navy Blue": "717QalKXxXL"
  },
  "color_images": {
    "Red": [
      "https://m.media-amazon.com/images/I/815DCfdNsXL._SL1500_.jpg"
    ],
    "Brown": [
      "https://m.media-amazon.com/images/I/81rkHBBu8tL._SL1500_.jpg"
    ],
    "Khaki": [
      "https://m.media-amazon.com/images/I/81ft-fc6RdL._SL1500_.jpg"
    ],
    "Deep Green": [
      "https://m.media-amazon.com/images/I/71pbcteqDsL._SL1500_.jpg"
    ],
    "Blue": [
      "https://m.media-amazon.com/images/I/81V1e7VKwzL._SL1500_.jpg"
    ],
    "Burgundy": [
      "https://m.media-amazon.com/images/I/71cVgPATvhL._SL1500_.jpg"
    ],
    "Dark Grey": [
      "https://m.media-amazon.com/images/I/81VYvO3ZloL._SL1500_.jpg"
    ],
    "Army Green": [
      "https://m.media-amazon.com/images/I/81jOEkSRn3L._SL1500_.jpg"
    ],
    "Hot Pink": [
      "https://m.media-amazon.com/images/I/81hFNHmWdtL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/714yg-qAdoL._SL1500_.jpg"
    ],
    "Navy Blue": [
      "https://m.media-amazon.com/images/I/717QalKXxXL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress-sleeveless-cocktail",
      "title": "Womens Dress Sleeveless Cocktail",
      "price": 27.19,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/713CbSuzGgL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-evening-formal",
      "title": "Womens Maxi Dress Long Sleeve Evening Formal",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71diEw2+G9L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-ruched-evening-long-sleeve-bodycon",
      "title": "Womens Maxi Dress Cocktail Ruched Evening Long Sleeve Bodycon",
      "price": 46.97,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51OQMF8VX5L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 425.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51-1QDhDKvL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 165.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/614rKT8yRfL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-formal-maxi-one-shoulder-sleeveless",
      "title": "Womens Maxi Dress Formal Maxi One Shoulder Sleeveless",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51ePfLM7P+L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-bodycon-maxi-ruched-long-sleeve-off-shoulder",
      "title": "Womens Maxi Dress Formal Bodycon Maxi Ruched Long Sleeve Off Shoulder",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51HztR7iFkL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-bodycon-v-neck-maxi",
      "title": "Womens Maxi Dress Long Sleeve Bodycon V Neck Maxi",
      "price": 44.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61NjE1FKC7L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/710lf+6ytxL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-long-sleeve-mermaid-formal",
      "title": "Womens Maxi Dress Evening Long Sleeve Mermaid Formal",
      "price": 89.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61MSG5QxBuL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-v-neck-long-sleeve",
      "title": "Womens Maxi Dress V Neck Long Sleeve",
      "price": 44.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61DN9lxWRzL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-v-neck-formal-sleeveless",
      "title": "Womens Dress V Neck Formal Sleeveless",
      "price": 88.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51ld3ZgHVhL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 24.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61H3TuaNRDL._SL1500_.jpg"
      ]
    }
  ]
}