{
  "id": "womens-maxi-dress-long-sleeve-v-neck-maxi",
  "handle": "womens-maxi-dress-long-sleeve-v-neck-maxi",
  "sku": "JC2557",
  "asin": "B0F7LQN91S",
  "title": "Womens Maxi Dress Long Sleeve V Neck Maxi",
  "title_original": "Simplee Women's Floral Boho Long Sleeve Maxi Dress V Neck Empire Waist Swing Flowy Wedding Guest Dress",
  "brand": "Visit the Simplee Store",
  "price": 49.99,
  "social_proof": {
    "bought_past_month": 61,
    "text": "61+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/81rkl6vd4VL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91GTCmIhHdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81saAre8aqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81Vx4FM-ZaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91i0xGFUOkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/814sooyIRHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81cIXtdwCyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81EQxvw99DL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81NWTVU+FRL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/711waPhTA2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81BksSdWeTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71S6GIHpo1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81BjG9Z8h1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81rT1ezyb+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81BbRQyWmlL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71sa6rmgIyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/813gVv9kQwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81R8gZ9gSfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81QiEM99TDL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/81rkl6vd4VL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91GTCmIhHdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81saAre8aqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81Vx4FM-ZaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91i0xGFUOkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/814sooyIRHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81cIXtdwCyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81EQxvw99DL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81NWTVU+FRL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/711waPhTA2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81BksSdWeTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71S6GIHpo1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81BjG9Z8h1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81rT1ezyb+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81BbRQyWmlL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71sa6rmgIyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/813gVv9kQwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81R8gZ9gSfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81QiEM99TDL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Product Dimensions ‏": "‎ 7.87 x 7.87 x 0.59 inches; 12.35 ounces",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ May 6, 2025",
    "ASIN ‏": "‎ B0F7LQWCJ9",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#23,803 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #168 in Women's Formal Dresses",
    "Customer Reviews": "4.6 4.6 out of 5 stars (205)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Light Pink Floral",
      "Navy Floral",
      "Emerald Green Floral",
      "Pink Floral",
      "Black Floral",
      "Green Floral",
      "Black Orange Floral",
      "Dusty Blue Floral",
      "Black Pink Floral",
      "Navy Blue Floral",
      "Brown Floral",
      "Black White Floral",
      "Navy Pink Floral",
      "Light Green Floral"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.6,
    "count": 205,
    "customers_say": "Customers find the dress stylish and comfortable, with good fabric quality and perfect for wedding or other dressy affairs. They appreciate its flattering silhouette and perfect fit, with one customer noting it falls right above the ankles. While some it's perfectly sized, others mention it runs too small. Select to learn more Style Fit Quality Comfort Fabric quality Dress fit Flattering Size 47 customers mention \"Style\" 46 positive 1 negative Customers find the dress very pretty, with one customer noting its perfect silhouette and another describing it as feminine. \" Beautiful dress but the elastic waist is very small. I am a true size 4 and the small size Small perfectly everywhere else....\" Read more \" Very pretty and dressy. Perfect for wedding or other dressy affair. Well made soft flowing material. Very affordable\" Read more \"...I'm 5 ft 4 and the dress hits at my ankle. It's beautiful and flowy, and fully lined....\" Read more \"Comfortable and pretty ! Wore it to a wedding and got lots of compliments! Love it\" Read more 44 customers mention \"Fit\" 35 positive 9 negative Customers like how the dress fits, with one mentioning it falls right above the ankles. \"...It is lined but fabric is lightweight. It fits well but may want to size up if you don’t want snug fit. Colors are true to photos.\" Read more \"Super cute. Fit perfectly . (Only down side: no pockets)\" Read more \"Love the material, the fit and the pattern! It’s perfect!\" Read more \"It is a bad fitting dress . I will wear it around the house as it looks cheaply made and not fit for wearing outside.\" Read more 26 customers mention \"Quality\" 24 positive 2 negative Customers find the dress to be amazing, with one mentioning that the material feels wonderful. \"Love this dress!! Wore it to my daughter’s baptism. Great quality , lined and the v neck isn’t too deep. Perfect for a chilly fall day....\" Read more \" Love this dress !!...\" Read more \" Nice dress that is lined...\" Read more \" Love the dress and got many compliments when wearing it. The fabric is good quality and the fitting was perfect. I bought a Medium\" Read more 17 customers mention \"Comfort\" 14 positive 3 negative Customers find the dress comfortable. \"...washing and drying according to directions it was a perfect fit and comfortable . The elastic in the waist and around the wrists shrunk....\" Read more \" Very comfortable & prefect for the transition from summer into fall. Got many compliments on it. Was true to size.\" Read more \"...The size was perfect. Beautiful colors for fall. So comfortable and wrinkle resistant. I’ve had so many compliments on this dress....\" Read more \"I wore this for a wedding. It was both dressy and comfy . The fabric was not sheer but was also not heavy. It was a perfect balance.\" Read more 15 customers mention \"Fabric quality\" 12 positive 3 negative Customers appreciate the fabric quality of the dress, with one customer noting it is well-made and soft, while another mentions it is 100% polyester. \"Beautiful dress very nice fabric !\" Read more \"Perfect fit, wrinkle resistance, good material \" Read more \"Very classy. Feels expensive . Looks great. Wore to a funeral.\" Read more \"I wore this for a wedding. It was both dressy and comfy. The fabric was not sheer but was also not heavy. It was a perfect balance.\" Read more 10 customers mention \"Dress fit\" 10 positive 0 negative Customers find the dress perfect for weddings and other dressy affairs, with one customer noting it's suitable for outdoor events, while another mentions it works well for family photos. \"A perfect Fall dress . I purchased this dress for an upcoming fall wedding. I ordered a small size....\" Read more \"...I am going to buy a 2nd one in another color! Perfect for a fall wedding !\" Read more \"...it to dress up for special occasions, like weddings, but it’s also casual enough to get more regular wear out of. Worth every penny.\" Read more \"I LOVE this dress. It was perfect for my family photos . Very flattering fit. The waist is pretty tight as others have commented....\" Read more 10 customers mention \"Flattering\" 9 positive 1 negative Customers find the dress flattering. \"Was really pleased how flattering this is. I love it. The color is as pictured.\" Read more \"Such a cute dress. Fits great. Very flattering .\" Read more \"...It's beautiful and flowy, and fully lined. The cut is flattering to my curvy shape , and the sheer sleeves elevate the look....\" Read more \"Fit is true to size. Flattering and comfortable. Can dress up or down.\" Read more 23 customers mention \"Size\" 14 positive 9 negative Customers have mixed experiences with the dress's sizing, with some finding it true to size while others report it runs too small. \"...The silhouette is perfect, so is the fit. True to size . It’s flowy and comfortable.\" Read more \"Very pretty, light, flowy. Flattering shape. Small in the bust … I am considering exchanging for the next size up but it fits so well everywhere else...\" Read more \"Dress was cute and petite friendly . I’m 5’1 and it was a great length on me. Flower print was nice....\" Read more \" Size chart is pretty accurate . Very comfortable and good quality. Love how it fits.\" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Sizing Was Confusing",
        "body": "I ordered this dress for a family photo shoot. I liked the style. It fit the color scheme and fall season. Amazon said I should get a large. It was way too big. I had time to get a medium. It was still quite loose in the waist and I looked frumpy. Time was short so I decided to wear it anyway. After machine washing and drying according to directions it was a perfect fit and comfortable. The elastic in the waist and around the wrists shrunk. There were no wrinkles. I didn’t take pictures before washing. Here are pictures of how it looks now. I got many compliments. Read more",
        "author": "Catherine Sepam",
        "rating": 5.0,
        "date": "November 26, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71w4SaTYNFL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71jKtoQabPL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71soQk1oP0L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Flattering Hourglass Fit – Win-Win Dress",
        "body": "Can’t believe how much I loved this dress on me! I’m 5’5”, 138 lbs, hourglass with a large bust (34G). I ordered a small but am exchanging for a medium since the bust and shoulder area were too tight. The dress arrived wrinkle-free right out of the package and had no smell. Perfect for season transition—looks great with cute wedges or boots. I love that it covers my arms but the fabric is sheer, so it doesn’t feel heavy. Total win-win! Read more",
        "author": "Ann Dobek",
        "rating": 5.0,
        "date": "October 10, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Beautiful!",
        "body": "I ordered this to wear at a fall wedding. I'm 5 ft 4 and the dress hits at my ankle. It's beautiful and flowy, and fully lined. The cut is flattering to my curvy shape, and the sheer sleeves elevate the look. And even though it arrived balled up in the package, it wasn't wrinkled, so it should travel well. I can't wait to wear this! Read more",
        "author": "Kindle Customer",
        "rating": 5.0,
        "date": "November 7, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Pretty dress",
        "body": "Dress was cute and petite friendly. I’m 5’1 and it was a great length on me. Flower print was nice. It doesn’t have stretch so I did struggle a little to get the dress off but it fit me well. I think it can be dressed up or down. Read more",
        "author": "Customer",
        "rating": 4.0,
        "date": "August 17, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Good quality for your money",
        "body": "Size chart is pretty accurate. Very comfortable and good quality. Love how it fits. Read more",
        "author": "Customer",
        "rating": 5.0,
        "date": "November 20, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Beautiful Fall Dress",
        "body": "I bought this dress for a friends fall wedding. The size was perfect. Beautiful colors for fall. So comfortable and wrinkle resistant. I’ve had so many compliments on this dress. A definite must for your wardrobe. Read more",
        "author": "Melissa Moles",
        "rating": 5.0,
        "date": "November 25, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Amazing",
        "body": "Fantastic dress. Well-made fits perfectly sized well. Love it. 5”10 145lbs M is great. Read more",
        "author": "Denise Kent",
        "rating": 5.0,
        "date": "November 5, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Great dress for wedding guest",
        "body": "I wore this for a wedding. It was both dressy and comfy. The fabric was not sheer but was also not heavy. It was a perfect balance. Read more",
        "author": "Customer",
        "rating": 5.0,
        "date": "November 4, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Long Sleeve V Neck Maxi is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.",
  "about_this_item": "Womens Maxi Dress Long Sleeve V Neck Maxi is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.",
  "long_description": "Womens Maxi Dress Long Sleeve V Neck Maxi is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Light Pink Floral, Navy Floral, Emerald Green Floral, Pink Floral, Black Floral, Green Floral, Black Orange Floral, Dusty Blue Floral, Black Pink Floral, Navy Blue Floral, Brown Floral, Black White Floral, Navy Pink Floral, Light Green Floral. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Long Sleeve V Neck Maxi is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Light Pink Floral, Navy Floral, Emerald Green Floral, Pink Floral, Black Floral, Green Floral, Black Orange Floral, Dusty Blue Floral, Black Pink Floral, Navy Blue Floral, Brown Floral, Black White Floral, Navy Pink Floral, Light Green Floral. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "5d2ba435-2dbe-4cb6-949d-5ce85284628b",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5d2ba435-2dbe-4cb6-949d-5ce85284628b/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5d2ba435-2dbe-4cb6-949d-5ce85284628b/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/1af80bca-1e89-481e-a768-fdcc51afd93d.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "214dd602-b5a4-4819-a7f3-e4f1997e9639",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/214dd602-b5a4-4819-a7f3-e4f1997e9639/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/214dd602-b5a4-4819-a7f3-e4f1997e9639/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/1af80bca-1e89-481e-a768-fdcc51afd93d.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "60ced567-ccf4-432b-aa24-e78226cdc8b2",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/60ced567-ccf4-432b-aa24-e78226cdc8b2/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/60ced567-ccf4-432b-aa24-e78226cdc8b2/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/1af80bca-1e89-481e-a768-fdcc51afd93d.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "51bf3de0-3532-4c69-a632-4d68b498fca6",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/51bf3de0-3532-4c69-a632-4d68b498fca6/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/51bf3de0-3532-4c69-a632-4d68b498fca6/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/1af80bca-1e89-481e-a768-fdcc51afd93d.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "2f37b0d3-fe0d-4ef1-8cbd-f485064196e4",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2f37b0d3-fe0d-4ef1-8cbd-f485064196e4/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2f37b0d3-fe0d-4ef1-8cbd-f485064196e4/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/1af80bca-1e89-481e-a768-fdcc51afd93d.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "76c084a3-37ca-466d-9157-52339d8087db",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/76c084a3-37ca-466d-9157-52339d8087db/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/76c084a3-37ca-466d-9157-52339d8087db/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/1af80bca-1e89-481e-a768-fdcc51afd93d.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "0cd858a2-0d88-41cf-a2fc-347ea14e723e",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0cd858a2-0d88-41cf-a2fc-347ea14e723e/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0cd858a2-0d88-41cf-a2fc-347ea14e723e/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/1af80bca-1e89-481e-a768-fdcc51afd93d.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "27182c1e-250b-48ee-8518-405bc4e7c100",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/27182c1e-250b-48ee-8518-405bc4e7c100/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/27182c1e-250b-48ee-8518-405bc4e7c100/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/1af80bca-1e89-481e-a768-fdcc51afd93d.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "0b224f65-7b6f-4c23-9fcf-9c71474f50ac",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0b224f65-7b6f-4c23-9fcf-9c71474f50ac/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0b224f65-7b6f-4c23-9fcf-9c71474f50ac/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/1af80bca-1e89-481e-a768-fdcc51afd93d.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "9cb20d74-df86-4957-8ad4-87c182cec753",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9cb20d74-df86-4957-8ad4-87c182cec753/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9cb20d74-df86-4957-8ad4-87c182cec753/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/1af80bca-1e89-481e-a768-fdcc51afd93d.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "a6e15f05-8acb-4b5a-899f-96d7ff788ea0",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a6e15f05-8acb-4b5a-899f-96d7ff788ea0/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a6e15f05-8acb-4b5a-899f-96d7ff788ea0/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/1af80bca-1e89-481e-a768-fdcc51afd93d.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "a39c0ed1-7085-46e9-891c-bb30e9e3e91c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a39c0ed1-7085-46e9-891c-bb30e9e3e91c/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a39c0ed1-7085-46e9-891c-bb30e9e3e91c/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/1af80bca-1e89-481e-a768-fdcc51afd93d.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Light Pink Floral": "https://m.media-amazon.com/images/I/41+KRDouqaL._AC_SR38,50_.jpg",
    "Navy Floral": "https://m.media-amazon.com/images/I/41ACT8V5AeL._AC_SR38,50_.jpg",
    "Emerald Green Floral": "https://m.media-amazon.com/images/I/41AlWB26F5L._AC_SR38,50_.jpg",
    "Pink Floral": "https://m.media-amazon.com/images/I/41kYMmWrPnL._AC_SR38,50_.jpg",
    "Black Floral": "https://m.media-amazon.com/images/I/418J0WCUsgL._AC_SR38,50_.jpg",
    "Green Floral": "https://m.media-amazon.com/images/I/41hS+UQxxNL._AC_SR38,50_.jpg",
    "Black Orange Floral": "https://m.media-amazon.com/images/I/41cDP8bWNIL._AC_SR38,50_.jpg",
    "Dusty Blue Floral": "https://m.media-amazon.com/images/I/419o+CS2uBL._AC_SR38,50_.jpg",
    "Black Pink Floral": "https://m.media-amazon.com/images/I/417kUjrPfTL._AC_SR38,50_.jpg",
    "Navy Blue Floral": "https://m.media-amazon.com/images/I/41lYn+UKqfL._AC_SR38,50_.jpg",
    "Brown Floral": "https://m.media-amazon.com/images/I/41M97CjaNZL._AC_SR38,50_.jpg",
    "Black White Floral": "https://m.media-amazon.com/images/I/41i3ayZn0DL._AC_SR38,50_.jpg",
    "Navy Pink Floral": "https://m.media-amazon.com/images/I/41Am5UsiyVL._AC_SR38,50_.jpg",
    "Light Green Floral": "https://m.media-amazon.com/images/I/41Ua9z3Ox3L._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Light Pink Floral": "81cIXtdwCyL",
    "Navy Floral": "81rkl6vd4VL",
    "Emerald Green Floral": "81EQxvw99DL",
    "Pink Floral": "81NWTVU+FRL",
    "Black Floral": "711waPhTA2L",
    "Green Floral": "81BksSdWeTL",
    "Black Orange Floral": "71S6GIHpo1L",
    "Dusty Blue Floral": "81BjG9Z8h1L",
    "Black Pink Floral": "81rT1ezyb+L",
    "Navy Blue Floral": "81BbRQyWmlL",
    "Brown Floral": "71sa6rmgIyL",
    "Black White Floral": "813gVv9kQwL",
    "Navy Pink Floral": "81R8gZ9gSfL",
    "Light Green Floral": "81QiEM99TDL"
  },
  "color_images": {
    "Light Pink Floral": [
      "https://m.media-amazon.com/images/I/81cIXtdwCyL._SL1500_.jpg"
    ],
    "Navy Floral": [
      "https://m.media-amazon.com/images/I/81rkl6vd4VL._SL1500_.jpg"
    ],
    "Emerald Green Floral": [
      "https://m.media-amazon.com/images/I/81EQxvw99DL._SL1500_.jpg"
    ],
    "Pink Floral": [
      "https://m.media-amazon.com/images/I/81NWTVU+FRL._SL1500_.jpg"
    ],
    "Black Floral": [
      "https://m.media-amazon.com/images/I/711waPhTA2L._SL1500_.jpg"
    ],
    "Green Floral": [
      "https://m.media-amazon.com/images/I/81BksSdWeTL._SL1500_.jpg"
    ],
    "Black Orange Floral": [
      "https://m.media-amazon.com/images/I/71S6GIHpo1L._SL1500_.jpg"
    ],
    "Dusty Blue Floral": [
      "https://m.media-amazon.com/images/I/81BjG9Z8h1L._SL1500_.jpg"
    ],
    "Black Pink Floral": [
      "https://m.media-amazon.com/images/I/81rT1ezyb+L._SL1500_.jpg"
    ],
    "Navy Blue Floral": [
      "https://m.media-amazon.com/images/I/81BbRQyWmlL._SL1500_.jpg"
    ],
    "Brown Floral": [
      "https://m.media-amazon.com/images/I/71sa6rmgIyL._SL1500_.jpg"
    ],
    "Black White Floral": [
      "https://m.media-amazon.com/images/I/813gVv9kQwL._SL1500_.jpg"
    ],
    "Navy Pink Floral": [
      "https://m.media-amazon.com/images/I/81R8gZ9gSfL._SL1500_.jpg"
    ],
    "Light Green Floral": [
      "https://m.media-amazon.com/images/I/81QiEM99TDL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-bodycon-long-sleeve-ruched",
      "title": "Womens Maxi Dress Bodycon Long Sleeve Ruched",
      "price": 37.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51HXlzAgqNL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-v-neck",
      "title": "Womens Maxi Dress Long Sleeve V Neck",
      "price": 45.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71pVwbt4uKL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 139.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71TANKZawRL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail",
      "title": "Womens Dress Cocktail",
      "price": 50.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/71W6t9r3P8L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 51.29,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61PiBYMUlgL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-evening",
      "title": "Womens Maxi Dress Evening",
      "price": 74.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61zhrIilchL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail-v-neck",
      "title": "Womens Dress Cocktail V Neck",
      "price": 42.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71QusYRKDhL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-v-neck",
      "title": "Womens Dress V Neck",
      "price": 42.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/81ZnK+U8WNL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 32.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51j9Telt82L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-bodycon-ruched",
      "title": "Womens Maxi Dress Long Sleeve Bodycon Ruched",
      "price": 58.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71qQ-zJaP8L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/81VEy9ZQg3L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-sleeveless",
      "title": "Womens Maxi Dress Sleeveless",
      "price": 43.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61J24Xha0vL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-evening-formal-off-shoulder-mermaid",
      "title": "Womens Dress Evening Formal Off Shoulder Mermaid",
      "price": 70.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61ad57Ra1oL._SL1500_.jpg"
      ]
    }
  ]
}