{
  "id": "womens-dress-ruched-bodycon-v-neck",
  "handle": "womens-dress-ruched-bodycon-v-neck",
  "sku": "JC1293",
  "asin": "B0F7QNKDHB",
  "title": "Womens Dress Ruched Bodycon V Neck",
  "title_original": "CHICME Summer Dresses for Women Floral Print Plunge V Neck Midi Dress Casual Ruched Slit Bodycon Party Dress",
  "brand": "Visit the CHICME Store",
  "price": 31.99,
  "social_proof": {
    "bought_past_month": 52,
    "text": "52+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/51P0kVASvyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61dqwWoyhFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61MfzUuvXtL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Mdhhc0FPL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51DbtUWqXkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51xTRL7DZwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/719CtZj0CfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41R9fXEpJQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61hNdJ1x1fL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61d854LLThL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61bTYvGTFnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61HtI7mgUtL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51djhX9xkrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61DcE7iTGUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61cyOh+3okL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61dr0NP6IpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51GElM86dqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71HDvHjfKgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/515YKSmgQqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/618uJSV2y0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61JIcYYpGTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61hOAkVAgjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61xfaccIihL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61+3HdWbVnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41x05pbS8gL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/617WHeSnzJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/610tNTLzYBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61UAHp1jWCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/611pP9XMflL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61zWUnQRPhL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/51P0kVASvyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61dqwWoyhFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61MfzUuvXtL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Mdhhc0FPL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51DbtUWqXkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51xTRL7DZwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/719CtZj0CfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41R9fXEpJQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61hNdJ1x1fL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61d854LLThL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61bTYvGTFnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61HtI7mgUtL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51djhX9xkrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61DcE7iTGUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61cyOh+3okL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61dr0NP6IpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51GElM86dqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71HDvHjfKgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/515YKSmgQqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/618uJSV2y0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61JIcYYpGTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61hOAkVAgjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61xfaccIihL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61+3HdWbVnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41x05pbS8gL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/617WHeSnzJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/610tNTLzYBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61UAHp1jWCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/611pP9XMflL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61zWUnQRPhL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ May 7, 2025",
    "ASIN ‏": "‎ B0F7QJRH3M",
    "Best Sellers Rank": "#60,029 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #1,559 in Women's Casual Dresses",
    "Customer Reviews": "4.0 4.0 out of 5 stars (166)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Red",
      "Brown",
      "A-black",
      "Blue",
      "Solid Black"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.0,
    "count": 166,
    "customers_say": "Customers find the dress sexy without trying too hard and flatter their shape, with one mentioning how the ruching helps hide problem areas like the tummy. The dress fits well, is comfortable, and is very stretchy, with one customer noting it's great for wedding guests. The fabric quality receives mixed feedback, with some praising the material while others find it cheap. The stitching quality is negative, with multiple customers reporting poor stitching and construction issues. Generated from the text of customer reviews Select to learn more Style (26) Fit (24) Quality (18) Flattering (17) Comfort (11) Stretchiness (8) Fabric quality (12) Stitching quality (8) 26 customers mention style, 26 positive, 0 negative 26 customers mention \"Style\" 26 positive 0 negative Customers find the dress stylish, describing it as chic and sexy without trying too hard, with one customer noting it looks exactly like the picture. \" Beautiful dress , very flattering and would buy it again in another color \" Read more \" ...So if you have curves, size up. It’s super flattering and sexy !!! I’m returning the medium and buying more colors in large.... \" Read more \" Dress is lovely but runs two sizes too small than it should could not wear. It had to give it away. \" Read more \" ...Fabric feels nice and dress looks beautiful on \" Read more 24 customers mention fit, 24 positive, 0 negative 24 customers mention \"Fit\" 24 positive 0 negative Customers like how the dress fits, with one mentioning it comfortably hugs the curves, while another notes it's not too long. \" ...It’s just like the picture. I can’t wait to wear this dress. Amazing fit . My girls (breast) are so happy. If you are thinking about it, go for it \" Read more \" ...This dress is stretchy, flattering, fits perfectly , looks exactly like the picture AND I put it in the washing machine on delicate and it held up... \" Read more \" Great for a candlelight orchestra event. Fit perfect and was comfortable. Formal but not too formal. Flirty but yet classy. \" Read more \" Absolutely love the fit of this dress . As soon as I slipped it on, it felt comfortable. Fabric feels nice and dress looks beautiful on \" Read more 18 customers mention quality, 17 positive, 1 negative 18 customers mention \"Quality\" 17 positive 1 negative Customers love this dress, with one mentioning it's great for wedding guests. \" Good quality . Looks great on and very flattering. Received a lot of compliments. Wore shapewear underneath and wasn’t able to see with front slit.... \" Read more \" Mystery Stain but nice dress ... \" Read more \" Love this dress . Very flattering for anyone with a tummy. \" Read more \" ...Other than this issue, the dress is perfect .... \" Read more 17 customers mention flattering, 15 positive, 2 negative 17 customers mention \"Flattering\" 15 positive 2 negative Customers find the dress flattering, with one mentioning how the ruching helps hide problem areas like the tummy, while another notes how it comfortably hugs the curves. \" Good quality. Looks great on and very flattering . Received a lot of compliments. Wore shapewear underneath and wasn’t able to see with front slit.... \" Read more \" ...So if you have curves, size up. It’s super flattering and sexy!!! I’m returning the medium and buying more colors in large.... \" Read more \" I love this dress, it’s so flattering . I risked ordering down instead of up. When suggested size up, I do.... \" Read more \" ...This dress is stretchy, flattering , fits perfectly, looks exactly like the picture AND I put it in the washing machine on delicate and it held up... \" Read more 11 customers mention comfort, 11 positive, 0 negative 11 customers mention \"Comfort\" 11 positive 0 negative Customers find the dress comfortable. \" Great for a candlelight orchestra event. Fit perfect and was comfortable . Formal but not too formal. Flirty but yet classy. \" Read more \" Love this dress! It was very comfortable \" Read more \" ...Length is great and was very comfortable on . \" Read more \" ... Very comfy & If it gets wet oh well. It’s not $$$$. \" Read more 8 customers mention stretchiness, 7 positive, 1 negative 8 customers mention \"Stretchiness\" 7 positive 1 negative Customers like the dress's stretchiness. \" Very Stretchy and Comfortable order your size it WILL FIT...SUPER CUTE FOR ANY SHAPE I PROMISE ... I'm getting another \" Read more \" ...The material has a nice stretch to it as well. The design is flattering to many body types. \" Read more \" Ohhhh this is fire! It’s very very stretchy , comfortably hugs the curves, not too long. I’m 5’2, 160lbs and got a medium. Perfect size! \" Read more \" ...My bust is 40 DDD. The fit is fabulous because the fabric is a stretchy and the folds accentuate your curves.... \" Read more 12 customers mention fabric quality, 5 positive, 7 negative 12 customers mention \"Fabric quality\" 5 positive 7 negative Customers have mixed opinions about the fabric quality of the dress, with some finding it perfect while others describe it as cheap. \" Awful fabric . Awful construction. Don't waste your time or money. Pulled stitches, pulled fabric even when not on.... \" Read more \" ...As soon as I slipped it on, it felt comfortable. Fabric feels nice and dress looks beautiful on \" Read more \" I love the style of design but I did not like the fabric at all . I’m 5’4” and 180Lbs \" Read more \" Fits perfectly, material is cozy , looks elegant but casual \" Read more 8 customers mention stitching quality, 1 positive, 7 negative 8 customers mention \"Stitching quality\" 1 positive 7 negative Customers report poor stitching and construction of the dress. \" ... Stitching is not well done . Had to return it. \" Read more \" Seam at the waist just below the dip of the V-neck was very poorly stitched . Otherwise it was nice when I tried it on. \" Read more \" ... Very cheaply made . \" Read more \" Not well made . It’s very stretchy, but the seams pulls and it looks like it’s coming undone. \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Well worth it!",
        "body": "Love thevway it sits on my body. Several compliments! Its gorgeous. The material is thin..but not see- through. Also it's very giving and covers up those lumps and bumps with the rusching. Read more",
        "author": "patty tapia",
        "rating": 5.0,
        "date": "October 17, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars This dress is fabulous! ♥️",
        "body": "I bought this dress for my birthday and it looked fantastic! The fit was true to size and it was comfortable. I was the Belle of the ball! The color and design is awesome, I love it! Read more",
        "author": "Denise Greene",
        "rating": 5.0,
        "date": "October 22, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71xhSOpXaZL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "4.0 out of 5 stars Sooo Many Compliments!!",
        "body": "I was skeptical but WOW this dress was a hit at a wedding I attended! I have a big boobs so I used cakes to cover the nips and hold my tatas back from popping out. This dress is stretchy, flattering, fits perfectly, looks exactly like the picture AND I put it in the washing machine on delicate and it held up great. I’ll be wearing this again, great addition to my wardrobe! Read more",
        "author": "Ellie De Marchis",
        "rating": 4.0,
        "date": "September 2, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71Ycc1mE3EL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/81l-prFrl+L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "1.0 out of 5 stars Cheaply made",
        "body": "I washed it once and threading started to unravel not made well but was cute while it lasted Read more",
        "author": "Tiffani teran",
        "rating": 1.0,
        "date": "October 11, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Great choice, great fit",
        "body": "I am 5 for 9 and 230lbs. My bust is 40 DDD. The fit is fabulous because the fabric is a stretchy and the folds accentuate your curves. You will need the right bottoms or you will have panty lines. Love this dresss. Read more",
        "author": "bigkev",
        "rating": 5.0,
        "date": "October 5, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71TjeTaNJTL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "3.0 out of 5 stars Cute fit but off white and expected silky material!",
        "body": "The style of the dress is super cute but when I recieved it the color was more of an off white and the material was rayeon and I was expecting a higher quality. It had a great fit for my girlie's with a little extra tummy! Read more",
        "author": "Morning Glory",
        "rating": 3.0,
        "date": "October 15, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Sexy",
        "body": "Yeeeeessssss. Fits in all the right places. The extenuating of the curves is always a plus. Read more",
        "author": "Jessica Stewart",
        "rating": 5.0,
        "date": "November 26, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Definitely worth a try. I’m very happy I did!",
        "body": "I love this dress, it’s so flattering. I risked ordering down instead of up. When suggested size up, I do. I usually order 2X based on bust size but then bottom 1/2 is usually big or too loose. So after reading it has good stretch I ordered the 1X vs 2X & I’m glad I did, it’s amazing. The stomach and butt are relaxed & the bust had enough stretch but not so much it pulls too far apart. It can still be a plunge V line or I can wear a camisole. Depends on where I wear it. (Other reviews mention some white piece, I have no idea what they are referring to) Idk what the fabric is and no it’s not a top notch quality dress nor does it feel like it’s going to fall apart. It’s something you can wear to a nice dinner then kick your heels off and walk on the beach. Very comfy & If it gets wet oh well. It’s not $$$$. Read more",
        "author": "Sam C",
        "rating": 5.0,
        "date": "September 18, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Dress Ruched Bodycon V Neck is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.",
  "about_this_item": "Womens Dress Ruched Bodycon V Neck is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.",
  "long_description": "Womens Dress Ruched Bodycon V Neck is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Red, Brown, A-black, Blue, Solid Black. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Dress Ruched Bodycon V Neck is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Red, Brown, A-black, Blue, Solid Black. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "98e2dd7d-30d8-4f95-b3f9-e9e7a90f7c9f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/98e2dd7d-30d8-4f95-b3f9-e9e7a90f7c9f/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/98e2dd7d-30d8-4f95-b3f9-e9e7a90f7c9f/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/c883ec2e-96dd-4be3-81a3-bcceea86c256.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "6b4841a3-a457-4faa-8212-59b98b94f059",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6b4841a3-a457-4faa-8212-59b98b94f059/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6b4841a3-a457-4faa-8212-59b98b94f059/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/c883ec2e-96dd-4be3-81a3-bcceea86c256.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "40e28dcf-0173-49cb-84a4-90c10447a097",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/40e28dcf-0173-49cb-84a4-90c10447a097/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/40e28dcf-0173-49cb-84a4-90c10447a097/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/c883ec2e-96dd-4be3-81a3-bcceea86c256.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "63954983-baa4-44a0-a8e6-79bc9cdf6bd9",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/63954983-baa4-44a0-a8e6-79bc9cdf6bd9/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/63954983-baa4-44a0-a8e6-79bc9cdf6bd9/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/c883ec2e-96dd-4be3-81a3-bcceea86c256.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "76d70d69-5671-475b-bf45-7b954d5cbc0d",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/76d70d69-5671-475b-bf45-7b954d5cbc0d/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/76d70d69-5671-475b-bf45-7b954d5cbc0d/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/c883ec2e-96dd-4be3-81a3-bcceea86c256.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "34fda5ca-c3ef-45c2-816a-39bde7da6bbc",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/34fda5ca-c3ef-45c2-816a-39bde7da6bbc/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/34fda5ca-c3ef-45c2-816a-39bde7da6bbc/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/c883ec2e-96dd-4be3-81a3-bcceea86c256.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "a95a8c39-643c-46b2-be08-9f2efd6df19e",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a95a8c39-643c-46b2-be08-9f2efd6df19e/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a95a8c39-643c-46b2-be08-9f2efd6df19e/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/c883ec2e-96dd-4be3-81a3-bcceea86c256.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "7ab34178-7abe-4f82-b889-33bbf86e426e",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7ab34178-7abe-4f82-b889-33bbf86e426e/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7ab34178-7abe-4f82-b889-33bbf86e426e/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/c883ec2e-96dd-4be3-81a3-bcceea86c256.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "9f9126fe-4f1f-4cb8-a4c9-5b2334e47a57",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9f9126fe-4f1f-4cb8-a4c9-5b2334e47a57/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9f9126fe-4f1f-4cb8-a4c9-5b2334e47a57/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/c883ec2e-96dd-4be3-81a3-bcceea86c256.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "91aee0c5-ea2b-414f-852c-656ff176026d",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/91aee0c5-ea2b-414f-852c-656ff176026d/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/91aee0c5-ea2b-414f-852c-656ff176026d/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/c883ec2e-96dd-4be3-81a3-bcceea86c256.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "305d8f23-0203-40b2-a3d7-858d281a5f51",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/305d8f23-0203-40b2-a3d7-858d281a5f51/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/305d8f23-0203-40b2-a3d7-858d281a5f51/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/c883ec2e-96dd-4be3-81a3-bcceea86c256.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "4e2e7405-85c9-4203-b5c6-5d1ba18e25e0",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4e2e7405-85c9-4203-b5c6-5d1ba18e25e0/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4e2e7405-85c9-4203-b5c6-5d1ba18e25e0/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/c883ec2e-96dd-4be3-81a3-bcceea86c256.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Red": "https://m.media-amazon.com/images/I/31noXvbnIbL._AC_SR38,50_.jpg",
    "Brown": "https://m.media-amazon.com/images/I/31sIsCqyPIL._AC_SR38,50_.jpg",
    "A-black": "https://m.media-amazon.com/images/I/31EPL7MggmL._AC_SR38,50_.jpg",
    "Blue": "https://m.media-amazon.com/images/I/31FqbsC3vaL._AC_SR38,50_.jpg",
    "Solid Black": "https://m.media-amazon.com/images/I/315fAL-g5uL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Red": "41R9fXEpJQL",
    "Brown": "51djhX9xkrL",
    "A-black": "51P0kVASvyL",
    "Blue": "515YKSmgQqL",
    "Solid Black": "41x05pbS8gL"
  },
  "color_images": {
    "Red": [
      "https://m.media-amazon.com/images/I/41R9fXEpJQL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61hNdJ1x1fL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61d854LLThL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61bTYvGTFnL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61HtI7mgUtL._SL1500_.jpg"
    ],
    "Brown": [
      "https://m.media-amazon.com/images/I/51djhX9xkrL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61DcE7iTGUL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61cyOh+3okL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61dr0NP6IpL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/51GElM86dqL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71HDvHjfKgL._SL1500_.jpg"
    ],
    "A-black": [
      "https://m.media-amazon.com/images/I/51P0kVASvyL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61dqwWoyhFL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61MfzUuvXtL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61Mdhhc0FPL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/51DbtUWqXkL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/51xTRL7DZwL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/719CtZj0CfL._SL1500_.jpg"
    ],
    "Blue": [
      "https://m.media-amazon.com/images/I/515YKSmgQqL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/618uJSV2y0L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61JIcYYpGTL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61hOAkVAgjL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61xfaccIihL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61+3HdWbVnL._SL1500_.jpg"
    ],
    "Solid Black": [
      "https://m.media-amazon.com/images/I/41x05pbS8gL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/617WHeSnzJL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/610tNTLzYBL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61UAHp1jWCL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/611pP9XMflL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61zWUnQRPhL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-evening-v-neck-formal",
      "title": "Womens Maxi Dress Evening V Neck Formal",
      "price": 89.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61N7xSWWaVL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-bodycon-cocktail-sleeveless",
      "title": "Womens Maxi Dress Maxi Bodycon Cocktail Sleeveless",
      "price": 43.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/41Y-qNIH8+L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-formal-evening",
      "title": "Womens Dress Formal Evening",
      "price": 74.94,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51j+OhQCMyL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 103.97,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/618s-d7jZsL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal",
      "title": "Womens Maxi Dress Formal",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61IcEYiG5oL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress-sleeveless-bodycon",
      "title": "Womens Dress Sleeveless Bodycon",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71KG9wan6yL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-short-sleeve-maxi-v-neck",
      "title": "Womens Maxi Dress Formal Short Sleeve Maxi V Neck",
      "price": 29.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/81GUSHJv+RL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 44.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/612YeIbUQOL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-bodycon-long-sleeve-maxi",
      "title": "Womens Maxi Dress Cocktail Bodycon Long Sleeve Maxi",
      "price": 69.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/51VFqKA840L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 54.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71ES22A0NiL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail",
      "title": "Womens Dress Cocktail",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/71-dsEQ5yOL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 368.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/41a7iAOfywL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-cocktail",
      "title": "Womens Maxi Dress Formal Cocktail",
      "price": 30.38,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/71goFS8akNL._SL1500_.jpg"
      ]
    }
  ]
}