{
  "id": "womens-maxi-dress-cocktail-formal-long-sleeve-v-neck",
  "handle": "womens-maxi-dress-cocktail-formal-long-sleeve-v-neck",
  "sku": "JC3187",
  "asin": "B0F7LRBCWM",
  "title": "Womens Maxi Dress Cocktail Formal Long Sleeve V Neck",
  "title_original": "ZAFUL Womens Long Sleeve Velvet Dress 2025 Fall V Neck Holiday Cocktail Party Semi Formal Midi Dresses for Wedding Guest",
  "brand": "Visit the ZAFUL Store",
  "price": 58.99,
  "social_proof": {
    "bought_past_month": 230,
    "text": "230+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/71uH8PBprDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/714Q3J4uSCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/717J2QX9SRL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Go360Q62L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81r6ch3F6DL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91ozA6TLHCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71mszn9TUWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81yznojcL0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71sch3LF3cL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ex21pHMGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71gTTy2fS9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ivhNpvt9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71w-uTK8iAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/717-fKl9TPL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61mHFWO9uZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71gTSIjRp-L._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/71uH8PBprDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/714Q3J4uSCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/717J2QX9SRL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Go360Q62L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81r6ch3F6DL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91ozA6TLHCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71mszn9TUWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81yznojcL0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71sch3LF3cL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ex21pHMGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71gTTy2fS9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ivhNpvt9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71w-uTK8iAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/717-fKl9TPL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61mHFWO9uZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71gTSIjRp-L._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ August 10, 2025",
    "ASIN ‏": "‎ B0F7LQ3GLC",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#42,509 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #310 in Women's Formal Dresses",
    "Customer Reviews": "4.0 4.0 out of 5 stars (73)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Red",
      "Brown",
      "Gold",
      "Wine Red",
      "Blue",
      "Royal Blue",
      "Black",
      "Champagne",
      "Green"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.0,
    "count": 73,
    "customers_say": "Customers find the dress beautiful in color, comfortable, and of good quality, with one noting it's perfect for Christmas. The material receives mixed feedback - while many find it soft, one customer mentions it feels cheap. Customers disagree on the fit, with some saying the size M fits just right while others find the top doesn't sit well. The dress's size and dressiness receive mixed reviews, with some finding it true to size while others say it's too big, and opinions vary on how versatile it is for different occasions. Generated from the text of customer reviews Select to learn more Color (18) Comfort (9) Dress quality (6) Fit (12) Material quality (7) Size (5) Dressiness (4) 18 customers mention color, 14 positive, 4 negative 18 customers mention \"Color\" 14 positive 4 negative Customers like the dress's color, with one mentioning it looks very expensive and another noting it will be perfect for Christmas. \" BEAUTIFUL dress and looks high end! Purchased for Christmas photos! 5’2 / 150 / size medium \" Read more \" Pretty , but I couldn’t use it for my planned activity, attending a wedding. It would be great for a ren faire (some sort of rich wench?)... \" Read more \" Absolutely beautiful dress . Fit perfectly (and I have curves). Very comfortable to wear! \" Read more \" The color is bland . The front should be sewn up instead of having two buttons with elastic loops. The double waist is too long.... \" Read more 9 customers mention comfort, 8 positive, 1 negative 9 customers mention \"Comfort\" 8 positive 1 negative Customers find the dress comfortable. \" ...The waist is flattering and comfortable . I was pleasantly surprised by the two buttons which allow you to adjust your cleavage showing.... \" Read more \" ...This dress is very comfortable and can be dressy for any occasion. \" Read more \" Beautiful and comfortable dress ! Looks very expensive! True to size! \" Read more \" ...It is stretchy and therefore very comfy to wear . I will most likely order it in one more color. I am 5'5\" 140pounds and size M fits just right. \" Read more 6 customers mention dress quality, 6 positive, 0 negative 6 customers mention \"Dress quality\" 6 positive 0 negative Customers find the dress to be really great, with one mentioning it's perfect for evening and holiday occasions. \" Really great dress . Alittle on the bohemian side but I still really liked it \" Read more \" Great dress !... \" Read more \" great dress to buy ... \" Read more \" Perfect for Christmas ... \" Read more 12 customers mention fit, 8 positive, 4 negative 12 customers mention \"Fit\" 8 positive 4 negative Customers have mixed opinions about the dress's fit, with some finding the size M comfortable while others report issues with the top not sitting well. \" Great fit . Wore for a wedding. True to size. Blue color was stunning \" Read more \" ...It fits a little large everywhere except the bust and was not too terrible long on me even though I am just 5' 2\". \" Read more \" ...The fabric is a lovely weight that moves really nicely. The waist is flattering and comfortable.... \" Read more \" ...Apparently the company paid attention! This is sewn and very modest neckline , no gaping or cleavage show! Fabric is soft, comfortable, and flows!... \" Read more 7 customers mention material quality, 4 positive, 3 negative 7 customers mention \"Material quality\" 4 positive 3 negative Customers have mixed opinions about the dress's material quality, with some finding it gorgeous and soft, while others note it feels cheap and thin. \" ...This is sewn and very modest neckline, no gaping or cleavage show! Fabric is soft , comfortable, and flows! I only wish this dress had pockets!... \" Read more \" Pretty wine color but material is thin and makes the dress look cheap. \" Read more \" The material is gorgeous and the color very pretty. I did not feel the bust was comfortable and feel I may be too busty for it.... \" Read more \" ...I am a smaller bust, but still looks and fits fine. Material feels a little cheap . \" Read more 5 customers mention size, 3 positive, 2 negative 5 customers mention \"Size\" 3 positive 2 negative Customers have mixed opinions about the dress's sizing, with some finding it true to size while others report it being too big. \" Great fit. Wore for a wedding. True to size . Blue color was stunning \" Read more \" Too big and very heavy \" Read more \" Really cute! Looks nice and true to size for me . I am a smaller bust, but still looks and fits fine. Material feels a little cheap. \" Read more \" ...The amount of material on the bottom is flowy and full . I returned. I felt the bottom was too much for the top not fitting as well.... \" Read more 4 customers mention dressiness, 2 positive, 2 negative 4 customers mention \"Dressiness\" 2 positive 2 negative Customers have mixed opinions about the dress's versatility, with some finding it suitable for various occasions, while others mention it's not appropriate for their needs. \" ...It would be great for a ren faire (some sort of rich wench?) or Halloween costume (hot witch?). \" Read more \" Not to dressy but very upscale... \" Read more \" ...This dress is very comfortable and can be dressy for any occasion . \" Read more \" Pretty, but not right for my purposes ... \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Gorgeous color",
        "body": "Absolutely gorgeous dress! I saw previous reviews complaining about the buttons and gaps. Apparently the company paid attention! This is sewn and very modest neckline, no gaping or cleavage show! Fabric is soft, comfortable, and flows! I only wish this dress had pockets! I'll be wearing this to Christmas dinner. For reference, I'm a sz 12 to 14. I ordered the XL, I think Lg would've worked, but I like a looser fit. I'm 5'1 so I may hem this as it comes to my ankles. Still happy with the style, fit, and color! Read more",
        "author": "Life full of lemons",
        "rating": 5.0,
        "date": "December 3, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71TwRb+KARL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/811eHCtklHL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "4.0 out of 5 stars Perfect for Christmas",
        "body": "Really cute! Looks nice and true to size for me. I am a smaller bust, but still looks and fits fine. Material feels a little cheap. Read more",
        "author": "Michelle Weaver",
        "rating": 4.0,
        "date": "October 10, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Beautiful dress!",
        "body": "Gorgeous and SO comfortable! I wore this for family photos and received so many compliments. It fits a little large everywhere except the bust and was not too terrible long on me even though I am just 5' 2\". Read more",
        "author": "Niki Rose",
        "rating": 5.0,
        "date": "December 9, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/81WXXJh0TKL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars The perfect evening and/or holiday dress",
        "body": "Absolutely beautiful dress. Fit perfectly (and I have curves). Very comfortable to wear! Read more",
        "author": "JHall",
        "rating": 5.0,
        "date": "November 22, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Not great for a busty person, beautiful fabric",
        "body": "The material is gorgeous and the color very pretty. I did not feel the bust was comfortable and feel I may be too busty for it. The amount of material on the bottom is flowy and full. I returned. I felt the bottom was too much for the top not fitting as well. For reference I am 5’5” and weigh 185 lbs. I normally wear a large but I couldn’t tell if it was too big or too small. Read more",
        "author": "Mary",
        "rating": 3.0,
        "date": "November 9, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "2.0 out of 5 stars Color is wrong",
        "body": "Not the same color!! Ordered Champagne and got brown.. This is not the same as pictured at all. Ordered to color coordinate a photo shoot and big fail on that end. Fit and comfort is fine for the price. Read more",
        "author": "Tara",
        "rating": 2.0,
        "date": "December 17, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71ZYNGfU6WL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "4.0 out of 5 stars Color off.",
        "body": "Prrtty but color was quite different than pictured so I returned it. Read more",
        "author": "MJ",
        "rating": 4.0,
        "date": "November 23, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Size up if you have a larger waist, true to size.",
        "body": "Love this dress, perfect fit but if you do not have a small waist you will need to size up. The quality of the material is a bit thicker so it is just right to wear on a cold weather day. This dress is very comfortable and can be dressy for any occasion. Read more",
        "author": "Elizabeth Calderon",
        "rating": 5.0,
        "date": "December 20, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Cocktail Formal Long Sleeve V Neck is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.",
  "about_this_item": "Womens Maxi Dress Cocktail Formal Long Sleeve V Neck is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.",
  "long_description": "Womens Maxi Dress Cocktail Formal Long Sleeve V Neck is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Red, Brown, Gold, Wine Red, Blue, Royal Blue, Black, Champagne, Green. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Cocktail Formal Long Sleeve V Neck is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Red, Brown, Gold, Wine Red, Blue, Royal Blue, Black, Champagne, Green. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "a73c3e26-dcef-4809-b58e-ac5bfe997fa1",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a73c3e26-dcef-4809-b58e-ac5bfe997fa1/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a73c3e26-dcef-4809-b58e-ac5bfe997fa1/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/14bdc108-6e3c-4a7d-a940-066d9c6ae4df.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "414d5ae5-c83a-4c9e-9212-73d521b8719a",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/414d5ae5-c83a-4c9e-9212-73d521b8719a/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/414d5ae5-c83a-4c9e-9212-73d521b8719a/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/14bdc108-6e3c-4a7d-a940-066d9c6ae4df.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "464e07da-d837-4692-a1db-e2c4677730ca",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/464e07da-d837-4692-a1db-e2c4677730ca/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/464e07da-d837-4692-a1db-e2c4677730ca/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/14bdc108-6e3c-4a7d-a940-066d9c6ae4df.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "6c868c40-673d-4473-8671-6f358eff2aa4",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6c868c40-673d-4473-8671-6f358eff2aa4/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6c868c40-673d-4473-8671-6f358eff2aa4/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/14bdc108-6e3c-4a7d-a940-066d9c6ae4df.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "dccaa445-a510-4de0-b2a1-e19c7a258243",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/dccaa445-a510-4de0-b2a1-e19c7a258243/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/dccaa445-a510-4de0-b2a1-e19c7a258243/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/14bdc108-6e3c-4a7d-a940-066d9c6ae4df.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "97f8f7e8-0542-48fc-aa19-c2d80b343055",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/97f8f7e8-0542-48fc-aa19-c2d80b343055/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/97f8f7e8-0542-48fc-aa19-c2d80b343055/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/14bdc108-6e3c-4a7d-a940-066d9c6ae4df.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "b740ce78-cbc4-4f65-a70f-ea3882b9a09d",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b740ce78-cbc4-4f65-a70f-ea3882b9a09d/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b740ce78-cbc4-4f65-a70f-ea3882b9a09d/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/14bdc108-6e3c-4a7d-a940-066d9c6ae4df.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "d5f079a2-084a-4914-8a4b-8deceedb8ebc",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d5f079a2-084a-4914-8a4b-8deceedb8ebc/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d5f079a2-084a-4914-8a4b-8deceedb8ebc/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/14bdc108-6e3c-4a7d-a940-066d9c6ae4df.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "2fcd6b3b-6984-41ee-84ee-259ee981ad86",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2fcd6b3b-6984-41ee-84ee-259ee981ad86/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2fcd6b3b-6984-41ee-84ee-259ee981ad86/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/14bdc108-6e3c-4a7d-a940-066d9c6ae4df.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "6ab62a95-5b5b-45c3-8cbb-b3fd60cc0471",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6ab62a95-5b5b-45c3-8cbb-b3fd60cc0471/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6ab62a95-5b5b-45c3-8cbb-b3fd60cc0471/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/14bdc108-6e3c-4a7d-a940-066d9c6ae4df.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "713c6126-7824-40c6-8173-039a75d8f075",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/713c6126-7824-40c6-8173-039a75d8f075/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/713c6126-7824-40c6-8173-039a75d8f075/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/14bdc108-6e3c-4a7d-a940-066d9c6ae4df.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "43af0f54-4d56-4b49-a6fb-f8fa888b4d7a",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/43af0f54-4d56-4b49-a6fb-f8fa888b4d7a/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/43af0f54-4d56-4b49-a6fb-f8fa888b4d7a/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/14bdc108-6e3c-4a7d-a940-066d9c6ae4df.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Red": "https://m.media-amazon.com/images/I/41ydTqa8BGL._AC_SR38,50_.jpg",
    "Brown": "https://m.media-amazon.com/images/I/411n1Z02xAL._AC_SR38,50_.jpg",
    "Gold": "https://m.media-amazon.com/images/I/410c+KjHLAL._AC_SR38,50_.jpg",
    "Wine Red": "https://m.media-amazon.com/images/I/41QI0aybVUL._AC_SR38,50_.jpg",
    "Blue": "https://m.media-amazon.com/images/I/416666lO4lL._AC_SR38,50_.jpg",
    "Royal Blue": "https://m.media-amazon.com/images/I/4186MeZ4x8L._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31907WhtaUL._AC_SR38,50_.jpg",
    "Champagne": "https://m.media-amazon.com/images/I/31EaCiVzDFL._AC_SR38,50_.jpg",
    "Green": "https://m.media-amazon.com/images/I/41LJou7AkRL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Red": "71sch3LF3cL",
    "Brown": "71ex21pHMGL",
    "Gold": "71gTTy2fS9L",
    "Wine Red": "71uH8PBprDL",
    "Blue": "71ivhNpvt9L",
    "Royal Blue": "71w-uTK8iAL",
    "Black": "717-fKl9TPL",
    "Champagne": "61mHFWO9uZL",
    "Green": "71gTSIjRp-L"
  },
  "color_images": {
    "Red": [
      "https://m.media-amazon.com/images/I/71sch3LF3cL._SL1500_.jpg"
    ],
    "Brown": [
      "https://m.media-amazon.com/images/I/71ex21pHMGL._SL1500_.jpg"
    ],
    "Gold": [
      "https://m.media-amazon.com/images/I/71gTTy2fS9L._SL1500_.jpg"
    ],
    "Wine Red": [
      "https://m.media-amazon.com/images/I/71uH8PBprDL._SL1500_.jpg"
    ],
    "Blue": [
      "https://m.media-amazon.com/images/I/71ivhNpvt9L._SL1500_.jpg"
    ],
    "Royal Blue": [
      "https://m.media-amazon.com/images/I/71w-uTK8iAL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/717-fKl9TPL._SL1500_.jpg"
    ],
    "Champagne": [
      "https://m.media-amazon.com/images/I/61mHFWO9uZL._SL1500_.jpg"
    ],
    "Green": [
      "https://m.media-amazon.com/images/I/71gTSIjRp-L._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-maxi",
      "title": "Womens Maxi Dress Maxi",
      "price": 46.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/81MG1MAn2FL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-split-maxi-long-sleeve",
      "title": "Womens Maxi Dress Split Maxi Long Sleeve",
      "price": 18.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61tOVhv9IVL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-short-sleeve-split-bodycon-ruched-high-split-boat-neck",
      "title": "Womens Maxi Dress Short Sleeve Split Bodycon Ruched High Split Boat Neck",
      "price": 47.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51NZ2UbUgoL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 84.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61TPkVHwqkL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-cocktail",
      "title": "Womens Maxi Dress Long Sleeve Cocktail",
      "price": 35.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61szAHC9bIL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress-formal",
      "title": "Womens Dress Formal",
      "price": 75.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61PMgdXV6wL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-bodycon",
      "title": "Womens Maxi Dress Long Sleeve Bodycon",
      "price": 11.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/712UY0mltbL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-ruched-cocktail-bodycon-one-shoulder",
      "title": "Womens Dress Ruched Cocktail Bodycon One Shoulder",
      "price": 55.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/614gNsWeueL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-evening",
      "title": "Womens Dress Evening",
      "price": 37.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51X3FTelb4L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-bodycon-boat-neck",
      "title": "Womens Dress Bodycon Boat Neck",
      "price": 29.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61WEuVl80xL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 145.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61TqENaLjiL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-bodycon-cocktail",
      "title": "Womens Maxi Dress Long Sleeve Bodycon Cocktail",
      "price": 29.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71uLDl8TnLL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-sleeveless",
      "title": "Womens Maxi Dress Evening Sleeveless",
      "price": 76.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51RVwRrNYEL._SL1500_.jpg"
      ]
    }
  ]
}