{
  "id": "womens-dress",
  "handle": "womens-dress",
  "sku": "JC1596",
  "asin": "B0F7FBVZVP",
  "title": "Womens Dress",
  "title_original": "GRACE KARIN Work Dresses for Women 2025 3/4 Sleeve Fit and Flare Business Midi Dress Classy Office Dresses with Pockets",
  "brand": "Visit the GRACE KARIN Store",
  "price": 42.99,
  "social_proof": {
    "bought_past_month": 141,
    "text": "141+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/610ibAREFTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81GyqSeq7aL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71eB9RK9x8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/715o-jDkfjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61LGd8EFzyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/617ABLuxBML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ZRxQkkNNL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61MCUSSWYqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61v0hoLFY0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Ge4txwfyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61KzNRE8NvL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61r5pmmMotL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61+X9VRbVlL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/612EPRSkARL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61juLXPjf9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61r52NNgl2L._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/610ibAREFTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81GyqSeq7aL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71eB9RK9x8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/715o-jDkfjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61LGd8EFzyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/617ABLuxBML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ZRxQkkNNL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61MCUSSWYqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61v0hoLFY0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Ge4txwfyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61KzNRE8NvL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61r5pmmMotL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61+X9VRbVlL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/612EPRSkARL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61juLXPjf9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61r52NNgl2L._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Item model number ‏": "‎ CL0203A25-LYF",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ June 13, 2025",
    "ASIN ‏": "‎ B0F7FF3ZST",
    "Best Sellers Rank": "#30,759 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #11 in Women's Wear to Work Dresses",
    "Customer Reviews": "4.2 4.2 out of 5 stars (223)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Work",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Black",
      "Dusty Blue",
      "Navy Blue",
      "Red",
      "Wine Red",
      "Purple",
      "Peacock Blue",
      "Blue Green",
      "Royal Blue",
      "Amy Green",
      "Light Pink",
      "Green",
      "Light Khaki"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.2,
    "count": 223,
    "customers_say": "Customers find the dress versatile, suitable for both work and church occasions, and appreciate its good quality and fabric thickness. They like its color and comfort, with one customer noting it can be dressed up or down. The fit receives mixed feedback, with some finding it nice while others describe it as tight around the bust and ribcage. The fabric weight also gets mixed reviews, with some praising it while others find it too heavy. Select to learn more Style Quality Material quality Dress for occasion Comfort Color Fit Fabric weight 32 customers mention \"Style\" 32 positive 0 negative Customers find the dress lovely looking, with one mentioning it can be dressed up or down. \" Beautiful dress . Very good quality. Material soft and not see through. Five Stars... Also, I own the Royal Blue dress....\" Read more \"This dress is cute and well made but way too big for me. I’m 5’2” 115 lbs.\" Read more \"This dress is beautiful ! The cut is flattering and the color is outstanding! I ordered the wine color, and it is gorgeous!...\" Read more \"This dress was gorgeous . The material was nice, not to heavy and not are through. I returned because it was a little big on me.\" Read more 21 customers mention \"Quality\" 18 positive 3 negative Customers find the dress to be of good quality and consider it a great bargain. \" Great dress if you want to fit in at Amish country or look like you work at Der Dutchman. Unflattering fit and does not look like the listing photos\" Read more \"This dress is a great bargan because it comes in many colores, black, blue and red, just to name a few....\" Read more \"This dress is cute and well made but way too big for me. I’m 5’2” 115 lbs.\" Read more \"I bought this to wear in holiday party Material is soft, good quality , good length\" Read more 19 customers mention \"Material quality\" 14 positive 5 negative Customers like the material of the dress, noting its good thickness and nice texture. \" Great Material , size I ordered is L (it is to big), so I have to return it, and yes it is a true \"wine red\", I was hoping it would be more...\" Read more \"I love the feel of the fabric . The pockets are definitely gets five stars.\" Read more \"Very nice three-season dress. The fabric is not what I expected . I expected a lighter weight. It is more of a fall/winter-weight dress....\" Read more \"Really pretty, maybe order a size down. The fabric is nice , not see through. Cut in an hour glass shape. Nice length. Overall perfect for work.\" Read more 13 customers mention \"Dress for occasion\" 13 positive 0 negative Customers find the dress versatile, suitable for various occasions including work, church, and special events. \"Love the color, material and fit. It’s great for work and bold color\" Read more \"...good black dress to have in the closet for funerals since it’s an all season dress ....\" Read more \" Perfect dress for a funeral i had to attend unexpectedly, unfortunately. Didn’t wrinkle in the suitcase, modest enough and simple and comfortable....\" Read more \"This was the perfect interview dress . So comfortable yet flattering....\" Read more 11 customers mention \"Comfort\" 11 positive 0 negative Customers find the dress comfortable. \"...The dress itself is comfortable , but I'm not in love with the material... it isn't as soft as I would like....\" Read more \"This was the perfect interview dress. So comfortable yet flattering....\" Read more \"...On the color and fit! And, it was very comfortable . I am sure I can find an event to wear it again!\" Read more \"...It’s extremely comfortable and not too heavy either! I will be wearing this in winter months for Christmas pictures with my family....\" Read more 10 customers mention \"Color\" 9 positive 1 negative Customers love the color of the dress, with one mentioning it comes in multiple shades. \" Love the color , material and fit. It’s great for work and bold color\" Read more \"...It’s a good black dress to have in the closet for funerals since it’s an all season dress....\" Read more \"...Received so many compliments on this dress. Love the navy blue color ! I usually wear a size 10 or 12 ~ ordered a medium and a large....\" Read more \"... Color is a beautiful Navy , as in picture.\" Read more 33 customers mention \"Fit\" 23 positive 10 negative Customers have mixed opinions about the dress's fit, with some finding it nice while others report it being too big and tight around the bust and ribcage. \" Perfect fit , comfortable and loved the color!\" Read more \"Very flattering dress. Beautiful fit and flow when walking and I received a lot of compliments. Will be purchasing more....\" Read more \"... Unflattering fit and does not look like the listing photos\" Read more \"...I am 5’4” 120# and ordered the Med. the fit was perfect , material was a nice weight for fall....\" Read more 13 customers mention \"Fabric weight\" 9 positive 4 negative Customers have mixed opinions about the dress's fabric weight, with some finding it fantastic while others say it's too heavy. \"...Will be purchasing more. Fabric is light weight , and I loved the idea of having pockets for small items that you may need on your person\" Read more \"I love the weight of the fabric . true to size. Great for church\" Read more \"I like the dress, some weight to the fabric . Need to lose weight or would have kept it.\" Read more \"Very nice detailing. Mid weight fabric . Nice neckline. A true 14.\" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Beautiful, Comfortable, Wrinkle-Free",
        "body": "So comfortable, love the little longer length, material is beautiful, does not wrinkle. Received so many compliments on this dress. Love the navy blue color! I usually wear a size 10 or 12 ~ ordered a medium and a large. Both fit fine but the large has a little more room in the waist. Would highly recommend. Read more",
        "author": "Deb",
        "rating": 5.0,
        "date": "October 15, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Cute dress",
        "body": "Beautiful dress, very stylish and perfect for any occasion. Material is better than expected and love the pockets! Read more",
        "author": "Zoe L.",
        "rating": 5.0,
        "date": "December 23, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Fit and quality",
        "body": "Really cute dress. Didn't fit me. Size ordered was small. Top part of the dress was to large. Even though this is a stretching material. Read more",
        "author": "Brenda Weaver",
        "rating": 4.0,
        "date": "October 5, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Size down!",
        "body": "I typically wear a size large because I don’t like things too tight. This dress i purchased in a size medium due to other reviews and I agree a medium was a great choice. I am 5’6 174 pounds and this dress is very elegant not too tight not too loose or long. It’s extremely comfortable and not too heavy either! I will be wearing this in winter months for Christmas pictures with my family. I purchased this item in black and I bought a black and gold belt to go on the waistband. Read more",
        "author": "Angela",
        "rating": 5.0,
        "date": "September 19, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Pretty dress but pocket placement is unfortunate.",
        "body": "The dress is a gorgeous color of royal blue. I love the neckline and flattering 3/4 sleeves. The material feels a bit cheap and was pretty wrinkled on arrival. I am returning it because the pockets are positioned too much at the hip. The pockets jut out and make me look like I have fuller hips which is unflattering. I have wide hips and do not need that accentuated. If only the pockets were more positioned closer towards the belly—in front of the hip instead of at the side hip. Read more",
        "author": "JennyBenny",
        "rating": 3.0,
        "date": "November 9, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars This dress is a great bargan.",
        "body": "This dress is a great bargan because it comes in many colores, black, blue and red, just to name a few. You can ware it to many affaires such as church gatherings or dinner outings. I love the pretty bottons on the sleeves of the dress and it has pockets which enhances this dress. I just love the way this dress fit on me. It brings out my figure and the material is not to lite or heavey. What a great bargan. Read more",
        "author": "Choice Joyce",
        "rating": 5.0,
        "date": "October 28, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "1.0 out of 5 stars Lovely dress",
        "body": "It was a beautiful dress but not for me. Read more",
        "author": "suzanbylsma",
        "rating": 1.0,
        "date": "December 15, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Perfect fit and very good quality fabric",
        "body": "I just received this dress and could not believe how good the quality is. The fit was perfect. I am 74, 5'3\" and weigh 127, and ordered the large. I can use it for office or Church. I liked it so much, I ordered another color. Read more",
        "author": "J. PYLE",
        "rating": 5.0,
        "date": "November 26, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Dress is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.",
  "about_this_item": "Womens Dress is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.",
  "long_description": "Womens Dress is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Black, Dusty Blue, Navy Blue, Red, Wine Red, Purple, Peacock Blue, Blue Green, Royal Blue, Amy Green, Light Pink, Green, Light Khaki. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Dress is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Black, Dusty Blue, Navy Blue, Red, Wine Red, Purple, Peacock Blue, Blue Green, Royal Blue, Amy Green, Light Pink, Green, Light Khaki. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "c3dda5a7-7941-40d7-9828-d452fd1d3a53",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c3dda5a7-7941-40d7-9828-d452fd1d3a53/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c3dda5a7-7941-40d7-9828-d452fd1d3a53/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/b16890c9-bebc-447a-98a6-e8922fb8b79a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "83195b42-4bad-4c0f-990d-16f9fec5dff8",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/83195b42-4bad-4c0f-990d-16f9fec5dff8/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/83195b42-4bad-4c0f-990d-16f9fec5dff8/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/b16890c9-bebc-447a-98a6-e8922fb8b79a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "ef8d7cf7-fa8e-49a4-9a9d-51d32273efaf",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ef8d7cf7-fa8e-49a4-9a9d-51d32273efaf/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ef8d7cf7-fa8e-49a4-9a9d-51d32273efaf/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/b16890c9-bebc-447a-98a6-e8922fb8b79a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "8e1e0300-cd20-438f-a883-4abf971f5625",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8e1e0300-cd20-438f-a883-4abf971f5625/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8e1e0300-cd20-438f-a883-4abf971f5625/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/b16890c9-bebc-447a-98a6-e8922fb8b79a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "5970f8b2-82f1-4b22-a1e3-9bb844e522ac",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5970f8b2-82f1-4b22-a1e3-9bb844e522ac/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5970f8b2-82f1-4b22-a1e3-9bb844e522ac/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/b16890c9-bebc-447a-98a6-e8922fb8b79a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "8e356551-939f-4b5f-a87d-a948b2b255ac",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8e356551-939f-4b5f-a87d-a948b2b255ac/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8e356551-939f-4b5f-a87d-a948b2b255ac/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/b16890c9-bebc-447a-98a6-e8922fb8b79a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "5be554ed-566a-466f-aee0-ae169a80cfa2",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5be554ed-566a-466f-aee0-ae169a80cfa2/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5be554ed-566a-466f-aee0-ae169a80cfa2/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/b16890c9-bebc-447a-98a6-e8922fb8b79a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "04d556ea-5640-4647-a57b-24f7d2bcae49",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/04d556ea-5640-4647-a57b-24f7d2bcae49/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/04d556ea-5640-4647-a57b-24f7d2bcae49/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/b16890c9-bebc-447a-98a6-e8922fb8b79a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "6e2b52f7-109f-480e-b8bf-bb7987cb8af9",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6e2b52f7-109f-480e-b8bf-bb7987cb8af9/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6e2b52f7-109f-480e-b8bf-bb7987cb8af9/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/b16890c9-bebc-447a-98a6-e8922fb8b79a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "7a58a3d6-82f9-4549-ad19-210f081fd5ea",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7a58a3d6-82f9-4549-ad19-210f081fd5ea/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7a58a3d6-82f9-4549-ad19-210f081fd5ea/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/b16890c9-bebc-447a-98a6-e8922fb8b79a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "ed660377-d50c-4e8d-a0de-ce24b05ec33e",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ed660377-d50c-4e8d-a0de-ce24b05ec33e/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ed660377-d50c-4e8d-a0de-ce24b05ec33e/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/b16890c9-bebc-447a-98a6-e8922fb8b79a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "2fda3c8b-6586-4f53-b589-9e122a1d9d55",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2fda3c8b-6586-4f53-b589-9e122a1d9d55/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2fda3c8b-6586-4f53-b589-9e122a1d9d55/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/b16890c9-bebc-447a-98a6-e8922fb8b79a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Black": "https://m.media-amazon.com/images/I/31A0DjCjQ0L._AC_SR38,50_.jpg",
    "Dusty Blue": "https://m.media-amazon.com/images/I/31LmydfHtwL._AC_SR38,50_.jpg",
    "Navy Blue": "https://m.media-amazon.com/images/I/31-soAPHg7L._AC_SR38,50_.jpg",
    "Red": "https://m.media-amazon.com/images/I/317NgrEAZ2L._AC_SR38,50_.jpg",
    "Wine Red": "https://m.media-amazon.com/images/I/31Ccg6C26JL._AC_SR38,50_.jpg",
    "Purple": "https://m.media-amazon.com/images/I/31bFlmyb7pL._AC_SR38,50_.jpg",
    "Peacock Blue": "https://m.media-amazon.com/images/I/31F6ZV6YLKL._AC_SR38,50_.jpg",
    "Blue Green": "https://m.media-amazon.com/images/I/31TQEJYAybL._AC_SR38,50_.jpg",
    "Royal Blue": "https://m.media-amazon.com/images/I/31fCH0VTtCL._AC_SR38,50_.jpg",
    "Amy Green": "https://m.media-amazon.com/images/I/31dlm59tRKL._AC_SR38,50_.jpg",
    "Light Pink": "https://m.media-amazon.com/images/I/31G44S65zVL._AC_SR38,50_.jpg",
    "Green": "https://m.media-amazon.com/images/I/31V0yHDJXKL._AC_SR38,50_.jpg",
    "Light Khaki": "https://m.media-amazon.com/images/I/31X+2Y6o8KL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Black": "610ibAREFTL",
    "Dusty Blue": "61LGd8EFzyL",
    "Navy Blue": "617ABLuxBML",
    "Red": "61ZRxQkkNNL",
    "Wine Red": "61MCUSSWYqL",
    "Purple": "61v0hoLFY0L",
    "Peacock Blue": "61Ge4txwfyL",
    "Blue Green": "61KzNRE8NvL",
    "Royal Blue": "61r5pmmMotL",
    "Amy Green": "61+X9VRbVlL",
    "Light Pink": "612EPRSkARL",
    "Green": "61juLXPjf9L",
    "Light Khaki": "61r52NNgl2L"
  },
  "color_images": {
    "Black": [
      "https://m.media-amazon.com/images/I/610ibAREFTL._SL1500_.jpg"
    ],
    "Dusty Blue": [
      "https://m.media-amazon.com/images/I/61LGd8EFzyL._SL1500_.jpg"
    ],
    "Navy Blue": [
      "https://m.media-amazon.com/images/I/617ABLuxBML._SL1500_.jpg"
    ],
    "Red": [
      "https://m.media-amazon.com/images/I/61ZRxQkkNNL._SL1500_.jpg"
    ],
    "Wine Red": [
      "https://m.media-amazon.com/images/I/61MCUSSWYqL._SL1500_.jpg"
    ],
    "Purple": [
      "https://m.media-amazon.com/images/I/61v0hoLFY0L._SL1500_.jpg"
    ],
    "Peacock Blue": [
      "https://m.media-amazon.com/images/I/61Ge4txwfyL._SL1500_.jpg"
    ],
    "Blue Green": [
      "https://m.media-amazon.com/images/I/61KzNRE8NvL._SL1500_.jpg"
    ],
    "Royal Blue": [
      "https://m.media-amazon.com/images/I/61r5pmmMotL._SL1500_.jpg"
    ],
    "Amy Green": [
      "https://m.media-amazon.com/images/I/61+X9VRbVlL._SL1500_.jpg"
    ],
    "Light Pink": [
      "https://m.media-amazon.com/images/I/612EPRSkARL._SL1500_.jpg"
    ],
    "Green": [
      "https://m.media-amazon.com/images/I/61juLXPjf9L._SL1500_.jpg"
    ],
    "Light Khaki": [
      "https://m.media-amazon.com/images/I/61r52NNgl2L._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-sleeveless-maxi",
      "title": "Womens Maxi Dress Sleeveless Maxi",
      "price": 48.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71qwUjryGiL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 43.69,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61-pFN+nfgL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-bodycon",
      "title": "Womens Maxi Dress Maxi Bodycon",
      "price": 36.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61o6MKJoZLL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-one-shoulder-formal-mermaid-bodycon-evening-maxi",
      "title": "Womens Maxi Dress One Shoulder Formal Mermaid Bodycon Evening Maxi",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71mgUBuGwhL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-v-neck-short-sleeve",
      "title": "Womens Dress V Neck Short Sleeve",
      "price": 34.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71T+iJeFITL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress-cocktail-ruched-evening-split",
      "title": "Womens Dress Cocktail Ruched Evening Split",
      "price": 29.69,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/61003bnFhAS._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-maxi",
      "title": "Womens Maxi Dress Formal Maxi",
      "price": 64.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/61RWPo72AmL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-mermaid-one-shoulder",
      "title": "Womens Maxi Dress Mermaid One Shoulder",
      "price": 238.74,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51lR3NNtXCL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-maxi-formal-long-sleeve-v-neck",
      "title": "Womens Maxi Dress Cocktail Maxi Formal Long Sleeve V Neck",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61cfJoIR5bL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-bodycon-ruched",
      "title": "Womens Maxi Dress Cocktail Bodycon Ruched",
      "price": 49.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51+rVhgLHSL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-formal",
      "title": "Womens Dress Formal",
      "price": 75.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51TVxkZ3J2L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening",
      "title": "Womens Maxi Dress Formal Evening",
      "price": 64.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/516ScMrYzlL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-ruched-bodycon-v-neck",
      "title": "Womens Maxi Dress Long Sleeve Ruched Bodycon V Neck",
      "price": 33.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51AvldIvTmL._SL1500_.jpg"
      ]
    }
  ]
}