{
  "id": "womens-dress-sleeveless-bodycon-cocktail-ruched",
  "handle": "womens-dress-sleeveless-bodycon-cocktail-ruched",
  "sku": "JC3188",
  "asin": "B0F8Q9X6L5",
  "title": "Womens Dress Sleeveless Bodycon Cocktail Ruched",
  "title_original": "ZAFUL Womens Sleeveless Velvet Cocktail Dresses Cowl Neck Party Midi Wedding Guest Dress Ruched Slit Bodycon Dress",
  "brand": "Visit the ZAFUL Store",
  "price": 39.99,
  "social_proof": {
    "bought_past_month": 1861,
    "text": "1861+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/81kioSYTBsL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81fGjjc7foL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81AdK719wOL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81jfximMZ1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81WYH-SpvbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81Qgc0JkmWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/713m0J+9ZYL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71dieKvVf0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71cG4u1YuRL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71TkkxZ4y4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71TjostEFgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Q+CpC3kyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/718BajxBy4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71mbN2c0ZlL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71HMg3b-wdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/719AKYuPQyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71qCU4lkV9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Oy115CyXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71carO5Eh9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71TVEmzofWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81JE4VQoTXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71PwrgztgfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71FT5jzv2mL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71GJa9pBynL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Ult8av52L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71m3O1cNP0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71LEkdmbieL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/81kioSYTBsL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81fGjjc7foL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81AdK719wOL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81jfximMZ1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81WYH-SpvbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81Qgc0JkmWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/713m0J+9ZYL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71dieKvVf0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71cG4u1YuRL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71TkkxZ4y4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71TjostEFgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Q+CpC3kyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/718BajxBy4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71mbN2c0ZlL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71HMg3b-wdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/719AKYuPQyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71qCU4lkV9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Oy115CyXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71carO5Eh9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71TVEmzofWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81JE4VQoTXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71PwrgztgfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71FT5jzv2mL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71GJa9pBynL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Ult8av52L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71m3O1cNP0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71LEkdmbieL._SL1500_.jpg"
  ],
  "aplus_images": [
    "https://m.media-amazon.com/images/I/31yP6W9jpSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41ECarOQC3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41qMCMVvKsL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/418Ar5M1P8L._SL1500_.jpg"
  ],
  "description_images": [
    "https://m.media-amazon.com/images/I/31yP6W9jpSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41ECarOQC3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41qMCMVvKsL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/418Ar5M1P8L._SL1500_.jpg"
  ],
  "bullets": [],
  "specs": {
    "Item model number ‏": "‎ Velvet Dress",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ July 5, 2025",
    "Manufacturer ‏": "‎ ZAFUL",
    "ASIN ‏": "‎ B0F8Q9VWSH",
    "Best Sellers Rank": "#18,694 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #20 in Women's Cocktail Dresses",
    "Customer Reviews": "4.3 4.3 out of 5 stars (142)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Wine",
      "Brown",
      "Rust",
      "Dark Coffee",
      "Dark Navy",
      "Dark Pink",
      "Burgundy",
      "Black",
      "Champagne",
      "Desert Blue",
      "Dark Green",
      "Light Blue",
      "Olive",
      "Rose Red",
      "Lake Blue",
      "Navy",
      "Khaki",
      "Purple",
      "Royal Blue",
      "Dark Blue",
      "Rose Pink",
      "Grey"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.3,
    "count": 142,
    "customers_say": "Customers find the dress elegant, with one mentioning it received lots of compliments at a wedding, and appreciate its true-to-size fit, comfort, and versatility for different occasions. The dress is soft and hugs curves nicely, with one customer noting it provides tummy coverage. They like its color, with one describing it as a nice rust shade for fall. Generated from the text of customer reviews Select to learn more Elegance (33) Fit (29) Comfort (16) Size (15) Dress fit (13) Color (12) Flattering (12) Softness (9) 33 customers mention elegance, 31 positive, 2 negative 33 customers mention \"Elegance\" 31 positive 2 negative Customers find the dress elegant and beautiful, with one mentioning it received lots of compliments at a wedding, and another noting it feels like a more expensive piece. \" It’s beautiful , but I think I’ll be returning for a different dress. I was hoping the top was a bit more lower cut. It is modest and elegant.... \" Read more \" ...Truly a beautiful dress . Purchased a medium and it fits loosely yet flattering. 5’8” 135# \" Read more \" Perfect fit, love this dress ! \" Read more \" ...Pros: Pretty and really soft Very stretchy Hugs curves nicely with tummy coverage (would look really cute on baby bump)... \" Read more 29 customers mention fit, 21 positive, 8 negative 29 customers mention \"Fit\" 21 positive 8 negative Customers like how the dress fits, with one mentioning it has enough stretch to accommodate different body types. \" Gorgeous velvet dress!! Fit perfectly and the ruching really helps to hide any extra around the middle. Truly a beautiful dress.... \" Read more \" Perfect fit , love this dress! \" Read more \" Beautiful and comfortable. I normally wear a small and it was a little large for me . And I'm 5'5,140 athletic, fit.... \" Read more \" Dress fit perfect and looks great on. Love the color. The material wasn’t too thin or thick. Definitely recommend. \" Read more 16 customers mention comfort, 16 positive, 0 negative 16 customers mention \"Comfort\" 16 positive 0 negative Customers find the dress comfortable. \" ...I received so many compliments while wearing it. It’s comfortable , has just the right amount of stretch, and feels like a much more expensive piece.... \" Read more \" Just like the description. Very nice fit, very comfortable . Flattering! \" Read more \" It is cute, comfy , and hugs all the right places. It's also longer than knee length so appropriate for more conservative events \" Read more \" Buy this dress NOW in every color! It’s so comfortable . Fits true to size. Color is exactly as it appears. \" Read more 15 customers mention size, 11 positive, 4 negative 15 customers mention \"Size\" 11 positive 4 negative Customers are satisfied with the dress's sizing, finding it true to size. \" Great quality, true to size , color was accurate, flattering and comfortable; Length was great- I’m 5’8” in a medium \" Read more \" I love the comfort of the material. Very fitting, true to size for me . \" Read more \" Pretty color but way too big. Size down !! \" Read more \" ...It’s not super thick but you don’t need a slip. The sizing was true to size for me.... \" Read more 13 customers mention dress fit, 13 positive, 0 negative 13 customers mention \"Dress fit\" 13 positive 0 negative Customers find the dress perfect for cocktail events, with one mentioning it's appropriate for more conservative occasions. \" Perfect dress ! Ordered size small (135lbs, 5’5) and it fit perfectly. Wore to a fall wedding and received so many compliments!... \" Read more \" Incredible dress ! I absolutely loved it and got so many compliments. Very comfortable.... \" Read more \" ...fabric, great fit, and a polished look that makes it perfect for any special occasion . \" Read more \" ...It looks FLAWLESS and was great for the event ! Super flattering, perfect sizing! \" Read more 12 customers mention color, 12 positive, 0 negative 12 customers mention \"Color\" 12 positive 0 negative Customers love the color of the dress, with one mentioning it's a nice rust shade suitable for fall. \" Love this dress. The fit is flawless and the color is so rich and beautiful. Im wearing this for my son's wedding. \" Read more \" Great quality, true to size, color was accurate , flattering and comfortable; Length was great- I’m 5’8” in a medium \" Read more \" ... Color is beautiful Cons If you are 5'0 and under the length hits at an weird place... \" Read more \" ...Wore to a fall wedding and received so many compliments! Color was perfect and it was extremely comfortable! \" Read more 12 customers mention flattering, 10 positive, 2 negative 12 customers mention \"Flattering\" 10 positive 2 negative Customers find the dress flattering, noting that it hugs all the right places. \" Great quality, true to size, color was accurate, flattering and comfortable; Length was great- I’m 5’8” in a medium \" Read more \" Cute wore for a dinner party hugs all the right places great quality soft and not too thick beautiful cut would definitely recommend... \" Read more \" ...The style is elegant and very flattering , with a classic silhouette that looks stunning without being overdone.... \" Read more \" ...It looks FLAWLESS and was great for the event! Super flattering , perfect sizing! \" Read more 9 customers mention softness, 7 positive, 2 negative 9 customers mention \"Softness\" 7 positive 2 negative Customers appreciate the dress's softness, describing it as great quality. \" Love it! It’s so comfy. The material is soft and stretchy and has a little sparkle to it. Doesn’t show my granny panty lines.... \" Read more \" ...The material is fantastic— soft , rich, and much higher quality than you’d expect at this price.... \" Read more \" Very soft . True to size. I received tons of compliments on this dress. \" Read more \" ...No amount of steaming would have fixed it, and it was not crushed velvet . You get what you pay for. \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars A standout dress! Perfect for any cocktail attire.",
        "body": "This sleeveless velvet cocktail dress completely exceeded my expectations. The material is fantastic—soft, rich, and much higher quality than you’d expect at this price. The stitching and construction are excellent, and the dress holds its shape beautifully through an entire evening. The style is elegant and very flattering, with a classic silhouette that looks stunning without being overdone. I received so many compliments while wearing it. It’s comfortable, has just the right amount of stretch, and feels like a much more expensive piece. Simple yet stunning! Sizing was perfect. I weigh 145 lbs 5”5 and the small was absolutely perfect. Overall, this dress is absolutely worth the money. Gorgeous fabric, great fit, and a polished look that makes it perfect for any special occasion. Read more",
        "author": "Customer",
        "rating": 5.0,
        "date": "December 1, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Perfect cocktail dress",
        "body": "Great quality, true to size, color was accurate, flattering and comfortable; Length was great- I’m 5’8” in a medium Read more",
        "author": "Meredith Johnson",
        "rating": 5.0,
        "date": "October 12, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71XqcJ5F-lL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Perfect fall guest wedding dress",
        "body": "Dress fit perfect and looks great on. Love the color. The material wasn’t too thin or thick. Definitely recommend. Read more",
        "author": "Adriana Medina",
        "rating": 5.0,
        "date": "November 6, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars A little long on 5'0 and under",
        "body": "Perfect dress for someone else, but sadly did not work for me. Pros: Pretty and really soft Very stretchy Hugs curves nicely with tummy coverage (would look really cute on baby bump) Color is beautiful Cons If you are 5'0 and under the length hits at an weird place Cowl neck doesn't work too well on a large chest Runs slightly large Read more",
        "author": "Samantha B",
        "rating": 3.0,
        "date": "December 5, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/916CIYfHFuL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Cute dress!",
        "body": "Nice rust color for fall. Nice quality for the price. 5’4” 130 lbs. S fit perfectly. Read more",
        "author": "LauraK",
        "rating": 5.0,
        "date": "November 30, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71hLeHvtRdL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Pretty and comfortable",
        "body": "Had just enough stretch to fit just right - wore it for a wedding I went to and was very pleased with the look and comfort. Read more",
        "author": "Anne Chism",
        "rating": 5.0,
        "date": "November 8, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Pretty dress but size down",
        "body": "It is very cute however I still felt it was loose. I ordered a small and wish they had an XS. I am 5’5 136lbs. And the top fit well but it seemed a bit loose in the waist. Very stretchy fabric Read more",
        "author": "Paige R",
        "rating": 4.0,
        "date": "November 29, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Perfect Cruise Dress",
        "body": "Bought 2 of these dresses for our cruise. They were a great value for something a little fancier without breaking the bank. Fabric colors are beautiful and it’s stretchy and feels nice. It’s not super thick but you don’t need a slip. The sizing was true to size for me. I added a colorful scarf for the shoulders as an extra pop of color. I like the way the styling fit my curvy body. I’m 5’3” 155lb Read more",
        "author": "Kathy Campbell",
        "rating": 5.0,
        "date": "November 25, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/81aaKQepOhL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/51Pi1RTWnkL._SY88._SL1500_.jpg"
        ]
      }
    ]
  },
  "short_description": "Womens Dress Sleeveless Bodycon Cocktail Ruched is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.",
  "about_this_item": "Womens Dress Sleeveless Bodycon Cocktail Ruched is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.",
  "long_description": "Womens Dress Sleeveless Bodycon Cocktail Ruched is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Wine, Brown, Rust, Dark Coffee, Dark Navy, Dark Pink, Burgundy, Black, Champagne, Desert Blue, Dark Green, Light Blue, Olive, Rose Red. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Dress Sleeveless Bodycon Cocktail Ruched is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/31yP6W9jpSL._SL1500_.jpg",
      "alt": "Womens Dress Sleeveless Bodycon Cocktail Ruched details image 1"
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/41ECarOQC3L._SL1500_.jpg",
      "alt": "Womens Dress Sleeveless Bodycon Cocktail Ruched details image 2"
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/41qMCMVvKsL._SL1500_.jpg",
      "alt": "Womens Dress Sleeveless Bodycon Cocktail Ruched details image 3"
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/418Ar5M1P8L._SL1500_.jpg",
      "alt": "Womens Dress Sleeveless Bodycon Cocktail Ruched details image 4"
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Wine, Brown, Rust, Dark Coffee, Dark Navy, Dark Pink, Burgundy, Black, Champagne, Desert Blue, Dark Green, Light Blue, Olive, Rose Red. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "34a8d536-1e40-4f62-ac25-46c3eaf1cfa7",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/34a8d536-1e40-4f62-ac25-46c3eaf1cfa7/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/34a8d536-1e40-4f62-ac25-46c3eaf1cfa7/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "7cc489da-e523-461f-a12e-dbaad397dffe",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7cc489da-e523-461f-a12e-dbaad397dffe/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7cc489da-e523-461f-a12e-dbaad397dffe/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "0d239b71-2228-4780-9b2e-c4608b0031fd",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0d239b71-2228-4780-9b2e-c4608b0031fd/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0d239b71-2228-4780-9b2e-c4608b0031fd/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "b51969b1-16da-4d6e-b03a-9621b307e7b1",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b51969b1-16da-4d6e-b03a-9621b307e7b1/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b51969b1-16da-4d6e-b03a-9621b307e7b1/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "e82051b5-850a-4187-a8d8-38cd43139ce8",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e82051b5-850a-4187-a8d8-38cd43139ce8/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e82051b5-850a-4187-a8d8-38cd43139ce8/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "31d3addd-1756-4824-9559-fea32da9b044",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/31d3addd-1756-4824-9559-fea32da9b044/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/31d3addd-1756-4824-9559-fea32da9b044/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "b960c2d0-ef68-4205-8ab6-97d61bb08ecc",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b960c2d0-ef68-4205-8ab6-97d61bb08ecc/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b960c2d0-ef68-4205-8ab6-97d61bb08ecc/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "fc97f07d-af97-4572-951f-01f7b5063c83",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/fc97f07d-af97-4572-951f-01f7b5063c83/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/fc97f07d-af97-4572-951f-01f7b5063c83/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "a524bd5e-18b3-45d3-a0d1-9fae1b4ad2fa",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a524bd5e-18b3-45d3-a0d1-9fae1b4ad2fa/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a524bd5e-18b3-45d3-a0d1-9fae1b4ad2fa/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "99a317dd-cee2-4a7c-b464-b5178c269c9e",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/99a317dd-cee2-4a7c-b464-b5178c269c9e/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/99a317dd-cee2-4a7c-b464-b5178c269c9e/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "658e6482-3a6a-400d-942e-ab1a3944d796",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/658e6482-3a6a-400d-942e-ab1a3944d796/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/658e6482-3a6a-400d-942e-ab1a3944d796/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "c41070b8-a43c-4fcd-9ce5-2324ff787963",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c41070b8-a43c-4fcd-9ce5-2324ff787963/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c41070b8-a43c-4fcd-9ce5-2324ff787963/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Wine": "https://m.media-amazon.com/images/I/312PM8pednL._AC_SR38,50_.jpg",
    "Brown": "https://m.media-amazon.com/images/I/31mVBUPlW1L._AC_SR38,50_.jpg",
    "Rust": "https://m.media-amazon.com/images/I/31eHOuZyopL._AC_SR38,50_.jpg",
    "Dark Coffee": "https://m.media-amazon.com/images/I/31XmCo2aB4L._AC_SR38,50_.jpg",
    "Dark Navy": "https://m.media-amazon.com/images/I/31C+s2XkDWL._AC_SR38,50_.jpg",
    "Dark Pink": "https://m.media-amazon.com/images/I/3192iMV10rL._AC_SR38,50_.jpg",
    "Burgundy": "https://m.media-amazon.com/images/I/31d9W-7mYTL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31+Rc-vgxLL._AC_SR38,50_.jpg",
    "Champagne": "https://m.media-amazon.com/images/I/31IuDvo8cRL._AC_SR38,50_.jpg",
    "Desert Blue": "https://m.media-amazon.com/images/I/318qJB8D9oL._AC_SR38,50_.jpg",
    "Dark Green": "https://m.media-amazon.com/images/I/31f-+VVeAWL._AC_SR38,50_.jpg",
    "Light Blue": "https://m.media-amazon.com/images/I/312-1FqUH3L._AC_SR38,50_.jpg",
    "Olive": "https://m.media-amazon.com/images/I/31aKZxK7KoL._AC_SR38,50_.jpg",
    "Rose Red": "https://m.media-amazon.com/images/I/31NAv7O6KXL._AC_SR38,50_.jpg",
    "Lake Blue": "https://m.media-amazon.com/images/I/31W5kmJf8ZL._AC_SR38,50_.jpg",
    "Navy": "https://m.media-amazon.com/images/I/31TA9vO0JfL._AC_SR38,50_.jpg",
    "Khaki": "https://m.media-amazon.com/images/I/31XNhBfkHJL._AC_SR38,50_.jpg",
    "Purple": "https://m.media-amazon.com/images/I/31Mimy2xIML._AC_SR38,50_.jpg",
    "Royal Blue": "https://m.media-amazon.com/images/I/31ZEQ0TnxfL._AC_SR38,50_.jpg",
    "Dark Blue": "https://m.media-amazon.com/images/I/41PJBtg4IgL._AC_SR38,50_.jpg",
    "Rose Pink": "https://m.media-amazon.com/images/I/31zM15DYdQL._AC_SR38,50_.jpg",
    "Grey": "https://m.media-amazon.com/images/I/31hoAx2Nu1L._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Wine": "81kioSYTBsL",
    "Brown": "713m0J+9ZYL",
    "Rust": "71dieKvVf0L",
    "Dark Coffee": "71cG4u1YuRL",
    "Dark Navy": "71TkkxZ4y4L",
    "Dark Pink": "71TjostEFgL",
    "Burgundy": "71Q+CpC3kyL",
    "Black": "718BajxBy4L",
    "Champagne": "71mbN2c0ZlL",
    "Desert Blue": "71HMg3b-wdL",
    "Dark Green": "719AKYuPQyL",
    "Light Blue": "71qCU4lkV9L",
    "Olive": "71Oy115CyXL",
    "Rose Red": "71carO5Eh9L",
    "Lake Blue": "71TVEmzofWL",
    "Navy": "81JE4VQoTXL",
    "Khaki": "71PwrgztgfL",
    "Purple": "71FT5jzv2mL",
    "Royal Blue": "71GJa9pBynL",
    "Dark Blue": "71Ult8av52L",
    "Rose Pink": "71m3O1cNP0L",
    "Grey": "71LEkdmbieL"
  },
  "color_images": {
    "Wine": [
      "https://m.media-amazon.com/images/I/81kioSYTBsL._SL1500_.jpg"
    ],
    "Brown": [
      "https://m.media-amazon.com/images/I/713m0J+9ZYL._SL1500_.jpg"
    ],
    "Rust": [
      "https://m.media-amazon.com/images/I/71dieKvVf0L._SL1500_.jpg"
    ],
    "Dark Coffee": [
      "https://m.media-amazon.com/images/I/71cG4u1YuRL._SL1500_.jpg"
    ],
    "Dark Navy": [
      "https://m.media-amazon.com/images/I/71TkkxZ4y4L._SL1500_.jpg"
    ],
    "Dark Pink": [
      "https://m.media-amazon.com/images/I/71TjostEFgL._SL1500_.jpg"
    ],
    "Burgundy": [
      "https://m.media-amazon.com/images/I/71Q+CpC3kyL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/718BajxBy4L._SL1500_.jpg"
    ],
    "Champagne": [
      "https://m.media-amazon.com/images/I/71mbN2c0ZlL._SL1500_.jpg"
    ],
    "Desert Blue": [
      "https://m.media-amazon.com/images/I/71HMg3b-wdL._SL1500_.jpg"
    ],
    "Dark Green": [
      "https://m.media-amazon.com/images/I/719AKYuPQyL._SL1500_.jpg"
    ],
    "Light Blue": [
      "https://m.media-amazon.com/images/I/71qCU4lkV9L._SL1500_.jpg"
    ],
    "Olive": [
      "https://m.media-amazon.com/images/I/71Oy115CyXL._SL1500_.jpg"
    ],
    "Rose Red": [
      "https://m.media-amazon.com/images/I/71carO5Eh9L._SL1500_.jpg"
    ],
    "Lake Blue": [
      "https://m.media-amazon.com/images/I/71TVEmzofWL._SL1500_.jpg"
    ],
    "Navy": [
      "https://m.media-amazon.com/images/I/81JE4VQoTXL._SL1500_.jpg"
    ],
    "Khaki": [
      "https://m.media-amazon.com/images/I/71PwrgztgfL._SL1500_.jpg"
    ],
    "Purple": [
      "https://m.media-amazon.com/images/I/71FT5jzv2mL._SL1500_.jpg"
    ],
    "Royal Blue": [
      "https://m.media-amazon.com/images/I/71GJa9pBynL._SL1500_.jpg"
    ],
    "Dark Blue": [
      "https://m.media-amazon.com/images/I/71Ult8av52L._SL1500_.jpg"
    ],
    "Rose Pink": [
      "https://m.media-amazon.com/images/I/71m3O1cNP0L._SL1500_.jpg"
    ],
    "Grey": [
      "https://m.media-amazon.com/images/I/71LEkdmbieL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-off-shoulder-formal-mermaid-evening",
      "title": "Womens Maxi Dress Off Shoulder Formal Mermaid Evening",
      "price": 55.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61a1opbQoFL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 12.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/81lnBeTGoYL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-maxi-long-sleeve",
      "title": "Womens Maxi Dress Bodycon Maxi Long Sleeve",
      "price": 44.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51HPiBldymL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51+ZvnP0Z4L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 469.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71em0qX7SBL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress-cocktail",
      "title": "Womens Dress Cocktail",
      "price": 80.49,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/71eKfuRshVL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-long-sleeve-maxi-cocktail",
      "title": "Womens Maxi Dress Bodycon Long Sleeve Maxi Cocktail",
      "price": 47.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/81Qz5s7t1VL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-mermaid-one-shoulder-formal-evening",
      "title": "Womens Maxi Dress Mermaid One Shoulder Formal Evening",
      "price": 84.89,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/516h99NkyZL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-v-neck-short-sleeve",
      "title": "Womens Dress V Neck Short Sleeve",
      "price": 36.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/71rfdk76L+L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening",
      "title": "Womens Maxi Dress Formal Evening",
      "price": 94.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51ru-RLCAiL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-v-neck-long-sleeve-formal-evening",
      "title": "Womens Maxi Dress V Neck Long Sleeve Formal Evening",
      "price": 73.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/519YaXd3zXL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-cocktail-ruched",
      "title": "Womens Maxi Dress Bodycon Cocktail Ruched",
      "price": 37.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/91HL3aBO+gL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 45.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51g3DTDsW9L._SL1500_.jpg"
      ]
    }
  ]
}