{
  "id": "womens-maxi-dress-v-neck-maxi-long-sleeve",
  "handle": "womens-maxi-dress-v-neck-maxi-long-sleeve",
  "sku": "JC1095",
  "asin": "B0F8MHP6JZ",
  "title": "Womens Maxi Dress V Neck Maxi Long Sleeve",
  "title_original": "ANRABESS Women's Floral Maxi Dress 2025 Fall V Neck Puff Long Sleeve Flowy Casual Wedding Guest Tea Party Tulle Dresses",
  "brand": "Visit the ANRABESS Store",
  "price": 39.99,
  "social_proof": {
    "bought_past_month": 718,
    "text": "718+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/71tAbGI9psL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/A1EtOia5L8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71tYS00M8YL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ZBDNVTxeL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/7100zsHuP7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71nmPjYHjEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71KZEVYjjXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81Y-bDh2mgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71w91qInEcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71mBTa0o2oL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81ObDGf2v1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81eogCx6HlL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71q7VfxhXjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ulpQjIdmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71hKzKWC8kL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71pRdLzszdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71T5sG2nIoL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71HOunnxaSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71jm6hKojvL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71gKyB2-LfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71LXghCAi+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81wnkGzEHjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81RuMRjz4FL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71m9JFZZXpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/814tevoRVEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81MzkNbVg2L._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/71tAbGI9psL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/A1EtOia5L8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71tYS00M8YL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ZBDNVTxeL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/7100zsHuP7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71nmPjYHjEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71KZEVYjjXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81Y-bDh2mgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71w91qInEcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71mBTa0o2oL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81ObDGf2v1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81eogCx6HlL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71q7VfxhXjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ulpQjIdmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71hKzKWC8kL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71pRdLzszdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71T5sG2nIoL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71HOunnxaSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71jm6hKojvL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71gKyB2-LfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71LXghCAi+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81wnkGzEHjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81RuMRjz4FL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71m9JFZZXpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/814tevoRVEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81MzkNbVg2L._SL1500_.jpg"
  ],
  "aplus_images": [
    "https://m.media-amazon.com/images/I/51R-GFijfdL._SL1500_.jpg"
  ],
  "description_images": [
    "https://m.media-amazon.com/images/I/51R-GFijfdL._SL1500_.jpg"
  ],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ May 14, 2025",
    "ASIN ‏": "‎ B0F8N2QVWH",
    "Best Sellers Rank": "#35,974 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #325 in Women's Casual Dresses",
    "Customer Reviews": "4.5 4.5 out of 5 stars (139)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Emerald Green Floral",
      "Dusty Orchid Floral",
      "Yellow Floral Green",
      "Purple Floral Blue",
      "Blue Golden Flower",
      "Dusty Olive Floral",
      "Rose Red Flower",
      "Floral Black Yellow",
      "Red and Yellow Rose",
      "Brown Floral Dark Blue",
      "Floral Lake Blue",
      "Light Blue Floral",
      "Apricot Black Flower",
      "Black Red Flower",
      "Multicolored Rose Apricot",
      "Pink Flower",
      "Purple Rose",
      "Floral Green",
      "Pink Peony White",
      "Navy Red Floral"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.5,
    "count": 139,
    "customers_say": "Customers find the dress gorgeous, with one noting it looks very expensive, and appreciate its nice fabric and colors. The dress fits well, is comfortable, and is perfect for fall and winter occasions. They like its quality and size, with one mentioning it sits nicely on their figure. Generated from the text of customer reviews Select to learn more Beauty (37) Fit (31) Quality (24) Comfort (20) Size (13) Dress size (10) Color (9) Fabric quality (9) 37 customers mention beauty, 37 positive, 0 negative 37 customers mention \"Beauty\" 37 positive 0 negative Customers find the dress beautiful, with pretty colors and one customer noting it looks very expensive. \" It is a beautiful dress , very good quality. Unfortunately, the one I got was just a little too.Snug, so I may order it again in the spring. \" Read more \" THis dress is beautiful and flowy but the reason I gave it 3 stars is the v neckline is extremely low cut and not flattering for me.... \" Read more \" This dress is so pretty - got tons of compliments! \" Read more \" ...I am returning it. My size down to a large. Very pretty . \" Read more 31 customers mention fit, 28 positive, 3 negative 31 customers mention \"Fit\" 28 positive 3 negative Customers like how the dress fits, with one mentioning it sits nicely on their figure. \" The dress is beautiful. It fits well and I love the way it looks. The material is soft and drapes well. All in all, I love the dress! \" Read more \" Beautiful dress, fits perfectly , feels well made, and good for casual elegance. \" Read more \" Normally I go for xs but the small was perfect. It fit well and was great quality. Highly recommend!! Just like the photo. I went with the black. \" Read more \" Amazing fit and true to size! Bought an xl and around 220-230 lbs. It’s a great align style! \" Read more 24 customers mention quality, 22 positive, 2 negative 24 customers mention \"Quality\" 22 positive 2 negative Customers find the dress to be of nice quality and amazing. \" Good quality . Nice colors. Elastic waist is not my favorite but fits well. Good value for the money. \" Read more \" Great dress ! This dress was a great fit, style and comfort level for the price. I wore it to a wedding and can definitely wear it again. \" Read more \" Love the dress , it's exactly as shown. The length, fit - flattering. \" Read more \" Nice dress , runs a bit small. Will be nice for a fall wedding. \" Read more 20 customers mention comfort, 20 positive, 0 negative 20 customers mention \"Comfort\" 20 positive 0 negative Customers find the dress comfortable. \" Very pretty dress; fits me well and is comfortable . Material is a little flimsy and I don't know if there is a way to wash it.... \" Read more \" Fit was great, very comfortable ....I received many compliments when I wore it out for the first time the other night. \" Read more \" Obsessed! So comfortable , so flattering. Perfect length. Good quality doesn’t feel cheap and not too low cut \" Read more \" Great dress! This dress was a great fit, style and comfort level for the price . I wore it to a wedding and can definitely wear it again. \" Read more 13 customers mention size, 10 positive, 3 negative 13 customers mention \"Size\" 10 positive 3 negative Customers are satisfied with the dress's size, with one mentioning it is beautiful and true to size. \" True to size . Perfect dress or Fall/Winter with long sleeves but light fabric and very comfortable. Priced just right. \" Read more \" This dress is beautiful true to size \" Read more \" Beautiful dress and very nice quality. Sizing was spot on ! Bought for a fall wedding. Classy, yet not boring. \" Read more \" Nice dress, runs a bit small . Will be nice for a fall wedding. \" Read more 10 customers mention dress size, 10 positive, 0 negative 10 customers mention \"Dress size\" 10 positive 0 negative Customers find this dress suitable for fall and winter occasions, particularly for weddings. \" Beautiful dress! It was perfect for a Fall wedding with knee high boots. Comfortable too! Im 5'7 and typically wear a size 10.... \" Read more \" Comfortable and great for a fall wedding \" Read more \" Nice dress, runs a bit small. Will be nice for a fall wedding . \" Read more \" Arrived on time and was the perfect dress for an engagement party . I’m 5’5” 130 lbs. \" Read more 9 customers mention color, 8 positive, 1 negative 9 customers mention \"Color\" 8 positive 1 negative Customers like the colors of the dress, with one mentioning its muted fall tones. \" Pretty colors !... \" Read more \" ...The color was exact , but the material quality not as expected for the price (even on sale!)... \" Read more \" Looks exactly like the picture. It's very feminine and the color is beautiful . Fits true to size, comfortable, and seems to be good quality. \" Read more \" The fit, feel and color was perfect for a fall family wedding. Very flattering and fit perfectly in all the right places. \" Read more 9 customers mention fabric quality, 7 positive, 2 negative 9 customers mention \"Fabric quality\" 7 positive 2 negative Customers like the fabric of the dress, with one mentioning it is light and another noting it is lovely. \" True to size. Perfect dress or Fall/Winter with long sleeves but light fabric and very comfortable. Priced just right. \" Read more \" ... Beautiful fabric and print, not itchy and sits nicely on my figure. Love it! \" Read more \" Beautiful and fits well. Looks elegant. Nice fabric \" Read more \" I was very disappointed in the material . It was made very cheaply.... \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Great dress! Cost effective and can be worn again.",
        "body": "Great dress! This dress was a great fit, style and comfort level for the price. I wore it to a wedding and can definitely wear it again. Read more",
        "author": "Ericka_S",
        "rating": 5.0,
        "date": "December 22, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Well Worth It! Beautiful and Comfortable!",
        "body": "Absolutely adorable and fits so well! No doubt about this one, it is better in person and good value for my money. Beautiful fabric and print, not itchy and sits nicely on my figure. Love it! Read more",
        "author": "Stephanie Galvan",
        "rating": 5.0,
        "date": "December 17, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Very pretty; a little flimsy",
        "body": "Very pretty dress; fits me well and is comfortable. Material is a little flimsy and I don't know if there is a way to wash it. No instructions provided. Read more",
        "author": "Jon P",
        "rating": 4.0,
        "date": "September 25, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Perfect fall dress",
        "body": "Looks exactly like the picture. It's very feminine and the color is beautiful. Fits true to size, comfortable, and seems to be good quality. Read more",
        "author": "JLH",
        "rating": 5.0,
        "date": "September 27, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Floral Maxi Dress",
        "body": "This was a beautiful dress on. Comfortable and fit true to size 14/16. I am 6 ft and 190. Very well made. Read more",
        "author": "Darlene King",
        "rating": 5.0,
        "date": "November 26, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Made more for petite, shorter women",
        "body": "Th dress looks beautiful when you take it out of the package. Once you try it on you realize that the waist is so high up it doesn’t go on your waist at all and the elastic at the supposed waist does not look good when it is so high above you waist. I think this dress is more for a petite person who is shorter than 5’9”. Had to return. Read more",
        "author": "Linda Kalb",
        "rating": 3.0,
        "date": "November 10, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Quality in the making",
        "body": "Lovely dress. Soft, silky fabric. Perfect fit. I receive many compliments whenever I wear it. Read more",
        "author": "Rachel, H",
        "rating": 5.0,
        "date": "November 17, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Beautiful and comfortable",
        "body": "Beautiful dress! It was perfect for a Fall wedding with knee high boots. Comfortable too! Im 5'7 and typically wear a size 10. The medium fit perfectly. Read more",
        "author": "C. winter",
        "rating": 5.0,
        "date": "December 2, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress V Neck Maxi Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.",
  "about_this_item": "Womens Maxi Dress V Neck Maxi Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.",
  "long_description": "Womens Maxi Dress V Neck Maxi Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Emerald Green Floral, Dusty Orchid Floral, Yellow Floral Green, Purple Floral Blue, Blue Golden Flower, Dusty Olive Floral, Rose Red Flower, Floral Black Yellow, Red and Yellow Rose, Brown Floral Dark Blue, Floral Lake Blue, Light Blue Floral, Apricot Black Flower, Black Red Flower. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress V Neck Maxi Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/51R-GFijfdL._SL1500_.jpg",
      "alt": "Womens Maxi Dress V Neck Maxi Long Sleeve details image 1"
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Emerald Green Floral, Dusty Orchid Floral, Yellow Floral Green, Purple Floral Blue, Blue Golden Flower, Dusty Olive Floral, Rose Red Flower, Floral Black Yellow, Red and Yellow Rose, Brown Floral Dark Blue, Floral Lake Blue, Light Blue Floral, Apricot Black Flower, Black Red Flower. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "91f4d5f6-2ddd-4260-9bfb-80fa5b9b32bf",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/91f4d5f6-2ddd-4260-9bfb-80fa5b9b32bf/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/91f4d5f6-2ddd-4260-9bfb-80fa5b9b32bf/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "d3186614-578c-4248-81fb-fb74ef115387",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d3186614-578c-4248-81fb-fb74ef115387/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d3186614-578c-4248-81fb-fb74ef115387/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "9737f29a-d93e-49fb-91aa-42e74947caf7",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9737f29a-d93e-49fb-91aa-42e74947caf7/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9737f29a-d93e-49fb-91aa-42e74947caf7/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "f0e134a8-2a99-4ace-abe0-79473ba5a309",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f0e134a8-2a99-4ace-abe0-79473ba5a309/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f0e134a8-2a99-4ace-abe0-79473ba5a309/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "57bd5aec-a3be-4d70-acab-0ad5f7c2eb88",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/57bd5aec-a3be-4d70-acab-0ad5f7c2eb88/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/57bd5aec-a3be-4d70-acab-0ad5f7c2eb88/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "fe20812a-43ca-46e3-b102-17bc9f30ce52",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/fe20812a-43ca-46e3-b102-17bc9f30ce52/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/fe20812a-43ca-46e3-b102-17bc9f30ce52/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "7569d39e-9108-4c20-bbda-d1715a09d628",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7569d39e-9108-4c20-bbda-d1715a09d628/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7569d39e-9108-4c20-bbda-d1715a09d628/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "fae3636a-9927-4b38-bd2e-76fa02cbf94e",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/fae3636a-9927-4b38-bd2e-76fa02cbf94e/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/fae3636a-9927-4b38-bd2e-76fa02cbf94e/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Emerald Green Floral": "https://m.media-amazon.com/images/I/41UpOs5++kL._AC_SR38,50_.jpg",
    "Dusty Orchid Floral": "https://m.media-amazon.com/images/I/41SQTEWNhnL._AC_SR38,50_.jpg",
    "Yellow Floral Green": "https://m.media-amazon.com/images/I/41f3AzoYK4L._AC_SR38,50_.jpg",
    "Purple Floral Blue": "https://m.media-amazon.com/images/I/41z8tmWM6oL._AC_SR38,50_.jpg",
    "Blue Golden Flower": "https://m.media-amazon.com/images/I/41EzzSnFXzL._AC_SR38,50_.jpg",
    "Dusty Olive Floral": "https://m.media-amazon.com/images/I/41Z+aYFgFHL._AC_SR38,50_.jpg",
    "Rose Red Flower": "https://m.media-amazon.com/images/I/41qv2ZLXNvL._AC_SR38,50_.jpg",
    "Floral Black Yellow": "https://m.media-amazon.com/images/I/41snfrvAogL._AC_SR38,50_.jpg",
    "Red and Yellow Rose": "https://m.media-amazon.com/images/I/41ZGvDV7oKL._AC_SR38,50_.jpg",
    "Brown Floral Dark Blue": "https://m.media-amazon.com/images/I/41j2I+E7mzL._AC_SR38,50_.jpg",
    "Floral Lake Blue": "https://m.media-amazon.com/images/I/41SZrSVyOFL._AC_SR38,50_.jpg",
    "Light Blue Floral": "https://m.media-amazon.com/images/I/41Wr5E56nVL._AC_SR38,50_.jpg",
    "Apricot Black Flower": "https://m.media-amazon.com/images/I/41jjeVHslqL._AC_SR38,50_.jpg",
    "Black Red Flower": "https://m.media-amazon.com/images/I/41N0YaulH5L._AC_SR38,50_.jpg",
    "Multicolored Rose Apricot": "https://m.media-amazon.com/images/I/31sO78jH-AL._AC_SR38,50_.jpg",
    "Pink Flower": "https://m.media-amazon.com/images/I/41lckWOE8hL._AC_SR38,50_.jpg",
    "Purple Rose": "https://m.media-amazon.com/images/I/41tN7lydr6L._AC_SR38,50_.jpg",
    "Floral Green": "https://m.media-amazon.com/images/I/417KAufo8IL._AC_SR38,50_.jpg",
    "Pink Peony White": "https://m.media-amazon.com/images/I/41VDabr6LyL._AC_SR38,50_.jpg",
    "Navy Red Floral": "https://m.media-amazon.com/images/I/41gvdOH3XkL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Emerald Green Floral": "81Y-bDh2mgL",
    "Dusty Orchid Floral": "71w91qInEcL",
    "Yellow Floral Green": "71mBTa0o2oL",
    "Purple Floral Blue": "81ObDGf2v1L",
    "Blue Golden Flower": "81eogCx6HlL",
    "Dusty Olive Floral": "71q7VfxhXjL",
    "Rose Red Flower": "71ulpQjIdmL",
    "Floral Black Yellow": "71hKzKWC8kL",
    "Red and Yellow Rose": "71tAbGI9psL",
    "Brown Floral Dark Blue": "71pRdLzszdL",
    "Floral Lake Blue": "71T5sG2nIoL",
    "Light Blue Floral": "71HOunnxaSL",
    "Apricot Black Flower": "71jm6hKojvL",
    "Black Red Flower": "71gKyB2-LfL",
    "Multicolored Rose Apricot": "71LXghCAi+L",
    "Pink Flower": "81wnkGzEHjL",
    "Purple Rose": "81RuMRjz4FL",
    "Floral Green": "71m9JFZZXpL",
    "Pink Peony White": "814tevoRVEL",
    "Navy Red Floral": "81MzkNbVg2L"
  },
  "color_images": {
    "Emerald Green Floral": [
      "https://m.media-amazon.com/images/I/81Y-bDh2mgL._SL1500_.jpg"
    ],
    "Dusty Orchid Floral": [
      "https://m.media-amazon.com/images/I/71w91qInEcL._SL1500_.jpg"
    ],
    "Yellow Floral Green": [
      "https://m.media-amazon.com/images/I/71mBTa0o2oL._SL1500_.jpg"
    ],
    "Purple Floral Blue": [
      "https://m.media-amazon.com/images/I/81ObDGf2v1L._SL1500_.jpg"
    ],
    "Blue Golden Flower": [
      "https://m.media-amazon.com/images/I/81eogCx6HlL._SL1500_.jpg"
    ],
    "Dusty Olive Floral": [
      "https://m.media-amazon.com/images/I/71q7VfxhXjL._SL1500_.jpg"
    ],
    "Rose Red Flower": [
      "https://m.media-amazon.com/images/I/71ulpQjIdmL._SL1500_.jpg"
    ],
    "Floral Black Yellow": [
      "https://m.media-amazon.com/images/I/71hKzKWC8kL._SL1500_.jpg"
    ],
    "Red and Yellow Rose": [
      "https://m.media-amazon.com/images/I/71tAbGI9psL._SL1500_.jpg"
    ],
    "Brown Floral Dark Blue": [
      "https://m.media-amazon.com/images/I/71pRdLzszdL._SL1500_.jpg"
    ],
    "Floral Lake Blue": [
      "https://m.media-amazon.com/images/I/71T5sG2nIoL._SL1500_.jpg"
    ],
    "Light Blue Floral": [
      "https://m.media-amazon.com/images/I/71HOunnxaSL._SL1500_.jpg"
    ],
    "Apricot Black Flower": [
      "https://m.media-amazon.com/images/I/71jm6hKojvL._SL1500_.jpg"
    ],
    "Black Red Flower": [
      "https://m.media-amazon.com/images/I/71gKyB2-LfL._SL1500_.jpg"
    ],
    "Multicolored Rose Apricot": [
      "https://m.media-amazon.com/images/I/71LXghCAi+L._SL1500_.jpg"
    ],
    "Pink Flower": [
      "https://m.media-amazon.com/images/I/81wnkGzEHjL._SL1500_.jpg"
    ],
    "Purple Rose": [
      "https://m.media-amazon.com/images/I/81RuMRjz4FL._SL1500_.jpg"
    ],
    "Floral Green": [
      "https://m.media-amazon.com/images/I/71m9JFZZXpL._SL1500_.jpg"
    ],
    "Pink Peony White": [
      "https://m.media-amazon.com/images/I/814tevoRVEL._SL1500_.jpg"
    ],
    "Navy Red Floral": [
      "https://m.media-amazon.com/images/I/81MzkNbVg2L._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-sleeveless-maxi",
      "title": "Womens Maxi Dress Sleeveless Maxi",
      "price": 42.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61HRr0Xk8rL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal",
      "title": "Womens Maxi Dress Formal",
      "price": 85.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61F5d3ZfNOL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-formal-short-sleeve-cocktail-v-neck",
      "title": "Womens Maxi Dress Maxi Formal Short Sleeve Cocktail V Neck",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61oikC7o1TL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail-v-neck",
      "title": "Womens Dress Cocktail V Neck",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/712spNNP9kL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-maxi",
      "title": "Womens Maxi Dress Long Sleeve Maxi",
      "price": 69.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/4124GHJyoEL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-bodycon-long-sleeve",
      "title": "Womens Maxi Dress Bodycon Long Sleeve",
      "price": 48.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51lq6qHEjqL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-maxi",
      "title": "Womens Maxi Dress Long Sleeve Maxi",
      "price": 33.29,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51Z7G4x4yEL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-maxi-sleeveless",
      "title": "Womens Maxi Dress Cocktail Maxi Sleeveless",
      "price": 46.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51oQSnmj+hL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-v-neck",
      "title": "Womens Maxi Dress Maxi V Neck",
      "price": 45.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/718u-jSEcIL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-v-neck-maxi-cocktail-split",
      "title": "Womens Maxi Dress Formal V Neck Maxi Cocktail Split",
      "price": 60.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61aI0CiufFL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-sleeveless-v-neck",
      "title": "Womens Dress Sleeveless V Neck",
      "price": 37.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71OWV0uu-HL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-bodycon-cocktail",
      "title": "Womens Maxi Dress Long Sleeve Bodycon Cocktail",
      "price": 29.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71uLDl8TnLL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-long-sleeve-ruched-bodycon",
      "title": "Womens Maxi Dress Cocktail Long Sleeve Ruched Bodycon",
      "price": 32.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61OCQ5rPyoL._SL1500_.jpg"
      ]
    }
  ]
}