{
  "id": "womens-maxi-dress-cocktail-v-neck-evening-formal",
  "handle": "womens-maxi-dress-cocktail-v-neck-evening-formal",
  "sku": "JC1178",
  "asin": "B0F82WYX7P",
  "title": "Womens Maxi Dress Cocktail V Neck Evening Formal",
  "title_original": "Black Formal Dresses for Women Gowns Evening Party Cocktail Dress,Women Formal Party Dress,V Neck Wedding Guest Dresses.",
  "brand": "Visit the Lesuxa Store",
  "price": 56.39,
  "social_proof": {
    "bought_past_month": 50,
    "text": "50+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/71NTVc6YT5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71zc4d2fXZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81Sy3mfu3LL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81RnHGxrnAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81TyY2u655L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71tZ6crTT6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91IofkjXadL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81WOEV5GPrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71TZAR5RxrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/613SFD03T7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71pwB-6ysZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61JMUJqjNKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71kGEicqnxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81zBq0va-TL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81GfTPgo6KL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/810uketh+5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81jIOlT3HUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81w+awjnluL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81ok5RlWHdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/812bMNri4VL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/71NTVc6YT5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71zc4d2fXZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81Sy3mfu3LL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81RnHGxrnAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81TyY2u655L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71tZ6crTT6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91IofkjXadL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81WOEV5GPrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71TZAR5RxrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/613SFD03T7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71pwB-6ysZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61JMUJqjNKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71kGEicqnxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81zBq0va-TL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81GfTPgo6KL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/810uketh+5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81jIOlT3HUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81w+awjnluL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81ok5RlWHdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/812bMNri4VL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ August 29, 2025",
    "Manufacturer ‏": "‎ Lesuxa",
    "ASIN ‏": "‎ B0FP4WHLJT",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#195,082 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #1,008 in Women's Formal Dresses #1,604 in Women's Club & Night Out Dresses",
    "Customer Reviews": "4.4 4.4 out of 5 stars (41)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Black-018",
      "Black",
      "Purple-223"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.4,
    "count": 41,
    "customers_say": null,
    "items": [
      {
        "title": "5.0 out of 5 stars Beautiful dress",
        "body": "I bought this dress to wear to a wedding. Love the softness and sparkles. It is stretchy yet doesn’t bag after wearing it several hours. I received a lot of compliments on the dress. Read more",
        "author": "NanaD",
        "rating": 5.0,
        "date": "November 12, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Sparkle Kissed, Soft Draped, Feminine to the Core, and Kitten Approved. Swoon~",
        "body": "The First Look The moment I slipped this dress from its package, I felt that quiet little flutter a girl gets when something truly beautiful brushes against her fingertips. She is feminine to the core, a vision of evening softness with butterfly sleeves that float like a sigh. The wrap-style bodice is sewn securely so nothing shifts out of place, and the gentle V neckline is held by a tiny snap that keeps the look polished instead of plunging. On my 5'3 frame, the tea length becomes a graceful ankle graze and the whole silhouette feels dreamy, delicate and ready to glide into a Christmas party or a New Year’s night of sparkle. The Feel and Fit I sized up twice because I wanted a little extra room, and while she is a touch looser than I hoped, that is entirely on me. A quick side take-in will make her perfect. Even so, the dress hugs the waist in a soft, flattering way and then flows down the body with a lovely freedom, no cling, no squeeze, just feminine drape and a gentle sway. The hidden back zipper earns its keep by sliding smoothly without tugging and the shape it gives feels both chic and modest, the kind of beauty that never begs for attention but always receives it. ----------------------------------------------------------- The Fabric Breakdown: The Sparkling Softness Duo 95% Polyester, The Elegant Shapeshifter Smooth, drapey, and quietly strong, it gives this dress its body skimming grace. It resists wrinkles, holds its flow and creates that lovely polished finish that moves with you like a confident whisper. 5% Spandex, The Secret Stretch Just enough give to keep everything comfortable, never stiff, never restrictive. It lets the dress mold softly to your shape while staying true to its silhouette. Together they create a fabric that feels smooth on the inside and lightly dazzling on the outside, never itchy, never cheap. ----------------------------------------------------------- The Look and the Little Sparkles The outer layer carries a sprinkle of sequins, not a loud party storm but a refined constellation that catches light the way moonlight catches water. Elegant, not club-ish, and beautifully balanced. The dress is not lined, yet the fabric itself has two faces. The inner face is soft and kind to the skin, while the outer face holds the shimmer. I adore the cascading drape from waist to hem. It falls in a gentle ruffle that lengthens the body and adds that romantic movement that makes you want to walk a little slower just to feel it. Kitten VIP Wash Routine She asked for a hand wash but I gave her my kitten VIP treatment. Cold water, gentle cycle and gentle soap, a no heat fluff and a patient lay flat to dry, and she behaved like a perfect lady. No color loss, no loosened sparkles, just renewed softness and that same elegant shimmer she arrived with. In Closing This dress is feminine grace wrapped in sparkle, the kind of piece that makes you straighten your posture and let a little purr curl behind your smile. She is elegant, flattering, modern, and sweetly modest. Nothing about her feels cheap or rushed. She feels like a night worth remembering. I am smitten like a kitten and already planning where she will shine first. Perfect for holiday nights, winter celebrations or any moment that asks for beauty with a soft little twirl. Read more",
        "author": "Heart of Lace, Shield of Fire",
        "rating": 5.0,
        "date": "December 8, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars An elegant formal dress for women that can serve almost any occasion.",
        "body": "\"Black Formal Dress for Women Gown Evening Party Cocktail Dress, Women's Formal Party Dress, V-Neck Wedding Guest Dresses.\" Here is an elegant formal dress for women that can serve as a beautiful evening gown, cocktail party dress, or women's formal party dress. The black sequined fabric is soft and lightweight and has a touch of stretchiness to it that dares you to put it on. This elegantly styled dress has a classic A-Line contour, and falls to about mid-calf. It suits practically every body type you can imagine and gives a chic yet modest look. This fashionable outfit also features a flattering V-neckline that adds a touch of charm for those women who may want to show off a gorgeous choker, necklace, or diamond necklace or heart pendant. Added sequins make this dress quite trendy, and youthful-looking. It's a fabulous choice for an evening out with friends, party time, wedding day, homecoming, cocktail, bridesmaid, dinner gatherings, shopping, street, graduation, birthday parties, or a casual evening out with friends. The only issue that I had with the garment is despite it's obvious beauty I do not like having to adjust my thinking when it comes to sizing. I'm an American woman, who is used to standard American sizing. So, when ordering a piece of clothing, I really want to trust the sizing. I hate anticipating receiving a beautiful outfit only to find that it doesn't fit well because I chose the wrong size. Read more",
        "author": "Charlotte A. Clark-Frieson",
        "rating": 4.0,
        "date": "December 6, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61BChi6lawL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/61eK+LYzviL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/61fPKW1T32L._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71O-ARx5SAL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/61JvPzcrygL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Stunning, Sparkly, and Shockingly Comfortable",
        "body": "I am genuinely blown away by this dress. The first thing I noticed when I took it out of the package was how incredibly soft and comfortable the fabric is. It has that smooth, drapey feel that makes you wonder if you should really be wearing something this cozy to a formal event. And then—oh my goodness—the sparkle. I was nervous it would be the dreaded loose glitter that sheds everywhere like a craft project gone wrong, but absolutely not. The sparkles are sewn in, not glued on, and they catch the light in the most elegant, eye-catching way. It looks far more expensive than it is, and best of all, nothing rubs off, flakes, or transfers. The cut of this dress deserves its own standing ovation. I normally wear shapewear under every fitted dress because I like a little smoothing, but the way this gown is designed made that completely unnecessary. The fit is incredibly flattering—supportive in the right places, skimming where it should, and flowing where it needs to. I felt confident, polished, and honestly a little surprised at how much I loved the shape without any extra layers underneath. The V-neckline is tasteful, the length is perfect, and the overall silhouette strikes that ideal balance between formal elegance and effortless comfort. I wore it to an evening event and received multiple compliments, including someone asking where I got it because “it sparkles without being glittery,” which is exactly the magic this dress delivers. If you’re on the fence, especially about comfort or glitter fallout, let me reassure you—this dress is a winner. Beautiful, flattering, and comfortable enough to wear all night. I would recommend it 100%. Read more",
        "author": "Daniella",
        "rating": 5.0,
        "date": "November 18, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71XpLXUleIL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71LHJWOHAFL._SY88._SL1500_.jpg"
        ]
      }
    ]
  },
  "short_description": "Womens Maxi Dress Cocktail V Neck Evening Formal is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.",
  "about_this_item": "Womens Maxi Dress Cocktail V Neck Evening Formal is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.",
  "long_description": "Womens Maxi Dress Cocktail V Neck Evening Formal is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Black-018, Black, Purple-223. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Cocktail V Neck Evening Formal is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Black-018, Black, Purple-223. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "bb97c852-9aac-4031-9a0a-46731ccd56aa",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bb97c852-9aac-4031-9a0a-46731ccd56aa/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bb97c852-9aac-4031-9a0a-46731ccd56aa/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/ac0cb415-2962-488c-84a5-014808b7d683.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "6eca0eea-3899-4d14-94c6-1b70fe5453db",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6eca0eea-3899-4d14-94c6-1b70fe5453db/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6eca0eea-3899-4d14-94c6-1b70fe5453db/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/ac0cb415-2962-488c-84a5-014808b7d683.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "a4b110ee-8616-4a10-85a5-fc09966b48f4",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a4b110ee-8616-4a10-85a5-fc09966b48f4/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a4b110ee-8616-4a10-85a5-fc09966b48f4/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/ac0cb415-2962-488c-84a5-014808b7d683.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "785a37f5-36a9-4c20-bce7-df61672b74c3",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/785a37f5-36a9-4c20-bce7-df61672b74c3/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/785a37f5-36a9-4c20-bce7-df61672b74c3/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/ac0cb415-2962-488c-84a5-014808b7d683.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "390664d7-96d1-42a1-b008-263482714517",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/390664d7-96d1-42a1-b008-263482714517/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/390664d7-96d1-42a1-b008-263482714517/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/ac0cb415-2962-488c-84a5-014808b7d683.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "8135e1c6-027a-47e8-93ce-738a2f257afc",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8135e1c6-027a-47e8-93ce-738a2f257afc/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8135e1c6-027a-47e8-93ce-738a2f257afc/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/ac0cb415-2962-488c-84a5-014808b7d683.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "bb6a216d-939d-470a-bf9b-b9593fcc6302",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bb6a216d-939d-470a-bf9b-b9593fcc6302/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bb6a216d-939d-470a-bf9b-b9593fcc6302/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/ac0cb415-2962-488c-84a5-014808b7d683.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "27626e1b-e95f-4c51-9ec4-e251b460d680",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/27626e1b-e95f-4c51-9ec4-e251b460d680/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/27626e1b-e95f-4c51-9ec4-e251b460d680/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/ac0cb415-2962-488c-84a5-014808b7d683.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Black-018": "https://m.media-amazon.com/images/I/414EXHfP2EL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/415DcJEkWSL._AC_SR38,50_.jpg",
    "Purple-223": "https://m.media-amazon.com/images/I/415gSeEpdcL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Black-018": "71NTVc6YT5L",
    "Black": "71TZAR5RxrL",
    "Purple-223": "81zBq0va-TL"
  },
  "color_images": {
    "Black-018": [
      "https://m.media-amazon.com/images/I/71NTVc6YT5L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71zc4d2fXZL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81Sy3mfu3LL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81RnHGxrnAL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81TyY2u655L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71tZ6crTT6L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/91IofkjXadL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81WOEV5GPrL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/71TZAR5RxrL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/613SFD03T7L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71pwB-6ysZL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61JMUJqjNKL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71kGEicqnxL._SL1500_.jpg"
    ],
    "Purple-223": [
      "https://m.media-amazon.com/images/I/81zBq0va-TL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81GfTPgo6KL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/810uketh+5L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81jIOlT3HUL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81w+awjnluL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81ok5RlWHdL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/812bMNri4VL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress-cocktail-evening-formal",
      "title": "Womens Dress Cocktail Evening Formal",
      "price": 53.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71O9kkR1wfL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-formal-sleeveless",
      "title": "Womens Dress Formal Sleeveless",
      "price": 41.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/616zDDTqi3L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 30.5,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61PEij+E1GL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-off-shoulder-mermaid",
      "title": "Womens Dress Off Shoulder Mermaid",
      "price": 139.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Wedding Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/61n04CfaRtL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-ruched-cocktail",
      "title": "Womens Dress Ruched Cocktail",
      "price": 47.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/81-Vk1vn3WL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61IGAau0ywL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-long-sleeve-mermaid-formal",
      "title": "Womens Maxi Dress Evening Long Sleeve Mermaid Formal",
      "price": 89.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Wedding Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/61zfgJCgyUL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-formal",
      "title": "Womens Maxi Dress Evening Formal",
      "price": 82.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61sqAown2BL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-short-sleeve",
      "title": "Womens Dress Short Sleeve",
      "price": 43.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51SC0J3glyL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-ruched-bodycon-sleeveless",
      "title": "Womens Dress Ruched Bodycon Sleeveless",
      "price": 33.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61viMtDU1pL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61-soOVYL7L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 239.56,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51m1Niq7kWL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 169.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51Cd8onMJbL._SL1500_.jpg"
      ]
    }
  ]
}