{
  "id": "womens-maxi-dress-v-neck-long-sleeve",
  "handle": "womens-maxi-dress-v-neck-long-sleeve",
  "sku": "JC2121",
  "asin": "B0F9LQT7HF",
  "title": "Womens Maxi Dress V Neck Long Sleeve",
  "title_original": "OFEEFAN Long Sleeve Sweater Dress Fall Dresses 2025 V Neck Empire Waist Baby Doll Dresses Women Casual Dress with Pockets",
  "brand": "Visit the OFEEFAN Store",
  "price": 19.99,
  "social_proof": {
    "bought_past_month": 64,
    "text": "64+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/71m+U9nujeL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71pRY3rm2gL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81arsx+uoHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81wBo9IE9IL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81LhCi3bcgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71hQeLey7EL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71-4HHjhX9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71L6Eugir2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81dAFo1eQcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71iLRr44yKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81xZ2Il4JgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71IgHkv+LML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81Hb4h6p1oL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71MxBryncGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71RVDg2rcHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71q19DVFaPL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/711bOTTJdWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81YBjrHI2zL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71wt7zvOJdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71nxlXuFIkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71jO3j+eLQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71zyaGC+j3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71EO8dIg2LL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/71m+U9nujeL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71pRY3rm2gL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81arsx+uoHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81wBo9IE9IL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81LhCi3bcgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71hQeLey7EL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71-4HHjhX9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71L6Eugir2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81dAFo1eQcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71iLRr44yKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81xZ2Il4JgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71IgHkv+LML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81Hb4h6p1oL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71MxBryncGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71RVDg2rcHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71q19DVFaPL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/711bOTTJdWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81YBjrHI2zL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71wt7zvOJdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71nxlXuFIkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71jO3j+eLQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71zyaGC+j3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71EO8dIg2LL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ August 20, 2025",
    "ASIN ‏": "‎ B0FVV7C4L1",
    "Best Sellers Rank": "#2,704 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #12 in Women's Casual Dresses",
    "Customer Reviews": "4.3 4.3 out of 5 stars (745)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Blue",
      "S-orange Stripe",
      "T-green Grey Plaid",
      "T-greyblue Orange Floral",
      "Apricot",
      "T-red Black Plaid",
      "Black",
      "T-yellow Brown Plaid",
      "Red",
      "T-tie Dye Navyfloral",
      "Khaki",
      "Pink",
      "T-leopard",
      "Purple",
      "S-wine Red Stripe",
      "T-black Floral",
      "Caramel",
      "Green",
      "Chocolate Brown"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.3,
    "count": 745,
    "customers_say": "Customers find the dress comfortable and cozy like a sweater, with a perfect oversized fit that can be dressed up or worn casually. They appreciate its soft material and consider it a wonderful autumn or winter dress, with one customer noting it's great for all-day wear or evening wear. Customers find the dress flattering, with one mentioning its empire waist cut, and they like its warmth, with one noting it works well in Texas fall and winter weather. The material thickness receives mixed feedback, with several customers describing it as thin. Generated from the text of customer reviews Select to learn more Fit (83) Style (81) Comfort (67) Soft fabric (47) Dress fit (37) Flattering (23) Warmth (22) Material thickness (25) 83 customers mention fit, 67 positive, 16 negative 83 customers mention \"Fit\" 67 positive 16 negative Customers like how the dress fits, describing it as perfect oversized and loose, with one customer noting it skims without being tight. \" Love the dress! Has deep pockets. Very soft and comfortable. True to size . The fit is perfect. Not too thin or thick. \" Read more \" ...dress, love the pink color, it is very breathable & not fitted, fits well even if you have a bit of a belly \" Read more \" ...I can't wait to wear it with boots. I wear a medium and this dress fits perfectly .... \" Read more \" Comfy and Cute! Fits true to size and will be super easy to take from early fall into winter and beyond \" Read more 81 customers mention style, 76 positive, 5 negative 81 customers mention \"Style\" 76 positive 5 negative Customers find the dress stylish, describing it as a wonderful autumn or winter dress that looks professional. One customer mentions it comes with accessories for different looks. \" This dress is cute , it fit well even after washing, it just got shorter. I washed it before wearing it and it shrunk a little.... \" Read more \" Super cute ! Very soft and comfortable. Looks great with boots! Good quality and holds it shape nicely. Got lots of compliments. \" Read more \" very cute and flows dress, love the pink color, it is very breathable & not fitted, fits well even if you have a bit of a belly \" Read more \" ...Cons: • The green is slightly less vibrant in person, but still very pretty (not even a real con)... \" Read more 67 customers mention comfort, 62 positive, 5 negative 67 customers mention \"Comfort\" 62 positive 5 negative Customers find the dress comfortable, describing it as cozy like a sweater, though some mention the fabric is itchy and awful. \" ...The material is soft, comfortable and great for all day wear or evening wear. I got so many compliments when I wore it to a friends outdoor wedding.... \" Read more \" Comfy and soft. Fitted enough to be flattering, but loose enough to be comfortable. Luv the pockets too! 120 lbs, 5’5”, size small \" Read more \" Got this for our family holiday photos and it was fantastic. Very comfortable , cozy, and figure flattering on this mom of 2.... \" Read more \" Super cute and comfortable dress .. looks so cute with leggings and boots! Washes well and is soft! \" Read more 47 customers mention soft fabric, 45 positive, 2 negative 47 customers mention \"Soft fabric\" 45 positive 2 negative Customers appreciate the dress's soft material. \" Comfy and soft . Fitted enough to be flattering, but loose enough to be comfortable. Luv the pockets too! 120 lbs, 5’5”, size small \" Read more \" This dress is super soft and flattering. It's the perfect fall dress. Looks cute with tennis shoes, flats or boots! \" Read more \" Super cute! Very soft and comfortable. Looks great with boots! Good quality and holds it shape nicely. Got lots of compliments. \" Read more \" Love the long arms, perfect for layering. It’s so soft but ONLY on the outside of the dress. The inside is very itchy. I put it on inside out.... \" Read more 37 customers mention dress fit, 34 positive, 3 negative 37 customers mention \"Dress fit\" 34 positive 3 negative Customers find the dress fits well and can be dressed up or worn casually, with one customer noting it's suitable for all-day wear or evening events. \" Great dress but had to return it because it runs really short. In the pic it goes to the models knee but it was more mid thigh.... \" Read more \" Great fall dress !... \" Read more \" Perfect fall dress . I got a large (I weigh 185lbs) and it is perfect oversized, flowy, and comfortable. The material is very soft. \" Read more \" Cute and casual . Fits nice. Thought it would be a little heavier material. Will look great with boots. \" Read more 23 customers mention flattering, 21 positive, 2 negative 23 customers mention \"Flattering\" 21 positive 2 negative Customers find the dress flattering, particularly noting its flattering empire cut and how it gives a shape to the body, with one customer mentioning it's low enough to be flattering without being revealing. \" ...V-neck that’s modest but still flattering • Comfortable thickness for indoor gatherings or warmer climates •... \" Read more \" This dress fit true to size. I love how it looks and feels. Very flattering . I don't like my upper arms, sleeves looks great, no need for a sweater.... \" Read more \" Such a flattering dress !... \" Read more \" ...Very comfortable, cozy, and figure flattering on this mom of 2. Will be getting this in another color or two. \" Read more 22 customers mention warmth, 20 positive, 2 negative 22 customers mention \"Warmth\" 20 positive 2 negative Customers find the dress perfect for winter and fall, with one mentioning it's great for layering. \" It runs awfully big and the material is 100% see through. It is warm , but nothing like the picture. I’m super sad! \" Read more \" ...It’s so comfortable fall right above the knee has pockets and is perfect for fall . I wore on my birthday to a winery with boots. \" Read more \" nice, comfortable dress, great for summer as it is wide and airy. love it \" Read more \" Love this. Great price. Warm for winter . Can dress it up or wear casual. Love this fall color but comes in many color. \" Read more 25 customers mention material thickness, 7 positive, 18 negative 25 customers mention \"Material thickness\" 7 positive 18 negative Customers report that the dress's material is thin, with one customer noting that the skirt is made of a different fabric. \" Very thin material . I'm returning it shows every little nook and cranny on the body or undergarments. \" Read more \" Very thin and cheaply made disappointing \" Read more \" Thin sweater dress . I could have went a size smaller but I haven't washed it yet so maybe it will shrink a little.... \" Read more \" Dress is very thin and you must wear a slip underneath \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Just found my Thanksgiving outfit!",
        "body": "I bought this green sweater dress in a size small to wear for Friendsgiving and holiday events this fall. I’m 5'4\" and 125 pounds, and the fit is perfect. It’s fitted through the top with a little flare at the bottom that gives my athletic frame a waist and a really flattering shape. The v-neck is modest but still low enough to be flattering without feeling revealing. The fabric is the a soft ribbed material. It feels cozy like a sweater but has the lighter weight of a shirt, so it’s comfortable for indoor events or mild fall weather. It isn’t see-through, and the color is a bit less vibrant in person than online, leaning toward an earthy green. I still really like it. Pros: • Soft ribbed fabric that feels cozy but lightweight • Flattering fit through the waist with a gentle flare • V-neck that’s modest but still flattering • Comfortable thickness for indoor gatherings or warmer climates • True to size and fits perfectly on an athletic build Cons: • The green is slightly less vibrant in person, but still very pretty (not even a real con) Verdict: 5 stars and it's going to be my Thanksgiving outfit! Flattering, soft, and perfect for any fall event. I’m pairing it with knee-high boots and keeping it for sure. It's one of those pieces I’m genuinely excited about. And I scour reviews before buying things, so I hope I can pay it forward and help someone else!! Read more",
        "author": "Useful University | Julia & Marc",
        "rating": 5.0,
        "date": "November 11, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71T6dn2r5+L._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71HqhT+d64L._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71OM24X7-XL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71kgYFWCJ0L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Best sweater dress!",
        "body": "The media could not be loaded. This sweater dress is so comfortable and flattering. The ribbed fabric has a nice stretch without being flimsy, and the fit is easy while still giving some shape at the waist. The length is perfect with tights and boots, and the V-neck is just the right depth. It’s warm enough for cooler weather but not too heavy. I’ve worn it out and also casually and it works for both. Super cute, easy piece to throw on and go. Would definitely buy this in another color. Read more",
        "author": "k.bellah",
        "rating": 5.0,
        "date": "December 7, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/713uYsQGm4L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Great dress",
        "body": "I absolutely love this dress, it is so comfortable, I received many compliments the first time I wore it. It’s so cozy and it has pockets. The fit is vey flattering. Great price point! Not sheer but lightweight enough for Florida “winter”. Looks great styled with boots or flats, love the color I purchased as well!! Read more",
        "author": "Tara Hardy",
        "rating": 5.0,
        "date": "November 14, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71aHjVe5zCL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "4.0 out of 5 stars Comfy!",
        "body": "The fabric is soft and it fits comfortably! It’s a wonderful autumn or winter dress. I pair it with leggings and cute shoes/boots. The cut isn’t the best for my shape, but that doesn’t bother me much because I feel comfortable wearing it. Read more",
        "author": "Customer",
        "rating": 4.0,
        "date": "November 30, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Super comfy",
        "body": "This dress is super cute. I found it works well with the days where it’s warmer during the day and cooler at night. The material isn’t overly thick and the sizing is pretty true. Read more",
        "author": "Customer",
        "rating": 5.0,
        "date": "December 12, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Great dress - great value!",
        "body": "Super cute and comfortable dress.. looks so cute with leggings and boots! Washes well and is soft! Read more",
        "author": "CK",
        "rating": 5.0,
        "date": "December 16, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Soft, comfortable and true to size",
        "body": "Love the dress! Has deep pockets. Very soft and comfortable. True to size. The fit is perfect. Not too thin or thick. Read more",
        "author": "Angie Gillespie",
        "rating": 5.0,
        "date": "November 22, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Adorable.",
        "body": "Adorable! I got this in medium and it fits nicely. 5’4” tall and 135 lbs. It skims without being tight, and the length is perfect for me. I tend to be long waisted, so an extra inch in the bodice would have been perfect, but it’s good overall. It lost one star because I chose the black with plaid skirt, and the skirt is a different material. I thought it was a light sweater dress overall, but only the solid colors are. I do really like it, though, and overall it’s a cute dress. Read more",
        "author": "Customer",
        "rating": 4.0,
        "date": "November 14, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress V Neck Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.",
  "about_this_item": "Womens Maxi Dress V Neck Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.",
  "long_description": "Womens Maxi Dress V Neck Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Blue, S-orange Stripe, T-green Grey Plaid, T-greyblue Orange Floral, Apricot, T-red Black Plaid, Black, T-yellow Brown Plaid, Red, T-tie Dye Navyfloral, Khaki, Pink, T-leopard, Purple. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress V Neck Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Blue, S-orange Stripe, T-green Grey Plaid, T-greyblue Orange Floral, Apricot, T-red Black Plaid, Black, T-yellow Brown Plaid, Red, T-tie Dye Navyfloral, Khaki, Pink, T-leopard, Purple. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "0e59f9aa-a57e-4651-b63b-6dea384fcd68",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0e59f9aa-a57e-4651-b63b-6dea384fcd68/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0e59f9aa-a57e-4651-b63b-6dea384fcd68/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "7848219d-66a1-4bdb-96b8-783cd97c34c8",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7848219d-66a1-4bdb-96b8-783cd97c34c8/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7848219d-66a1-4bdb-96b8-783cd97c34c8/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "8da621ca-d4e3-45aa-bfba-5fe2df888703",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8da621ca-d4e3-45aa-bfba-5fe2df888703/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8da621ca-d4e3-45aa-bfba-5fe2df888703/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "4b6ef8de-3b81-461d-945a-30d6e9fc461e",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4b6ef8de-3b81-461d-945a-30d6e9fc461e/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4b6ef8de-3b81-461d-945a-30d6e9fc461e/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "2e9ed700-0c3d-4e14-a734-cc992af7b1f6",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2e9ed700-0c3d-4e14-a734-cc992af7b1f6/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2e9ed700-0c3d-4e14-a734-cc992af7b1f6/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "a3422501-8c47-4acd-8e33-dea9b4876d38",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a3422501-8c47-4acd-8e33-dea9b4876d38/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a3422501-8c47-4acd-8e33-dea9b4876d38/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "ff33b23d-8220-4b4a-be2b-5e265e11dd7f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ff33b23d-8220-4b4a-be2b-5e265e11dd7f/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ff33b23d-8220-4b4a-be2b-5e265e11dd7f/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "a7b423db-f6f1-4235-a309-5c1393718f29",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a7b423db-f6f1-4235-a309-5c1393718f29/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a7b423db-f6f1-4235-a309-5c1393718f29/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "c8a85d3a-a6c6-41f9-b026-935520867e87",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c8a85d3a-a6c6-41f9-b026-935520867e87/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c8a85d3a-a6c6-41f9-b026-935520867e87/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "1d404802-7e77-448a-a389-2b8ecca73787",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1d404802-7e77-448a-a389-2b8ecca73787/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1d404802-7e77-448a-a389-2b8ecca73787/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "7b91df54-124d-40ca-9843-5d806461118f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7b91df54-124d-40ca-9843-5d806461118f/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7b91df54-124d-40ca-9843-5d806461118f/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "ef96d084-7d70-4901-ac22-40c3812bef66",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ef96d084-7d70-4901-ac22-40c3812bef66/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ef96d084-7d70-4901-ac22-40c3812bef66/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Blue": "https://m.media-amazon.com/images/I/41iWIBeykIL._AC_SR38,50_.jpg",
    "S-orange Stripe": "https://m.media-amazon.com/images/I/41iLfBPY+wL._AC_SR38,50_.jpg",
    "T-green Grey Plaid": "https://m.media-amazon.com/images/I/41gchZkXQ+L._AC_SR38,50_.jpg",
    "T-greyblue Orange Floral": "https://m.media-amazon.com/images/I/51EZoirKguL._AC_SR38,50_.jpg",
    "Apricot": "https://m.media-amazon.com/images/I/419lN1z3zOL._AC_SR38,50_.jpg",
    "T-red Black Plaid": "https://m.media-amazon.com/images/I/41cSbG6AQWL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/41uveqpu8UL._AC_SR38,50_.jpg",
    "T-yellow Brown Plaid": "https://m.media-amazon.com/images/I/417I2rJcjuL._AC_SR38,50_.jpg",
    "Red": "https://m.media-amazon.com/images/I/41nx1zFETIL._AC_SR38,50_.jpg",
    "T-tie Dye Navyfloral": "https://m.media-amazon.com/images/I/41TzH8RvmvL._AC_SR38,50_.jpg",
    "Khaki": "https://m.media-amazon.com/images/I/41HvBcFpk6L._AC_SR38,50_.jpg",
    "Pink": "https://m.media-amazon.com/images/I/41Ik9npvaCL._AC_SR38,50_.jpg",
    "T-leopard": "https://m.media-amazon.com/images/I/51Nkdd81oAL._AC_SR38,50_.jpg",
    "Purple": "https://m.media-amazon.com/images/I/413D7cUAQDL._AC_SR38,50_.jpg",
    "S-wine Red Stripe": "https://m.media-amazon.com/images/I/41McXkUtSuL._AC_SR38,50_.jpg",
    "T-black Floral": "https://m.media-amazon.com/images/I/41XRdodIPzL._AC_SR38,50_.jpg",
    "Caramel": "https://m.media-amazon.com/images/I/41El2iapdjL._AC_SR38,50_.jpg",
    "Green": "https://m.media-amazon.com/images/I/41AKeGLAcAL._AC_SR38,50_.jpg",
    "Chocolate Brown": "https://m.media-amazon.com/images/I/41kV--x-z9L._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Blue": "71hQeLey7EL",
    "S-orange Stripe": "71-4HHjhX9L",
    "T-green Grey Plaid": "71L6Eugir2L",
    "T-greyblue Orange Floral": "81dAFo1eQcL",
    "Apricot": "71iLRr44yKL",
    "T-red Black Plaid": "81xZ2Il4JgL",
    "Black": "71IgHkv+LML",
    "T-yellow Brown Plaid": "81Hb4h6p1oL",
    "Red": "71MxBryncGL",
    "T-tie Dye Navyfloral": "71RVDg2rcHL",
    "Khaki": "71q19DVFaPL",
    "Pink": "711bOTTJdWL",
    "T-leopard": "81YBjrHI2zL",
    "Purple": "71wt7zvOJdL",
    "S-wine Red Stripe": "71nxlXuFIkL",
    "T-black Floral": "71jO3j+eLQL",
    "Caramel": "71zyaGC+j3L",
    "Green": "71m+U9nujeL",
    "Chocolate Brown": "71EO8dIg2LL"
  },
  "color_images": {
    "Blue": [
      "https://m.media-amazon.com/images/I/71hQeLey7EL._SL1500_.jpg"
    ],
    "S-orange Stripe": [
      "https://m.media-amazon.com/images/I/71-4HHjhX9L._SL1500_.jpg"
    ],
    "T-green Grey Plaid": [
      "https://m.media-amazon.com/images/I/71L6Eugir2L._SL1500_.jpg"
    ],
    "T-greyblue Orange Floral": [
      "https://m.media-amazon.com/images/I/81dAFo1eQcL._SL1500_.jpg"
    ],
    "Apricot": [
      "https://m.media-amazon.com/images/I/71iLRr44yKL._SL1500_.jpg"
    ],
    "T-red Black Plaid": [
      "https://m.media-amazon.com/images/I/81xZ2Il4JgL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/71IgHkv+LML._SL1500_.jpg"
    ],
    "T-yellow Brown Plaid": [
      "https://m.media-amazon.com/images/I/81Hb4h6p1oL._SL1500_.jpg"
    ],
    "Red": [
      "https://m.media-amazon.com/images/I/71MxBryncGL._SL1500_.jpg"
    ],
    "T-tie Dye Navyfloral": [
      "https://m.media-amazon.com/images/I/71RVDg2rcHL._SL1500_.jpg"
    ],
    "Khaki": [
      "https://m.media-amazon.com/images/I/71q19DVFaPL._SL1500_.jpg"
    ],
    "Pink": [
      "https://m.media-amazon.com/images/I/711bOTTJdWL._SL1500_.jpg"
    ],
    "T-leopard": [
      "https://m.media-amazon.com/images/I/81YBjrHI2zL._SL1500_.jpg"
    ],
    "Purple": [
      "https://m.media-amazon.com/images/I/71wt7zvOJdL._SL1500_.jpg"
    ],
    "S-wine Red Stripe": [
      "https://m.media-amazon.com/images/I/71nxlXuFIkL._SL1500_.jpg"
    ],
    "T-black Floral": [
      "https://m.media-amazon.com/images/I/71jO3j+eLQL._SL1500_.jpg"
    ],
    "Caramel": [
      "https://m.media-amazon.com/images/I/71zyaGC+j3L._SL1500_.jpg"
    ],
    "Green": [
      "https://m.media-amazon.com/images/I/71m+U9nujeL._SL1500_.jpg"
    ],
    "Chocolate Brown": [
      "https://m.media-amazon.com/images/I/71EO8dIg2LL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress-v-neck-sleeveless",
      "title": "Womens Dress V Neck Sleeveless",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/81T7G18uRnL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-boat-neck-sleeveless",
      "title": "Womens Dress Boat Neck Sleeveless",
      "price": 19.79,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/518oJldZIfL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-formal",
      "title": "Womens Dress Formal",
      "price": 69.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51vneqmjy1L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-bodycon-sleeveless",
      "title": "Womens Dress Bodycon Sleeveless",
      "price": 40.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61nnB4TWroL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 324.43,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/41gTuGV5SBL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-formal-evening",
      "title": "Womens Maxi Dress Formal Evening",
      "price": 94.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61fzKHOQJGL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-ruched-v-neck-cocktail-maxi-formal",
      "title": "Womens Maxi Dress Ruched V Neck Cocktail Maxi Formal",
      "price": 129.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71i8AuwBqUL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-off-shoulder-maxi",
      "title": "Womens Maxi Dress Bodycon Off Shoulder Maxi",
      "price": 36.89,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61DDKd5ehZL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-v-neck-bodycon",
      "title": "Womens Maxi Dress Long Sleeve V Neck Bodycon",
      "price": 47.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61QbwpUJEwL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 76.9,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Wedding Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/514+blcsiGL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening",
      "title": "Womens Maxi Dress Formal Evening",
      "price": 77.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61Hj4-S+4eL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-cocktail-ruched",
      "title": "Womens Maxi Dress Bodycon Cocktail Ruched",
      "price": 37.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/91HL3aBO+gL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-v-neck-cocktail-evening-long-sleeve",
      "title": "Womens Maxi Dress V Neck Cocktail Evening Long Sleeve",
      "price": 64.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/71jdGTmoWkL._SL1500_.jpg"
      ]
    }
  ]
}