{
  "id": "womens-maxi-dress-long-sleeve-cocktail",
  "handle": "womens-maxi-dress-long-sleeve-cocktail",
  "sku": "JC2261",
  "asin": "B0F9XT5JGC",
  "title": "Womens Maxi Dress Long Sleeve Cocktail",
  "title_original": "PRETTYGARDEN Cocktail Dresses for Women 2026 Elegant Classy Fall Long Sleeve Midi A Line Flowy Modest Winter Party Dress",
  "brand": "Visit the PRETTYGARDEN Store",
  "price": 51.99,
  "social_proof": {
    "bought_past_month": 308,
    "text": "308+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/61kZvoo1V7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61FqQ0Y1YZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61nrdFDMY4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/715lIlK47gL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61QSTbaw-tL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ofRAKMr5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/616stmS323L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61zw5Pw1MXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71kbUZQSNHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71BUlG7o4xL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ENVurd+jL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71jJscDR-mL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71r1OU7aBSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71bexa5P5kL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Z66FNXFqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71cg0kgUhwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/718cyTfYslL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61k06poR+eL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ZzG63dklL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71fnjjXOckL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71-JUcbi49L._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/61kZvoo1V7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61FqQ0Y1YZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61nrdFDMY4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/715lIlK47gL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61QSTbaw-tL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ofRAKMr5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/616stmS323L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61zw5Pw1MXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71kbUZQSNHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71BUlG7o4xL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ENVurd+jL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71jJscDR-mL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71r1OU7aBSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71bexa5P5kL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Z66FNXFqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71cg0kgUhwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/718cyTfYslL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61k06poR+eL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ZzG63dklL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71fnjjXOckL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71-JUcbi49L._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Package Dimensions ‏": "‎ 14 x 11 x 1.5 inches; 1.4 Pounds",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ August 10, 2025",
    "ASIN ‏": "‎ B0F9XTQF5T",
    "Best Sellers Rank": "#8,187 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #9 in Women's Cocktail Dresses",
    "Customer Reviews": "4.3 4.3 out of 5 stars (241)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Brown",
      "Blue",
      "Burgundy",
      "Apricot",
      "Army Green",
      "Black",
      "Dusty Blue",
      "Light Blue",
      "Dark Cyan",
      "Pink",
      "White",
      "Beige",
      "Dark Blue",
      "Grey Green"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.3,
    "count": 241,
    "customers_say": "Customers find the dress fits beautifully and appreciate its versatility, being able to dress it up or down. The dress features a nice hefty fabric and medium weight, with one customer noting it's perfect for cooler and cold weather. They praise its high quality construction, with one mentioning the nicely sewn seams, and find it comfortable to wear. Customers disagree on the sizing, with several noting it runs a little big. Select to learn more Fit Style Fabric thickness Quality Material weight Build quality Comfort Size 41 customers mention \"Fit\" 31 positive 10 negative Customers find that the dress fits beautifully. \"...ordered a small and, other than a little extra room in the waist, it fits well ! The A-line shape is beautiful and the skirt twirls very nicely....\" Read more \" Fits beautifully ! I love the color. Quality is great and the price certainly is excellent for a stylish party dress....\" Read more \" Perfect fit , classy fall dress\" Read more \"Very matronly and too short ...\" Read more 37 customers mention \"Style\" 36 positive 1 negative Customers find the dress stylish, describing it as a perfect black dress that can be dressed up or down. \" Beautiful dress . Very nice fabric. Thick fabric so good for cool environments. I sized down so the fit is snug and flattering. Very elegant....\" Read more \"I loved this dress. It is perfect! Beautiful and comfortable! Right size.\" Read more \"What a pretty dress . The material weight is perfect to make it flow nicely and it's very soft. Love it, highly recommend\" Read more \" Love the color ! It feels thicker and heavier that I love it. Its warmth and smooth to put it on. It will go with everything shoes I have it....\" Read more 30 customers mention \"Fabric thickness\" 28 positive 2 negative Customers appreciate the dress's fabric thickness, describing it as nice and hefty, with one customer noting it's great for cooler and cold weather. \"Love the fit and the material . I would recommend to anyone who’s looking for a little black dress that can be casual or dressy.\" Read more \"...The material is soft and thick , and the length is perfect to wear with boots. For reference, I’m 5'6\" and 175 pounds, and it fits beautifully....\" Read more \"Beautiful dress . Very nice fabric . Thick fabric so good for cool environments. I sized down so the fit is snug and flattering. Very elegant....\" Read more \"Well made and love the material . It just doesn’t look good on me. Also the arms were too long.\" Read more 26 customers mention \"Quality\" 24 positive 2 negative Customers find the dress to be of high quality, with one mentioning it's perfect for holiday wear and can be dressed up or down. \" Nice dress may run a little large.\" Read more \"...Overall, this was a great dress . if you have a small waist, definitely size down or it might look a little frumpy.\" Read more \"... Great Quality !\" Read more \" Good quality , and very flattering!\" Read more 16 customers mention \"Material weight\" 16 positive 0 negative Customers appreciate the dress's material weight, describing it as perfect and medium-weight with some heft. \"...The dress is very well made and I loved the fabric and weight of the dress .\" Read more \" Heavier dress and nice feel. Lovely color. Cut is a little odd. Arms and shoulders kind of tight, but it is especially tight around the elbows....\" Read more \" Love the weight of this dress and the fit. I would buy again in different colors\" Read more \" Medium weight dress perfect for holiday wear to dress up or down. Also for funeral services. Dress fits nicely.\" Read more 14 customers mention \"Build quality\" 12 positive 2 negative Customers appreciate the dress's construction, with one mentioning that the seams are nicely sewn. \"I got the most compliments on this dress today! Well made , good quality fabric and stitching. Great value for the money....\" Read more \"This is a well-constructed dress overall. The material is slightly thick, so there's some heft to it....\" Read more \" Beautifully made and perfect material for fall/winter!\" Read more \"...The dress is very well made and I loved the fabric and weight of the dress.\" Read more 12 customers mention \"Comfort\" 11 positive 1 negative Customers find the dress comfortable, with one mentioning it is very forgiving. \"Love the dress and the material is soft and comfortable . The size ran a little big for me, though.\" Read more \"Beautiful dress fits true to size perfectly. Very comfortable . I receive many compliments. It’s very figure flattering. I’m not petite....\" Read more \"This is a beautiful dress and it is a great quality material and super comfortable . I loved the pockets, that’s always a bonus....\" Read more \"The fabric is beautifully heavy and flows nicely- very forgiving !...\" Read more 10 customers mention \"Size\" 4 positive 6 negative Customers have mixed opinions about the dress size, with some finding it runs a little big. \"nice thick material hangs well. Flattering cut. Runs large . Im 5'4 160# and the large is fine, but not form-fitting at the bodice like Id hoped.\" Read more \" Size , shape and style of dress are great for wearing to many occasions.\" Read more \"Nice dress may run a little large .\" Read more \"I loved this dress. It is perfect! Beautiful and comfortable! Right size .\" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Beautiful, high quality midi dress",
        "body": "I love this dress!! I was pleasantly surprised by the quality of the fabric; it's soft, thick, and has some stretch! I wasn't sure how long it would be, but I'm 5'6\" and it fell just below my knees. I ordered a small and, other than a little extra room in the waist, it fits well! The A-line shape is beautiful and the skirt twirls very nicely. I will definitely be buying more in other colors! Read more",
        "author": "Lizzy Williamson",
        "rating": 5.0,
        "date": "October 31, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars soo beautiful!",
        "body": "Love the color! It feels thicker and heavier that I love it. Its warmth and smooth to put it on. It will go with everything shoes I have it. Size is great fit Read more",
        "author": "Jessie",
        "rating": 5.0,
        "date": "December 4, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Great Quality, fast delivery",
        "body": "I loved the style, the fit through the bodice and the feel of this dress. I have long legs so the length was too short and not the tea length I needed. I am 5'6\" 130 lbs so the small was a perfect fit in the bodice area and if I ordered a medium it would have given me an extra inch in length but I did not want to compromise a looser fit in the bodice. Other then that I would definitely recommend this dress. Furthermore, it arrived very quickly and I am assuming the return will be just as well. Very pleased with this company and am looking again to order a different style from them. Great Quality! Read more",
        "author": "Moose",
        "rating": 4.0,
        "date": "October 30, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Beautiful",
        "body": "Definitely impressed with quality! What a beautiful color and material! Simply loved it! Fits great to size and is so classy! Read more",
        "author": "Robert-Isaac Rueda",
        "rating": 5.0,
        "date": "December 22, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Purchased Black and love it!",
        "body": "Purchased the dress for winter festivities. Thicker fabric provides warmth but not bulk. Dress fits nicely and really is that perfect black dress for winter. Add a jacket or sweater, belt, gloves, boots or heels. Dress it up or down. Read more",
        "author": "Consumer",
        "rating": 5.0,
        "date": "December 18, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Fall dress",
        "body": "Perfect fit for size, made well, nice hefty fabric, not thin. Good length, I’m 5’. 5”, it hit mid calf. Great color brown, will buy this again. Easily to dress it up or wear casual. Read more",
        "author": "thaby",
        "rating": 5.0,
        "date": "November 9, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars High Quality",
        "body": "Great fit! Wonderful thickness on the material. Not made cheap. It’s high quality. Read more",
        "author": "Marion Kusajtys",
        "rating": 5.0,
        "date": "December 20, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "1.0 out of 5 stars That is not no way worth the money",
        "body": "This is something that I would not recommend for anyone to buy. It’s a piece of trash. Read more",
        "author": "Diathy Peterson",
        "rating": 1.0,
        "date": "October 18, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Long Sleeve Cocktail is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.",
  "about_this_item": "Womens Maxi Dress Long Sleeve Cocktail is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.",
  "long_description": "Womens Maxi Dress Long Sleeve Cocktail is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Brown, Blue, Burgundy, Apricot, Army Green, Black, Dusty Blue, Light Blue, Dark Cyan, Pink, White, Beige, Dark Blue, Grey Green. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Long Sleeve Cocktail is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Brown, Blue, Burgundy, Apricot, Army Green, Black, Dusty Blue, Light Blue, Dark Cyan, Pink, White, Beige, Dark Blue, Grey Green. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "d6f3bb63-febd-486a-8e83-02387abc5148",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d6f3bb63-febd-486a-8e83-02387abc5148/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d6f3bb63-febd-486a-8e83-02387abc5148/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/fcb188cd-27e1-4c37-a2c7-b2f42b092925.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "c6a13f9d-1326-42f1-b9e5-cfdf56d043ef",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c6a13f9d-1326-42f1-b9e5-cfdf56d043ef/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c6a13f9d-1326-42f1-b9e5-cfdf56d043ef/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/fcb188cd-27e1-4c37-a2c7-b2f42b092925.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "46d8c26a-6b14-45e0-a7e9-b8f1a5192894",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/46d8c26a-6b14-45e0-a7e9-b8f1a5192894/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/46d8c26a-6b14-45e0-a7e9-b8f1a5192894/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/fcb188cd-27e1-4c37-a2c7-b2f42b092925.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "96b24677-7f1f-4ca3-84b9-fcd66cc526e8",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/96b24677-7f1f-4ca3-84b9-fcd66cc526e8/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/96b24677-7f1f-4ca3-84b9-fcd66cc526e8/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/fcb188cd-27e1-4c37-a2c7-b2f42b092925.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "06550e15-7f0f-4ace-b70d-ae32ffe896e5",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/06550e15-7f0f-4ace-b70d-ae32ffe896e5/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/06550e15-7f0f-4ace-b70d-ae32ffe896e5/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/fcb188cd-27e1-4c37-a2c7-b2f42b092925.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "12abd486-6c82-4e81-9ef9-979deb14f835",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/12abd486-6c82-4e81-9ef9-979deb14f835/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/12abd486-6c82-4e81-9ef9-979deb14f835/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/fcb188cd-27e1-4c37-a2c7-b2f42b092925.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "03e6a375-177b-455f-92be-770c86a14dee",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/03e6a375-177b-455f-92be-770c86a14dee/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/03e6a375-177b-455f-92be-770c86a14dee/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/fcb188cd-27e1-4c37-a2c7-b2f42b092925.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "7f067e53-dc54-4c03-b756-107493c41b5d",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7f067e53-dc54-4c03-b756-107493c41b5d/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7f067e53-dc54-4c03-b756-107493c41b5d/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/fcb188cd-27e1-4c37-a2c7-b2f42b092925.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "506f44eb-b0f3-43c5-84d1-eb5c80fbff29",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/506f44eb-b0f3-43c5-84d1-eb5c80fbff29/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/506f44eb-b0f3-43c5-84d1-eb5c80fbff29/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/fcb188cd-27e1-4c37-a2c7-b2f42b092925.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "7ab3e0cb-918b-42f0-802a-7d746d8e2188",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7ab3e0cb-918b-42f0-802a-7d746d8e2188/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7ab3e0cb-918b-42f0-802a-7d746d8e2188/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/fcb188cd-27e1-4c37-a2c7-b2f42b092925.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "4b734828-8115-480b-99c5-3227c106a323",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4b734828-8115-480b-99c5-3227c106a323/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4b734828-8115-480b-99c5-3227c106a323/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/fcb188cd-27e1-4c37-a2c7-b2f42b092925.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "6b8a505c-d56e-4c87-bb2a-b9681e771e82",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6b8a505c-d56e-4c87-bb2a-b9681e771e82/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6b8a505c-d56e-4c87-bb2a-b9681e771e82/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/fcb188cd-27e1-4c37-a2c7-b2f42b092925.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Brown": "https://m.media-amazon.com/images/I/31GP9T3gZzL._AC_SR38,50_.jpg",
    "Blue": "https://m.media-amazon.com/images/I/31ckMGCZdgL._AC_SR38,50_.jpg",
    "Burgundy": "https://m.media-amazon.com/images/I/31K3O1mJE7L._AC_SR38,50_.jpg",
    "Apricot": "https://m.media-amazon.com/images/I/31AavaFJLsL._AC_SR38,50_.jpg",
    "Army Green": "https://m.media-amazon.com/images/I/31z1jn0MhYL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31LHyvDOFKL._AC_SR38,50_.jpg",
    "Dusty Blue": "https://m.media-amazon.com/images/I/31G1TFF1v8L._AC_SR38,50_.jpg",
    "Light Blue": "https://m.media-amazon.com/images/I/317WyoVJcDL._AC_SR38,50_.jpg",
    "Dark Cyan": "https://m.media-amazon.com/images/I/315PyPSEZkL._AC_SR38,50_.jpg",
    "Pink": "https://m.media-amazon.com/images/I/31uARHZPumL._AC_SR38,50_.jpg",
    "White": "https://m.media-amazon.com/images/I/21l-ch7VJqL._AC_SR38,50_.jpg",
    "Beige": "https://m.media-amazon.com/images/I/313iZrZ1FgL._AC_SR38,50_.jpg",
    "Dark Blue": "https://m.media-amazon.com/images/I/312L-fUc1xL._AC_SR38,50_.jpg",
    "Grey Green": "https://m.media-amazon.com/images/I/31y8AfqedyL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Brown": "71kbUZQSNHL",
    "Blue": "71BUlG7o4xL",
    "Burgundy": "71ENVurd+jL",
    "Apricot": "71jJscDR-mL",
    "Army Green": "71r1OU7aBSL",
    "Black": "61kZvoo1V7L",
    "Dusty Blue": "71bexa5P5kL",
    "Light Blue": "71Z66FNXFqL",
    "Dark Cyan": "71cg0kgUhwL",
    "Pink": "718cyTfYslL",
    "White": "61k06poR+eL",
    "Beige": "71ZzG63dklL",
    "Dark Blue": "71fnjjXOckL",
    "Grey Green": "71-JUcbi49L"
  },
  "color_images": {
    "Brown": [
      "https://m.media-amazon.com/images/I/71kbUZQSNHL._SL1500_.jpg"
    ],
    "Blue": [
      "https://m.media-amazon.com/images/I/71BUlG7o4xL._SL1500_.jpg"
    ],
    "Burgundy": [
      "https://m.media-amazon.com/images/I/71ENVurd+jL._SL1500_.jpg"
    ],
    "Apricot": [
      "https://m.media-amazon.com/images/I/71jJscDR-mL._SL1500_.jpg"
    ],
    "Army Green": [
      "https://m.media-amazon.com/images/I/71r1OU7aBSL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/61kZvoo1V7L._SL1500_.jpg"
    ],
    "Dusty Blue": [
      "https://m.media-amazon.com/images/I/71bexa5P5kL._SL1500_.jpg"
    ],
    "Light Blue": [
      "https://m.media-amazon.com/images/I/71Z66FNXFqL._SL1500_.jpg"
    ],
    "Dark Cyan": [
      "https://m.media-amazon.com/images/I/71cg0kgUhwL._SL1500_.jpg"
    ],
    "Pink": [
      "https://m.media-amazon.com/images/I/718cyTfYslL._SL1500_.jpg"
    ],
    "White": [
      "https://m.media-amazon.com/images/I/61k06poR+eL._SL1500_.jpg"
    ],
    "Beige": [
      "https://m.media-amazon.com/images/I/71ZzG63dklL._SL1500_.jpg"
    ],
    "Dark Blue": [
      "https://m.media-amazon.com/images/I/71fnjjXOckL._SL1500_.jpg"
    ],
    "Grey Green": [
      "https://m.media-amazon.com/images/I/71-JUcbi49L._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress-sleeveless",
      "title": "Womens Dress Sleeveless",
      "price": 40.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71ROAXb9J3L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-sleeveless",
      "title": "Womens Dress Sleeveless",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71quZoNcLYL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-ruched-evening-long-sleeve-bodycon",
      "title": "Womens Maxi Dress Cocktail Ruched Evening Long Sleeve Bodycon",
      "price": 46.97,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51OQMF8VX5L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-maxi",
      "title": "Womens Maxi Dress Bodycon Maxi",
      "price": 40.17,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/41bSqtJhKaL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 48.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61IlS+ROtkL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-bodycon-evening-sleeveless-v-neck-maxi",
      "title": "Womens Maxi Dress Bodycon Evening Sleeveless V Neck Maxi",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61mWvWOD+8L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 36.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61gUSDNnB3L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-ruched-sleeveless-bodycon",
      "title": "Womens Dress Ruched Sleeveless Bodycon",
      "price": 41.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51tFezn1whL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 76.9,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Wedding Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/514+blcsiGL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-formal-one-shoulder-mermaid",
      "title": "Womens Maxi Dress Cocktail Formal One Shoulder Mermaid",
      "price": 69.79,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/71iYonizZ1L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 109.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/61VzPPZgQXL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal",
      "title": "Womens Maxi Dress Formal",
      "price": 84.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61KmvUJ0NXL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-long-sleeve",
      "title": "Womens Maxi Dress Bodycon Long Sleeve",
      "price": 28.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71JTLYi9l-L._SL1500_.jpg"
      ]
    }
  ]
}