{
  "id": "womens-maxi-dress-cocktail-bodycon-long-sleeve-ruched",
  "handle": "womens-maxi-dress-cocktail-bodycon-long-sleeve-ruched",
  "sku": "JC2818",
  "asin": "B0F9NW94CF",
  "title": "Womens Maxi Dress Cocktail Bodycon Long Sleeve Ruched",
  "title_original": "WIHOLL Women's Mesh Sheer Long Sleeve Ruched Mini Dress Sexy Bodycon Mock Neck Cocktail Party Club Dresses 2025",
  "brand": "Visit the WIHOLL Store",
  "price": 24.99,
  "social_proof": {
    "bought_past_month": 767,
    "text": "767+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/61xmkRAfuFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61r-cR39JUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61433UTtoML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61pRUql+8bL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61RUAqxY8QL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71FDqXcTWML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71MYlaXq4DL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71IWdc3hQhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71sHmfgPRbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71YJWa5daCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Fs+xiaJhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61L5-MZbO2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/810qodjOXnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71EHtvK0znL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91QOVy2l1GL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71xoj3k896L._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/61xmkRAfuFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61r-cR39JUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61433UTtoML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61pRUql+8bL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61RUAqxY8QL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71FDqXcTWML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71MYlaXq4DL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71IWdc3hQhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71sHmfgPRbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71YJWa5daCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Fs+xiaJhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61L5-MZbO2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/810qodjOXnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71EHtvK0znL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91QOVy2l1GL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71xoj3k896L._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ August 23, 2025",
    "ASIN ‏": "‎ B0FMQDFPF2",
    "Best Sellers Rank": "#2,696 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #4 in Women's Club & Night Out Dresses #16 in Women's Casual Dresses",
    "Customer Reviews": "4.4 4.4 out of 5 stars (228)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "01 - Black",
      "01 - Red",
      "02 - Purple Print",
      "02 - Red Print",
      "02 - Lake Blue Print",
      "02 - Blue Print",
      "01 - Green",
      "01 - Coffee",
      "02 - Pink Floral Print",
      "03 - Leopard Print",
      "03 - Blue White Print",
      "03 - Brown Print"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.4,
    "count": 228,
    "customers_say": "Customers find the dress comfortable and well-made, with a perfect fit that can be adjusted for length. They describe it as flattering, highlighting curves in all the right places, and appreciate its stretchiness. The dress receives positive feedback for its looks, with one customer noting it's fancy enough for a wedding, and another mentioning it's true to size. The color receives mixed reactions from customers. Select to learn more Fit Looks Quality Comfort Size Flattering Stretchiness Color 35 customers mention \"Fit\" 26 positive 9 negative Customers are satisfied with how the dress fits. \" Fits well , super stretchy so it’s comfortable, soft fabric! Not much tummy control, will have to buy some shape wear to hold me tight....\" Read more \"Very cute, great fit ....\" Read more \"...It was a size of a shirt. The dress was extremely short it doesn’t even go past my waistline....\" Read more \"The sizing is spot on, I am a size large and it fits great . The color is beautiful and the quality of the material is very nice and soft....\" Read more 35 customers mention \"Looks\" 32 positive 3 negative Customers find the dress gorgeous, with one mentioning it's fancy enough for a wedding. \"Love this dress sexy but classy at the same time! Bought my usual size which was L and fits perfectly\" Read more \"The dress itself is very cute and fit perfectly on me. It was very stretchy and hugged my curves perfectly....\" Read more \"It’s cute but the sheer fabric didn’t fit me right , sleeves were too long and I just think it was supposed to fit tighter on arms/chest area....\" Read more \" Beautiful dress runs 1 size big\" Read more 20 customers mention \"Quality\" 18 positive 2 negative Customers find the dress well made and of good quality. \" Great dress \" Read more \" Great quality , shipped fast, amazing outfit / costume for Wednesday Adam’s or even just a grunge outfit.\" Read more \" Love the dress overall my only complaint is the material was very thin so it is see through need a slip dress under to wear this dress out.\" Read more \"This dress rocks ! 24 dollars are you kidding me?! I wore it to an expensive dinner and it looked the part.\" Read more 14 customers mention \"Comfort\" 14 positive 0 negative Customers find the dress comfortable, with one mentioning it doesn't feel itchy or tight. \"For the price!!! Does it job. Simple. Comfortable . Not the greatest material, but who cares. Even if you wear it just one or two times it’s worth it.\" Read more \"...The material is comfortable . The cut/pattern/design looked about off from the picture. Doesn’t fit the way it looked in the image....\" Read more \"...It’s lightweight, comfy , and easy to dress up or down. Perfect for Halloween events or even a casual night out.\" Read more \"Love the dress comfy and well made!\" Read more 14 customers mention \"Size\" 10 positive 4 negative the dress fits true to size. \"Fits well and true to size . Ses like it should bringore sex appeal but doesn't quite do it and I'm not sure why.\" Read more \"I bought this for a concert. The dress is true to size , and very flattering. I am short (5ft), and the length was perfect for me as well.\" Read more \"This dress would have been a great buy, however it is sized too big ....\" Read more \"Fit I would say is pretty true to size . I ordered a medium and should have sized down ....\" Read more 11 customers mention \"Flattering\" 8 positive 3 negative Customers find the dress flattering, with one mentioning it highlights curves in all the right places and another noting it's perfect for flat-tummy days. \"This black dress is simple but so flattering . The mesh top adds the perfect touch without feeling itchy or tight, and it fits true to size....\" Read more \"I bought this for a concert. The dress is true to size, and very flattering . I am short (5ft), and the length was perfect for me as well.\" Read more \"Fits well, super stretchy so it’s comfortable, soft fabric! Not much tummy control , will have to buy some shape wear to hold me tight....\" Read more \"This is super cute, very clingy and hugs all your curves . Definitely for flat-tummy days! Break out the spanx for this one. I love the sheer sleeves....\" Read more 10 customers mention \"Stretchiness\" 9 positive 1 negative Customers like the dress's stretchiness, with one mentioning that the neck hole is particularly flexible. \"...The material is comfortable, very stretchy and not scratchy. I am excited to use this dress for my next event!\" Read more \" Stretchy material you can go down a size\" Read more \"...The material wasnt tight or itchy and had just the right amount of stretch .\" Read more \"Fits well, super stretchy so it’s comfortable, soft fabric! Not much tummy control, will have to buy some shape wear to hold me tight....\" Read more 11 customers mention \"Color\" 7 positive 4 negative Customers have mixed opinions about the dress's color. \"I ordered medium and I love the color . I chose the teal blue. It’s so comfortable. Fits perfectly with the awesome shape where that I had underneath....\" Read more \"The dress is more orange than red , still looks good\" Read more \"The color is stunning and I don’t believe I have a softer feeling dress. So stylish and fits from neck to sleeves to waist!...\" Read more \"The sizing is spot on, I am a size large and it fits great. The color is beautiful and the quality of the material is very nice and soft....\" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars You’ll Look & Feel pretty in this Dress!!!",
        "body": "I ordered medium and I love the color. I chose the teal blue. It’s so comfortable. Fits perfectly with the awesome shape where that I had underneath. I also bought it in red it fits great and I love the built-in slip. Also has nice quality stitching very pretty. A must have! Read more",
        "author": "Sharita",
        "rating": 5.0,
        "date": "November 21, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/81jcl6oyqyL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71c8Gwwe1dL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Flattering, Confident, and Beautifully Designed",
        "body": "The media could not be loaded. This dress exceeded expectations in both quality and fit. The mesh overlay and ruching detail create a flattering silhouette that highlights curves in all the right places without feeling too tight or restrictive. The fabric is soft, stretchy, and breathable, providing both comfort and structure — rare for a form-fitting style. Wearing this dress gave me a huge boost of confidence — it’s one of those pieces that instantly makes you feel put-together and powerful. It hugs the body comfortably and moves with you, not against you, and the fit is true to size. Overall a great value! Read more",
        "author": "rane koehler",
        "rating": 5.0,
        "date": "November 13, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61LFyzl8QdL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Gorgeous and classy dress! Solids are better than patterns",
        "body": "I ordered this dress in four different colors – the teal and black pattern, the purple and black pattern, and plain Red and plain black. I thought the patterns would better disguise any body flaws, but the ruching is so amazing that disguising is not necessary. I didn't really care for the patterning anyway, and it disguises the mesh portion of the top which I think is the dress's best feature! Also the teal and black one had a weird very large black swath from the collar to the bust area which I definitely would have returned for a different dress even if I kept the pattern. I'm returning the patterned ones, and keeping the red and the black. They are gorgeous, inexpensive, and super classy looking. There is no seam down the middle of the back which makes the dress look much more expensive. I am 5'4\" tall, 117 pounds, 34C bust, 28 inch waist, 35\" hips. The size small fit me beautifully. Read more",
        "author": "Flammajamma",
        "rating": 5.0,
        "date": "December 3, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71mHJhUjO6L._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71XLDOQg3BL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/712PUecisJL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/61DupahtOIL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "3.0 out of 5 stars It’s cute and fits but…",
        "body": "The dress itself is very cute and fit perfectly on me. It was very stretchy and hugged my curves perfectly. My ONLY complaint is that the dress was clearly worn previously and sent back in the same condition as it was worn and the dress smelled awful. It smelled like BO and dollar store body spray. My dirty bin smelled bad, my room smelled bad, everything smelled bad. This may not fall on the company but people are gross to say the least. I’m glad that I always wash clothes before I wear them. Read more",
        "author": "Nadia",
        "rating": 3.0,
        "date": "October 20, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Very cute and comfy",
        "body": "I love this dress! Cant wait to wear it again. I ordered a Xl and fit perfectly. Was a little worried because normally wear 2Xl. It’s very stretchy! Read more",
        "author": "Heather Anderson",
        "rating": 5.0,
        "date": "December 15, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Odd fit for a short girl",
        "body": "Pretty dress but it for me weird. The armpit area was low so made it to where I couldn’t raise my arms. Maybe it’s just my body type. The material was good and very pretty. Read more",
        "author": "Megan C.",
        "rating": 4.0,
        "date": "October 16, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Yeah!",
        "body": "I wasn’t expecting much from this dress but l was pleasantly surprised at the quality and fit. It’s sexy and simple. Does what it’s supposed to do - look good on you :) Read more",
        "author": "Customer",
        "rating": 5.0,
        "date": "December 3, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Beautiful Color",
        "body": "The sizing is spot on, I am a size large and it fits great. The color is beautiful and the quality of the material is very nice and soft. The arms and top of the neck is see through, but the body of the dress is lined. There is some stretch to the dress, so it could fit an XL if you do not mind it fitting more snug. Read more",
        "author": "Ashley",
        "rating": 5.0,
        "date": "December 5, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Cocktail Bodycon Long Sleeve Ruched is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.",
  "about_this_item": "Womens Maxi Dress Cocktail Bodycon Long Sleeve Ruched is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.",
  "long_description": "Womens Maxi Dress Cocktail Bodycon Long Sleeve Ruched is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: 01 - Black, 01 - Red, 02 - Purple Print, 02 - Red Print, 02 - Lake Blue Print, 02 - Blue Print, 01 - Green, 01 - Coffee, 02 - Pink Floral Print, 03 - Leopard Print, 03 - Blue White Print, 03 - Brown Print. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Cocktail Bodycon Long Sleeve Ruched is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: 01 - Black, 01 - Red, 02 - Purple Print, 02 - Red Print, 02 - Lake Blue Print, 02 - Blue Print, 01 - Green, 01 - Coffee, 02 - Pink Floral Print, 03 - Leopard Print, 03 - Blue White Print, 03 - Brown Print. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "a48aa7f9-d8ce-4ae1-96f0-147e62bcf6fe",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a48aa7f9-d8ce-4ae1-96f0-147e62bcf6fe/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a48aa7f9-d8ce-4ae1-96f0-147e62bcf6fe/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "afa33b23-5b46-46df-94ef-d687bcbbc8de",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/afa33b23-5b46-46df-94ef-d687bcbbc8de/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/afa33b23-5b46-46df-94ef-d687bcbbc8de/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "5cdebfeb-4c72-4ed8-9f6f-cfeac68d4825",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5cdebfeb-4c72-4ed8-9f6f-cfeac68d4825/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5cdebfeb-4c72-4ed8-9f6f-cfeac68d4825/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "182d482a-55f8-4534-bc64-f8a24ea94692",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/182d482a-55f8-4534-bc64-f8a24ea94692/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/182d482a-55f8-4534-bc64-f8a24ea94692/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "3650b16e-44be-49f2-99c6-0f3dde04ae84",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3650b16e-44be-49f2-99c6-0f3dde04ae84/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3650b16e-44be-49f2-99c6-0f3dde04ae84/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "8ea60821-f6b8-48e3-8dd3-af24fa2b909c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8ea60821-f6b8-48e3-8dd3-af24fa2b909c/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8ea60821-f6b8-48e3-8dd3-af24fa2b909c/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "d4639911-bf17-49f4-9246-f3bc42441f43",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d4639911-bf17-49f4-9246-f3bc42441f43/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d4639911-bf17-49f4-9246-f3bc42441f43/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "0a4259ac-57e5-4778-9a32-ec97377cdf03",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0a4259ac-57e5-4778-9a32-ec97377cdf03/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0a4259ac-57e5-4778-9a32-ec97377cdf03/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "ad728880-5527-43e5-845f-f72ce33a5463",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ad728880-5527-43e5-845f-f72ce33a5463/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ad728880-5527-43e5-845f-f72ce33a5463/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "58294919-97a1-40f5-9fdf-1c58b48f1203",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/58294919-97a1-40f5-9fdf-1c58b48f1203/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/58294919-97a1-40f5-9fdf-1c58b48f1203/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "e7cf41ab-d098-46fb-b6fe-d6d3e41edaec",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e7cf41ab-d098-46fb-b6fe-d6d3e41edaec/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e7cf41ab-d098-46fb-b6fe-d6d3e41edaec/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "892541d2-4259-49de-b981-fb82c108b481",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/892541d2-4259-49de-b981-fb82c108b481/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/892541d2-4259-49de-b981-fb82c108b481/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "01 - Black": "https://m.media-amazon.com/images/I/31glc+dMHKL._AC_SR38,50_.jpg",
    "01 - Red": "https://m.media-amazon.com/images/I/31fF2dnuj1L._AC_SR38,50_.jpg",
    "02 - Purple Print": "https://m.media-amazon.com/images/I/41gx5hkU-vL._AC_SR38,50_.jpg",
    "02 - Red Print": "https://m.media-amazon.com/images/I/41Ip2AHsHsL._AC_SR38,50_.jpg",
    "02 - Lake Blue Print": "https://m.media-amazon.com/images/I/41kuJRC1SaL._AC_SR38,50_.jpg",
    "02 - Blue Print": "https://m.media-amazon.com/images/I/31o-jDBUb0L._AC_SR38,50_.jpg",
    "01 - Green": "https://m.media-amazon.com/images/I/31HQlCGguDL._AC_SR38,50_.jpg",
    "01 - Coffee": "https://m.media-amazon.com/images/I/31+2DDwS3xL._AC_SR38,50_.jpg",
    "02 - Pink Floral Print": "https://m.media-amazon.com/images/I/41n9Z7z8yQL._AC_SR38,50_.jpg",
    "03 - Leopard Print": "https://m.media-amazon.com/images/I/413DRAaV5cL._AC_SR38,50_.jpg",
    "03 - Blue White Print": "https://m.media-amazon.com/images/I/41m6RxxtBZL._AC_SR38,50_.jpg",
    "03 - Brown Print": "https://m.media-amazon.com/images/I/41WtHPlxqJL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "01 - Black": "61xmkRAfuFL",
    "01 - Red": "71FDqXcTWML",
    "02 - Purple Print": "71MYlaXq4DL",
    "02 - Red Print": "71IWdc3hQhL",
    "02 - Lake Blue Print": "71sHmfgPRbL",
    "02 - Blue Print": "71YJWa5daCL",
    "01 - Green": "71Fs+xiaJhL",
    "01 - Coffee": "61L5-MZbO2L",
    "02 - Pink Floral Print": "810qodjOXnL",
    "03 - Leopard Print": "71EHtvK0znL",
    "03 - Blue White Print": "91QOVy2l1GL",
    "03 - Brown Print": "71xoj3k896L"
  },
  "color_images": {
    "01 - Black": [
      "https://m.media-amazon.com/images/I/61xmkRAfuFL._SL1500_.jpg"
    ],
    "01 - Red": [
      "https://m.media-amazon.com/images/I/71FDqXcTWML._SL1500_.jpg"
    ],
    "02 - Purple Print": [
      "https://m.media-amazon.com/images/I/71MYlaXq4DL._SL1500_.jpg"
    ],
    "02 - Red Print": [
      "https://m.media-amazon.com/images/I/71IWdc3hQhL._SL1500_.jpg"
    ],
    "02 - Lake Blue Print": [
      "https://m.media-amazon.com/images/I/71sHmfgPRbL._SL1500_.jpg"
    ],
    "02 - Blue Print": [
      "https://m.media-amazon.com/images/I/71YJWa5daCL._SL1500_.jpg"
    ],
    "01 - Green": [
      "https://m.media-amazon.com/images/I/71Fs+xiaJhL._SL1500_.jpg"
    ],
    "01 - Coffee": [
      "https://m.media-amazon.com/images/I/61L5-MZbO2L._SL1500_.jpg"
    ],
    "02 - Pink Floral Print": [
      "https://m.media-amazon.com/images/I/810qodjOXnL._SL1500_.jpg"
    ],
    "03 - Leopard Print": [
      "https://m.media-amazon.com/images/I/71EHtvK0znL._SL1500_.jpg"
    ],
    "03 - Blue White Print": [
      "https://m.media-amazon.com/images/I/91QOVy2l1GL._SL1500_.jpg"
    ],
    "03 - Brown Print": [
      "https://m.media-amazon.com/images/I/71xoj3k896L._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress-sleeveless-bodycon",
      "title": "Womens Dress Sleeveless Bodycon",
      "price": 29.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/71ZyZt+SGML._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 33.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71iLw0ri7XL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-formal-maxi",
      "title": "Womens Maxi Dress Long Sleeve Formal Maxi",
      "price": 57.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61HzhJOJQJL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-v-neck-evening-cocktail-split-sleeveless",
      "title": "Womens Maxi Dress V Neck Evening Cocktail Split Sleeveless",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61iTIlfCryL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-long-sleeve",
      "title": "Womens Maxi Dress Maxi Long Sleeve",
      "price": 141.9,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61AOPd6C-DL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress-sleeveless-formal",
      "title": "Womens Dress Sleeveless Formal",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61-zfl0UV6L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-v-neck-cocktail-maxi-long-sleeve",
      "title": "Womens Maxi Dress V Neck Cocktail Maxi Long Sleeve",
      "price": 69.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51WvQKrLYQL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/812eDUSaSmL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 45.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61UJHzAzqWL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 298.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71Jq8YdpWeL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-maxi-bodycon",
      "title": "Womens Maxi Dress Long Sleeve Maxi Bodycon",
      "price": 41.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51u-03U0ZHL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-sleeveless-cocktail-v-neck-bodycon-ruched",
      "title": "Womens Dress Sleeveless Cocktail V Neck Bodycon Ruched",
      "price": 45.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61d6j+j8sjL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-sleeveless-v-neck-cocktail-maxi-bodycon",
      "title": "Womens Maxi Dress Sleeveless V Neck Cocktail Maxi Bodycon",
      "price": 44.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51eoMzKwaqL._SL1500_.jpg"
      ]
    }
  ]
}