{
  "id": "womens-dress-cocktail-bodycon-ruched",
  "handle": "womens-dress-cocktail-bodycon-ruched",
  "sku": "JC2933",
  "asin": "B0F9YCDDQ8",
  "title": "Womens Dress Cocktail Bodycon Ruched",
  "title_original": "Women's Off The Shoulder Midi Dress Built-in Bra Ruched Corset Bodycon Sexy Elegant Holiday Cocktail Party Dresses",
  "brand": "Visit the CurvySweet Store",
  "price": 54.99,
  "social_proof": {
    "bought_past_month": 498,
    "text": "498+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/61NkbYTg92L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71oXJKemwTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71tlUXJv4TL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71KckCUTp5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Rvsi--Z8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/713ZjU2Yu+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71LJWInyclL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81iovIRa3GL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71dcmjmphaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61dTjOf02BL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61WJGLRad5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61UnOnhniUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61uFbj8aseL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61qJcUvQ+yL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/61NkbYTg92L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71oXJKemwTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71tlUXJv4TL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71KckCUTp5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Rvsi--Z8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/713ZjU2Yu+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71LJWInyclL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81iovIRa3GL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71dcmjmphaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61dTjOf02BL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61WJGLRad5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61UnOnhniUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61uFbj8aseL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61qJcUvQ+yL._SL1500_.jpg"
  ],
  "aplus_images": [
    "https://m.media-amazon.com/images/I/31cNYgb%2BLuL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31YBp3Gb29L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/313FZeiBUiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/318YZRXY1VL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31rbmbfI5VL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31od-9gi02L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/3125ygvTnBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41E-6tfmaBL._SL1500_.jpg"
  ],
  "description_images": [
    "https://m.media-amazon.com/images/I/31cNYgb%2BLuL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31YBp3Gb29L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/313FZeiBUiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/318YZRXY1VL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31rbmbfI5VL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31od-9gi02L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/3125ygvTnBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41E-6tfmaBL._SL1500_.jpg"
  ],
  "bullets": [],
  "specs": {
    "Product Dimensions ‏": "‎ 13.39 x 8.66 x 1.18 inches",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ May 27, 2025",
    "ASIN ‏": "‎ B0F9YBP6XZ",
    "Best Sellers Rank": "#22,855 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #159 in Women's Club & Night Out Dresses",
    "Customer Reviews": "4.2 4.2 out of 5 stars (102)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Dark Green",
      "Red",
      "Pink",
      "Burgundy",
      "Black",
      "Caramel"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.2,
    "count": 102,
    "customers_say": "Customers find the dress fits perfectly and appreciate its style, with one mentioning it absolutely hugs their curves. The material receives positive feedback for its nice quality and stretchiness, while the rich color adds to its appeal. The dress's sturdiness receives mixed reviews, with one customer noting it's not see-through at all. Select to learn more Fit Style Curves Quality Material quality Stretchiness Color Sturdiness 16 customers mention \"Fit\" 12 positive 4 negative Customers are satisfied with how the dress fits. \" Perfect fit ...\" Read more \"I love the quality of the material and the dress fit perfectly . The color matched my skin tone and accentuated my curves.\" Read more \"This dress fits weird .. The corset like in the front rides up and the back comes down.. I have a little tummy and bigger boobs.. I ordered a large...\" Read more \"The dress look just like in the picture. It fits beautiful . It has stretching in it. I'm 5'6 179 and I purchased a large and it fit me just right....\" Read more 16 customers mention \"Style\" 16 positive 0 negative Customers find the dress pretty, with one describing it as romantic. \"This is a beautiful dress and the fix is awesome very pleased. My flavor is the material and the feel on my skin, the way it hangs every curve....\" Read more \" Cute but Needs Adjustments...\" Read more \"...Its a bit revealing, sexy and I don't want to do too much at the wedding. I'll take the shawl off for the reception. The material feels great....\" Read more \" Super cute , just like the picutre. Only downside, it doesnt hold up the girls if you are bigger up top!\" Read more 11 customers mention \"Curves\" 9 positive 2 negative Customers find the dress flattering and appreciate how it accentuates their curves. \"The dress is super cute and flattering , the length was longer than expected. Still pretty for the price, but not a perfect fit right out of the bag.\" Read more \"The dress.. GET the dress!!! It’s so comfortable and hugs all the right curves . The material is very nice, not cheap feeling....\" Read more \"...The color matched my skin tone and accentuated my curves .\" Read more \"Very beautiful dress that shows off curves . I'm 5'4, 175lbs, 36C in bra. I kept the small. Im usually medium. But this has lots of stretch....\" Read more 7 customers mention \"Quality\" 7 positive 0 negative Customers love the quality of the dress. \"This dress was perfect . Got lots of compliments.\" Read more \" Love the dress ! I ordered a M, I’m about 5’6” 150lbs, 36C. Muscular build. It accentuates your body yet hides the imperfections. Very stretchy....\" Read more \"This dress is really nice . The quality is good and stretchy so I sized down for it to have a little bit of a tighter fit.\" Read more \"I love the quality of the material and the dress fit perfectly. The color matched my skin tone and accentuated my curves.\" Read more 6 customers mention \"Material quality\" 6 positive 0 negative Customers like the material of the dress, with one mentioning that it hugs in all the right places. \"...The color is rich and romantic, and the fabric hugs in all the right places without feeling restrictive....\" Read more \"...The fabric is nice but that’s the only positive thing about this dress.\" Read more \"...I’m about 4’10 150lbs and it fit perfectly. The material was perfect , not thin or cheap. I got a lot of compliments. 10/10\" Read more \"...It’s so comfortable and hugs all the right curves. The material is very nice , not cheap feeling. It’s also breathable too....\" Read more 6 customers mention \"Stretchiness\" 6 positive 0 negative Customers appreciate the dress's stretchiness. \"This dress is really nice. The quality is good and stretchy so I sized down for it to have a little bit of a tighter fit.\" Read more \"...I kept the small. Im usually medium. But this has lots of stretch . Im going to use breast tape to pull the breast together....\" Read more \"...It accentuates your body yet hides the imperfections. Very stretchy . My girls held up nicely....\" Read more \"The dress look just like in the picture. It fits beautiful. It has stretching in it . I'm 5'6 179 and I purchased a large and it fit me just right....\" Read more 5 customers mention \"Color\" 4 positive 1 negative Customers like the dress's color, describing it as rich. \"...The color is rich and romantic, and the fabric hugs in all the right places without feeling restrictive....\" Read more \"...The color matched my skin tone and accentuated my curves.\" Read more \"...Yes to the dress, the color is a winner chicken dinner . I got the brown camel color love it.\" Read more \" color is off ...\" Read more 9 customers mention \"Sturdiness\" 4 positive 5 negative Customers have mixed opinions about the dress's sturdiness, with some finding it secure and not see-through, while others report issues with stains and deodorant marks. \"Product was used. There were deodorant marks all over it . And it had small little lint balls in the inside like it’s been previously used.\" Read more \"...There’s built in cups and I didn’t wear a bra. It’s NOT see through at all . It doesn’t suck in the fupa so wear a shaper if necessary. 10/10\" Read more \"...Its a bit revealing , sexy and I don't want to do too much at the wedding. I'll take the shawl off for the reception. The material feels great....\" Read more \"...It accentuates your body yet hides the imperfections . Very stretchy. My girls held up nicely....\" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Million-Buck Energy, Just Size Down",
        "body": "This dress is a total showstopper. The corset-style bodice, ruched detailing, and off-the-shoulder fit make it feel like it was custom-made for drama—in the best way. The color is rich and romantic, and the fabric hugs in all the right places without feeling restrictive. I slipped it on and instantly felt like I should be walking a red carpet or starring in a music video. That said, I did have to size down. The fit runs a little generous, especially in the waist and bust, so if you want that snatched silhouette, go one size smaller than usual. Once I did, it was perfection—secure, flattering, and surprisingly comfortable for how glam it looks. I also don’t have a a backside (I call it my Hank Hill) but it makes it look good! I also LOVE the built in pads for the bra, made it super easy to wear! If you’re looking for a dress that turns heads and boosts confidence, this one delivers. Just check the sizing chart and trust your instincts—you deserve to feel like a million bucks, too. Read more",
        "author": "crazycatladyjes",
        "rating": 5.0,
        "date": "November 25, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71+cyOvod9L._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71A4N2Xdq9L._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/81bWxyt6P5L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Feminine",
        "body": "Very beautiful dress that shows off curves. I'm 5'4, 175lbs, 36C in bra. I kept the small. Im usually medium. But this has lots of stretch. Im going to use breast tape to pull the breast together. I'm wearing it for a wedding so I'm going to drape a shawl on for the ceremony. Its a bit revealing, sexy and I don't want to do too much at the wedding. I'll take the shawl off for the reception. The material feels great. Soft. Im pairing it with beige shoes and purse. My dates suit is beige. The color is so beautiful for fall. Read more",
        "author": "Ronsofoxy",
        "rating": 5.0,
        "date": "October 2, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71t62QhJjKL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71RleZ9koWL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/61IdruZEtVL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Great quality for the price",
        "body": "Omg this dress is amazing. Great quality. Sexy. Fits like a dream Read more",
        "author": "Connie Francis",
        "rating": 5.0,
        "date": "December 22, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "1.0 out of 5 stars Not actually a corset, top has no support either.",
        "body": "I don’t understand all the five star reviews on the stress. The supposed corset is not actually a corset, it’s just some sewn on strips of fabric. Provides zero corset-like support. Additionally, the top provides no support at allllll for your bust. As one reviewer aptly put it, if you bend over, you’re in trouble. If you have any kind of chest at all, the dress is not going to be your friend. I sized down like all the reviews said, but it was no use. Really disappointed because the concept of the dress is really beautiful, but execution is just sorely lacking! Read more",
        "author": "VineReviewerMH",
        "rating": 1.0,
        "date": "December 20, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Get the dress",
        "body": "The dress look just like in the picture. It fits beautiful. It has stretching in it. I'm 5'6 179 and I purchased a large and it fit me just right. I did wear my faja under and you couldn't see a thing. Read more",
        "author": "Luv Lyfe",
        "rating": 5.0,
        "date": "December 14, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Cute but Needs Adjustments",
        "body": "The dress is super cute and flattering, the length was longer than expected. Still pretty for the price, but not a perfect fit right out of the bag. Read more",
        "author": "Carmen",
        "rating": 4.0,
        "date": "October 14, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Yes to the dress",
        "body": "This is a beautiful dress and the fix is awesome very pleased. My flavor is the material and the feel on my skin, the way it hangs every curve. Yes to the dress, the color is a winner chicken dinner. I got the brown camel color love it. Read more",
        "author": "Paige",
        "rating": 5.0,
        "date": "December 2, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Buy it already!!!",
        "body": "The media could not be loaded. The dress.. GET the dress!!! It’s so comfortable and hugs all the right curves. The material is very nice, not cheap feeling. It’s also breathable too. I ordered a medium and would consider it sized appropriately. I’m 5’4 and weigh 169 lbs. There’s built in cups and I didn’t wear a bra. It’s NOT see through at all. It doesn’t suck in the fupa so wear a shaper if necessary. 10/10 Read more",
        "author": "Kristen Blake",
        "rating": 5.0,
        "date": "December 19, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/815o8FGaiXL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71yjoK3BJDL._SY88._SL1500_.jpg"
        ]
      }
    ]
  },
  "short_description": "Womens Dress Cocktail Bodycon Ruched is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.",
  "about_this_item": "Womens Dress Cocktail Bodycon Ruched is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.",
  "long_description": "Womens Dress Cocktail Bodycon Ruched is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Dark Green, Red, Pink, Burgundy, Black, Caramel. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Dress Cocktail Bodycon Ruched is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/31cNYgb%2BLuL._SL1500_.jpg",
      "alt": "Womens Dress Cocktail Bodycon Ruched details image 1"
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/31YBp3Gb29L._SL1500_.jpg",
      "alt": "Womens Dress Cocktail Bodycon Ruched details image 2"
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/313FZeiBUiL._SL1500_.jpg",
      "alt": "Womens Dress Cocktail Bodycon Ruched details image 3"
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/318YZRXY1VL._SL1500_.jpg",
      "alt": "Womens Dress Cocktail Bodycon Ruched details image 4"
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Dark Green, Red, Pink, Burgundy, Black, Caramel. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/31rbmbfI5VL._SL1500_.jpg",
      "alt": "Womens Dress Cocktail Bodycon Ruched details image 5"
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "bc4f7688-ad18-4222-8e05-3ff719e8b068",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bc4f7688-ad18-4222-8e05-3ff719e8b068/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bc4f7688-ad18-4222-8e05-3ff719e8b068/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "27298481-c7c7-4bf1-9ca2-bc9047a76bf6",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/27298481-c7c7-4bf1-9ca2-bc9047a76bf6/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/27298481-c7c7-4bf1-9ca2-bc9047a76bf6/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "294dbb88-1f0f-4a0c-bab2-0739491c69ea",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/294dbb88-1f0f-4a0c-bab2-0739491c69ea/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/294dbb88-1f0f-4a0c-bab2-0739491c69ea/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "2a7fa7e9-dabf-4176-834b-338ccababf32",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2a7fa7e9-dabf-4176-834b-338ccababf32/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2a7fa7e9-dabf-4176-834b-338ccababf32/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "76425049-b4cc-4d9a-8e0c-b416970c7184",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/76425049-b4cc-4d9a-8e0c-b416970c7184/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/76425049-b4cc-4d9a-8e0c-b416970c7184/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "78731ee3-aff1-413d-834f-b1130abf1abc",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/78731ee3-aff1-413d-834f-b1130abf1abc/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/78731ee3-aff1-413d-834f-b1130abf1abc/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "53cfaa64-4cb4-4614-87ec-6635f2bf175b",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/53cfaa64-4cb4-4614-87ec-6635f2bf175b/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/53cfaa64-4cb4-4614-87ec-6635f2bf175b/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "acf9af5e-502c-49e8-91fc-29a404d150c9",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/acf9af5e-502c-49e8-91fc-29a404d150c9/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/acf9af5e-502c-49e8-91fc-29a404d150c9/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "ff317bfa-21ae-4c39-aa66-bb112352fc16",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ff317bfa-21ae-4c39-aa66-bb112352fc16/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ff317bfa-21ae-4c39-aa66-bb112352fc16/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "ad545c03-7fa6-41ea-aa20-da36b3dc125d",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ad545c03-7fa6-41ea-aa20-da36b3dc125d/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ad545c03-7fa6-41ea-aa20-da36b3dc125d/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "e993e081-8539-46f5-a08a-5b2716e5ae4d",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e993e081-8539-46f5-a08a-5b2716e5ae4d/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e993e081-8539-46f5-a08a-5b2716e5ae4d/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "fe61016f-521a-4c16-abe5-a1d7f86d12dd",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/fe61016f-521a-4c16-abe5-a1d7f86d12dd/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/fe61016f-521a-4c16-abe5-a1d7f86d12dd/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Dark Green": "https://m.media-amazon.com/images/I/411AqqXCgBL._AC_SR38,50_.jpg",
    "Red": "https://m.media-amazon.com/images/I/41MtvcDKoWL._AC_SR38,50_.jpg",
    "Pink": "https://m.media-amazon.com/images/I/41K-GzcV7oL._AC_SR38,50_.jpg",
    "Burgundy": "https://m.media-amazon.com/images/I/418CDhBZUpL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/317NHGLIQCL._AC_SR38,50_.jpg",
    "Caramel": "https://m.media-amazon.com/images/I/41f+Aq0PBCL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Dark Green": "61dTjOf02BL",
    "Red": "61WJGLRad5L",
    "Pink": "61UnOnhniUL",
    "Burgundy": "61NkbYTg92L",
    "Black": "61uFbj8aseL",
    "Caramel": "61qJcUvQ+yL"
  },
  "color_images": {
    "Dark Green": [
      "https://m.media-amazon.com/images/I/61dTjOf02BL._SL1500_.jpg"
    ],
    "Red": [
      "https://m.media-amazon.com/images/I/61WJGLRad5L._SL1500_.jpg"
    ],
    "Pink": [
      "https://m.media-amazon.com/images/I/61UnOnhniUL._SL1500_.jpg"
    ],
    "Burgundy": [
      "https://m.media-amazon.com/images/I/61NkbYTg92L._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/61uFbj8aseL._SL1500_.jpg"
    ],
    "Caramel": [
      "https://m.media-amazon.com/images/I/61qJcUvQ+yL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-bodycon-long-sleeve",
      "title": "Womens Maxi Dress Bodycon Long Sleeve",
      "price": 37.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61mEacM4-HL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-v-neck-short-sleeve",
      "title": "Womens Dress V Neck Short Sleeve",
      "price": 45.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71GF8D6aXML._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-one-shoulder-formal",
      "title": "Womens Maxi Dress Evening One Shoulder Formal",
      "price": 88.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51dteyRhDhL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-sleeveless-ruched",
      "title": "Womens Dress Sleeveless Ruched",
      "price": 33.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/61e+2lRRZ5L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 40.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71yVMc8pyyL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-off-shoulder",
      "title": "Womens Maxi Dress Off Shoulder",
      "price": 159.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/71gSdMwmvyL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-v-neck-short-sleeve-formal-maxi",
      "title": "Womens Maxi Dress V Neck Short Sleeve Formal Maxi",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71XBVAHbDGL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 51.29,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61PiBYMUlgL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-maxi",
      "title": "Womens Maxi Dress Formal Maxi",
      "price": 31.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51Jg8Q2xhpL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 19.47,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/81XrlLpfU-L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-split-formal-cocktail-bodycon",
      "title": "Womens Dress Split Formal Cocktail Bodycon",
      "price": 45.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/4151Mn-1bQL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-v-neck",
      "title": "Womens Maxi Dress Long Sleeve V Neck",
      "price": 54.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71LLeakgTML._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-bodycon",
      "title": "Womens Maxi Dress Maxi Bodycon",
      "price": 34.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61M7t3v6iUL._SL1500_.jpg"
      ]
    }
  ]
}