{
  "id": "womens-dress",
  "handle": "womens-dress",
  "sku": "JC1802",
  "asin": "B0FB16SH77",
  "title": "Womens Dress",
  "title_original": "Levi's Womens Vianna Vest Dress (Also Available in Plus)",
  "brand": "Visit the Levi's Store",
  "price": 59.99,
  "social_proof": {
    "bought_past_month": 50,
    "text": "50+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/41Kk3d-Y48L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41OZWAcNsJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41qP5cLk8xL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41UbVUwXcDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41NDc3KMdGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41h+1pY8iUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41JcmIL5-jL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41V0TCjZ2hL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41gbViaGyIL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41MmiNxLlvL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/41Kk3d-Y48L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41OZWAcNsJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41qP5cLk8xL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41UbVUwXcDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41NDc3KMdGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41h+1pY8iUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41JcmIL5-jL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41V0TCjZ2hL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41gbViaGyIL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41MmiNxLlvL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Item model number ‏": "‎ 001WL-0000",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ October 11, 2024",
    "Manufacturer ‏": "‎ Levi's",
    "ASIN ‏": "‎ B0DJW3R6YP",
    "Best Sellers Rank": "#66,206 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #680 in Women's Casual Dresses",
    "Customer Reviews": "4.0 4.0 out of 5 stars (59)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "(New) Ivy Green (Corduroy)",
      "Never Going to Change",
      "(New) Merlot (Corduroy)",
      "(New) Special Showing",
      "Capturing Moments"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.0,
    "count": 59,
    "customers_say": "Customers find the dress classy and flattering, with accurate color representation and good comfort. The dress is versatile, with one customer noting it's great for travel and summer months, and another mentioning it keeps its shape during the day. While some it fits great, others find it tight in the bust area, and many report it runs small in the bust. Generated from the text of customer reviews Select to learn more Quality (19) Color accuracy (4) Comfort (4) Stretchability (4) Versatility (4) Flattering (3) Fit (16) Size (15) 19 customers mention quality, 19 positive, 0 negative 19 customers mention \"Quality\" 19 positive 0 negative Customers appreciate the dress's quality, describing it as classy, sassy, and cute for summer wear. \" I really love this dress, is cute , well done but unlucky runs small in the chest area (at least in my opinion), if you're looking a more relaxed fit... \" Read more \" So cute but runs small! I’m 5’1”, 122# and usually wear an xs/s, small fits a little snug in the chest. if you’re busty, size up \" Read more \" Nice dress . Runs small if youre busty. My typical size is medium but I had to go to an XL for a good fit. I’m 5’9 and 182 lbs \" Read more \" Beautiful dress , great quality, just didn't fit right across the chest \" Read more 4 customers mention color accuracy, 3 positive, 1 negative 4 customers mention \"Color accuracy\" 3 positive 1 negative Customers are satisfied with the dress's color accuracy. \" ...I really love the color , perfect for the season. \" Read more \" The color is as described , the quality is amazing however you’ll need to size up if you are chesty.... \" Read more \" Color bleed issue ... \" Read more \" Color is great , fabric is durable and thick. Does not stretch at all. Runs small so definitely size up. Even by two if you want a more relaxed fit. \" Read more 4 customers mention comfort, 4 positive, 0 negative 4 customers mention \"Comfort\" 4 positive 0 negative Customers find the dress comfortable. \" Very comfy & cute! I bought this to wear for our family photos. It is very sturdy and falls at a perfect length.... \" Read more \" ...This is really a great, comfortable , versatile Levi's dress with good fit and quality, which makes the Levi's price totally worth it. \" Read more \" ...Great fall/ winter dress! It’s very flattering, very comfy with a little stretch to it.... \" Read more \" Literally my new favorite dress. It’s SO cute, comfortable , very flattering on me.... \" Read more 4 customers mention stretchability, 3 positive, 1 negative 4 customers mention \"Stretchability\" 3 positive 1 negative Customers like the dress's stretchability, with one mentioning it maintains its shape throughout the day. \" ...It's great original-quality denim fabric, no stretch .... \" Read more \" Color is great, fabric is durable and thick. Does not stretch at all . Runs small so definitely size up. Even by two if you want a more relaxed fit. \" Read more \" This was a super cute dress, but no stretch to it —if you have a chest or are broad shouldered, size up! \" Read more \" ...is great quality, fairly priced, washes and drys well and keeps its shape during the day . Great buttons! \" Read more 4 customers mention versatility, 4 positive, 0 negative 4 customers mention \"Versatility\" 4 positive 0 negative Customers find the dress versatile, with one mentioning it's great for travel and summer months. \" ... It is wearable but there is no room for shrinking or wearing a shirt underneath it. If you want any space go up one size. \" Read more \" ...Love the quality, love the look, all season wear. So versatile . A must piece and a closet staple. \" Read more \" ...This is really a great, comfortable, versatile Levi's dress with good fit and quality, which makes the Levi's price totally worth it. \" Read more \" Very cute, classy and sassy. Great for travel and summer months , very flattering, I am large chested so I had to size up.... \" Read more 3 customers mention flattering, 3 positive, 0 negative 3 customers mention \"Flattering\" 3 positive 0 negative Customers find the dress flattering. \" Very cute, classy and sassy. Great for travel and summer months, very flattering , I am large chested so I had to size up.... \" Read more \" Literally my new favorite dress. It’s SO cute, comfortable, very flattering on me .... \" Read more \" I loooove this dress!! Great fall/ winter dress! It’s very flattering , very comfy with a little stretch to it.... \" Read more 16 customers mention fit, 7 positive, 9 negative 16 customers mention \"Fit\" 7 positive 9 negative Customers have mixed opinions about the dress's fit, with some finding it great while others report it being tight in the bust area. \" ...this dress because the reviews stating it ran at small and was tight in the chest .... \" Read more \" ...I’m 5’10” 160lbs and purchased a medium, it fits great ! \" Read more \" ...This runs pretty true to size I feel like except it’s a little tight in the bust area so if you are bigger than a D you would probably have to size... \" Read more \" ...be careful about armhole gaping with sleeveless tops but this dress fits perfectly --the armholes fit me well with no bra peek.... \" Read more 15 customers mention size, 4 positive, 11 negative 15 customers mention \"Size\" 4 positive 11 negative Customers report that the dress runs very small in the bust area. \" Color is great, fabric is durable and thick. Does not stretch at all. Runs small so definitely size up. Even by two if you want a more relaxed fit. \" Read more \" I really love this dress, is cute, well done but unlucky runs small in the chest area (at least in my opinion), if you're looking a more relaxed fit... \" Read more \" ...This runs pretty true to size I feel like except it’s a little tight in the bust area so if you are bigger than a D you would probably have to size... \" Read more \" The color is as described, the quality is amazing however you’ll need to size up if you are chesty.... \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Love this dress!",
        "body": "I had seen this dress locally but not in my size so I was very happy to find it on Amazon. It's great original-quality denim fabric, no stretch. Being busty but slim-armed, I always have to be careful about armhole gaping with sleeveless tops but this dress fits perfectly--the armholes fit me well with no bra peek. The buttonholes are pretty tight (as on the fly of the 501's) so they do take a bit of wrangling. The up side is they stay buttoned well. This dress looks cute with the bottom couple of buttons left open. I'm on the short side--5'3\" and it hits about 2 inches above the knee on me. This is really a great, comfortable, versatile Levi's dress with good fit and quality, which makes the Levi's price totally worth it. Read more",
        "author": "NWGirl",
        "rating": 5.0,
        "date": "September 10, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Slim fit a little tight in chest area",
        "body": "The color is as described, the quality is amazing however you’ll need to size up if you are chesty. I was looking for it to be looser fitting but to my surprise the tag said “SLIM FIT” I normally wear a 3x so I bought the 4x to be safe and it’s true to its tag label but the description under specification says “standard fit” So that why it has a 3 star, the shape and texture are true to the description. Read more",
        "author": "Kidsis1803",
        "rating": 3.0,
        "date": "November 16, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61TPihxeTYL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/717muxlGQtL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Timeless Piece",
        "body": "What a gorgeous piece. It is how I envisioned it and fits so well. It is a sturdy denim that has a thickness to it that you can wear layered during the cold season and still wear it in one piece during the hot season. I am petite and small chested (34A), so this dress fits just right for me. The chest is a bit roomier but doesn’t scrunch up like other dresses would with the shape that it provides. Previous reviewers said to size up if need more room for chest. It wouldn’t make sense to size up because the dress would be too roomy and big. Love the quality, love the look, all season wear. So versatile. A must piece and a closet staple. Read more",
        "author": "epune02",
        "rating": 5.0,
        "date": "August 30, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Amazing quality",
        "body": "Literally my new favorite dress. It’s SO cute, comfortable, very flattering on me. I have a larger chest (36DD) and it was too snug if I wore a regular bra, so I actually went without - which I never feel comfortable doing, but this dress held everything in place! It was great. At first, it had a bit of a weird chemical smell to it, but that came out easily after the first wash - it also did not seem to fade at all after washing. It’s extremely good quality denim, has a little bit of a stretch but not too much. I wore this all summer, and I will continue to wear it in the fall and winter. Read more",
        "author": "Tricia P.",
        "rating": 5.0,
        "date": "September 5, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Size up one",
        "body": "This is very cute but size up one! I am a 28 waist, height 5’4”, 140 lbs, bra 34C and I ordered a small based on the size chart. It is wearable but there is no room for shrinking or wearing a shirt underneath it. If you want any space go up one size. Read more",
        "author": "Leah Garner",
        "rating": 4.0,
        "date": "July 12, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Cute but fits a little diff than picture",
        "body": "It was not as fitted at the bottom or as short as I wanted/expected.. BUT if you’re walking around and sitting down the fit is actually ideal. I’m 145lbs 5’4 36C and got medium, could not go smaller tbh cause it was snug on my chest. Read more",
        "author": "Doomslayerkitty",
        "rating": 5.0,
        "date": "November 4, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71rk73RrZwL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "3.0 out of 5 stars Good cold weather dress with layers",
        "body": "Color is great, fabric is durable and thick. Does not stretch at all. Runs small so definitely size up. Even by two if you want a more relaxed fit. Read more",
        "author": "Jessica Olivera",
        "rating": 3.0,
        "date": "December 3, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "1.0 out of 5 stars POOR FIT",
        "body": "Large is too small and extra large is way too big. The sizes with Levi’s are off. Now I have a dress that I can wear except I have big pockets under my arms. Not everybody has huge boobs and a tiny body. Although I am pretty thin for my height. The large, which is kind of an overstated size for me was so tight I couldn’t button it. Read more",
        "author": "Terri R Hoover",
        "rating": 1.0,
        "date": "November 30, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Dress is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.",
  "about_this_item": "Womens Dress is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.",
  "long_description": "Womens Dress is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: (New) Ivy Green (Corduroy), Never Going to Change, (New) Merlot (Corduroy), (New) Special Showing, Capturing Moments. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Dress is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: (New) Ivy Green (Corduroy), Never Going to Change, (New) Merlot (Corduroy), (New) Special Showing, Capturing Moments. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [],
  "color_swatches": {
    "(New) Ivy Green (Corduroy)": "https://m.media-amazon.com/images/I/31VE2Y3A1lL._AC_SR38,50_.jpg",
    "Never Going to Change": "https://m.media-amazon.com/images/I/315FmwAdNmL._AC_SR38,50_.jpg",
    "(New) Merlot (Corduroy)": "https://m.media-amazon.com/images/I/31IELILWRxL._AC_SR38,50_.jpg",
    "(New) Special Showing": "https://m.media-amazon.com/images/I/319q+RbZo3L._AC_SR38,50_.jpg",
    "Capturing Moments": "https://m.media-amazon.com/images/I/31EDuM+tyhL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "(New) Ivy Green (Corduroy)": "41qP5cLk8xL",
    "Never Going to Change": "41NDc3KMdGL",
    "(New) Merlot (Corduroy)": "41Kk3d-Y48L",
    "(New) Special Showing": "41JcmIL5-jL",
    "Capturing Moments": "41gbViaGyIL"
  },
  "color_images": {
    "(New) Ivy Green (Corduroy)": [
      "https://m.media-amazon.com/images/I/41qP5cLk8xL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/41UbVUwXcDL._SL1500_.jpg"
    ],
    "Never Going to Change": [
      "https://m.media-amazon.com/images/I/41NDc3KMdGL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/41h+1pY8iUL._SL1500_.jpg"
    ],
    "(New) Merlot (Corduroy)": [
      "https://m.media-amazon.com/images/I/41Kk3d-Y48L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/41OZWAcNsJL._SL1500_.jpg"
    ],
    "(New) Special Showing": [
      "https://m.media-amazon.com/images/I/41JcmIL5-jL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/41V0TCjZ2hL._SL1500_.jpg"
    ],
    "Capturing Moments": [
      "https://m.media-amazon.com/images/I/41gbViaGyIL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/41MmiNxLlvL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-sleeveless-maxi",
      "title": "Womens Maxi Dress Sleeveless Maxi",
      "price": 48.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71qwUjryGiL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 43.69,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61-pFN+nfgL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-bodycon",
      "title": "Womens Maxi Dress Maxi Bodycon",
      "price": 36.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61o6MKJoZLL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-one-shoulder-formal-mermaid-bodycon-evening-maxi",
      "title": "Womens Maxi Dress One Shoulder Formal Mermaid Bodycon Evening Maxi",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71mgUBuGwhL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-v-neck-short-sleeve",
      "title": "Womens Dress V Neck Short Sleeve",
      "price": 34.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71T+iJeFITL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress-cocktail-ruched-evening-split",
      "title": "Womens Dress Cocktail Ruched Evening Split",
      "price": 29.69,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/61003bnFhAS._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-maxi",
      "title": "Womens Maxi Dress Formal Maxi",
      "price": 64.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/61RWPo72AmL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-mermaid-one-shoulder",
      "title": "Womens Maxi Dress Mermaid One Shoulder",
      "price": 238.74,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51lR3NNtXCL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-maxi-formal-long-sleeve-v-neck",
      "title": "Womens Maxi Dress Cocktail Maxi Formal Long Sleeve V Neck",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61cfJoIR5bL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-bodycon-ruched",
      "title": "Womens Maxi Dress Cocktail Bodycon Ruched",
      "price": 49.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51+rVhgLHSL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-formal",
      "title": "Womens Dress Formal",
      "price": 75.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51TVxkZ3J2L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening",
      "title": "Womens Maxi Dress Formal Evening",
      "price": 64.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/516ScMrYzlL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-ruched-bodycon-v-neck",
      "title": "Womens Maxi Dress Long Sleeve Ruched Bodycon V Neck",
      "price": 33.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51AvldIvTmL._SL1500_.jpg"
      ]
    }
  ]
}