{
  "id": "womens-maxi-dress-long-sleeve-v-neck",
  "handle": "womens-maxi-dress-long-sleeve-v-neck",
  "sku": "JC1688",
  "asin": "B0FB913SKZ",
  "title": "Womens Maxi Dress Long Sleeve V Neck",
  "title_original": "Jayscreate Women's 2025 Long Sleeve Corduroy Dress Above Knee A-Line V Neck Fall Winter Short Work Dress",
  "brand": "Visit the Jayscreate Store",
  "price": 40.84,
  "social_proof": {
    "bought_past_month": 1608,
    "text": "1608+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/61ZKTvMhh-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71mS9b4TQoL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71dmokCILbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Q3a-LW-YL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/715kvQ4jMnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71mEX56sUjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71pAErPQQCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61oPgYhk7uL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61+1cf8Hj9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71laiC0fS2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61kYOFDrhsL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71idLnIhj9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61qM9WfqCUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61PpSDpPy+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71BOhWF3KfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61zp3c9E3YL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61kHT12HF4L._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/61ZKTvMhh-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71mS9b4TQoL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71dmokCILbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Q3a-LW-YL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/715kvQ4jMnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71mEX56sUjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71pAErPQQCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61oPgYhk7uL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61+1cf8Hj9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71laiC0fS2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61kYOFDrhsL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71idLnIhj9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61qM9WfqCUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61PpSDpPy+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71BOhWF3KfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61zp3c9E3YL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61kHT12HF4L._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Package Dimensions ‏": "‎ 11.4 x 7.2 x 0.6 inches; 4.8 ounces",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ May 29, 2025",
    "ASIN ‏": "‎ B0FB8ZLCX9",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#25,511 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #7 in Women's Wear to Work Dresses",
    "Customer Reviews": "4.6 4.6 out of 5 stars (101)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Work",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Red",
      "Brown",
      "Off Brown",
      "Plaid-green",
      "Rust",
      "White",
      "Plaid-red",
      "Apricot",
      "Black",
      "Navy Blue",
      "Green"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.6,
    "count": 101,
    "customers_say": "Customers find the dress comfortable, soft, and stretchy, with one noting it's less stiff than typical corduroy. The fit receives positive feedback, with one customer mentioning it hits right above the knee, and they appreciate its great quality and cute appearance. The material thickness is well-received, and customers like the dress's stretchiness. Opinions about sizing are mixed, with some finding it true to size while others report sizing issues. Generated from the text of customer reviews Select to learn more Fit (23) Quality (17) Looks cute (15) Comfort (11) Softness (8) Material thickness (7) Stretchiness (6) Size (6) 23 customers mention fit, 18 positive, 5 negative 23 customers mention \"Fit\" 18 positive 5 negative Customers like how the dress fits, particularly noting its flattering cut, with one customer mentioning it works well with big hips and another noting it hits just above the knee. \" Great fit and price. Very comfortable and would buy again! \" Read more \" Love it! Fits perfectly , true to size, falls right off the body, great for laddies like me who lack a waist and have a little extra chub!... \" Read more \" This dress is so cute! Love the fabric and the cut is flattering . Has pockets that don’t accentuate the hips.... \" Read more \" I like it. Color is great. It is a little tight around the chest area and I am a B cup. A great fall dress! \" Read more 17 customers mention quality, 17 positive, 0 negative 17 customers mention \"Quality\" 17 positive 0 negative Customers find the dress to be of great quality. \" Great dress ! I could have probably gone with a Medium but got Large and it was so comfortable! Wore it with cowboy boots and got lots of compliments! \" Read more \" Love it. Cute babydoll style. True to size. Great quality . \" Read more \" ...It is a little tight around the chest area and I am a B cup. A great fall dress ! \" Read more \" I am very impressed with this dress. The quality of the material is excellent . I love corduroy and the color I chose (burgundy) is so classy.... \" Read more 15 customers mention looks cute, 14 positive, 1 negative 15 customers mention \"Looks cute\" 14 positive 1 negative Customers find the dress cute. \" So cute ! Received a compliment by so many. Perfect weight! Super comfortable and love the softness of the corduroy. Also, has pockets!... \" Read more \" ...This dress is comfy and super cute . I’m 5’4” and 178lbs. I bought a Large. The upper back was very complimentary and smooth.... \" Read more \" Super cute dress for work! The corduroy is not too heavy and has some stretch. Fit as described. Washes well. \" Read more \" Fits me perfectly. Love it! So cute on ; it's a good look on me! Love the sturdiness of corduroy.... \" Read more 11 customers mention comfort, 11 positive, 0 negative 11 customers mention \"Comfort\" 11 positive 0 negative Customers find the dress comfortable. \" This dress is so comfortable and made with quality. Ordered my normal size of medium and the fit was perfect. \" Read more \" ...Great price, shipped quick, very comfortable and material feels like it will hold up! \" Read more \" ...This dress is comfy and super cute. I’m 5’4” and 178lbs. I bought a Large. The upper back was very complimentary and smooth.... \" Read more \" So comfy and a little stretchy which is great! A tad short for me, I’m 5’ 9” but should be fine with tights! \" Read more 8 customers mention softness, 8 positive, 0 negative 8 customers mention \"Softness\" 8 positive 0 negative Customers find the dress soft and smooth. \" ...So many compliments! The corduroy isn’t heavy , it’s soft and it has pockets!!! Dress it up with cute fall boots or throw on some cute tennis shoes!! \" Read more \" This is an amazing buy! The fabric is very soft and even softer on the inside. Tailoring is great, fit is great, color is great.... \" Read more \" Very soft very comfortable great fit \" Read more \" ...I bought a Large. The upper back was very complimentary and smooth . The sleeves are “bracelet length”, falling just a tiny shorter than the wrist.... \" Read more 7 customers mention material thickness, 7 positive, 0 negative 7 customers mention \"Material thickness\" 7 positive 0 negative Customers like the material thickness of the dress, with one customer specifically praising its fabric quality. \" This dress is so cute! Love the fabric and the cut is flattering. Has pockets that don’t accentuate the hips.... \" Read more \" Great dress with great thick material … runs big in my opinion I normally wear a large and if I buy in another color I will get a medium. \" Read more \" Wanted to love this dress the cut and fabric are great but even the small was just too big. I’m 5’ 1” and 130 lbs.... \" Read more \" Material thickness , value for money , I love it. \" Read more 6 customers mention stretchiness, 6 positive, 0 negative 6 customers mention \"Stretchiness\" 6 positive 0 negative Customers like the dress's stretchiness, with one mentioning that the corduroy material is soft. \" Super cute dress for work! The corduroy is not too heavy and has some stretch . Fit as described. Washes well. \" Read more \" So comfy and a little stretchy which is great! A tad short for me, I’m 5’ 9” but should be fine with tights! \" Read more \" The top is a tiny bit snug but still fit due to the stretchiness of the fabric . This dress is comfy and super cute. I’m 5’4” and 178lbs.... \" Read more \" ...The corduroy was prefect, good quality with a bit of stretch . I'm 5'4\" & the length was just as I like it. So, I knew I'd wear a 2nd color as well.... \" Read more 6 customers mention size, 4 positive, 2 negative 6 customers mention \"Size\" 4 positive 2 negative Customers have mixed experiences with the dress's fit, with some finding it true to size while others report sizing issues. \" Love it! Fits perfectly, true to size , falls right off the body, great for laddies like me who lack a waist and have a little extra chub!... \" Read more \" ...to love this dress the cut and fabric are great but even the small was just too big . I’m 5’ 1” and 130 lbs.... \" Read more \" Love this dress! Very comfortable and true to size . Looks nice with a belt, too! \" Read more \" Love it. Cute babydoll style. True to size . Great quality. \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Super cute!",
        "body": "The top is a tiny bit snug but still fit due to the stretchiness of the fabric. This dress is comfy and super cute. I’m 5’4” and 178lbs. I bought a Large. The upper back was very complimentary and smooth. The sleeves are “bracelet length”, falling just a tiny shorter than the wrist. The length fell just above the knee. I’ve noticed that the corduroy fabric does not wrinkle. I’m very happy with this purchase. Read more",
        "author": "David Ewing",
        "rating": 5.0,
        "date": "October 19, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Cute dress decent fabric",
        "body": "The dress is as. I got the green corduroy and it can be dressed up or down. I got a medium and it is a big tight in the bust. I am a 38c. I’m going to keep it because it fits well otherwise. The length is above the knee. I am 5’5 . I might buy another color , but can’t decide between the red and the brown. Read more",
        "author": "Yankee fan",
        "rating": 5.0,
        "date": "November 14, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Great Dress",
        "body": "So cute! Received a compliment by so many. Perfect weight! Super comfortable and love the softness of the corduroy. Also, has pockets! Absolutely love this dress. 5+ stars! Read more",
        "author": "Edie Turner",
        "rating": 5.0,
        "date": "November 6, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Nice",
        "body": "Fit very nicely and looks great Read more",
        "author": "Richard S. Walicki",
        "rating": 4.0,
        "date": "November 20, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Good dress",
        "body": "Great fit and price. Very comfortable and would buy again! Read more",
        "author": "BART",
        "rating": 5.0,
        "date": "December 1, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Amazing find!",
        "body": "This is an amazing buy! The fabric is very soft and even softer on the inside. Tailoring is great, fit is great, color is great. If anything, I wish the buttons went all the way down. But, overall, I am thrilled and will buy multiple colors! Read more",
        "author": "Matt Wilson",
        "rating": 5.0,
        "date": "November 11, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Gorgeous",
        "body": "Just got this today. The quality is wonderful. Excellent quality for an Amazon purchase. Thicker material but not hot, very breathable. I was definitely surprised by it. The top section fit great, the lower part could be a tad smaller but if I go any smallerin the size, then my top part won’t fit. lol definitely recommend. The color is beautiful. Read more",
        "author": "Brittany",
        "rating": 5.0,
        "date": "October 9, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Comfortable",
        "body": "This dress is so comfortable and made with quality. Ordered my normal size of medium and the fit was perfect. Read more",
        "author": "DJ",
        "rating": 5.0,
        "date": "November 23, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Long Sleeve V Neck is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.",
  "about_this_item": "Womens Maxi Dress Long Sleeve V Neck is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.",
  "long_description": "Womens Maxi Dress Long Sleeve V Neck is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Red, Brown, Off Brown, Plaid-green, Rust, White, Plaid-red, Apricot, Black, Navy Blue, Green. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Long Sleeve V Neck is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Red, Brown, Off Brown, Plaid-green, Rust, White, Plaid-red, Apricot, Black, Navy Blue, Green. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "a82b6fad-6145-4c60-8f34-682a0d44a6b1",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a82b6fad-6145-4c60-8f34-682a0d44a6b1/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a82b6fad-6145-4c60-8f34-682a0d44a6b1/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "9f5cf8ff-c546-4aee-9499-0a587ff49251",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9f5cf8ff-c546-4aee-9499-0a587ff49251/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9f5cf8ff-c546-4aee-9499-0a587ff49251/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Red": "https://m.media-amazon.com/images/I/41YTYEWsSDL._AC_SR38,50_.jpg",
    "Brown": "https://m.media-amazon.com/images/I/41Xq7A86YqL._AC_SR38,50_.jpg",
    "Off Brown": "https://m.media-amazon.com/images/I/41NkniK1lHL._AC_SR38,50_.jpg",
    "Plaid-green": "https://m.media-amazon.com/images/I/41VD9e4M2tL._AC_SR38,50_.jpg",
    "Rust": "https://m.media-amazon.com/images/I/41B8LgQzXYL._AC_SR38,50_.jpg",
    "White": "https://m.media-amazon.com/images/I/31iJQ36WxxL._AC_SR38,50_.jpg",
    "Plaid-red": "https://m.media-amazon.com/images/I/418vjrgc0JL._AC_SR38,50_.jpg",
    "Apricot": "https://m.media-amazon.com/images/I/31WjcZdwcEL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/41SJSE0oifL._AC_SR38,50_.jpg",
    "Navy Blue": "https://m.media-amazon.com/images/I/41oMmdVp8UL._AC_SR38,50_.jpg",
    "Green": "https://m.media-amazon.com/images/I/41MN6is15TL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Red": "61oPgYhk7uL",
    "Brown": "61+1cf8Hj9L",
    "Off Brown": "71laiC0fS2L",
    "Plaid-green": "61kYOFDrhsL",
    "Rust": "71idLnIhj9L",
    "White": "61qM9WfqCUL",
    "Plaid-red": "61PpSDpPy+L",
    "Apricot": "71BOhWF3KfL",
    "Black": "61zp3c9E3YL",
    "Navy Blue": "61kHT12HF4L",
    "Green": "61ZKTvMhh-L"
  },
  "color_images": {
    "Red": [
      "https://m.media-amazon.com/images/I/61oPgYhk7uL._SL1500_.jpg"
    ],
    "Brown": [
      "https://m.media-amazon.com/images/I/61+1cf8Hj9L._SL1500_.jpg"
    ],
    "Off Brown": [
      "https://m.media-amazon.com/images/I/71laiC0fS2L._SL1500_.jpg"
    ],
    "Plaid-green": [
      "https://m.media-amazon.com/images/I/61kYOFDrhsL._SL1500_.jpg"
    ],
    "Rust": [
      "https://m.media-amazon.com/images/I/71idLnIhj9L._SL1500_.jpg"
    ],
    "White": [
      "https://m.media-amazon.com/images/I/61qM9WfqCUL._SL1500_.jpg"
    ],
    "Plaid-red": [
      "https://m.media-amazon.com/images/I/61PpSDpPy+L._SL1500_.jpg"
    ],
    "Apricot": [
      "https://m.media-amazon.com/images/I/71BOhWF3KfL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/61zp3c9E3YL._SL1500_.jpg"
    ],
    "Navy Blue": [
      "https://m.media-amazon.com/images/I/61kHT12HF4L._SL1500_.jpg"
    ],
    "Green": [
      "https://m.media-amazon.com/images/I/61ZKTvMhh-L._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 41.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71gLnAI8qnL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-ruched-evening-high-split-split",
      "title": "Womens Maxi Dress Maxi Ruched Evening High Split Split",
      "price": 72.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71omaPs6UqL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-short-sleeve-evening",
      "title": "Womens Dress Short Sleeve Evening",
      "price": 89.88,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61vi9CZReDL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-formal-cocktail-evening",
      "title": "Womens Dress Formal Cocktail Evening",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71ctK4kwdWL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 45.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/712FTzeTFLL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-formal-mermaid-evening-ruched",
      "title": "Womens Maxi Dress Formal Mermaid Evening Ruched",
      "price": 74.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61qHc0kmHEL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 37.79,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51WFZKRzSdL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 43.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Work",
      "images": [
        "https://m.media-amazon.com/images/I/81JXmyg5QfL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-sleeveless-split-formal-cocktail-v-neck",
      "title": "Womens Maxi Dress Sleeveless Split Formal Cocktail V Neck",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/51jHZEGYXHL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-ruched",
      "title": "Womens Maxi Dress Long Sleeve Ruched",
      "price": 49.29,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61P6bkbQawL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-one-shoulder-maxi-long-sleeve",
      "title": "Womens Maxi Dress One Shoulder Maxi Long Sleeve",
      "price": 45.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61UljfUsK4L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-long-sleeve-evening-formal",
      "title": "Womens Maxi Dress Cocktail Long Sleeve Evening Formal",
      "price": 46.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/6190eiFreBL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-formal-long-sleeve-evening",
      "title": "Womens Maxi Dress Maxi Formal Long Sleeve Evening",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51enCkUtvSL._SL1500_.jpg"
      ]
    }
  ]
}