{
  "id": "womens-dress-v-neck",
  "handle": "womens-dress-v-neck",
  "sku": "JC2110",
  "asin": "B0FB94MF3B",
  "title": "Womens Dress V Neck",
  "title_original": "NUFIWI Y2k Hooded Dress for Women Fur Trim Hoodie Dresses Deep V Neck Mini Short Dress Aesthetic Cute Clothes",
  "brand": "NUFIWI",
  "price": 31.98,
  "social_proof": {
    "bought_past_month": 545,
    "text": "545+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/61mdVP8GFNL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61xDfwKKT0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/619yEdji5DL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61uZou6inHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51tWshk8-PL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51uwiFfQyzL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61OH7rDD-3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41M1HLixXfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41M8L4V0StL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/419mP26NbDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61UJzW4vUjL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/61mdVP8GFNL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61xDfwKKT0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/619yEdji5DL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61uZou6inHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51tWshk8-PL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51uwiFfQyzL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61OH7rDD-3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41M1HLixXfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41M8L4V0StL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/419mP26NbDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61UJzW4vUjL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ May 14, 2024",
    "ASIN ‏": "‎ B0D4471BJM",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#155,512 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #1,042 in Women's Club & Night Out Dresses",
    "Customer Reviews": "3.8 3.8 out of 5 stars (380)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "A White Feathers",
      "White"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 3.8,
    "count": 380,
    "customers_say": "Customers find the dress cute and cozy, with good comfort. However, the sizing receives mixed feedback, with several customers noting it runs small and tight. Moreover, the quality, softness, and material thickness get mixed reviews - while some find it great and super soft with thick enough material, others report poor quality, not fluffy enough, and thin fabric. Additionally, the fur quality is criticized for looking cheap, and several customers mention the dress is very see-through. Generated from the text of customer reviews Select to learn more Looks (29) Comfort (6) Quality (17) Softness (11) Material thickness (10) Cleavage (6) Size (37) Fur quality (8) 29 customers mention looks, 24 positive, 5 negative 29 customers mention \"Looks\" 24 positive 5 negative Customers find the dress very cute, with one describing it as sassy. \" this dress was super cute , however it’s pretty short i would size up to avoid having to pull it down all day but overall this dress was pretty cute. \" Read more \" ...Disappointing because its a sexy outfit but only made for size 0 small people. \" Read more \" ...Mine didn’t come with a string on it but still very cute \" Read more \" It’s cute . But it’s not that fluffy… thankfully it’s soft inside too. It’s comfortable at least. It doesn’t have as much fluff as you’d expect. \" Read more 6 customers mention comfort, 5 positive, 1 negative 6 customers mention \"Comfort\" 5 positive 1 negative Customers find the dress comfortable and cozy. \" ...I ordered the medium. It is SKIN TIGHT. It’s super soft and comfy but I would need to order at least two sizes up to be comfortable.... \" Read more \" ...I didn’t want to take it off. It fits like a glove and is soooooo comfortable , I’m going to a Christmas party and this is the perfect piece.... \" Read more \" ...The dress is soft and although very tight it seems comfortable .... \" Read more \" I used this dress for a holiday party and it fit perfectly and so cozy comfy . I received many compliments! \" Read more 17 customers mention quality, 11 positive, 6 negative 17 customers mention \"Quality\" 11 positive 6 negative Customers have mixed opinions about the dress's quality, with some finding it great and perfect, while others describe it as very poor. \" I got a size Medium good texture great quality 10/10 would buy again I’m actually going to get a white one \" Read more \" The dress runs small and it looks cheaply made . When I opened the package there was fur coming off and it looked used. \" Read more \" My husband insists I buy more colors. You have made the perfect dress \" Read more \" ...Overall tho the dress was nice \" Read more 11 customers mention softness, 7 positive, 4 negative 11 customers mention \"Softness\" 7 positive 4 negative Customers have mixed opinions about the dress's softness, with some finding it super soft while others say it's not fluffy enough. \" I used it for my Monster High Abbey cosplay! It was soft and fits perfectly \" Read more \" It’s cute. But it’s not that fluffy … thankfully it’s soft inside too. It’s comfortable at least. It doesn’t have as much fluff as you’d expect. \" Read more \" ...I am 128 lb, 5’. I ordered the medium. It is SKIN TIGHT. It’s super soft and comfy but I would need to order at least two sizes up to be comfortable.... \" Read more \" I got a size Medium good texture great quality 10/10 would buy again I’m actually going to get a white one \" Read more 10 customers mention material thickness, 5 positive, 5 negative 10 customers mention \"Material thickness\" 5 positive 5 negative Customers have mixed opinions about the dress's material thickness, with some finding it thick enough while others describe it as quite thin and terrible. \" ...I ordered the size the chart suggested and fits perfect! The material is thick enough to not be see through and warm.... \" Read more \" The fabric is thin and does not feel nice. \" Read more \" I was very surprised with the material and the fur which was perfect. Arrived on time (last minute Christmas shopping) just great purchase overall \" Read more \" Not at all what it looked like in photos. Material was very light , and sheer. Very short, looked like a shirt. \" Read more 6 customers mention cleavage, 2 positive, 4 negative 6 customers mention \"Cleavage\" 2 positive 4 negative Customers have mixed opinions about the dress's cleavage, with several noting it is very see-through. \" Material is not that stretchy and very see through . Not flattering on the chest it’s right and shows no cleavage \" Read more \" ...It’s a little tight might wanna size up but it’s not see through which is a plus :) \" Read more \" ...Finally bought it and it’s super cute, a bit see through but thicker quality than I expected \" Read more \" Not at all what it looked like in photos. Material was very light, and sheer . Very short, looked like a shirt. \" Read more 37 customers mention size, 11 positive, 26 negative 37 customers mention \"Size\" 11 positive 26 negative Customers report that the dress runs very small and tight, particularly around the arms and waist. \" ...Also it is very short . I'll definitely need to wear it with leggings or really short white shorts underneath \" Read more \" I love the dress but it's too small . \" Read more \" I used it for my Monster High Abbey cosplay! It was soft and fits perfectly \" Read more \" Its skin tight but not in an uncomfortable way its also very warm \" Read more 8 customers mention fur quality, 2 positive, 6 negative 8 customers mention \"Fur quality\" 2 positive 6 negative Customers have mixed opinions about the fur quality of the dress, with several noting it looks cheap, while one customer mentions it's not durable enough to brush. \" It definitely does not have the same fluffy fur that is pictured, however it’s still super cute. I’m usually between a small and medium.... \" Read more \" ...the fur does look a little cheap but it’s still worth the price. I only give it four stars because the shipping. The dress came late.... \" Read more \" I was very surprised with the material and the fur which was perfect . Arrived on time (last minute Christmas shopping) just great purchase overall \" Read more \" Fur is not durable enough to brush it to even make it fluffy, stuck to my hands like cat hair.. Longer than expected.... \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Super cute",
        "body": "It definitely does not have the same fluffy fur that is pictured, however it’s still super cute. I’m usually between a small and medium. I looked at the other reviews and sized up to a medium and I’m very glad I did. It’s very tight but just the way I like it, if I got a small there’s no way it would’ve been wearable. Overall it’s worth it! Read more",
        "author": "Evelyn",
        "rating": 5.0,
        "date": "December 4, 2022",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Beautiful piece of clothing",
        "body": "I bought this fun dress to wear to a show. I got SO many compliments when I wore it. People saying I look Angelic. I bought a Large and it was firm fitting on the arms. But overall, LOVE IT. Read more",
        "author": "Customer",
        "rating": 5.0,
        "date": "November 16, 2022",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Short and shit tight",
        "body": "The dress is short which is expected from the picture but it is also a little bit too skin tight. The sleeves of the dress are were a little short and didn't go up to my wrist. Overall tho the dress was nice Read more",
        "author": "Eby",
        "rating": 4.0,
        "date": "October 30, 2022",
        "verified": false,
        "images": []
      },
      {
        "title": "1.0 out of 5 stars Do not buy",
        "body": "Not at all what it looked like in photos. Material was very light, and sheer. Very short, looked like a shirt. Read more",
        "author": "Angela Rhea",
        "rating": 1.0,
        "date": "September 24, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Came ripped different dress from what's pictured but close",
        "body": "I'm 5ft 4 inches tall 168 lbs got a large. Really tight but super cute and doesn't show a bunch of rolls due to the fabric it's made from. My arms aren't that big but feels quite tight in the arms. It came with a small hole up by the collar/ shoulder but I'll just sew it and hope it doesn't rip more. The drawstring does not have the fluffy poofs like the one the model is wearing so that is a bummer. It's more like what is pictured on the other people that reviewed it. The fur is also different not really furry but more fringy. The dress is soft and although very tight it seems comfortable. I have not worn it or washed it so still hard to tell how well it will hold up plus it being white I'll probably ruin it pretty fast. I'll definitely order another one Incase they sell out cause it's super cute. Also it is very short. I'll definitely need to wear it with leggings or really short white shorts underneath Read more",
        "author": "jessica",
        "rating": 3.0,
        "date": "October 27, 2022",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Winter wonderland",
        "body": "Amazing perfect fit and sexy outfit for your wintertime outings Read more",
        "author": "polly olsen",
        "rating": 5.0,
        "date": "July 30, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/712ur4tzPkL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71I1-oqdQlL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71-T+2AnrEL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Perfect for Christmas",
        "body": "Stunning dress i love it, fits perfectly n soft Read more",
        "author": "TP",
        "rating": 5.0,
        "date": "February 8, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/81+0Zs5DjSL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "2.0 out of 5 stars Shedding!",
        "body": "Fur is not durable enough to brush it to even make it fluffy, stuck to my hands like cat hair.. Longer than expected. So I'm returning this and finding something else for my birthday unfortunately. Read more",
        "author": "Mary Anne jabjanofsky",
        "rating": 2.0,
        "date": "December 9, 2023",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Dress V Neck is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.",
  "about_this_item": "Womens Dress V Neck is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.",
  "long_description": "Womens Dress V Neck is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: A White Feathers, White. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Dress V Neck is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: A White Feathers, White. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [],
  "color_swatches": {
    "A White Feathers": "https://m.media-amazon.com/images/I/31g3oOxiYvL._AC_SR38,50_.jpg",
    "White": "https://m.media-amazon.com/images/I/31JvgLTM6ML._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "A White Feathers": "61OH7rDD-3L",
    "White": "61mdVP8GFNL"
  },
  "color_images": {
    "A White Feathers": [
      "https://m.media-amazon.com/images/I/61OH7rDD-3L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/41M1HLixXfL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/41M8L4V0StL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/51uwiFfQyzL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/419mP26NbDL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61xDfwKKT0L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61UJzW4vUjL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/51tWshk8-PL._SL1500_.jpg"
    ],
    "White": [
      "https://m.media-amazon.com/images/I/61mdVP8GFNL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61xDfwKKT0L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/619yEdji5DL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61uZou6inHL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/51tWshk8-PL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/51uwiFfQyzL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-formal-cocktail-ruched-maxi-sleeveless-bodycon",
      "title": "Womens Maxi Dress Formal Cocktail Ruched Maxi Sleeveless Bodycon",
      "price": 48.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51lcEKwzt8L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 99.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51MWKDRcToL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal",
      "title": "Womens Maxi Dress Formal",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51eAiny1x-L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-ruched-formal-maxi-bodycon",
      "title": "Womens Maxi Dress Ruched Formal Maxi Bodycon",
      "price": 62.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61ipOhuw3WL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail",
      "title": "Womens Dress Cocktail",
      "price": 37.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61+EOqv4F9L._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 26.45,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/713OuBdQBYL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 564.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/614g9yo8opL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-cocktail-maxi-split",
      "title": "Womens Maxi Dress Formal Cocktail Maxi Split",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61G8RF1nKaL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-formal",
      "title": "Womens Dress Formal",
      "price": 89.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51Ba9fw8pTL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-split-sleeveless-cocktail-bodycon",
      "title": "Womens Dress Split Sleeveless Cocktail Bodycon",
      "price": 27.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51OoLUBGjtL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 79.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Wedding Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/51nJyQaIwAL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-mermaid",
      "title": "Womens Maxi Dress Cocktail Mermaid",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51QRiCCVj+L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening-bodycon-short-sleeve",
      "title": "Womens Maxi Dress Formal Evening Bodycon Short Sleeve",
      "price": 63.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61whKp-35lL._SL1500_.jpg"
      ]
    }
  ]
}