{
  "id": "womens-maxi-dress-long-sleeve",
  "handle": "womens-maxi-dress-long-sleeve",
  "sku": "JC2115",
  "asin": "B0FBGB7D66",
  "title": "Womens Maxi Dress Long Sleeve",
  "title_original": "OFEEFAN Fall Dresses for Women 2025 Long Sleeve Crew Neck Sweater Dress",
  "brand": "Visit the OFEEFAN Store",
  "price": 19.99,
  "social_proof": {
    "bought_past_month": 145,
    "text": "145+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/81EViPQu4BL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81lU7rW4KpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91DbJYjy2ML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81GyQZUcPeL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81LsMkeEWcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/811hGiMFRtL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81tkA4B2g4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/815R2N0LLiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/819eExhlKVL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81D3IafiT5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ktpYpaBhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71k4HwLR4PL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81c3LvrtW5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81LiZla+uGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71o77k+BZJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81cpxfoiDyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81tudEFxw1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81JD+03VYOL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81lNEvXtz6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81TH1PhDGOL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/81EViPQu4BL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81lU7rW4KpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91DbJYjy2ML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81GyQZUcPeL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81LsMkeEWcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/811hGiMFRtL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81tkA4B2g4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/815R2N0LLiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/819eExhlKVL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81D3IafiT5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ktpYpaBhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71k4HwLR4PL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81c3LvrtW5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81LiZla+uGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71o77k+BZJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81cpxfoiDyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81tudEFxw1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81JD+03VYOL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81lNEvXtz6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81TH1PhDGOL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Item model number ‏": "‎ OFE-WDR9170",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ July 22, 2025",
    "ASIN ‏": "‎ B0FHWKRZ9P",
    "Best Sellers Rank": "#3,832 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #14 in Women's Casual Dresses",
    "Customer Reviews": "4.3 4.3 out of 5 stars (460)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Wine",
      "Caramelred",
      "Navy Floral",
      "Blue",
      "Khakicaramel",
      "Apricot",
      "Hot Pink",
      "Black Taupe",
      "Black and White",
      "Black",
      "Navy",
      "Red Plaid",
      "Leopard",
      "White Plaid",
      "Black Plaid",
      "Green"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.3,
    "count": 460,
    "customers_say": "Customers find the dress fits well, with one noting it's perfect for family gatherings, and appreciate its soft, smooth material that's comfortable and doesn't wrinkle. Moreover, the dress is versatile, suitable for many occasions, and flatters various body types while hiding the belly, making it ideal for winter wear. However, the material thickness receives mixed feedback, with several customers noting it isn't very thick. Select to learn more Fit Style Soft fabric Comfort Quality Flattering Warmth Material thickness 83 customers mention \"Fit\" 65 positive 18 negative Customers are satisfied with the dress's fit, noting it's perfect and has the right length, though some mention it's tight on top. \"The dress is a perfect fit for my 5'4\" 116 lb frame! The fabric is very soft and comfy; and will keep me warm at a wedding in November.\" Read more \"Love this dress I ordered a small. Great fit .\" Read more \"Holiday fun cheetah print dress. Great fabric and value. It fits true to size , and it is wonderful to follow the trends, yet not break the bank.\" Read more \"I really like it except the sleeves were too tight . I'm 5'5\", 190 lbs. Ordered XL. Fit everywhere except sleeves....\" Read more 68 customers mention \"Style\" 66 positive 2 negative Customers find the dress pretty, with one mentioning it's suitable for a 70-year-old lady and another noting it's great for breast cancer awareness. \"Perfect fall weather dress. Well made, medium weight. Cute & comfortable, alittle swing on the bottom of the skirt. Will be ordering another color.\" Read more \"...Very pink! Though not a neon pink. Its very pretty . It is a good thickness and perfect for the unpredictable weather of early fall/late spring....\" Read more \"I wore this to church and it was comfortable. It was pretty it was warm. I got a whole bunch of compliments on outfit. It is thick enough to be warm....\" Read more \"This dress was super cute . However I did not keep it. I took it out and was disappointed by the material, it was fleece and blanket like....\" Read more 55 customers mention \"Soft fabric\" 51 positive 4 negative Customers love the soft material of the dress, describing it as super smooth and comfortable to wear. \"This dress JUST arrived! I tried it on immediately. It is soft , the right lightweight gauge, not too short, not too long, and flatters my figure!...\" Read more \"...Mine is more like a brushed chenille. It is very soft and comfortable. It is a nice heavy material so it will still be good for colder weather....\" Read more \" Super soft , thicker than expected, definitely keeps me warm, I wear a blazer and it did get fuzzers on the stomach area after the first wear,...\" Read more \"Oh so soft . And very comfortable. I don't even wear dresses but I will be wearing more than just Halloween....\" Read more 54 customers mention \"Comfort\" 51 positive 3 negative Customers find the dress comfortable, with one mentioning it doesn't wrinkle and another describing it as their favorite cozy option. \"I wore this to church and it was comfortable . It was pretty it was warm. I got a whole bunch of compliments on outfit. It is thick enough to be warm....\" Read more \" Comfy & soft. Bought when it was on sale. Perfect for casual wearing or for business casual attire for work or family pictures\" Read more \"I really like the material it’s really nice feel very comfortable fit nice it’s a perfect fit and just the right length.\" Read more \"This dress is so comfortable and the color is flattering, great quality. It is thicker so I'm saving it to wear to thanksgiving dinner....\" Read more 48 customers mention \"Quality\" 43 positive 5 negative Customers find the dress to be well-made and versatile, suitable for various occasions. \" Love this dress ! Perfect fit! Made well thick material. Would buy in more colors!\" Read more \"Such a great dress ! So easy to wear and compliments your figure. I get tons of compliments when I wear it, it’s not too think or thin....\" Read more \"...Depending on where you live I think it makes a great fall dress . I bought it for my honeymoon and will be posting pictures The medium fit me great.\" Read more \" Nice dress beautiful fabric somewhat heavier than I expected\" Read more 26 customers mention \"Flattering\" 25 positive 1 negative Customers find the dress flattering, particularly noting that it hides the belly, and one customer mentions it works well for different body types. \"Very nice and flattering . Fabric is very soft. Pretty warm, great for fall! I like it with a simple chain belt.\" Read more \"I absolutely love this dress. The detailing is great and It’s very flattering ! At this price I think I’m ordering other colors.\" Read more \"...Soft, stretchy, and light. Still warm, but not heavy or thick. Figure flattering and fun to wear. Perfect.\" Read more \"If you have a bit of a belly like I do, this dress is super flattering ! I rcvd tons of compliments at my office Christmas party!...\" Read more 25 customers mention \"Warmth\" 25 positive 0 negative Customers find the dress warm and perfect for winter and fall seasons, with one customer noting it's thick enough to provide good insulation, while another mentions it works well with boots and tights. \"I wore this to church and it was comfortable. It was pretty it was warm . I got a whole bunch of compliments on outfit. It is thick enough to be warm....\" Read more \"Very nice and flattering. Fabric is very soft. Pretty warm, great for fall ! I like it with a simple chain belt.\" Read more \"...It is however, thick so it’s good for winter weather . Also, I’m 5 ft and it is above the knee on me....\" Read more \" Perfect fall weather dress . Well made, medium weight. Cute & comfortable, alittle swing on the bottom of the skirt. Will be ordering another color.\" Read more 32 customers mention \"Material thickness\" 21 positive 11 negative Customers have mixed opinions about the dress's material thickness, with several noting that it isn't very thick. \"...Cute, soft, stretchy, thick material . Great for fall and winter. It’s thick tshirt material and super comfortable....\" Read more \"Better buy a sweater to go with this \"sweater dress\" ! Material is super thin -just about see through. Am so disappointed!!!!!\" Read more \"First of all, this is NOT a sweater dress. It is however, thick so it’s good for winter weather. Also, I’m 5 ft and it is above the knee on me....\" Read more \" Thin but not see through . The color is on the red side length is so cute. Softest material ever\" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Nice, comfortable and versatile dress",
        "body": "I'm 5'4 and 115 lbs and ordered a small. It fit true to size and was very comfortable and kept me warm outside in November. It's cute and casual but also can be dressy enough to wear out for a date or to work depending on how you style it. The material is very soft and thick enough that you can't see through it. There was a tiny hole in the one seam along my right side but I easily fixed it was a few stitches and there were no other issues with the dress. Read more",
        "author": "Reads",
        "rating": 5.0,
        "date": "December 4, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars A wonderful dress!",
        "body": "Loved this dress for my princess peach costume and for just to wear when I go out. The fit was very well on a postpartum body. It hid some of my tummy. The color is true to the photo. Very pink! Though not a neon pink. Its very pretty. It is a good thickness and perfect for the unpredictable weather of early fall/late spring. May be a little cozy for the summer but the length helps. The length of the bottom is modest but not too long. I am 5’3 and 160 if that helps. I am very happy with my purchase! Read more",
        "author": "Christy R.",
        "rating": 5.0,
        "date": "October 29, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Cute but not what I expected",
        "body": "This dress is cute and true to size. The one I received is definitely not a ribbed knit sweater dress even though that it the description. Mine is more like a brushed chenille. It is very soft and comfortable. It is a nice heavy material so it will still be good for colder weather. If you are looking for an actual ribbed sweater dress this may not be for you. Read more",
        "author": "Wyoming 827",
        "rating": 4.0,
        "date": "November 2, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Amazed",
        "body": "Oh so soft. And very comfortable. I don't even wear dresses but I will be wearing more than just Halloween. It's absolutely beautiful and fits really well. It won't let me upload the pic of my whole body so that's best I got. But really is a nice dress Read more",
        "author": "Todd Sanders",
        "rating": 5.0,
        "date": "December 14, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71o+3YlonxL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Versatility and perfect comfort. Soft, true to size and comfortable. A keeper!!",
        "body": "This dress is SOFT and STRETCHY, true to size and color. I am 5”4” and nearly 130 lbs. The garment is versatile, long enough for full coverage and it is not see-through. Can be worn with a festive belt and bag for holiday events. Leggings/tights add an element of cover for chilly days. I LOVE the sleeve length that matches my leg warmers and 2”heels, also from Amazon. Will surely purchase in another color. Best feature: The ‘give’ and stretch! I can pick up my kids without’ showing off’. Size small is perfect for me although even a medium would fit too, should I have chosen a more casual fit for comfort at home. Length and sleeve length are PERFECT for my 48 year old body… but I’m sure my 13 yr old will likely find it to wear. Regular undergarments are fine, as the dress is knitted thick enough to cover even darker colored ‘undies’. The neural color is as shown and is perfect with a belt, scarf, purse, boots, flats: ANY neutral accessory. Great garment to dress up or down for multiple events and the quality and fit far surpass the price. *Very happy, Amazon. I will be buying another. Read more",
        "author": "April Marko (Spirit Conduit)",
        "rating": 5.0,
        "date": "November 12, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71P0asZjIPL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/7140ZT+GtXL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/7182giV9B2L._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71bWAv1BeSL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "3.0 out of 5 stars Adorable flowy dress.",
        "body": "This dress was super cute. However I did not keep it. I took it out and was disappointed by the material, it was fleece and blanket like. I tried it in for reference to see how it fit. I’m 5’1 and 149lbs wearing a size Large. A little long to be paired with these boots but perfect with other shoes. I did enjoy the fit and how it’s tight on top and flowy on the bottom. Read more",
        "author": "Reli Arnold",
        "rating": 3.0,
        "date": "November 15, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71NcfafQLFL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71PY90lSSNL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Figure flattering shape",
        "body": "Nice thick no- show fabric, cute waist defining shape with flirty skirt. Love this cute somewhat dressy dress. Can be worn well with a belt. Nice above knee length. I’m 5’2”, small size. Very comfortable. Read more",
        "author": "Baylor Bear",
        "rating": 5.0,
        "date": "November 30, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Love love it",
        "body": "Super cute and fits well. Warm for winter. Hit mid thigh at my finger tips, not too short. Super soft and comfortable. I’m picky with material and this isn’t scratchy at all very soft and smooth. Color looks great for warm skin tones. Read more",
        "author": "Jamie Baleno",
        "rating": 5.0,
        "date": "November 24, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.",
  "about_this_item": "Womens Maxi Dress Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.",
  "long_description": "Womens Maxi Dress Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Wine, Caramelred, Navy Floral, Blue, Khakicaramel, Apricot, Hot Pink, Black Taupe, Black and White, Black, Navy, Red Plaid, Leopard, White Plaid. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Wine, Caramelred, Navy Floral, Blue, Khakicaramel, Apricot, Hot Pink, Black Taupe, Black and White, Black, Navy, Red Plaid, Leopard, White Plaid. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "d4b4e739-4c09-47f2-8dd9-e62f87ac7ad3",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d4b4e739-4c09-47f2-8dd9-e62f87ac7ad3/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d4b4e739-4c09-47f2-8dd9-e62f87ac7ad3/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/824c501e-4f94-4302-b0db-b952e33e1f49.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "4dd3728a-e45c-41f7-99d6-b661cb84598e",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4dd3728a-e45c-41f7-99d6-b661cb84598e/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4dd3728a-e45c-41f7-99d6-b661cb84598e/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/824c501e-4f94-4302-b0db-b952e33e1f49.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "43926a64-2362-4582-a6c8-39a149ef186c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/43926a64-2362-4582-a6c8-39a149ef186c/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/43926a64-2362-4582-a6c8-39a149ef186c/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/824c501e-4f94-4302-b0db-b952e33e1f49.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "28e999e8-97fe-4d46-8fc6-b9c7fd248a59",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/28e999e8-97fe-4d46-8fc6-b9c7fd248a59/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/28e999e8-97fe-4d46-8fc6-b9c7fd248a59/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/824c501e-4f94-4302-b0db-b952e33e1f49.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "3d1fe1e7-9b02-486c-be0e-9b3aba33db06",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3d1fe1e7-9b02-486c-be0e-9b3aba33db06/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3d1fe1e7-9b02-486c-be0e-9b3aba33db06/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/824c501e-4f94-4302-b0db-b952e33e1f49.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "3356e381-5fb5-4731-a9e7-e178c9269d18",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3356e381-5fb5-4731-a9e7-e178c9269d18/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3356e381-5fb5-4731-a9e7-e178c9269d18/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/824c501e-4f94-4302-b0db-b952e33e1f49.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "c49554db-7d29-4bc0-8a3a-825e8339cbd3",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c49554db-7d29-4bc0-8a3a-825e8339cbd3/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c49554db-7d29-4bc0-8a3a-825e8339cbd3/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/824c501e-4f94-4302-b0db-b952e33e1f49.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "dde2fd29-6598-4a07-bbbf-f35943f81777",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/dde2fd29-6598-4a07-bbbf-f35943f81777/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/dde2fd29-6598-4a07-bbbf-f35943f81777/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/824c501e-4f94-4302-b0db-b952e33e1f49.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "b5abf942-ad6d-42fd-b616-1a1c6b7bf1f3",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b5abf942-ad6d-42fd-b616-1a1c6b7bf1f3/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b5abf942-ad6d-42fd-b616-1a1c6b7bf1f3/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/824c501e-4f94-4302-b0db-b952e33e1f49.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "abf3431e-869a-409c-877d-4cfeb8ba43db",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/abf3431e-869a-409c-877d-4cfeb8ba43db/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/abf3431e-869a-409c-877d-4cfeb8ba43db/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/824c501e-4f94-4302-b0db-b952e33e1f49.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "3611b8b5-23bd-4a63-94da-42f6b4240cc2",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3611b8b5-23bd-4a63-94da-42f6b4240cc2/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3611b8b5-23bd-4a63-94da-42f6b4240cc2/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/824c501e-4f94-4302-b0db-b952e33e1f49.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "71c118ca-0cb8-431c-9a33-ffe6e0c2e433",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/71c118ca-0cb8-431c-9a33-ffe6e0c2e433/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/71c118ca-0cb8-431c-9a33-ffe6e0c2e433/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/824c501e-4f94-4302-b0db-b952e33e1f49.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Wine": "https://m.media-amazon.com/images/I/412iJ-GSh2L._AC_SR38,50_.jpg",
    "Caramelred": "https://m.media-amazon.com/images/I/41nWAHCOgzL._AC_SR38,50_.jpg",
    "Navy Floral": "https://m.media-amazon.com/images/I/51gGKVzlVcL._AC_SR38,50_.jpg",
    "Blue": "https://m.media-amazon.com/images/I/41tf-x1IwCL._AC_SR38,50_.jpg",
    "Khakicaramel": "https://m.media-amazon.com/images/I/41SaCE+gCSL._AC_SR38,50_.jpg",
    "Apricot": "https://m.media-amazon.com/images/I/41a-UHfGXUL._AC_SR38,50_.jpg",
    "Hot Pink": "https://m.media-amazon.com/images/I/41GMqAFOD+L._AC_SR38,50_.jpg",
    "Black Taupe": "https://m.media-amazon.com/images/I/51Af6KfldrL._AC_SR38,50_.jpg",
    "Black and White": "https://m.media-amazon.com/images/I/51IKWS0NwKL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/41MeE2G9sHL._AC_SR38,50_.jpg",
    "Navy": "https://m.media-amazon.com/images/I/414MZ3KB+yL._AC_SR38,50_.jpg",
    "Red Plaid": "https://m.media-amazon.com/images/I/516nFR5SK1L._AC_SR38,50_.jpg",
    "Leopard": "https://m.media-amazon.com/images/I/51doUM4pcrL._AC_SR38,50_.jpg",
    "White Plaid": "https://m.media-amazon.com/images/I/51TKP6r9ICL._AC_SR38,50_.jpg",
    "Black Plaid": "https://m.media-amazon.com/images/I/51YBR++d74L._AC_SR38,50_.jpg",
    "Green": "https://m.media-amazon.com/images/I/413VJGc2XTL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Wine": "811hGiMFRtL",
    "Caramelred": "81tkA4B2g4L",
    "Navy Floral": "815R2N0LLiL",
    "Blue": "819eExhlKVL",
    "Khakicaramel": "81D3IafiT5L",
    "Apricot": "71ktpYpaBhL",
    "Hot Pink": "71k4HwLR4PL",
    "Black Taupe": "81c3LvrtW5L",
    "Black and White": "81LiZla+uGL",
    "Black": "71o77k+BZJL",
    "Navy": "81cpxfoiDyL",
    "Red Plaid": "81tudEFxw1L",
    "Leopard": "81JD+03VYOL",
    "White Plaid": "81lNEvXtz6L",
    "Black Plaid": "81EViPQu4BL",
    "Green": "81TH1PhDGOL"
  },
  "color_images": {
    "Wine": [
      "https://m.media-amazon.com/images/I/811hGiMFRtL._SL1500_.jpg"
    ],
    "Caramelred": [
      "https://m.media-amazon.com/images/I/81tkA4B2g4L._SL1500_.jpg"
    ],
    "Navy Floral": [
      "https://m.media-amazon.com/images/I/815R2N0LLiL._SL1500_.jpg"
    ],
    "Blue": [
      "https://m.media-amazon.com/images/I/819eExhlKVL._SL1500_.jpg"
    ],
    "Khakicaramel": [
      "https://m.media-amazon.com/images/I/81D3IafiT5L._SL1500_.jpg"
    ],
    "Apricot": [
      "https://m.media-amazon.com/images/I/71ktpYpaBhL._SL1500_.jpg"
    ],
    "Hot Pink": [
      "https://m.media-amazon.com/images/I/71k4HwLR4PL._SL1500_.jpg"
    ],
    "Black Taupe": [
      "https://m.media-amazon.com/images/I/81c3LvrtW5L._SL1500_.jpg"
    ],
    "Black and White": [
      "https://m.media-amazon.com/images/I/81LiZla+uGL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/71o77k+BZJL._SL1500_.jpg"
    ],
    "Navy": [
      "https://m.media-amazon.com/images/I/81cpxfoiDyL._SL1500_.jpg"
    ],
    "Red Plaid": [
      "https://m.media-amazon.com/images/I/81tudEFxw1L._SL1500_.jpg"
    ],
    "Leopard": [
      "https://m.media-amazon.com/images/I/81JD+03VYOL._SL1500_.jpg"
    ],
    "White Plaid": [
      "https://m.media-amazon.com/images/I/81lNEvXtz6L._SL1500_.jpg"
    ],
    "Black Plaid": [
      "https://m.media-amazon.com/images/I/81EViPQu4BL._SL1500_.jpg"
    ],
    "Green": [
      "https://m.media-amazon.com/images/I/81TH1PhDGOL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress-cocktail-bodycon",
      "title": "Womens Dress Cocktail Bodycon",
      "price": 47.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61NfEwzl3xL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-one-shoulder-maxi-formal",
      "title": "Womens Maxi Dress Evening One Shoulder Maxi Formal",
      "price": 69.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/5150AIQL4eL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail",
      "title": "Womens Dress Cocktail",
      "price": 103.54,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61JApwce25L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-formal-bodycon-evening-sleeveless",
      "title": "Womens Maxi Dress Maxi Formal Bodycon Evening Sleeveless",
      "price": 61.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61s8qg6u1VL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 158.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71PmRANW40L._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress-bodycon-split-ruched-off-shoulder",
      "title": "Womens Dress Bodycon Split Ruched Off Shoulder",
      "price": 38.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/41JjYcPgcpL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 95.61,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Work",
      "images": [
        "https://m.media-amazon.com/images/I/71hVgSIB1jL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 138.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51PZNrlyY9L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-split-evening-formal",
      "title": "Womens Maxi Dress Split Evening Formal",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51BZ1BqPx8L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 65.97,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/81wr8PDg55L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-v-neck",
      "title": "Womens Dress V Neck",
      "price": 82.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/710bSTpZ9hL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 278.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/91YXeyW506L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening-long-sleeve",
      "title": "Womens Maxi Dress Formal Evening Long Sleeve",
      "price": 87.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61nnk+flvaL._SL1500_.jpg"
      ]
    }
  ]
}