{
  "id": "womens-maxi-dress-sleeveless-maxi",
  "handle": "womens-maxi-dress-sleeveless-maxi",
  "sku": "JC2016",
  "asin": "B0FCFNFYJS",
  "title": "Womens Maxi Dress Sleeveless Maxi",
  "title_original": "Milumia Women's Polka Dots Maxi Tank Dress Vintage Mock Neck Sleeveless Elegant Long Dresses",
  "brand": "Visit the Milumia Store",
  "price": 42.99,
  "social_proof": {
    "bought_past_month": 1882,
    "text": "1882+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/61HRr0Xk8rL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71F9TbsE58L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61AUG9aDqcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61zjzlItfzL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71dSsaf66OL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ooOUj3tJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61qTfI1CYbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61I1vAgs5VL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61n-BkBGY4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Phh7l1knL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/61HRr0Xk8rL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71F9TbsE58L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61AUG9aDqcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61zjzlItfzL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71dSsaf66OL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ooOUj3tJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61qTfI1CYbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61I1vAgs5VL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61n-BkBGY4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Phh7l1knL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ October 8, 2024",
    "ASIN ‏": "‎ B0DJNRKW37",
    "Best Sellers Rank": "#26,848 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #235 in Women's Casual Dresses",
    "Customer Reviews": "4.3 4.3 out of 5 stars (139)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Dark Green",
      "Red",
      "Brown",
      "Blue",
      "Black and White",
      "Black"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.3,
    "count": 139,
    "customers_say": "Customers find the dress gorgeous and appreciate its thick, stretchy fabric that feels soft and comfortable. Moreover, they like the fit, with one customer noting the subtle flare at the bottom, and another mentioning good coverage around the armholes. However, opinions about sizing are mixed, with several customers noting it runs extremely small. Select to learn more Fit Material quality Quality Looks great Comfort Fabric stretch Fabric softness Size 32 customers mention \"Fit\" 26 positive 6 negative Customers like how the dress fits, with one mentioning it works well as a fitted jacket for cooler weather. \" Perfect fit and the stretch is exactly what I needed. Material had great feel and not the low end quality....\" Read more \"...I get compliments every time I wear it. So comfy, no zipper, fits true to size . Great stretch and quality of fabric\" Read more \"...It’s form fitting but rhe bottom has a subtle flare which is very elegants. And the material is thick and stretchy....\" Read more \"This dress is amazing! the fit is perfect , the material is super soft and it’s makes you look beautiful i am 5’8 160lbs and the medium fit perfect\" Read more 26 customers mention \"Material quality\" 20 positive 6 negative Customers like the material of the dress, noting that the fabric is thick and has a great feel. \"I give this dress 2 stars instead of one because it is nice material . But it runs extremely small. I typically wear size 12 and ordered a Large....\" Read more \"Perfect fit! Quality fabric ! Dress it up or go casual!\" Read more \"Great dress! The fabric is nice and stretchy. The dress is super comfortable and looks amazing. I am 5'7, 140lbs and I purchased Small size....\" Read more \" Cheap fabric and poor made\" Read more 25 customers mention \"Quality\" 23 positive 2 negative Customers find the dress to be of great quality. \"Super cute and comfy! Love the dress even though I was nervous it being tight fitted.\" Read more \" Lovely dress , fabric soft and pretty thick although will need something underneath. I am a large and i had to send it back and reorder an XL....\" Read more \" Excellent quality . Thick material. Looks expensive.\" Read more \" Love this dress ! Fits well\" Read more 24 customers mention \"Looks great\" 23 positive 1 negative Customers find the dress pretty. \" Gorgeous dress . Great material. Looks so good on.\" Read more \"It's a pretty dress but I could barely get it on. Has a bit of stretch to the fabric but the size choices are only small, medium, and large....\" Read more \" Beautiful dress , good material and well made, but you need to size up, I had to return it for a large and I’m a size medium...\" Read more \" Cute style , but feels a bit like a plastic swimsuit, very synthetic feeling. Definitely want to size up....\" Read more 13 customers mention \"Comfort\" 13 positive 0 negative Customers find the dress comfortable. \"Great dress! The fabric is nice and stretchy. The dress is super comfortable and looks amazing. I am 5'7, 140lbs and I purchased Small size....\" Read more \"...It’s so so soft and comfortable , but completely office appropriate. It does run a littleeee big in my opinion....\" Read more \"I received so many compliments on this dress! It’s very comfortable and fits perfect. Hugs your body nicely, but not too tight....\" Read more \" Super comfortable dress that can be dressed up or dressed down! I wore it to two weddings and got a bunch of compliments. Fabric is very soft.\" Read more 9 customers mention \"Fabric stretch\" 9 positive 0 negative Customers like the fabric's stretchiness, with one mentioning that the material is thick and stretchy. \"Great dress! The fabric is nice and stretchy . The dress is super comfortable and looks amazing. I am 5'7, 140lbs and I purchased Small size....\" Read more \"...Medium would have fit fine, but dress has stretch & i prefer dresses with stretch skimming my body and not be totally fitted....\" Read more \"...And the material is thick and stretchy . I think it can be dressed up or down.\" Read more \"...Got so many compliments. Stretchy material and super comfortable. I ordered a size small and I am 5’6, 145 pounds!! Get this dress!!\" Read more 8 customers mention \"Fabric softness\" 8 positive 0 negative Customers like the fabric of the dress, describing it as soft. \"...It’s so so soft and comfortable, but completely office appropriate. It does run a littleeee big in my opinion....\" Read more \"...I wore it to two weddings and got a bunch of compliments. Fabric is very soft .\" Read more \"Fits is perfect and the fabric is soft !\" Read more \"Lovely dress, fabric soft and pretty thick although will need something underneath. I am a large and i had to send it back and reorder an XL....\" Read more 9 customers mention \"Size\" 3 positive 6 negative Customers have mixed opinions about the dress size, with some finding it spot on while others report that it runs extremely small. \"...But it runs extremely small . I typically wear size 12 and ordered a Large. It was more like an XS....\" Read more \"The dress is as described. Nice fit, stretch fabric and true to size . Good value for price.\" Read more \"Beautiful dress, good material and well made, but you need to size up , I had to return it for a large and I’m a size medium...\" Read more \"...Definitely want to size up . It is more form fitting than it shows, and hugs body tight. I don’t like the fabric feel, so I will be returning it.\" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Love the dress!",
        "body": "Great dress! The fabric is nice and stretchy. The dress is super comfortable and looks amazing. I am 5'7, 140lbs and I purchased Small size. Super happy and I totally recommend. I originally bought the white one, super happy that is not see through and I am ordering the blue one. Read more",
        "author": "Nataliebfit",
        "rating": 5.0,
        "date": "October 14, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71ZFp+JoDFL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71LIpkkU34L._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71nC0kC6tEL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Great wedding guest dress",
        "body": "I ended up wearing this dress to an Oct wedding in Nashville and it was perfect. It’s form fitting but rhe bottom has a subtle flare which is very elegants. And the material is thick and stretchy. I think it can be dressed up or down. Read more",
        "author": "Katie",
        "rating": 5.0,
        "date": "October 20, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Super dress for any occasion.",
        "body": "I received so many compliments on this dress! It’s very comfortable and fits perfect. Hugs your body nicely, but not too tight. For reference, I’m 5’5” and 130 lbs and bought the small. If I’d lose the 10 pounds I need to, it would truly be a perfect fit. The length was great with heels. I may buy another in a different color. Amazon suggested xs as my size, but after reading reviews I felt that would be too tight, and I would have been right. Read more",
        "author": "Lyn Harper",
        "rating": 5.0,
        "date": "November 2, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61jwqvk12dL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/61s2jjb7T7L._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/61gG-GN6fIL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71cF7ulr8QL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "4.0 out of 5 stars Material and how well it was done",
        "body": "Beautiful dress, good material and well made, but you need to size up, I had to return it for a large and I’m a size medium I love the black with white dots, I ordered 3 in different colors Read more",
        "author": "Bee B",
        "rating": 4.0,
        "date": "October 25, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Perfect for Bridal Shower Theme!",
        "body": "MY wife attended a bridal shower with a white and polka dot theme, and this dress was absolutely perfect for the occasion. It fit her like a glove, and the size was spot on. She received so many compliments on it and found it incredibly comfortable to wear. The dress is made of high-quality material, and she is already planning to wear it for other events in the future. The fabric is quite thick, so it looks like it will last a long time. All in all, it was a great find, and we couldn't be happier with the purchase! Read more",
        "author": "A&P",
        "rating": 5.0,
        "date": "October 19, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Fits tight and feels cheap",
        "body": "Cute style, but feels a bit like a plastic swimsuit, very synthetic feeling. Definitely want to size up. It is more form fitting than it shows, and hugs body tight. I don’t like the fabric feel, so I will be returning it. Read more",
        "author": "Tina",
        "rating": 3.0,
        "date": "December 4, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Buy this now!",
        "body": "So flattering - buy this dress! I get compliments every time I wear it. So comfy, no zipper, fits true to size. Great stretch and quality of fabric Read more",
        "author": "Jamie Mager",
        "rating": 5.0,
        "date": "November 4, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "1.0 out of 5 stars Low quality sewing",
        "body": "Too baggy at the hip area, there is too much extra fabric making it very unflattering Read more",
        "author": "K",
        "rating": 1.0,
        "date": "December 11, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Sleeveless Maxi is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.",
  "about_this_item": "Womens Maxi Dress Sleeveless Maxi is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.",
  "long_description": "Womens Maxi Dress Sleeveless Maxi is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Dark Green, Red, Brown, Blue, Black and White, Black. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Sleeveless Maxi is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Dark Green, Red, Brown, Blue, Black and White, Black. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "7acc20ea-a940-4582-84b1-6690c2ba03fd",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7acc20ea-a940-4582-84b1-6690c2ba03fd/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7acc20ea-a940-4582-84b1-6690c2ba03fd/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/abf34f56-1059-4654-988f-ceda30fdc02a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "139a526c-7847-4969-97aa-6bedd2b08b38",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/139a526c-7847-4969-97aa-6bedd2b08b38/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/139a526c-7847-4969-97aa-6bedd2b08b38/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/abf34f56-1059-4654-988f-ceda30fdc02a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "973e1973-ccf9-4589-add5-ee09420b52f7",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/973e1973-ccf9-4589-add5-ee09420b52f7/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/973e1973-ccf9-4589-add5-ee09420b52f7/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/abf34f56-1059-4654-988f-ceda30fdc02a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "49bdd486-5676-488e-b8a7-863612a1663e",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/49bdd486-5676-488e-b8a7-863612a1663e/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/49bdd486-5676-488e-b8a7-863612a1663e/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/abf34f56-1059-4654-988f-ceda30fdc02a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "63a12ca4-ee7e-4f9a-9521-11f26733b4d9",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/63a12ca4-ee7e-4f9a-9521-11f26733b4d9/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/63a12ca4-ee7e-4f9a-9521-11f26733b4d9/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/abf34f56-1059-4654-988f-ceda30fdc02a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "9eb593a5-95ce-4285-8a98-ec611f3ec9ad",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9eb593a5-95ce-4285-8a98-ec611f3ec9ad/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9eb593a5-95ce-4285-8a98-ec611f3ec9ad/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/abf34f56-1059-4654-988f-ceda30fdc02a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "eb9e19a4-0c3b-4d20-b009-e2229ee065cc",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/eb9e19a4-0c3b-4d20-b009-e2229ee065cc/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/eb9e19a4-0c3b-4d20-b009-e2229ee065cc/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/abf34f56-1059-4654-988f-ceda30fdc02a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "c6ca6835-e9b1-4187-9e10-af76cd8cab44",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c6ca6835-e9b1-4187-9e10-af76cd8cab44/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c6ca6835-e9b1-4187-9e10-af76cd8cab44/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/abf34f56-1059-4654-988f-ceda30fdc02a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "622d1fa6-9fb4-4573-bb2b-040a92e66dff",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/622d1fa6-9fb4-4573-bb2b-040a92e66dff/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/622d1fa6-9fb4-4573-bb2b-040a92e66dff/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/abf34f56-1059-4654-988f-ceda30fdc02a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "396fab32-0868-418a-97cb-e28a1440f6e0",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/396fab32-0868-418a-97cb-e28a1440f6e0/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/396fab32-0868-418a-97cb-e28a1440f6e0/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/abf34f56-1059-4654-988f-ceda30fdc02a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "eaa409f3-da3d-4d02-af8c-63e8e06d120c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/eaa409f3-da3d-4d02-af8c-63e8e06d120c/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/eaa409f3-da3d-4d02-af8c-63e8e06d120c/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/abf34f56-1059-4654-988f-ceda30fdc02a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "7d650064-8375-47b8-ae4d-78d659052ca3",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7d650064-8375-47b8-ae4d-78d659052ca3/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7d650064-8375-47b8-ae4d-78d659052ca3/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/abf34f56-1059-4654-988f-ceda30fdc02a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Dark Green": "https://m.media-amazon.com/images/I/41d5arF7JCL._AC_SR38,50_.jpg",
    "Red": "https://m.media-amazon.com/images/I/41psPbpPnrL._AC_SR38,50_.jpg",
    "Brown": "https://m.media-amazon.com/images/I/41Zkx0ar-pL._AC_SR38,50_.jpg",
    "Blue": "https://m.media-amazon.com/images/I/41F0KdhkFzL._AC_SR38,50_.jpg",
    "Black and White": "https://m.media-amazon.com/images/I/41uNSNCDLvL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/414Ftz5bxeL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Dark Green": "61ooOUj3tJL",
    "Red": "61qTfI1CYbL",
    "Brown": "61HRr0Xk8rL",
    "Blue": "61I1vAgs5VL",
    "Black and White": "61n-BkBGY4L",
    "Black": "61Phh7l1knL"
  },
  "color_images": {
    "Dark Green": [
      "https://m.media-amazon.com/images/I/61ooOUj3tJL._SL1500_.jpg"
    ],
    "Red": [
      "https://m.media-amazon.com/images/I/61qTfI1CYbL._SL1500_.jpg"
    ],
    "Brown": [
      "https://m.media-amazon.com/images/I/61HRr0Xk8rL._SL1500_.jpg"
    ],
    "Blue": [
      "https://m.media-amazon.com/images/I/61I1vAgs5VL._SL1500_.jpg"
    ],
    "Black and White": [
      "https://m.media-amazon.com/images/I/61n-BkBGY4L._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/61Phh7l1knL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-evening-short-sleeve-maxi",
      "title": "Womens Maxi Dress Evening Short Sleeve Maxi",
      "price": 108.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61wOhOilEWL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening",
      "title": "Womens Maxi Dress Formal Evening",
      "price": 79.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51JPBI7aU5L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-ruched-bodycon-cocktail",
      "title": "Womens Dress Ruched Bodycon Cocktail",
      "price": 43.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51Fi7gsARJL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-bodycon-maxi-v-neck-long-sleeve",
      "title": "Womens Maxi Dress Evening Bodycon Maxi V Neck Long Sleeve",
      "price": 45.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/519n5+gVMAL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi",
      "title": "Womens Maxi Dress Maxi",
      "price": 8.76,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71St-N3EkkL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-maxi-bodycon-cocktail-sleeveless",
      "title": "Womens Maxi Dress Maxi Bodycon Cocktail Sleeveless",
      "price": 43.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/41Y-qNIH8+L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71q7jQuq5DL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-bodycon-ruched-long-sleeve",
      "title": "Womens Maxi Dress Maxi Bodycon Ruched Long Sleeve",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61Hb4bfDy4L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-short-sleeve-v-neck",
      "title": "Womens Dress Short Sleeve V Neck",
      "price": 37.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61XObVpc1uL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-mermaid",
      "title": "Womens Maxi Dress Evening Mermaid",
      "price": 69.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51m7zikskVL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-off-shoulder-bodycon-long-sleeve-maxi",
      "title": "Womens Maxi Dress Off Shoulder Bodycon Long Sleeve Maxi",
      "price": 53.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/611pJhxTuIL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 77.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61ENtjtNHZL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-v-neck-evening-maxi-formal",
      "title": "Womens Maxi Dress V Neck Evening Maxi Formal",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61DEsjvdnWL._SL1500_.jpg"
      ]
    }
  ]
}