{
  "id": "womens-maxi-dress-long-sleeve-v-neck",
  "handle": "womens-maxi-dress-long-sleeve-v-neck",
  "sku": "JC2495",
  "asin": "B0FCFB5DWH",
  "title": "Womens Maxi Dress Long Sleeve V Neck",
  "title_original": "SELINK Womens Long Sleeve Dresses Casual V Neck Tribal Print Button Flowy Boho Mini Beach Dress",
  "brand": "Visit the SELINK Store",
  "price": 36.99,
  "social_proof": {
    "bought_past_month": 1218,
    "text": "1218+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/816W15SRvGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91R9v2WZrJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81thdNvyReL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81bOGRxxkpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81sLfjs4YyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81qeyrviwRL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81F4XgqHM9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81kjeMrHvnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/814IW6h42WL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81SIVoHU32L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/714NTU6HiDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81I+GDIGIrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81AsS8WZImL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81HBboTOwuL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81aKn6H35NL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81L+yUu1BcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81iI5sJgjuL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/816W15SRvGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91R9v2WZrJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81thdNvyReL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81bOGRxxkpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81sLfjs4YyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81qeyrviwRL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81F4XgqHM9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81kjeMrHvnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/814IW6h42WL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81SIVoHU32L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/714NTU6HiDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81I+GDIGIrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81AsS8WZImL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81HBboTOwuL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81aKn6H35NL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81L+yUu1BcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81iI5sJgjuL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Package Dimensions ‏": "‎ 10 x 8 x 0.5 inches; 3.53 ounces",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ July 19, 2024",
    "ASIN ‏": "‎ B0D7HMD1C2",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#20,447 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #254 in Women's Casual Dresses",
    "Customer Reviews": "4.1 4.1 out of 5 stars (723)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Sky Blue",
      "Z54 White Orange",
      "Z56 Red",
      "Z58 Green Plaid",
      "Z54 White Blue Geometric",
      "Z57 Rose",
      "Z59 Blue Leaf",
      "Orange",
      "Z54 Multicolour",
      "Beige",
      "Z56 White Blue Tribal",
      "Z59 White Blue",
      "Z54 White Red Tribal",
      "Z58 Red Plaid",
      "Green",
      "Z57 Yellow"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.1,
    "count": 723,
    "customers_say": "Customers love the dress's vibrant colors and find it well-made, comfortable, and perfect for casual nights. The fabric receives mixed feedback - while some appreciate its light weight, others note it's thin polyester. The sizing is also mixed, with some finding it runs a little big. Generated from the text of customer reviews Select to learn more Cute (151) Quality (81) Comfort (59) Color options (49) Fabric weight (33) Dress size (28) Fit (160) Fabric quality (65) 151 customers mention cute, 142 positive, 9 negative 151 customers mention \"Cute\" 142 positive 9 negative Customers find the dress pretty and love its print, with one customer describing it as retro flirty. \" Cute , lightweight dress that fits well with one bit of advice… IF you are larger chested, the buttons will pull.... \" Read more \" RUNS VERY BIG.... super cute though. WIsh I had ordered a small...I'm typically a medium, but honestly an XS would work for this dress.... \" Read more \" Beautiful . Well made dress with gorgeous design and bright pop of color. Perfect for summer evenings. Very comfortable. I love it. \" Read more \" This dress is so cute really nice cotton perfect for an afternoon luncheon. Style and color were, darling. \" Read more 81 customers mention quality, 73 positive, 8 negative 81 customers mention \"Quality\" 73 positive 8 negative Customers find the dress to be well-made, with one customer noting it exceeds expectations. \" Great dress . Very flattering and cool for the summer. Orders another color also!! \" Read more \" Love this dress , lightweight and flowy. Get compliments every time I wear it. Will be cute with tall boots this fall. \" Read more \" Love the dress . The fabric should wash well. I can’t wait to wear it. I wear a large and ordered a large. It fit perfect \" Read more \" Outstanding purchase. Only pros to report. Well made . Material is easy to wash although it could be hot for an outside event without a breeze.... \" Read more 59 customers mention comfort, 58 positive, 1 negative 59 customers mention \"Comfort\" 58 positive 1 negative Customers find the dress comfortable, with one mentioning it is true to size and another noting it has pockets. \" Cute dress, cool and comfortable . Size was perfect . Washed cold and hanged dry with great results. Looks far more expensive than what I paid for it. \" Read more \" So cute and comfy . I bought a medium as large was too big. I am 5’9” and 160. Medium was perfect.... \" Read more \" This dress is beautiful. The colors are vivid and it’s very comfortable . The fabric weight is perfect in my opinion.... \" Read more \" Cute, comfortable dress but wrinkles never come out of the fabric even after washing. \" Read more 49 customers mention color options, 44 positive, 5 negative 49 customers mention \"Color options\" 44 positive 5 negative Customers appreciate the vibrant colors of the dress, with one mentioning it's perfect for brunch. \" ...I’m 5.1” 155 lbs size L. Fits perfect in size and length. I love the colors ! I am so pleases I bought this dress. \" Read more \" ...It's comfortable, beautiful fit and material quality. The colors are vibrant . Such a flattering style. I'm 5'3\", 144 lbs and large fits me perfectly.... \" Read more \" ...said that, when I returned home, I tried the dress, and the colors are beautiful , but runs large from the waist down. Light fabric.... \" Read more \" This dress is hard to rate. It is well made, love the color but just not for me. \" Read more 33 customers mention fabric weight, 30 positive, 3 negative 33 customers mention \"Fabric weight\" 30 positive 3 negative Customers appreciate the dress's fabric weight, describing it as lightweight. \" This dress is beatiful. Not see through, is comfortable and light . You can wear it to church or on a day date. With boots or with sandals.... \" Read more \" Love this dress, lightweight and flowy. Get compliments every time I wear it. Will be cute with tall boots this fall. \" Read more \" Love this dress! Great for traveling for wrinkle free. Light weight and super cute on \" Read more \" Cute, lightweight dress that fits well with one bit of advice… IF you are larger chested, the buttons will pull.... \" Read more 28 customers mention dress size, 28 positive, 0 negative 28 customers mention \"Dress size\" 28 positive 0 negative Customers find this dress suitable for various occasions, with one mentioning it works well for both day and night wear, while another notes it's perfect for vacation in the sun. \" Great summer dress . Fit as expected \" Read more \" Soft, comfortable. Vibrant colors. Very summery ! Perfect summer dress ! \" Read more \" Really nice casual summer dress . \" Read more \" excellent summer dress \" Read more 160 customers mention fit, 95 positive, 65 negative 160 customers mention \"Fit\" 95 positive 65 negative Customers have mixed opinions about the dress's fit, with some finding it perfect in size and length, while others report it runs a little big and is absolutely huge on them. \" Great fit Great fabric Great pattern \" Read more \" This actually was really cute but too big so I returned it. The fabric is nice and if it weren't too large I would have kept it.... \" Read more \" Color and design as shown. Comfortable and good fit/ true to size . Still new, but I think a good value. \" Read more \" RUNS VERY BIG ....super cute though. WIsh I had ordered a small...I'm typically a medium, but honestly an XS would work for this dress.... \" Read more 65 customers mention fabric quality, 34 positive, 31 negative 65 customers mention \"Fabric quality\" 34 positive 31 negative Customers have mixed opinions about the fabric of the dress, with some loving it while others find it cheap and thin. \" Great fit Great fabric Great pattern \" Read more \" Horrible fabric . If I could give it 0 stars, I would. \" Read more \" Loose fitting, very thin material makes the dress cool to wear in 90 degree weather. It came with no tag or bagged. Good thing I wanted to keep it. \" Read more \" The print is pretty but the fabric is thin and should be lined but is not, also the edges are not fully finished. \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Gorgeous on!!!",
        "body": "Absolutely beautiful dress!!!! I felt magnificent wearing. Perfect fit, it’s very comfortable. Read more",
        "author": "Leslie Richardson",
        "rating": 5.0,
        "date": "December 10, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Great fit and comfortable",
        "body": "Great for, amazing flow to the dress. True to size. This color is not as yellow as I thought but still very cute. Read more",
        "author": "Valerie Davis",
        "rating": 5.0,
        "date": "November 29, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Great dress. I wish it didn’t snag so easily.",
        "body": "This dress is beautiful. The colors are vivid and it’s very comfortable. The fabric weight is perfect in my opinion. It isn’t see through and is lightweight. The only reason it’s not getting 5 stars is because it’s easily snagged. I wore it for less than 6 hours and snagged the front of it so now there is a line of white right through the beautiful pink and teal colors and I won’t be able to wear it for work or a nice occasion now. I’m 5 foot 2 inches and weigh 130, but my shoulders are pretty wide for a woman. I ordered a medium and it’s a little snug through the shoulder area. Read more",
        "author": "Amanda",
        "rating": 4.0,
        "date": "August 22, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Pretty pops of color on this white summer dress",
        "body": "Beautiful. Well made dress with gorgeous design and bright pop of color. Perfect for summer evenings. Very comfortable. I love it. Read more",
        "author": "Amazoncustomer1234",
        "rating": 5.0,
        "date": "December 6, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Cute summer dress",
        "body": "Love the dress. The fabric should wash well. I can’t wait to wear it. I wear a large and ordered a large. It fit perfect Read more",
        "author": "Rosemary",
        "rating": 5.0,
        "date": "November 15, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Too Much Material in the Wrong Places",
        "body": "This dress would be perfect for someone who was slender, had a small chest, and no hips. So...the girl in the picture, not me. If you're looking for a dress to hide a baby bump this would do it as flowy and has a lot of material in the front. Also, it has zero stretch across the shoulders. I tried to gather it with a belt but due to the baby doll hem under the bust it looked strange. I really loved the print and was disappointed it fit like a tent. Read more",
        "author": "Susan K.",
        "rating": 3.0,
        "date": "October 7, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Nice product",
        "body": "Very pretty. Thin, but expected. Read more",
        "author": "Customer",
        "rating": 5.0,
        "date": "December 17, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars GREAT BUT SIZE DOWN",
        "body": "Very cute but it does run big I am normally a true medium and read other reviews that said to size down so I ordered a small, I won’t say that I should’ve gotten an XS because then the bust wouldn’t fit but the length in these are made big and I would say from the waist down is loose but over all the small fits me well and I love it for the holidays and perfect church length! I am 5”4 150lbs 36 C Read more",
        "author": "Kayleigh Peppers",
        "rating": 4.0,
        "date": "December 1, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Long Sleeve V Neck is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.",
  "about_this_item": "Womens Maxi Dress Long Sleeve V Neck is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.",
  "long_description": "Womens Maxi Dress Long Sleeve V Neck is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Sky Blue, Z54 White Orange, Z56 Red, Z58 Green Plaid, Z54 White Blue Geometric, Z57 Rose, Z59 Blue Leaf, Orange, Z54 Multicolour, Beige, Z56 White Blue Tribal, Z59 White Blue, Z54 White Red Tribal, Z58 Red Plaid. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Long Sleeve V Neck is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Sky Blue, Z54 White Orange, Z56 Red, Z58 Green Plaid, Z54 White Blue Geometric, Z57 Rose, Z59 Blue Leaf, Orange, Z54 Multicolour, Beige, Z56 White Blue Tribal, Z59 White Blue, Z54 White Red Tribal, Z58 Red Plaid. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "8f66d404-2f9f-4cb5-af4f-884eb87fc139",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8f66d404-2f9f-4cb5-af4f-884eb87fc139/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8f66d404-2f9f-4cb5-af4f-884eb87fc139/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/89da5ace-4ec8-473c-b918-b738bffd4323.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "b82d32f0-2a3b-4797-8b4a-412516868217",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b82d32f0-2a3b-4797-8b4a-412516868217/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b82d32f0-2a3b-4797-8b4a-412516868217/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/89da5ace-4ec8-473c-b918-b738bffd4323.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "9e796194-f0c4-476a-a426-5206d78605f2",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9e796194-f0c4-476a-a426-5206d78605f2/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9e796194-f0c4-476a-a426-5206d78605f2/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/89da5ace-4ec8-473c-b918-b738bffd4323.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "0be5aef1-47db-42ff-bf32-f4aa889f202d",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0be5aef1-47db-42ff-bf32-f4aa889f202d/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0be5aef1-47db-42ff-bf32-f4aa889f202d/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/89da5ace-4ec8-473c-b918-b738bffd4323.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "60725fc4-edfd-4a38-a9a1-6de36ed9942c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/60725fc4-edfd-4a38-a9a1-6de36ed9942c/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/60725fc4-edfd-4a38-a9a1-6de36ed9942c/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/89da5ace-4ec8-473c-b918-b738bffd4323.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "7a4d9e39-b727-44ae-985f-dc8b2ec1341e",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7a4d9e39-b727-44ae-985f-dc8b2ec1341e/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7a4d9e39-b727-44ae-985f-dc8b2ec1341e/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/89da5ace-4ec8-473c-b918-b738bffd4323.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "c8981242-9bb4-4e88-9883-1497c0ce6c24",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c8981242-9bb4-4e88-9883-1497c0ce6c24/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c8981242-9bb4-4e88-9883-1497c0ce6c24/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/89da5ace-4ec8-473c-b918-b738bffd4323.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "c45cc561-4f33-4371-8622-1a6b60d01b20",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c45cc561-4f33-4371-8622-1a6b60d01b20/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c45cc561-4f33-4371-8622-1a6b60d01b20/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/89da5ace-4ec8-473c-b918-b738bffd4323.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "edead511-eb71-465c-9a61-e43e86989110",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/edead511-eb71-465c-9a61-e43e86989110/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/edead511-eb71-465c-9a61-e43e86989110/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/89da5ace-4ec8-473c-b918-b738bffd4323.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "3d078ff2-2097-4af2-a277-9ad845a4fc8d",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3d078ff2-2097-4af2-a277-9ad845a4fc8d/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3d078ff2-2097-4af2-a277-9ad845a4fc8d/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/89da5ace-4ec8-473c-b918-b738bffd4323.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "df381073-92f2-43b5-bcd3-8b44fd4a96eb",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/df381073-92f2-43b5-bcd3-8b44fd4a96eb/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/df381073-92f2-43b5-bcd3-8b44fd4a96eb/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/89da5ace-4ec8-473c-b918-b738bffd4323.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "3e29a36f-b44d-4cae-bab0-299d88ab5520",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3e29a36f-b44d-4cae-bab0-299d88ab5520/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3e29a36f-b44d-4cae-bab0-299d88ab5520/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/89da5ace-4ec8-473c-b918-b738bffd4323.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Sky Blue": "https://m.media-amazon.com/images/I/51rW41BxYUL._AC_SR38,50_.jpg",
    "Z54 White Orange": "https://m.media-amazon.com/images/I/416G1MB6JaL._AC_SR38,50_.jpg",
    "Z56 Red": "https://m.media-amazon.com/images/I/51yI6LVAwHL._AC_SR38,50_.jpg",
    "Z58 Green Plaid": "https://m.media-amazon.com/images/I/51PJREhp8iL._AC_SR38,50_.jpg",
    "Z54 White Blue Geometric": "https://m.media-amazon.com/images/I/51KuhSu-KJL._AC_SR38,50_.jpg",
    "Z57 Rose": "https://m.media-amazon.com/images/I/51iFFeUHvmL._AC_SR38,50_.jpg",
    "Z59 Blue Leaf": "https://m.media-amazon.com/images/I/51ERxBAsLIL._AC_SR38,50_.jpg",
    "Orange": "https://m.media-amazon.com/images/I/510UXIOu1qL._AC_SR38,50_.jpg",
    "Z54 Multicolour": "https://m.media-amazon.com/images/I/51dKSwEZTaL._AC_SR38,50_.jpg",
    "Beige": "https://m.media-amazon.com/images/I/516IS2tPP4L._AC_SR38,50_.jpg",
    "Z56 White Blue Tribal": "https://m.media-amazon.com/images/I/51peuya78PL._AC_SR38,50_.jpg",
    "Z59 White Blue": "https://m.media-amazon.com/images/I/51zp89g26OL._AC_SR38,50_.jpg",
    "Z54 White Red Tribal": "https://m.media-amazon.com/images/I/51uypMHKZmL._AC_SR38,50_.jpg",
    "Z58 Red Plaid": "https://m.media-amazon.com/images/I/51eRxyrC4RL._AC_SR38,50_.jpg",
    "Green": "https://m.media-amazon.com/images/I/51SLghxHB7L._AC_SR38,50_.jpg",
    "Z57 Yellow": "https://m.media-amazon.com/images/I/51qe0iEd45L._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Sky Blue": "81thdNvyReL",
    "Z54 White Orange": "81bOGRxxkpL",
    "Z56 Red": "816W15SRvGL",
    "Z58 Green Plaid": "81sLfjs4YyL",
    "Z54 White Blue Geometric": "81qeyrviwRL",
    "Z57 Rose": "81F4XgqHM9L",
    "Z59 Blue Leaf": "81kjeMrHvnL",
    "Orange": "814IW6h42WL",
    "Z54 Multicolour": "81SIVoHU32L",
    "Beige": "714NTU6HiDL",
    "Z56 White Blue Tribal": "81I+GDIGIrL",
    "Z59 White Blue": "81AsS8WZImL",
    "Z54 White Red Tribal": "81HBboTOwuL",
    "Z58 Red Plaid": "81aKn6H35NL",
    "Green": "81L+yUu1BcL",
    "Z57 Yellow": "81iI5sJgjuL"
  },
  "color_images": {
    "Sky Blue": [
      "https://m.media-amazon.com/images/I/81thdNvyReL._SL1500_.jpg"
    ],
    "Z54 White Orange": [
      "https://m.media-amazon.com/images/I/81bOGRxxkpL._SL1500_.jpg"
    ],
    "Z56 Red": [
      "https://m.media-amazon.com/images/I/816W15SRvGL._SL1500_.jpg"
    ],
    "Z58 Green Plaid": [
      "https://m.media-amazon.com/images/I/81sLfjs4YyL._SL1500_.jpg"
    ],
    "Z54 White Blue Geometric": [
      "https://m.media-amazon.com/images/I/81qeyrviwRL._SL1500_.jpg"
    ],
    "Z57 Rose": [
      "https://m.media-amazon.com/images/I/81F4XgqHM9L._SL1500_.jpg"
    ],
    "Z59 Blue Leaf": [
      "https://m.media-amazon.com/images/I/81kjeMrHvnL._SL1500_.jpg"
    ],
    "Orange": [
      "https://m.media-amazon.com/images/I/814IW6h42WL._SL1500_.jpg"
    ],
    "Z54 Multicolour": [
      "https://m.media-amazon.com/images/I/81SIVoHU32L._SL1500_.jpg"
    ],
    "Beige": [
      "https://m.media-amazon.com/images/I/714NTU6HiDL._SL1500_.jpg"
    ],
    "Z56 White Blue Tribal": [
      "https://m.media-amazon.com/images/I/81I+GDIGIrL._SL1500_.jpg"
    ],
    "Z59 White Blue": [
      "https://m.media-amazon.com/images/I/81AsS8WZImL._SL1500_.jpg"
    ],
    "Z54 White Red Tribal": [
      "https://m.media-amazon.com/images/I/81HBboTOwuL._SL1500_.jpg"
    ],
    "Z58 Red Plaid": [
      "https://m.media-amazon.com/images/I/81aKn6H35NL._SL1500_.jpg"
    ],
    "Green": [
      "https://m.media-amazon.com/images/I/81L+yUu1BcL._SL1500_.jpg"
    ],
    "Z57 Yellow": [
      "https://m.media-amazon.com/images/I/81iI5sJgjuL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 41.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71gLnAI8qnL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-ruched-evening-high-split-split",
      "title": "Womens Maxi Dress Maxi Ruched Evening High Split Split",
      "price": 72.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71omaPs6UqL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-short-sleeve-evening",
      "title": "Womens Dress Short Sleeve Evening",
      "price": 89.88,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61vi9CZReDL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-formal-cocktail-evening",
      "title": "Womens Dress Formal Cocktail Evening",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71ctK4kwdWL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 45.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/712FTzeTFLL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-formal-mermaid-evening-ruched",
      "title": "Womens Maxi Dress Formal Mermaid Evening Ruched",
      "price": 74.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61qHc0kmHEL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 37.79,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51WFZKRzSdL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 43.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Work",
      "images": [
        "https://m.media-amazon.com/images/I/81JXmyg5QfL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-sleeveless-split-formal-cocktail-v-neck",
      "title": "Womens Maxi Dress Sleeveless Split Formal Cocktail V Neck",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/51jHZEGYXHL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-ruched",
      "title": "Womens Maxi Dress Long Sleeve Ruched",
      "price": 49.29,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61P6bkbQawL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-one-shoulder-maxi-long-sleeve",
      "title": "Womens Maxi Dress One Shoulder Maxi Long Sleeve",
      "price": 45.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61UljfUsK4L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-long-sleeve-evening-formal",
      "title": "Womens Maxi Dress Cocktail Long Sleeve Evening Formal",
      "price": 46.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/6190eiFreBL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-formal-long-sleeve-evening",
      "title": "Womens Maxi Dress Maxi Formal Long Sleeve Evening",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51enCkUtvSL._SL1500_.jpg"
      ]
    }
  ]
}