{
  "id": "womens-maxi-dress-long-sleeve-maxi",
  "handle": "womens-maxi-dress-long-sleeve-maxi",
  "sku": "JC2450",
  "asin": "B0FCGBR4L3",
  "title": "Womens Maxi Dress Long Sleeve Maxi",
  "title_original": "Saodimallsu Womens Oversized Sweater Dress Mock Neck Long Sleeve Casual Warm Chunky Knit Fall Winter Maxi Dresses",
  "brand": "Visit the Saodimallsu Store",
  "price": 49.98,
  "social_proof": {
    "bought_past_month": 566,
    "text": "566+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/61LxxVOg3RL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71yQcqQzzrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81AzLS+PjGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81v8UNGHCQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/713VcKyZN1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61dgddQf6aL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61G0LE7EDTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61gAmjwgvIL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61kyp7bX0kL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61yuDx1BrmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61oDP9B8vDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61BzBIkulDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Q6ImVmLCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61JIsVbOI0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ECuioZWoL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61gmnP7eHZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61gye4Nf9gL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/610QbIXH5HL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/61LxxVOg3RL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71yQcqQzzrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81AzLS+PjGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81v8UNGHCQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/713VcKyZN1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61dgddQf6aL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61G0LE7EDTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61gAmjwgvIL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61kyp7bX0kL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61yuDx1BrmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61oDP9B8vDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61BzBIkulDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Q6ImVmLCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61JIsVbOI0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ECuioZWoL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61gmnP7eHZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61gye4Nf9gL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/610QbIXH5HL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ August 19, 2025",
    "ASIN ‏": "‎ B0FCG6LN1N",
    "Best Sellers Rank": "#4,592 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #19 in Women's Casual Dresses",
    "Customer Reviews": "4.1 4.1 out of 5 stars (182)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Brown",
      "Burgundy",
      "Dark Grey",
      "Apricot",
      "Army Green",
      "Black",
      "Coffee",
      "Dark Green",
      "Khaki",
      "White",
      "Beige",
      "Dark Blue",
      "Green",
      "Grey"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.1,
    "count": 182,
    "customers_say": "Customers find the sweater dress comfortable, soft, and well-made, with a twist of artsy fashion that can be dressed up or down. They appreciate its fit, with one customer noting it comes down to just above the ankle, and consider it perfect for fall and winter wear. They like its warmth, with one describing it as the coziest cold weather sweater dress. The sizing receives mixed feedback, with several customers noting it's very oversized. Select to learn more Comfort Style Warmth Fit Softness Quality Wearability Size 42 customers mention \"Comfort\" 39 positive 3 negative Customers find the sweater dress comfortable and cozy, with one customer noting that the material is not itchy. \"I bought this dress to look put together but to also be comfortable at the same time. It accomplished both. It's room6, comfortable, and warm....\" Read more \"It’s comfy but looks like a paper bag on. I’ve tried so hard to style it but it just doesn’t look good. Would only wear around the house lol\" Read more \"Warm, soft, cozy . The construction is really nice because you still have freedom of movement for your arms. So it's oversized, but also fits well....\" Read more \"This is the most cozy sweater ever. It’s very comfortable , and loose and perfect for cuddling up on a cold or rainy day....\" Read more 34 customers mention \"Style\" 28 positive 6 negative Customers find the sweater dress chic and pretty in color, noting that it can be dressed up. \"Love it so comfy and cute so many compliments add a cute necklace\" Read more \"...It is also stylish so you won't look frumpy. I am purchasing another one just to wear around the house during the cold Ohio winter....\" Read more \" SUPER CUTE ! I'm glad I got the L and not XL as it is very over sized. I'm 5'3 1/4\" tall and it hits lower calf/ankle length on me....\" Read more \"...SUPER comfortable! So cute ! Definitely oversized, so I ordered a small for my next 3 to compare sizing. But the medium is good....\" Read more 16 customers mention \"Warmth\" 15 positive 1 negative Customers find the sweater dress warm, with one describing it as the coziest cold weather option. \" Warm , soft, cozy. The construction is really nice because you still have freedom of movement for your arms. So it's oversized, but also fits well....\" Read more \"...It’s very cute and SO warm and cozy! The knit quality is a nice weight....\" Read more \"...The material thickness is perfect for winter because they are very warm .\" Read more \"This sweater dress is everything I hoped for! The chunky knit is warm and soft without feeling heavy, and the oversized fit gives it that effortless...\" Read more 14 customers mention \"Fit\" 13 positive 1 negative Customers like how the sweater dress fits, with one mentioning it comes down to just above the ankle. \"This sweater dress is the best! Perfect fit and very cozy. The material is well made and crazy soft.\" Read more \"This is the most cozy sweater ever. It’s very comfortable, and loose and perfect for cuddling up on a cold or rainy day....\" Read more \"...The chunky knit is warm and soft without feeling heavy, and the oversized fit gives it that effortless, cozy look....\" Read more \"...I am usually a size small and the small even with the oversized fit is perfect ! Super comfortable dress ❤️\" Read more 14 customers mention \"Softness\" 14 positive 0 negative Customers find the sweater soft, with one mentioning it feels comfortable without being heavy. \"Warm, soft , cozy. The construction is really nice because you still have freedom of movement for your arms. So it's oversized, but also fits well....\" Read more \"I was super impressed with style, fit, and length. very soft !\" Read more \"...The color is a nice neutral brown, and the knit is very soft . Since it is oversized, it fits like an oversized sweater....\" Read more \"Very nice sweater dress. material was soft and good quality. I'm 5 ft 4 130 pounds bought a medium because I wear stuff baggy....\" Read more 12 customers mention \"Quality\" 10 positive 2 negative Customers praise the quality of the sweater, describing it as well-made and a great find. \"It's well made . soft not itchy. I added a belt which made it not so boxy. The bottom flares out to almost balloonist look though....\" Read more \"Very nice sweater dress.material was soft and good quality . I'm 5 ft 4 130 pounds bought a medium because I wear stuff baggy....\" Read more \" Great sweater , overpriced for Amazon imo-should have been $22-25. It’s a fine sweater, the shape is what is really great about it....\" Read more \"Love it, great quality and so cozy. I'm wearing it for maternity, but could be worn whenever. Super stylish!\" Read more 9 customers mention \"Wearability\" 9 positive 0 negative Customers find the sweater dress perfect for fall and winter, with one customer noting it's ideal for cuddling up on cold or rainy days. \"Oversized and cozy. Perfect for fall and winter days\" Read more \"...Very forgiving for a curvy girl. Love this for Thanksgiving or work . Now I have to be more colors.\" Read more \"...This is the perfect sweater dress for all body types . It's not clingy, but it sure looks classy.\" Read more \"...It’s very comfortable, and loose and perfect for cuddling up on a cold or rainy day ....\" Read more 19 customers mention \"Size\" 9 positive 10 negative Customers have mixed opinions about the size of the sweater dress, with several noting it is very oversized. \"So comfy and warm! It’s definitely oversized , but that’s the style. I’ve worn it to work and a funeral…many compliments!\" Read more \" True to size , good quality. Just as pictured.\" Read more \"BIG - It’s very oversized ...\" Read more \"...It accomplished both. It's room6 , comfortable, and warm. I was out Christmas shopping on a rainy fall day and was not chilly....\" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Comfy Cozy",
        "body": "Warm, soft, cozy. The construction is really nice because you still have freedom of movement for your arms. So it's oversized, but also fits well. Thickness is great. Length is perfect, comes to mid-shin and I am 5'5\" 115lbs. It is also stylish so you won't look frumpy. I am purchasing another one just to wear around the house during the cold Ohio winter. If you are a freeze-baby like me, you'll love this sweater dress! Read more",
        "author": "JC",
        "rating": 5.0,
        "date": "December 12, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Cozy, Chic, and Perfect for Fall & Winter!",
        "body": "This sweater dress is everything I hoped for! The chunky knit is warm and soft without feeling heavy, and the oversized fit gives it that effortless, cozy look. The mock neck is super flattering and keeps me extra warm. Paired it with boots and it was the cutest outfit for family pictures. Definitely a new staple in my wardrobe! The added belt cinched it in to to give me a shape! Read more",
        "author": "Alexis Harrison",
        "rating": 5.0,
        "date": "December 3, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71WCzwTxDiL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars If Uggs Were a Sweater ⭐️⭐️⭐️⭐️⭐️",
        "body": "Let me be clear: this dress technically has no shape. It’s basically a long, cozy rectangle pretending to be a dress. It should be ugly. It should be unflattering. It should make me look like a background extra in a Hallmark movie about knitting. But it doesn’t. Somehow, it’s adorable. It’s like wearing a nightgown that convinced everyone it’s “office appropriate.” It’s grandma-core in the absolute best way — soft, oversized, and unapologetically cozy. Think: “just got a warm hug” meets “yes, I’m chic and comfortable, deal with it.” When I wore it, everyone reacted the same way they did when Uggs first came out — “ugh, it’s so ugly… where did you get it?” They pretended to hate it, but I could see the envy in their eyes. Deep down, they wanted to be swallowed by this same shapeless cloud of comfort. If you want to look like you didn’t try but still somehow win “coziest person in the room,” this is the dress. Anywho, I’ll take 10. Read more",
        "author": "Libby",
        "rating": 5.0,
        "date": "October 7, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61JOgoTqdNL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/61UiUKf3OXL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "4.0 out of 5 stars size down",
        "body": "I normally wear an L/LX and the medium fit right. Im 5'9\" and it came to my mid calf. It gives a very cozy vibe. Pair it with some boots and gold jewelry and it will give that cozy fall/winter \"chilling at the coffee shop\" vibe. It is polyester but it doesnt look like it. Cute for casual outings or even work. Read more",
        "author": "Zee",
        "rating": 4.0,
        "date": "November 14, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "1.0 out of 5 stars Potentially great",
        "body": "Will update when I get a replacement. Disappointed that I ordered this for next day delivery to wear soon but the plastic packaging was somehow glued to or shrink wrapped to the dress. Impossible to detach without ruining the dress. It is thick and looks like it will be a very warm piece to wear. Read more",
        "author": "Jessica",
        "rating": 1.0,
        "date": "December 13, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61xOMJbGdjL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/715e8kO73cL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "3.0 out of 5 stars It's OK.",
        "body": "It's well made. soft not itchy. I added a belt which made it not so boxy. The bottom flares out to almost balloonist look though. In my opinion it will only go with tall boots because of the way the bottom flares. I would size down though and still add a layer underneath. Read more",
        "author": "Amazon junkie",
        "rating": 3.0,
        "date": "December 14, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Try it! You may be pleasantly surprised! I was!",
        "body": "Okay I’m a short, fat, apple shaped woman or as my niece says “ Just Juicy” so I’m always looking for clothes that help hide the bod, with out being to overwhelming and adding more bulk. I fully expected to be returning this dress, I mean come on! A sweater dress?!? What was I thinking. Needless to say I was pleasantly surprised when I tried it on. It’s soft and actually drapes and hangs well and was not overwhelming on my bowling ball physique. And also comfortable! Now let’s be honest, did it make me look like Angelina Jolie? Heck no, Not even close! Only God could do that! But it was flattering and comfortable. How many things can you say that about in fact the only bad thing I can say about it is I wish it had pockets. But I wish they put pockets and everything. Why do men’s clothes get all the pockets, and in women’s clothing it’s just a perk? Anyway if you’re on the fence, I’d say try it. I may actually get another one. Read more",
        "author": "Steve's Sis",
        "rating": 5.0,
        "date": "December 12, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "2.0 out of 5 stars Frumpy",
        "body": "It’s comfy but looks like a paper bag on. I’ve tried so hard to style it but it just doesn’t look good. Would only wear around the house lol Read more",
        "author": "Lorna",
        "rating": 2.0,
        "date": "November 15, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Long Sleeve Maxi is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.",
  "about_this_item": "Womens Maxi Dress Long Sleeve Maxi is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.",
  "long_description": "Womens Maxi Dress Long Sleeve Maxi is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Brown, Burgundy, Dark Grey, Apricot, Army Green, Black, Coffee, Dark Green, Khaki, White, Beige, Dark Blue, Green, Grey. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Long Sleeve Maxi is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Brown, Burgundy, Dark Grey, Apricot, Army Green, Black, Coffee, Dark Green, Khaki, White, Beige, Dark Blue, Green, Grey. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "7d91a831-048c-43cf-8349-0f83bcce89e9",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7d91a831-048c-43cf-8349-0f83bcce89e9/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7d91a831-048c-43cf-8349-0f83bcce89e9/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "4fcd143c-6a1e-4162-9093-b2a62c2267be",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4fcd143c-6a1e-4162-9093-b2a62c2267be/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4fcd143c-6a1e-4162-9093-b2a62c2267be/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "26aac128-33eb-440f-84cd-7583d9d4c6dc",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/26aac128-33eb-440f-84cd-7583d9d4c6dc/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/26aac128-33eb-440f-84cd-7583d9d4c6dc/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "54af2267-abf3-45d6-a872-55b7fa2a0d24",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/54af2267-abf3-45d6-a872-55b7fa2a0d24/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/54af2267-abf3-45d6-a872-55b7fa2a0d24/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "98156f8d-6801-45a8-88c3-0852b7191258",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/98156f8d-6801-45a8-88c3-0852b7191258/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/98156f8d-6801-45a8-88c3-0852b7191258/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "971b8dff-d002-444e-8e55-e9e93e6bd9f6",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/971b8dff-d002-444e-8e55-e9e93e6bd9f6/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/971b8dff-d002-444e-8e55-e9e93e6bd9f6/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "9121aade-9164-4d0e-83a3-87d077ee978b",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9121aade-9164-4d0e-83a3-87d077ee978b/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9121aade-9164-4d0e-83a3-87d077ee978b/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "82d0748c-4229-4157-ad5c-a1dc128a7022",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/82d0748c-4229-4157-ad5c-a1dc128a7022/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/82d0748c-4229-4157-ad5c-a1dc128a7022/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "a885da4a-0a98-42e0-a50e-1bfae0aba344",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a885da4a-0a98-42e0-a50e-1bfae0aba344/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a885da4a-0a98-42e0-a50e-1bfae0aba344/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "17067ea1-c96a-4d32-9ff0-bf6df9872203",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/17067ea1-c96a-4d32-9ff0-bf6df9872203/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/17067ea1-c96a-4d32-9ff0-bf6df9872203/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "39010821-8397-40e5-af10-206e64b21b0e",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/39010821-8397-40e5-af10-206e64b21b0e/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/39010821-8397-40e5-af10-206e64b21b0e/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "12521b4b-1791-4ba3-99c6-b0f469375993",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/12521b4b-1791-4ba3-99c6-b0f469375993/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/12521b4b-1791-4ba3-99c6-b0f469375993/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Brown": "https://m.media-amazon.com/images/I/41CxfL3nFGL._AC_SR38,50_.jpg",
    "Burgundy": "https://m.media-amazon.com/images/I/41z9dtoO2jL._AC_SR38,50_.jpg",
    "Dark Grey": "https://m.media-amazon.com/images/I/41hVJo-aCYL._AC_SR38,50_.jpg",
    "Apricot": "https://m.media-amazon.com/images/I/4106L5HV65L._AC_SR38,50_.jpg",
    "Army Green": "https://m.media-amazon.com/images/I/313GVkA6TZL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31YGL3cjjtL._AC_SR38,50_.jpg",
    "Coffee": "https://m.media-amazon.com/images/I/315FzwVXdRL._AC_SR38,50_.jpg",
    "Dark Green": "https://m.media-amazon.com/images/I/4134uG9c70L._AC_SR38,50_.jpg",
    "Khaki": "https://m.media-amazon.com/images/I/315NySpSbIL._AC_SR38,50_.jpg",
    "White": "https://m.media-amazon.com/images/I/31fsuAh+dhL._AC_SR38,50_.jpg",
    "Beige": "https://m.media-amazon.com/images/I/31fwbLy+yOL._AC_SR38,50_.jpg",
    "Dark Blue": "https://m.media-amazon.com/images/I/410WDbUtoML._AC_SR38,50_.jpg",
    "Green": "https://m.media-amazon.com/images/I/4110kZnmroL._AC_SR38,50_.jpg",
    "Grey": "https://m.media-amazon.com/images/I/41Tx3EfuibL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Brown": "61dgddQf6aL",
    "Burgundy": "61G0LE7EDTL",
    "Dark Grey": "61gAmjwgvIL",
    "Apricot": "61kyp7bX0kL",
    "Army Green": "61yuDx1BrmL",
    "Black": "61oDP9B8vDL",
    "Coffee": "61BzBIkulDL",
    "Dark Green": "61Q6ImVmLCL",
    "Khaki": "61LxxVOg3RL",
    "White": "61JIsVbOI0L",
    "Beige": "61ECuioZWoL",
    "Dark Blue": "61gmnP7eHZL",
    "Green": "61gye4Nf9gL",
    "Grey": "610QbIXH5HL"
  },
  "color_images": {
    "Brown": [
      "https://m.media-amazon.com/images/I/61dgddQf6aL._SL1500_.jpg"
    ],
    "Burgundy": [
      "https://m.media-amazon.com/images/I/61G0LE7EDTL._SL1500_.jpg"
    ],
    "Dark Grey": [
      "https://m.media-amazon.com/images/I/61gAmjwgvIL._SL1500_.jpg"
    ],
    "Apricot": [
      "https://m.media-amazon.com/images/I/61kyp7bX0kL._SL1500_.jpg"
    ],
    "Army Green": [
      "https://m.media-amazon.com/images/I/61yuDx1BrmL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/61oDP9B8vDL._SL1500_.jpg"
    ],
    "Coffee": [
      "https://m.media-amazon.com/images/I/61BzBIkulDL._SL1500_.jpg"
    ],
    "Dark Green": [
      "https://m.media-amazon.com/images/I/61Q6ImVmLCL._SL1500_.jpg"
    ],
    "Khaki": [
      "https://m.media-amazon.com/images/I/61LxxVOg3RL._SL1500_.jpg"
    ],
    "White": [
      "https://m.media-amazon.com/images/I/61JIsVbOI0L._SL1500_.jpg"
    ],
    "Beige": [
      "https://m.media-amazon.com/images/I/61ECuioZWoL._SL1500_.jpg"
    ],
    "Dark Blue": [
      "https://m.media-amazon.com/images/I/61gmnP7eHZL._SL1500_.jpg"
    ],
    "Green": [
      "https://m.media-amazon.com/images/I/61gye4Nf9gL._SL1500_.jpg"
    ],
    "Grey": [
      "https://m.media-amazon.com/images/I/610QbIXH5HL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 210.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71gHGMr--UL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 36.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61gUSDNnB3L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-short-sleeve",
      "title": "Womens Dress Short Sleeve",
      "price": 75.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61XTYDFxLML._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-formal-bodycon",
      "title": "Womens Maxi Dress Long Sleeve Formal Bodycon",
      "price": 36.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61GBgs5yftL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 35.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/61ueGd5J5HL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-boat-neck-bodycon-long-sleeve",
      "title": "Womens Maxi Dress Boat Neck Bodycon Long Sleeve",
      "price": 36.89,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61g-xMLK3CL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-short-sleeve",
      "title": "Womens Dress Short Sleeve",
      "price": 139.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61DGsPsr6EL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-formal-evening",
      "title": "Womens Dress Formal Evening",
      "price": 85.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51DBpbbgqCL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-boat-neck",
      "title": "Womens Maxi Dress Boat Neck",
      "price": 34.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61X0az+gtqL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 41.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61jHeV88bYL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-long-sleeve",
      "title": "Womens Maxi Dress Bodycon Long Sleeve",
      "price": 27.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/419lpifTakL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-v-neck-split",
      "title": "Womens Maxi Dress Long Sleeve V Neck Split",
      "price": 9.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61rDQSA6d3L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-short-sleeve",
      "title": "Womens Dress Short Sleeve",
      "price": 36.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71mJpfJK2VL._SL1500_.jpg"
      ]
    }
  ]
}