{
  "id": "womens-maxi-dress-long-sleeve-bodycon",
  "handle": "womens-maxi-dress-long-sleeve-bodycon",
  "sku": "JC2807",
  "asin": "B0FC6GC3XL",
  "title": "Womens Maxi Dress Long Sleeve Bodycon",
  "title_original": "Wenrine Womens Bodycon Midi Sweater Dress Casual Ribbed Knit Bell Long Sleeve Ruffle Crewneck Decor Button Dresses",
  "brand": "Visit the Wenrine Store",
  "price": 35.99,
  "social_proof": {
    "bought_past_month": 57,
    "text": "57+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/61gW9gxtF1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71yYjWXhEKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71zlrMYKaRL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71yzovrVYsL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71a8uQeqeNL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/611cTns+uvL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71J+v6xpl5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71UyYpKuPzL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71dv5v+TRkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71nPH9nSQAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/616Y4w70bdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71y4yVzvjEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71GeWIuoA9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71SrtLxwlDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71kPq6DKSSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51wv+FaFuML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71dXPR-zGPL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71uLzFMg8rL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71j5w+cQHBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/713oIR8u1zL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61F44DC9uUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/712MNkHDmDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71w6zG6L6TL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71MOLlBEqqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ZruvKrzcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/619EejKM3LL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71CFFbqwq7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71zVlZwp-eL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71it-ehMdWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71nGdfrAJVL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ZwAHXD+nL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71tiHqtxiHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71V+4D2CiML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71MGU5cEpEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/710ta8oWw4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51sinAPOQeL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71LSqRA5z9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71p670AEjwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71BLBOotYFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/713coLE-gSL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/61gW9gxtF1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71yYjWXhEKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71zlrMYKaRL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71yzovrVYsL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71a8uQeqeNL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/611cTns+uvL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71J+v6xpl5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71UyYpKuPzL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71dv5v+TRkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71nPH9nSQAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/616Y4w70bdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71y4yVzvjEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71GeWIuoA9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71SrtLxwlDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71kPq6DKSSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51wv+FaFuML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71dXPR-zGPL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71uLzFMg8rL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71j5w+cQHBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/713oIR8u1zL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61F44DC9uUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/712MNkHDmDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71w6zG6L6TL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71MOLlBEqqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ZruvKrzcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/619EejKM3LL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71CFFbqwq7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71zVlZwp-eL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71it-ehMdWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71nGdfrAJVL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ZwAHXD+nL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71tiHqtxiHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71V+4D2CiML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71MGU5cEpEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/710ta8oWw4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51sinAPOQeL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71LSqRA5z9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71p670AEjwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71BLBOotYFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/713coLE-gSL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Package Dimensions ‏": "‎ 0.2 x 0.2 x 0.1 inches; 3.2 ounces",
    "Item model number ‏": "‎ C8P326",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ July 26, 2025",
    "ASIN ‏": "‎ B0FC6JFJTY",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#104,457 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #1,160 in Women's Casual Dresses",
    "Customer Reviews": "4.4 4.4 out of 5 stars (97)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Khaki",
      "Pink",
      "White",
      "Blue",
      "Yellow",
      "Burgundy",
      "Apricot",
      "Black"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.4,
    "count": 97,
    "customers_say": "Customers love this dress's style, particularly its sexy scoop in the back, and appreciate its firm fit and good stretch. The dress receives positive feedback for its quality, comfort, and thickness, with one customer noting it's great for work and going out. They like its color, with one describing it as a bright cheery yellow. Generated from the text of customer reviews Select to learn more Style (17) Fit (15) Quality (9) Comfort (8) Color (5) Thickness (5) Stretchiness (4) Wearability (4) 17 customers mention style, 17 positive, 0 negative 17 customers mention \"Style\" 17 positive 0 negative Customers find the dress cute, particularly appreciating the sexy scoop detail in the back. \" Beautiful dress and good quality for the price. Purchased for family photo. Fits fell and holds up well in the washing machine.... \" Read more \" Such a cute , feminine, modest bodycon dress \" Read more \" So pretty \" Read more \" Very soft and pretty \" Read more 15 customers mention fit, 15 positive, 0 negative 15 customers mention \"Fit\" 15 positive 0 negative Customers like the dress's fit, describing it as nice and firm. \" True to size nice fit , love it. Nice color. \" Read more \" ...Easy to dress up for a wedding or just for a night out! Fits true to size and the fabric is good quality, thick and stretchy, not too thick but not... \" Read more \" ...If it weren't for that I would have kept it. True to fit . \" Read more \" Absolutely my favorite dress. Love the fit and.... \" Read more 9 customers mention quality, 9 positive, 0 negative 9 customers mention \"Quality\" 9 positive 0 negative Customers love the quality of the dress, with one mentioning it offers good value for the price. \" Great dress , good material. \" Read more \" Absolutely my favorite dress . Love the fit and.... \" Read more \" ...The quality is great , super comfy, sizing seems true it's just thicker therefore heavier so it may have a bit of runching if you down smooth out.... \" Read more \" Love the quality and fit ! It’s perfect \" Read more 8 customers mention comfort, 8 positive, 0 negative 8 customers mention \"Comfort\" 8 positive 0 negative Customers find the dress comfortable. \" ...It's thick, kinda heavy, stretches, fits warm and comfortable . It's nice for the fall. My husband really like the look.... \" Read more \" ...The quality is great, super comfy , sizing seems true it's just thicker therefore heavier so it may have a bit of runching if you down smooth out.... \" Read more \" Beautiful dress and extremely comfortable ! \" Read more \" ...I wore it to church and felt perfectly warm and comfortable on a gloomy rainy day .... \" Read more 5 customers mention color, 5 positive, 0 negative 5 customers mention \"Color\" 5 positive 0 negative Customers like the dress's color, with one mentioning its bright cheery yellow shade. \" I love this dress! Color and fit is perfect! \" Read more \" True to size nice fit, love it. Nice color . \" Read more \" Pretty firm fitting dress. Blue is nice . \" Read more \" cute dress, love the bright cheery yellow the ruffle around the neckline, sleeve and the bottom make the dress very famine.... \" Read more 5 customers mention thickness, 4 positive, 1 negative 5 customers mention \"Thickness\" 4 positive 1 negative Customers like the dress's thickness. \" ...The quality is very satisfying for the price. It's thick , kinda heavy, stretches, fits warm and comfortable. It's nice for the fall.... \" Read more \" ...Has all the little extras. A great fit material is not too thin , is not see-through and it’s soft \" Read more \" ...it's got some thickness to it for that little touch of warmth in the colder months as well.... \" Read more \" ...quality is great, super comfy, sizing seems true it's just thicker therefore heavier so it may have a bit of runching if you down smooth out.... \" Read more 4 customers mention stretchiness, 3 positive, 1 negative 4 customers mention \"Stretchiness\" 3 positive 1 negative Customers like the dress's stretchiness. \" ...I also have to mention the good stretch . I wore it to church and felt perfectly warm and comfortable on a gloomy rainy day.... \" Read more \" ...Fits true to size and the fabric is good quality, thick and stretchy , not too thick but not see through. Great winter dress!... \" Read more \" Seriously one of the cutest dresses I own! Very stretchy , I should have sized down but for the price and quality honestly this will not be my... \" Read more \" ...It's thick, kinda heavy, stretches , fits warm and comfortable. It's nice for the fall. My husband really like the look.... \" Read more 4 customers mention wearability, 4 positive, 0 negative 4 customers mention \"Wearability\" 4 positive 0 negative Customers find the dress wearable, with some mentioning it's nice for fall, and one customer noting it's great for both work and going out. \" ... Great winter dress ! I liked it more than I expected! \" Read more \" ...It's nice for the fall . My husband really like the look. It's true to It's size and it stretches well so you can order you actual size. ⭐️⭐️⭐️⭐️⭐️ \" Read more \" ...Very becoming.cute flirty hem, nice long sleeve. Great dress for work and going out . \" Read more \" ...this dress is comfortable wear , nice for a fall and early winter .... \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Fits great!",
        "body": "This dress is super cute and comfortable! Easy to dress up for a wedding or just for a night out! Fits true to size and the fabric is good quality, thick and stretchy, not too thick but not see through. Great winter dress! I liked it more than I expected! Read more",
        "author": "Crafty Wildflower",
        "rating": 5.0,
        "date": "October 18, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71bQE887zmL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars comfortable and cute",
        "body": "cute dress, love the bright cheery yellow the ruffle around the neckline, sleeve and the bottom make the dress very famine. this dress is comfortable wear , nice for a fall and early winter. this dress does have some stretch to it so if you gain a little winter weight you'll still be able to put this cute dress on. it's got some thickness to it for that little touch of warmth in the colder months as well. over all very happy with the dress and ordered a couple more in different colors. Read more",
        "author": "missy",
        "rating": 5.0,
        "date": "November 25, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars So stylish",
        "body": "Absolutely my favorite dress. Love the fit and. Color wish we had more color options darker shades purple or blue or even a light purple a pretty med grey Read more",
        "author": "s bruner",
        "rating": 5.0,
        "date": "October 29, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Must have very nice",
        "body": "I really like this dress. The quality is very satisfying for the price. It's thick, kinda heavy, stretches, fits warm and comfortable. It's nice for the fall. My husband really like the look. It's true to It's size and it stretches well so you can order you actual size. ⭐️⭐️⭐️⭐️⭐️ Read more",
        "author": "Coco",
        "rating": 4.0,
        "date": "October 28, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61WvAo+fTjL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars But This Dress Right Now!!",
        "body": "Ladies! I LOVE LOVE LOVE this dress! I don't write reviews often but this one truly merited my thoughts. I ordered a medium in tbe wine/ox blood tone. This dress is a mix of stylish and elegant. I think it's flattering for most body types and if you have nice curves you deserve this dress. It says classy with out doing too much. As far as the feel, its a mix of warm and cozy without the feeling of bulkiness. I also have to mention the good stretch. I wore it to church and felt perfectly warm and comfortable on a gloomy rainy day. I'm style expert and I'm not too quick to buy fast fashion if it looks cheap or doesn't look flattering. The dress \"As Is\" honestly was just okay to me. But the \"creative\" vibe in me decided to tweek the dress until I discovered an instant elevation to this look. And now I LOVE this dress. If you're looking to level-up this dress from Amazon like to designer love....here's the recipe: 1. I removed ALL of the buttons. I don't care for non-functional buttons if I can help it. And to be honest it made the dress look cheap. 2. I turned the dress around. The seam where the buttons were has now created a sexy line down your back. Sort of reminiscent of panty hose with a seam down the back. Plus that faint line gives an optical illusion of an elongated silhouette. Also your neckline becomes more interesting because the frills frames your neck. And what was once the front now you have a sexy scoop in the back. 3. Steam the dress. I could have ironed it but I didn't want the risk of getting the \"iron shine\". If you know what I mean, there's no going back once you get the \"iron shine\". 4. Belt it. I love belts. Especially when I want to work it with a matching heel. I used my Versace belt with gold embellished \"V\" and black pumps with a gold zipper. This just might be my go-to for fall and winter. I'm so glad I took a chance on this dress. And now I plan on buying all of the colors!! Read more",
        "author": "Nicole V",
        "rating": 5.0,
        "date": "October 26, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/716l0QOhRfL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/61D0hsSTLOL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71xYvAoXVbL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/716pORfHwSL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Beautiful dress",
        "body": "Love the quality and fit ! It’s perfect Read more",
        "author": "Maria Cherepanova",
        "rating": 5.0,
        "date": "November 12, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Cute dress collar just made wrong",
        "body": "The material is good, the collar around the neck didn't lay properly and kept rolling up. If it weren't for that I would have kept it. True to fit. Read more",
        "author": "Cindy Heick",
        "rating": 3.0,
        "date": "October 2, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars So pretty!",
        "body": "Seriously one of the cutest dresses I own! Very stretchy, I should have sized down but for the price and quality honestly this will not be my only one. The quality is great, super comfy, sizing seems true it's just thicker therefore heavier so it may have a bit of runching if you down smooth out. Otherwise very true to size. I think this is a great budget friendly dress and is VERY flattering. Read more",
        "author": "Courtney Butterfield",
        "rating": 5.0,
        "date": "September 26, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71xbeos+XsL._SY88._SL1500_.jpg"
        ]
      }
    ]
  },
  "short_description": "Womens Maxi Dress Long Sleeve Bodycon is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.",
  "about_this_item": "Womens Maxi Dress Long Sleeve Bodycon is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.",
  "long_description": "Womens Maxi Dress Long Sleeve Bodycon is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Khaki, Pink, White, Blue, Yellow, Burgundy, Apricot, Black. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Long Sleeve Bodycon is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Khaki, Pink, White, Blue, Yellow, Burgundy, Apricot, Black. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "98cfc96b-7240-4557-b381-d0c646858653",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/98cfc96b-7240-4557-b381-d0c646858653/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/98cfc96b-7240-4557-b381-d0c646858653/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "55184087-ab04-4fad-a2a1-3d4b1211bb04",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/55184087-ab04-4fad-a2a1-3d4b1211bb04/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/55184087-ab04-4fad-a2a1-3d4b1211bb04/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "2858897a-374d-4f0b-9458-f8a540a8397e",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2858897a-374d-4f0b-9458-f8a540a8397e/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2858897a-374d-4f0b-9458-f8a540a8397e/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "bd2a233f-4b89-47e2-af3f-7a8edbee5a2c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bd2a233f-4b89-47e2-af3f-7a8edbee5a2c/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bd2a233f-4b89-47e2-af3f-7a8edbee5a2c/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "98c44019-65a5-4621-8231-f711eeffb048",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/98c44019-65a5-4621-8231-f711eeffb048/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/98c44019-65a5-4621-8231-f711eeffb048/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "4590fe5f-4ecd-4e4c-9246-9e723243b358",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4590fe5f-4ecd-4e4c-9246-9e723243b358/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4590fe5f-4ecd-4e4c-9246-9e723243b358/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "c34071f8-72c7-4aed-b380-cdfb8b735cee",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c34071f8-72c7-4aed-b380-cdfb8b735cee/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c34071f8-72c7-4aed-b380-cdfb8b735cee/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "04550673-075a-476f-a46e-d7c8576e83b7",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/04550673-075a-476f-a46e-d7c8576e83b7/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/04550673-075a-476f-a46e-d7c8576e83b7/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "5b756cdc-c46f-46bf-901a-8868a7fa9440",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5b756cdc-c46f-46bf-901a-8868a7fa9440/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5b756cdc-c46f-46bf-901a-8868a7fa9440/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "6d3f8d0a-05e6-46ec-b5bb-23eee3278bf0",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6d3f8d0a-05e6-46ec-b5bb-23eee3278bf0/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6d3f8d0a-05e6-46ec-b5bb-23eee3278bf0/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "295751cf-9962-44e4-aa7f-2a926458f924",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/295751cf-9962-44e4-aa7f-2a926458f924/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/295751cf-9962-44e4-aa7f-2a926458f924/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "f2542afa-11ff-42f0-a1b9-85a4fe30a7ca",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f2542afa-11ff-42f0-a1b9-85a4fe30a7ca/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f2542afa-11ff-42f0-a1b9-85a4fe30a7ca/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Khaki": "https://m.media-amazon.com/images/I/31+HhGF5PyL._AC_SR38,50_.jpg",
    "Pink": "https://m.media-amazon.com/images/I/31ocGRNfzQL._AC_SR38,50_.jpg",
    "White": "https://m.media-amazon.com/images/I/31zfjmD7nhL._AC_SR38,50_.jpg",
    "Blue": "https://m.media-amazon.com/images/I/414vLdsr+SL._AC_SR38,50_.jpg",
    "Yellow": "https://m.media-amazon.com/images/I/31ucsGeOokL._AC_SR38,50_.jpg",
    "Burgundy": "https://m.media-amazon.com/images/I/31BMSIpvv8L._AC_SR38,50_.jpg",
    "Apricot": "https://m.media-amazon.com/images/I/31UPAViCJmL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31C0ybRI-hL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Khaki": "611cTns+uvL",
    "Pink": "616Y4w70bdL",
    "White": "51wv+FaFuML",
    "Blue": "61F44DC9uUL",
    "Yellow": "619EejKM3LL",
    "Burgundy": "61gW9gxtF1L",
    "Apricot": "61ZwAHXD+nL",
    "Black": "51sinAPOQeL"
  },
  "color_images": {
    "Khaki": [
      "https://m.media-amazon.com/images/I/611cTns+uvL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71J+v6xpl5L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71UyYpKuPzL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71dv5v+TRkL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71nPH9nSQAL._SL1500_.jpg"
    ],
    "Pink": [
      "https://m.media-amazon.com/images/I/616Y4w70bdL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71y4yVzvjEL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71GeWIuoA9L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71SrtLxwlDL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71kPq6DKSSL._SL1500_.jpg"
    ],
    "White": [
      "https://m.media-amazon.com/images/I/51wv+FaFuML._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71dXPR-zGPL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71uLzFMg8rL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71j5w+cQHBL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/713oIR8u1zL._SL1500_.jpg"
    ],
    "Blue": [
      "https://m.media-amazon.com/images/I/61F44DC9uUL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/712MNkHDmDL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71w6zG6L6TL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71MOLlBEqqL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71ZruvKrzcL._SL1500_.jpg"
    ],
    "Yellow": [
      "https://m.media-amazon.com/images/I/619EejKM3LL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71CFFbqwq7L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71zVlZwp-eL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71it-ehMdWL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71nGdfrAJVL._SL1500_.jpg"
    ],
    "Burgundy": [
      "https://m.media-amazon.com/images/I/61gW9gxtF1L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71yYjWXhEKL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71zlrMYKaRL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71yzovrVYsL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71a8uQeqeNL._SL1500_.jpg"
    ],
    "Apricot": [
      "https://m.media-amazon.com/images/I/61ZwAHXD+nL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71tiHqtxiHL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71V+4D2CiML._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71MGU5cEpEL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/710ta8oWw4L._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/51sinAPOQeL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71LSqRA5z9L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71p670AEjwL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71BLBOotYFL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/713coLE-gSL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress-ruched-bodycon-sleeveless",
      "title": "Womens Dress Ruched Bodycon Sleeveless",
      "price": 29.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61GXSrzRjgL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 74.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51RX0pNwDVL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-v-neck-long-sleeve-ruched",
      "title": "Womens Maxi Dress V Neck Long Sleeve Ruched",
      "price": 35.9,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/61U3G0X5KOL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-off-shoulder-long-sleeve",
      "title": "Womens Maxi Dress Off Shoulder Long Sleeve",
      "price": 54.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71Ij3RfAevL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-mermaid-off-shoulder-evening-maxi-formal-bodycon",
      "title": "Womens Maxi Dress Mermaid Off Shoulder Evening Maxi Formal Bodycon",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71pUTmVdOjL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-one-shoulder-evening-formal",
      "title": "Womens Maxi Dress One Shoulder Evening Formal",
      "price": 74.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61c-8Xfw+kL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-short-sleeve",
      "title": "Womens Maxi Dress Maxi Short Sleeve",
      "price": 19.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51ww9izCuIL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-v-neck-evening",
      "title": "Womens Maxi Dress V Neck Evening",
      "price": 88.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51uJG32UaoL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-ruched-long-sleeve",
      "title": "Womens Maxi Dress Maxi Ruched Long Sleeve",
      "price": 44.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61X8e51a0bL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-long-sleeve",
      "title": "Womens Maxi Dress Bodycon Long Sleeve",
      "price": 35.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71sEzHZFs6L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-sleeveless-bodycon",
      "title": "Womens Dress Sleeveless Bodycon",
      "price": 29.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/71ZyZt+SGML._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-evening-mermaid-formal-one-shoulder",
      "title": "Womens Maxi Dress Maxi Evening Mermaid Formal One Shoulder",
      "price": 72.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51+4CGpYBtL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail",
      "title": "Womens Dress Cocktail",
      "price": 55.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71lQNHvgTIL._SL1500_.jpg"
      ]
    }
  ]
}