{
  "id": "womens-maxi-dress-long-sleeve-v-neck",
  "handle": "womens-maxi-dress-long-sleeve-v-neck",
  "sku": "JC2116",
  "asin": "B0FD39S9SC",
  "title": "Womens Maxi Dress Long Sleeve V Neck",
  "title_original": "OFEEFAN Fall Dresses for Women 2025 Loose V Neck Long Sleeve T Shirts Casual Sundresses Tie Front A-Line Dresses",
  "brand": "Visit the OFEEFAN Store",
  "price": 19.99,
  "social_proof": {
    "bought_past_month": 1033,
    "text": "1033+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/615H9NA1-KL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71S-rWBLP4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71BvdAX4n4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61spGjbhkpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61mW12RLpgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81ReTkikCDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71JGSnL396L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71c8fFwIVHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81xgTx8T3WL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/717-sMOpdML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/718ERGNkbhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71kII6flaNL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71waRgb3aNL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ZHvnrPPjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81ssHBTs2iL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71hdQtTjIkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81zBKksn0pL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71DqHN9rIQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81ikWq+5KiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91iS7mtEX3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71QAAsjbNrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71+KVFUg6gL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Q8N-1sO6L._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/615H9NA1-KL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71S-rWBLP4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71BvdAX4n4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61spGjbhkpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61mW12RLpgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81ReTkikCDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71JGSnL396L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71c8fFwIVHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81xgTx8T3WL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/717-sMOpdML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/718ERGNkbhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71kII6flaNL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71waRgb3aNL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ZHvnrPPjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81ssHBTs2iL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71hdQtTjIkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81zBKksn0pL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71DqHN9rIQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81ikWq+5KiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91iS7mtEX3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71QAAsjbNrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71+KVFUg6gL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Q8N-1sO6L._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ August 11, 2025",
    "ASIN ‏": "‎ B0FLXTCTHW",
    "Best Sellers Rank": "#8,928 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #97 in Women's Dresses",
    "Customer Reviews": "4.3 4.3 out of 5 stars (411)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Beige Plaid",
      "Brown",
      "Blue",
      "Blue Printing",
      "Apricot",
      "Black Dots",
      "Moss Green",
      "Black",
      "Coffee",
      "Grayish Purple",
      "Brown Stripes",
      "Red",
      "Yellow Grid",
      "Purple",
      "Leopard",
      "Black Printing",
      "Brownness",
      "Green",
      "Grey"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.3,
    "count": 411,
    "customers_say": "Customers find the dress comfortable, soft with pockets, and appreciate its versatility for running errands and dressing up for special occasions. Moreover, they like its style and quality, with one customer noting it's a great value for the price. However, the fit and size receive mixed feedback - while some find the length good, others say it's too short in length and waist, and while some find it runs true to size, others mention it runs a bit large. Generated from the text of customer reviews Select to learn more Style (48) Comfort (42) Soft material (29) Quality (27) Fabric quality (22) Versatility (21) Fit (73) Size (21) 48 customers mention style, 47 positive, 1 negative 48 customers mention \"Style\" 47 positive 1 negative Customers find the dress looks cute. \" Cute I will order another color. I ordered a large it's generous but I wouldn't say it runs large. Sleeves are long (kind of nice).... \" Read more \" ...I was extremely hesitant. Happy I decided to take a chance. Beautiful and received many compliments! \" Read more \" This dress is cute but I returned it. It's not flattering on my body type. For reference, I'm 5'0\" and 120 lb.... \" Read more \" Super cute . The color is as described and tts. I normally wear a size 4 for reference. The top was a tad big but not enough to return.... \" Read more 42 customers mention comfort, 41 positive, 1 negative 42 customers mention \"Comfort\" 41 positive 1 negative Customers find the dress comfortable, with one mentioning it is well-made and stylish. \" Comfortable . Good quality for the price. Material is figure flattering with medium thickness with a nice amount of stretch. It won't pill.... \" Read more \" This dress is so comfy -a nice weight and the perfect fit and length for me. I really like the brown color.... \" Read more \" Very comfortable a beautiful color and soft material . I ordered Small size and I am 135 lbs and 5-3” perfect size and great quality \" Read more \" super comfortable !! a great dress for everyday running around or casual work dress ❤️ \" Read more 29 customers mention soft material, 29 positive, 0 negative 29 customers mention \"Soft material\" 29 positive 0 negative Customers appreciate the dress's soft material, particularly noting that it has pockets. \" ...Otherwise, material is great. Thick and soft . Not a cheap looking dress at all. The picture looks lighter than it really is. \" Read more \" This Fall dress is so cute. The fabric is very comfortable and soft with pockets . The dress runs a bit large so I went with a size medium.... \" Read more \" Cute dress. The material is very soft . This dress would be flattering on an hourglass figure. I’m more rectangular shaped with a slight waistline.... \" Read more \" Very comfortable a beautiful color and soft material . I ordered Small size and I am 135 lbs and 5-3” perfect size and great quality \" Read more 27 customers mention quality, 26 positive, 1 negative 27 customers mention \"Quality\" 26 positive 1 negative Customers love the quality of the dress, with one mentioning it's perfect for workplace business casual wear. \" ...Maybe a medium would fit better. Not sure! Great dress \" Read more \" Good quality . Order your true size. I read it ran small so, I ordered what was recommended to me; 2xl, and it is way too large.... \" Read more \" Perfect fall dress . I love the fit and fabric is comfortable. I paired with a pair of tan boots \" Read more \" Love this dress ! Easy to throw on for any occasion! \" Read more 22 customers mention fabric quality, 16 positive, 6 negative 22 customers mention \"Fabric quality\" 16 positive 6 negative Customers like the fabric of the dress, describing it as nice, with one customer noting it feels great and another mentioning it offers good value for the price. \" ...It fits exactly as it should very flattering. Nice material . Will purchase more and other colors. \" Read more \" Runs True To Size! Nice, t-shirt material . Dress up or super casual. Rolls up great for packing. \" Read more \" I put this in the Salvation Army pile. It was cheap material and terribly made. \" Read more \" I liked the fabric , thick and warm for Fall/winter but the sleeves are way too long. They have to be rolled up to wear it \" Read more 21 customers mention versatility, 21 positive, 0 negative 21 customers mention \"Versatility\" 21 positive 0 negative Customers appreciate the dress's versatility, noting it can be dressed up for special occasions and dressed down for casual wear, with one customer mentioning it's great for everyday running around. \" ...I also love how versatile it is — it looks great with boots or sneakers, making it easy to dress up or down depending on the occasion.... \" Read more \" ...It is very comfortable. I like that it’s casual . I wear it around the house, I like wearing dresses. It’s very comfortable.... \" Read more \" ...The dress is versatile as it can be worn for casual or dressed up for certain occasions.... \" Read more \" ...Small fits perfect. Sleeves are long and fabric is nice. Can dress it up or down . \" Read more 73 customers mention fit, 45 positive, 28 negative 73 customers mention \"Fit\" 45 positive 28 negative Customers have mixed opinions about the dress's fit, with some finding it perfect while others report it being too short in length and waist, with sleeves being too long. \" ...I usually wear a medium but I bought a small and it fits perfectly ! The color is perfect for fall. I would buy again in more colors. \" Read more \" ...I have also purchased it in red. I really like it. The sleeves are long but I can fold them in or up until I can have them altered.... \" Read more \" Surprisingly good quality for the price and fits well . Actually, kind of slimming, too. Plan to buy in a another color. \" Read more \" This dress is so comfy-a nice weight and the perfect fit and length for me. I really like the brown color.... \" Read more 21 customers mention size, 12 positive, 9 negative 21 customers mention \"Size\" 12 positive 9 negative Customers have mixed opinions about the dress's size, with some finding it true to size and beautiful, while others report it being too short in length and waist, and making their torso look short. \" I bought the blue and the red one. True to size except for the sleeves, which are extremely too long on both.... \" Read more \" The dress is cute but it runs big . \" Read more \" Runs True To Size ! Nice, t-shirt material. Dress up or super casual. Rolls up great for packing. \" Read more \" Cute, but runs small . Returned without issues \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Very versatile, comfortable & pretty dress",
        "body": "Im going to give it 5 stars despite the fact the arm length is very long and the belt is plane and in an odd position it seems. The dress is versatile as it can be worn for casual or dressed up for certain occasions. It's definitely not a black-tie formal event dress but it can be worn to many occasions and looks very nice. The dress has two pockets that are a great size to where you dont have to worry about things falling out. It has a slight v-neck but not over exposed and a belt to distinguish your waste and show your shape. It fits nicely amd feels extremely comfortable. I'd recommend it. I have also purchased it in red. I really like it. The sleeves are long but I can fold them in or up until I can have them altered. The dress is great for the price im pleasantly surprised how much I like it. Read more",
        "author": "Rose1780",
        "rating": 5.0,
        "date": "December 21, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61UpmbdzASL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/61mjN+kpFOL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/61-fmy7VcfL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/61zQomSiF-L._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/6165kNQjtqL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars My go to dress. Grab in every color.",
        "body": "I absolutely love this casual dress! The material is so soft and comfortable, I can wear it all day without feeling restricted. It’s the perfect go-to dress for running errands, working, or just relaxing at home. I also love how versatile it is — it looks great with boots or sneakers, making it easy to dress up or down depending on the occasion. The fit is relaxed but still flattering, and it drapes nicely without being baggy. One small con is that it wrinkles a bit after washing, so I like to give it a quick steam or iron before wearing. Overall, this dress is comfortable, stylish, and practical, and I know I’ll be reaching for it a lot! Read more",
        "author": "Nadya",
        "rating": 5.0,
        "date": "December 23, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Love this and will buy in other colors",
        "body": "This is a perfect closet essential. Dress it up or down. Looks particularly nice with fashion boots- mine are knee high. The dress is soft and this fit was just as expected. Read more",
        "author": "Leslie Pieper",
        "rating": 4.0,
        "date": "December 2, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars I highly recommend this dress!",
        "body": "This Fall dress is so cute. The fabric is very comfortable and soft with pockets. The dress runs a bit large so I went with a size medium. The length, V neck and long sleeves are true to size. The quality is great and with colder weather (under 60 degrees) I wear leggings and boots underneath. You can wear the dress casually or dress in up. I love the dress so much I have purchased a few different colors. I highly recommend this dress! Size Medium 5 feet 7 inches 144 lbs Read more",
        "author": "Diane Lamb",
        "rating": 5.0,
        "date": "October 13, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Fits differently than the models",
        "body": "I like this dress. My issue is that the waist doesn’t sit in the same place as the models, so it sits differently my body. It is very comfortable. I like that it’s casual. I wear it around the house, I like wearing dresses. It’s very comfortable. The fabric is really soft and has some stretch to it. Read more",
        "author": "Karen l Shelton",
        "rating": 3.0,
        "date": "December 5, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Nice dress",
        "body": "Love the color, soft , length was actually good for me I am 5ft...sleeve was a little long but nothing crazy... Read more",
        "author": "Jaquelyn",
        "rating": 5.0,
        "date": "November 23, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Great material and beautiful",
        "body": "Very comfortable a beautiful color and soft material . I ordered Small size and I am 135 lbs and 5-3” perfect size and great quality Read more",
        "author": "Scotty",
        "rating": 5.0,
        "date": "October 22, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Cute dress",
        "body": "Washable casual ddress. Very cute! Expect compliments when you wear this dress. I am 5'3\" and ordered a medium. It is a great fit. Not too short for me. I wear it with boots. You could put tights on to help with warmth. The fabric looks like flannel, but it is lightweight. Read more",
        "author": "Joan",
        "rating": 4.0,
        "date": "December 16, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Long Sleeve V Neck is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.",
  "about_this_item": "Womens Maxi Dress Long Sleeve V Neck is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.",
  "long_description": "Womens Maxi Dress Long Sleeve V Neck is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Beige Plaid, Brown, Blue, Blue Printing, Apricot, Black Dots, Moss Green, Black, Coffee, Grayish Purple, Brown Stripes, Red, Yellow Grid, Purple. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Long Sleeve V Neck is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Beige Plaid, Brown, Blue, Blue Printing, Apricot, Black Dots, Moss Green, Black, Coffee, Grayish Purple, Brown Stripes, Red, Yellow Grid, Purple. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "76e78450-d073-4b59-89da-bd52e7ea212e",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/76e78450-d073-4b59-89da-bd52e7ea212e/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/76e78450-d073-4b59-89da-bd52e7ea212e/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "2e64a387-2cbd-41d9-8b9f-b7e1301282ce",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2e64a387-2cbd-41d9-8b9f-b7e1301282ce/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2e64a387-2cbd-41d9-8b9f-b7e1301282ce/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "edb85948-8b0f-48d4-9136-8c0a6baae1e8",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/edb85948-8b0f-48d4-9136-8c0a6baae1e8/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/edb85948-8b0f-48d4-9136-8c0a6baae1e8/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "9a0e7b75-b1d7-4e67-a497-865003a497e4",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9a0e7b75-b1d7-4e67-a497-865003a497e4/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9a0e7b75-b1d7-4e67-a497-865003a497e4/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "6258be46-4917-4d19-8d99-e0eec029f69c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6258be46-4917-4d19-8d99-e0eec029f69c/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6258be46-4917-4d19-8d99-e0eec029f69c/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "edffe2b6-dd48-4b96-a1dc-12ff0d2f725d",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/edffe2b6-dd48-4b96-a1dc-12ff0d2f725d/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/edffe2b6-dd48-4b96-a1dc-12ff0d2f725d/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "c75b5a1c-6256-4373-9c36-1c761a9ad511",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c75b5a1c-6256-4373-9c36-1c761a9ad511/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c75b5a1c-6256-4373-9c36-1c761a9ad511/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "9264bd3c-67fd-4f63-8dd7-4217364b912f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9264bd3c-67fd-4f63-8dd7-4217364b912f/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9264bd3c-67fd-4f63-8dd7-4217364b912f/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "8124e8a4-5860-4f8d-b3d5-952e65e85079",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8124e8a4-5860-4f8d-b3d5-952e65e85079/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8124e8a4-5860-4f8d-b3d5-952e65e85079/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "3a049168-34bb-4899-bf43-b660379b35bc",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3a049168-34bb-4899-bf43-b660379b35bc/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3a049168-34bb-4899-bf43-b660379b35bc/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "56ab8a1e-0ae5-4651-9a2f-eb68a902736f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/56ab8a1e-0ae5-4651-9a2f-eb68a902736f/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/56ab8a1e-0ae5-4651-9a2f-eb68a902736f/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "836c26c4-ffcb-4af9-98ed-ab8daaa82abe",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/836c26c4-ffcb-4af9-98ed-ab8daaa82abe/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/836c26c4-ffcb-4af9-98ed-ab8daaa82abe/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Beige Plaid": "https://m.media-amazon.com/images/I/41FAAH5DLsL._AC_SR38,50_.jpg",
    "Brown": "https://m.media-amazon.com/images/I/31zNjBLl-3L._AC_SR38,50_.jpg",
    "Blue": "https://m.media-amazon.com/images/I/41LOUqG525L._AC_SR38,50_.jpg",
    "Blue Printing": "https://m.media-amazon.com/images/I/41zpXixZH7L._AC_SR38,50_.jpg",
    "Apricot": "https://m.media-amazon.com/images/I/3144wXeXR3L._AC_SR38,50_.jpg",
    "Black Dots": "https://m.media-amazon.com/images/I/41SfkQsWSmL._AC_SR38,50_.jpg",
    "Moss Green": "https://m.media-amazon.com/images/I/31evNhJoKuL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/315vxlWNTCL._AC_SR38,50_.jpg",
    "Coffee": "https://m.media-amazon.com/images/I/31sMLkmpkLL._AC_SR38,50_.jpg",
    "Grayish Purple": "https://m.media-amazon.com/images/I/31Fk8tPq3XL._AC_SR38,50_.jpg",
    "Brown Stripes": "https://m.media-amazon.com/images/I/410Y8NddqlL._AC_SR38,50_.jpg",
    "Red": "https://m.media-amazon.com/images/I/31GvPAvNxgL._AC_SR38,50_.jpg",
    "Yellow Grid": "https://m.media-amazon.com/images/I/41ioJUzjUYL._AC_SR38,50_.jpg",
    "Purple": "https://m.media-amazon.com/images/I/31Lwpu+2gvL._AC_SR38,50_.jpg",
    "Leopard": "https://m.media-amazon.com/images/I/5175gYydpzL._AC_SR38,50_.jpg",
    "Black Printing": "https://m.media-amazon.com/images/I/51tx+o-Ws5L._AC_SR38,50_.jpg",
    "Brownness": "https://m.media-amazon.com/images/I/31uSl041XKL._AC_SR38,50_.jpg",
    "Green": "https://m.media-amazon.com/images/I/41xzUJSa9ZL._AC_SR38,50_.jpg",
    "Grey": "https://m.media-amazon.com/images/I/31yaok+NabL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Beige Plaid": "81ReTkikCDL",
    "Brown": "71JGSnL396L",
    "Blue": "71c8fFwIVHL",
    "Blue Printing": "81xgTx8T3WL",
    "Apricot": "717-sMOpdML",
    "Black Dots": "718ERGNkbhL",
    "Moss Green": "71kII6flaNL",
    "Black": "615H9NA1-KL",
    "Coffee": "71waRgb3aNL",
    "Grayish Purple": "71ZHvnrPPjL",
    "Brown Stripes": "81ssHBTs2iL",
    "Red": "71hdQtTjIkL",
    "Yellow Grid": "81zBKksn0pL",
    "Purple": "71DqHN9rIQL",
    "Leopard": "81ikWq+5KiL",
    "Black Printing": "91iS7mtEX3L",
    "Brownness": "71QAAsjbNrL",
    "Green": "71+KVFUg6gL",
    "Grey": "71Q8N-1sO6L"
  },
  "color_images": {
    "Beige Plaid": [
      "https://m.media-amazon.com/images/I/81ReTkikCDL._SL1500_.jpg"
    ],
    "Brown": [
      "https://m.media-amazon.com/images/I/71JGSnL396L._SL1500_.jpg"
    ],
    "Blue": [
      "https://m.media-amazon.com/images/I/71c8fFwIVHL._SL1500_.jpg"
    ],
    "Blue Printing": [
      "https://m.media-amazon.com/images/I/81xgTx8T3WL._SL1500_.jpg"
    ],
    "Apricot": [
      "https://m.media-amazon.com/images/I/717-sMOpdML._SL1500_.jpg"
    ],
    "Black Dots": [
      "https://m.media-amazon.com/images/I/718ERGNkbhL._SL1500_.jpg"
    ],
    "Moss Green": [
      "https://m.media-amazon.com/images/I/71kII6flaNL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/615H9NA1-KL._SL1500_.jpg"
    ],
    "Coffee": [
      "https://m.media-amazon.com/images/I/71waRgb3aNL._SL1500_.jpg"
    ],
    "Grayish Purple": [
      "https://m.media-amazon.com/images/I/71ZHvnrPPjL._SL1500_.jpg"
    ],
    "Brown Stripes": [
      "https://m.media-amazon.com/images/I/81ssHBTs2iL._SL1500_.jpg"
    ],
    "Red": [
      "https://m.media-amazon.com/images/I/71hdQtTjIkL._SL1500_.jpg"
    ],
    "Yellow Grid": [
      "https://m.media-amazon.com/images/I/81zBKksn0pL._SL1500_.jpg"
    ],
    "Purple": [
      "https://m.media-amazon.com/images/I/71DqHN9rIQL._SL1500_.jpg"
    ],
    "Leopard": [
      "https://m.media-amazon.com/images/I/81ikWq+5KiL._SL1500_.jpg"
    ],
    "Black Printing": [
      "https://m.media-amazon.com/images/I/91iS7mtEX3L._SL1500_.jpg"
    ],
    "Brownness": [
      "https://m.media-amazon.com/images/I/71QAAsjbNrL._SL1500_.jpg"
    ],
    "Green": [
      "https://m.media-amazon.com/images/I/71+KVFUg6gL._SL1500_.jpg"
    ],
    "Grey": [
      "https://m.media-amazon.com/images/I/71Q8N-1sO6L._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 41.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71gLnAI8qnL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-ruched-evening-high-split-split",
      "title": "Womens Maxi Dress Maxi Ruched Evening High Split Split",
      "price": 72.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71omaPs6UqL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-short-sleeve-evening",
      "title": "Womens Dress Short Sleeve Evening",
      "price": 89.88,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61vi9CZReDL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-formal-cocktail-evening",
      "title": "Womens Dress Formal Cocktail Evening",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71ctK4kwdWL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 45.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/712FTzeTFLL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-formal-mermaid-evening-ruched",
      "title": "Womens Maxi Dress Formal Mermaid Evening Ruched",
      "price": 74.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61qHc0kmHEL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 37.79,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51WFZKRzSdL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 43.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Work",
      "images": [
        "https://m.media-amazon.com/images/I/81JXmyg5QfL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-sleeveless-split-formal-cocktail-v-neck",
      "title": "Womens Maxi Dress Sleeveless Split Formal Cocktail V Neck",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/51jHZEGYXHL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-ruched",
      "title": "Womens Maxi Dress Long Sleeve Ruched",
      "price": 49.29,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61P6bkbQawL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-one-shoulder-maxi-long-sleeve",
      "title": "Womens Maxi Dress One Shoulder Maxi Long Sleeve",
      "price": 45.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61UljfUsK4L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-long-sleeve-evening-formal",
      "title": "Womens Maxi Dress Cocktail Long Sleeve Evening Formal",
      "price": 46.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/6190eiFreBL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-formal-long-sleeve-evening",
      "title": "Womens Maxi Dress Maxi Formal Long Sleeve Evening",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51enCkUtvSL._SL1500_.jpg"
      ]
    }
  ]
}