{
  "id": "womens-maxi-dress-long-sleeve",
  "handle": "womens-maxi-dress-long-sleeve",
  "sku": "JC1089",
  "asin": "B0FF8RF33G",
  "title": "Womens Maxi Dress Long Sleeve",
  "title_original": "ANRABESS Women Long Sleeve Midi Dress Crewneck 2026 Fall Fashion Casual Flowy A-Line Long Dresses Vacation Outfit with Pocket",
  "brand": "Visit the ANRABESS Store",
  "price": 37.99,
  "social_proof": {
    "bought_past_month": 1186,
    "text": "1186+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/81nNi8DkSbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/917ijWOAGXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81bhncGQeiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/814HHbcIdwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91h0eyevSNL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/A1UglNHNj4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/914xoAaxR3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91IkcVD3rjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91QN4ntNriL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71vkEOopFAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81KMnhaVCML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71RENPwX44L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71pZ3ySJ8tL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91s7ZhEJsmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/811iFpvTAFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81AIm9AA67L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/815qHH7gApL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/919wpi6lV0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/819o47q+MWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91LtwaSEXjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91HfjaXiwgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91oULXeSVbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71kqyseaSxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91uVnDu4u1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71M8tax2mOL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/81nNi8DkSbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/917ijWOAGXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81bhncGQeiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/814HHbcIdwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91h0eyevSNL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/A1UglNHNj4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/914xoAaxR3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91IkcVD3rjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91QN4ntNriL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71vkEOopFAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81KMnhaVCML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71RENPwX44L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71pZ3ySJ8tL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91s7ZhEJsmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/811iFpvTAFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81AIm9AA67L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/815qHH7gApL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/919wpi6lV0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/819o47q+MWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91LtwaSEXjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91HfjaXiwgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91oULXeSVbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71kqyseaSxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91uVnDu4u1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71M8tax2mOL._SL1500_.jpg"
  ],
  "aplus_images": [
    "https://m.media-amazon.com/images/I/51BF0TEJWJL._SL1500_.jpg"
  ],
  "description_images": [
    "https://m.media-amazon.com/images/I/51BF0TEJWJL._SL1500_.jpg"
  ],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ June 24, 2025",
    "ASIN ‏": "‎ B0FF9F2778",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#27,294 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #221 in Women's Casual Dresses",
    "Customer Reviews": "4.2 4.2 out of 5 stars (260)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Floral Pink",
      "Grey Khaki White Dot",
      "Floral Navy Blue White",
      "Green Blue Floral",
      "Army Green",
      "Floral Colorful",
      "Black",
      "Navy Blue",
      "Floral Blue Yellow",
      "Floral Black",
      "Blue Pink Flower",
      "Floral White",
      "Print Green White Floral",
      "Navy Blue Floral Hem",
      "Floral Green",
      "Floral Black Purple",
      "Floral Blue White",
      "Deep Purple",
      "Floral Green Purple",
      "Pink Round Dot"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.2,
    "count": 260,
    "customers_say": "Customers find the dress fits well, with one noting it's below the knee, and appreciate its soft, comfortable fabric. The dress is versatile, being suitable for any occasion and able to be dressed up or down. They like its classic style, color accuracy, and quality. Generated from the text of customer reviews Select to learn more Fit (65) Fabric quality (33) Comfort (32) Style (31) Quality (30) Color accuracy (18) Dress versatility (12) Soft fabric (12) 65 customers mention fit, 47 positive, 18 negative 65 customers mention \"Fit\" 47 positive 18 negative Customers are satisfied with how the dress fits, noting that the size L is comfortable and the length is appropriate, with one customer mentioning it's below the knee. \" ...I purchased a size medium ( I am 5”3”) and it was perfect! A great fit ! Even flattering! Very nice material. A great length. I definitely recommend. \" Read more \" It fits perfectly, true to size . I love the fabric. Very nice dress for the price. \" Read more \" ...I did not find the dress flattering. It runs a little small . If I were to order this again, I would definitely size up. \" Read more \" Love the dress, the fit and the pockets. Can be worn year round. Fit \" Read more 33 customers mention fabric quality, 24 positive, 9 negative 33 customers mention \"Fabric quality\" 24 positive 9 negative Customers appreciate the dress's fabric quality, describing it as soft and nice, with one customer noting it has a good weight. \" It fits perfectly, true to size. I love the fabric . Very nice dress for the price. \" Read more \" cute dress. Nice fabric . looks good on. \" Read more \" This dress did not fit well - too large and boxy, and the fabric felt cheap . Not worth the price. \" Read more \" I am 5’3 145 lbs bought a Medium fits perfectly. Soft fabric too.Very comfortable. Below the knee. \" Read more 32 customers mention comfort, 32 positive, 0 negative 32 customers mention \"Comfort\" 32 positive 0 negative Customers find the dress comfortable. \" It’s soft and flows well. It’s very comfortable and looks great! Material is nice quality. I love that it’s a classic style!... \" Read more \" ...It actually arrived early, and I wore it to church today. It's comfortable and dressy. \" Read more \" Soft, comfy , lightweight, true to size. \" Read more \" So easy to wash and wear. So pretty. So comfortable . I have received many compliments. True to size too! \" Read more 31 customers mention style, 30 positive, 1 negative 31 customers mention \"Style\" 30 positive 1 negative Customers find the dress very pretty and appreciate its classic style, with one customer specifically mentioning its attractive pattern and colors. \" Cute dress but I would not call it \"deep purple\". More of a wine/raisin color. I'm 5'6/140 and the medium fit perfectly. \" Read more \" It is lovely . The fabric is very nice and laundered beautifully. I’m pleased. \" Read more \" Beautiful dress …. Love the fabric; very soft and comfortable. Size (S) fit perfectly. I’m 5’4”, 124 lbs. you can’t go wrong with this dress! \" Read more \" Cute dress \" Read more 30 customers mention quality, 27 positive, 3 negative 30 customers mention \"Quality\" 27 positive 3 negative Customers find the dress to be of good quality, with one customer noting that both the top and sleeves are fine. \" Great dress ! Very comfortable and flattering. \" Read more \" I love the dress . I wore it to church yesterday and it was very comfortable. Definitely would buy again. \" Read more \" Lovely dress - perfect for daytime into evening. Doesn’t crease . Sizes are a little big - I had to drop down one size. \" Read more \" Perfect fit, feels soft and comfortable, it is very pretty and perfect . \" Read more 18 customers mention color accuracy, 14 positive, 4 negative 18 customers mention \"Color accuracy\" 14 positive 4 negative Customers like the color of the dress. \" Soft flowing material. Runs big so size down. Beautiful color \" Read more \" Love the color , style and print. nice solid fabric - way too long on me. i am 5'3\" and it almost touches the floor. I hated to return it. \" Read more \" I have not worn dress yet but like the color , fabric, and style. Like the fact can be worn as casual dress or dressed up. Love the pockets! \" Read more \" ...But, in reality it is cheap material and the color is faded looking , not at all like the picture.... \" Read more 12 customers mention dress versatility, 12 positive, 0 negative 12 customers mention \"Dress versatility\" 12 positive 0 negative Customers find the dress versatile, being perfect for any occasion and suitable for both casual wear and dressing up. One customer mentions it works well from daytime to evening, while another notes it's appropriate for both fall and spring seasons. \" Beautiful color. Nice fall dress . \" Read more \" Fits very well at xxl and the right length. Great church dress ! \" Read more \" ...Color is identical. Material is nice fits great perfect autumn dress . \" Read more \" Lovely dress - perfect for daytime into evening . Doesn’t crease . Sizes are a little big - I had to drop down one size. \" Read more 12 customers mention soft fabric, 12 positive, 0 negative 12 customers mention \"Soft fabric\" 12 positive 0 negative Customers appreciate the dress's soft fabric. \" It’s soft and flows well. It’s very comfortable and looks great! Material is nice quality. I love that it’s a classic style!... \" Read more \" Very soft , flattering and comfortable. I got many compliments. \" Read more \" Soft flowing material . Runs big so size down. Beautiful color \" Read more \" Perfect fit, feels soft and comfortable, it is very pretty and perfect. \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars A lovely dress, can be dressed up or down.",
        "body": "I don’t usually wear dresses, but this dress caught my eye and I liked the reviews. I purchased a size medium ( I am 5”3”) and it was perfect! A great fit! Even flattering! Very nice material. A great length. I definitely recommend. Read more",
        "author": "LNDNURSE",
        "rating": 5.0,
        "date": "December 23, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars BUY THIS GEM OF A DRESS!",
        "body": "This dress is very well made with a flattering fit.. The fabric is a nice quality weight. The colors are true to the photos. I will be wearing it Christmas day. I washed it in cold water and line dried. No ironing required. Read more",
        "author": "Tracey Young",
        "rating": 5.0,
        "date": "December 9, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Comfort in a dress",
        "body": "Very good quality and comfortable. Read more",
        "author": "Myra Heafner",
        "rating": 4.0,
        "date": "November 20, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars gorgeous dress",
        "body": "Love the color, style and print. nice solid fabric - way too long on me. i am 5'3\" and it almost touches the floor. I hated to return it. Read more",
        "author": "diamond girl",
        "rating": 5.0,
        "date": "December 6, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Quality of fabric.",
        "body": "I don’t think it is a very good quality fabric but it fits ok so I will see how it wears. It was very very wrinkled and I spent much time ironing it . Read more",
        "author": "Customer",
        "rating": 3.0,
        "date": "November 22, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars great buy!",
        "body": "So easy to wash and wear. So pretty. So comfortable. I have received many compliments. True to size too! Read more",
        "author": "Rosemarie Gilroy",
        "rating": 5.0,
        "date": "October 28, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Comfy",
        "body": "Soft, comfy, lightweight, true to size. Read more",
        "author": "Diane McIntyre",
        "rating": 5.0,
        "date": "November 26, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars good product",
        "body": "Not as thick as I would like it, but I will wear a slip I think it will be fine. I like the look very much, it fits me good! Read more",
        "author": "concetina_m",
        "rating": 4.0,
        "date": "October 16, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.",
  "about_this_item": "Womens Maxi Dress Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.",
  "long_description": "Womens Maxi Dress Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Floral Pink, Grey Khaki White Dot, Floral Navy Blue White, Green Blue Floral, Army Green, Floral Colorful, Black, Navy Blue, Floral Blue Yellow, Floral Black, Blue Pink Flower, Floral White, Print Green White Floral, Navy Blue Floral Hem. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/51BF0TEJWJL._SL1500_.jpg",
      "alt": "Womens Maxi Dress Long Sleeve details image 1"
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Floral Pink, Grey Khaki White Dot, Floral Navy Blue White, Green Blue Floral, Army Green, Floral Colorful, Black, Navy Blue, Floral Blue Yellow, Floral Black, Blue Pink Flower, Floral White, Print Green White Floral, Navy Blue Floral Hem. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "cd163ae2-5513-4a15-ad3a-f62fa822f984",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/cd163ae2-5513-4a15-ad3a-f62fa822f984/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/cd163ae2-5513-4a15-ad3a-f62fa822f984/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "9a89b162-8236-4418-8da8-82ffa378462b",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9a89b162-8236-4418-8da8-82ffa378462b/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9a89b162-8236-4418-8da8-82ffa378462b/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "a125fb12-813a-40c6-9cb5-6ca1c7dd8e44",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a125fb12-813a-40c6-9cb5-6ca1c7dd8e44/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a125fb12-813a-40c6-9cb5-6ca1c7dd8e44/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Floral Pink": "https://m.media-amazon.com/images/I/51jcW9WYLRL._AC_SR38,50_.jpg",
    "Grey Khaki White Dot": "https://m.media-amazon.com/images/I/41m6zq2asqL._AC_SR38,50_.jpg",
    "Floral Navy Blue White": "https://m.media-amazon.com/images/I/51Mfx5oIANL._AC_SR38,50_.jpg",
    "Green Blue Floral": "https://m.media-amazon.com/images/I/51VzuyWAFXL._AC_SR38,50_.jpg",
    "Army Green": "https://m.media-amazon.com/images/I/31up-WZ4s2L._AC_SR38,50_.jpg",
    "Floral Colorful": "https://m.media-amazon.com/images/I/415EwlGYNyL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31OAwdZDK0L._AC_SR38,50_.jpg",
    "Navy Blue": "https://m.media-amazon.com/images/I/31NibzbYI5L._AC_SR38,50_.jpg",
    "Floral Blue Yellow": "https://m.media-amazon.com/images/I/519bHZP60IL._AC_SR38,50_.jpg",
    "Floral Black": "https://m.media-amazon.com/images/I/51Y+doCglmL._AC_SR38,50_.jpg",
    "Blue Pink Flower": "https://m.media-amazon.com/images/I/41Ct4tbMytL._AC_SR38,50_.jpg",
    "Floral White": "https://m.media-amazon.com/images/I/41YhdwuEFlL._AC_SR38,50_.jpg",
    "Print Green White Floral": "https://m.media-amazon.com/images/I/51Pnu7deHmL._AC_SR38,50_.jpg",
    "Navy Blue Floral Hem": "https://m.media-amazon.com/images/I/41V95JTThtL._AC_SR38,50_.jpg",
    "Floral Green": "https://m.media-amazon.com/images/I/51X-SOlXU2L._AC_SR38,50_.jpg",
    "Floral Black Purple": "https://m.media-amazon.com/images/I/51OdZzi939L._AC_SR38,50_.jpg",
    "Floral Blue White": "https://m.media-amazon.com/images/I/516tJ+urrOL._AC_SR38,50_.jpg",
    "Deep Purple": "https://m.media-amazon.com/images/I/31AZ132h3aL._AC_SR38,50_.jpg",
    "Floral Green Purple": "https://m.media-amazon.com/images/I/51mYf7ve8FL._AC_SR38,50_.jpg",
    "Pink Round Dot": "https://m.media-amazon.com/images/I/41JojaqmrLL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Floral Pink": "914xoAaxR3L",
    "Grey Khaki White Dot": "81nNi8DkSbL",
    "Floral Navy Blue White": "91IkcVD3rjL",
    "Green Blue Floral": "91QN4ntNriL",
    "Army Green": "71vkEOopFAL",
    "Floral Colorful": "81KMnhaVCML",
    "Black": "71RENPwX44L",
    "Navy Blue": "71pZ3ySJ8tL",
    "Floral Blue Yellow": "91s7ZhEJsmL",
    "Floral Black": "811iFpvTAFL",
    "Blue Pink Flower": "81AIm9AA67L",
    "Floral White": "815qHH7gApL",
    "Print Green White Floral": "919wpi6lV0L",
    "Navy Blue Floral Hem": "819o47q+MWL",
    "Floral Green": "91LtwaSEXjL",
    "Floral Black Purple": "91HfjaXiwgL",
    "Floral Blue White": "91oULXeSVbL",
    "Deep Purple": "71kqyseaSxL",
    "Floral Green Purple": "91uVnDu4u1L",
    "Pink Round Dot": "71M8tax2mOL"
  },
  "color_images": {
    "Floral Pink": [
      "https://m.media-amazon.com/images/I/914xoAaxR3L._SL1500_.jpg"
    ],
    "Grey Khaki White Dot": [
      "https://m.media-amazon.com/images/I/81nNi8DkSbL._SL1500_.jpg"
    ],
    "Floral Navy Blue White": [
      "https://m.media-amazon.com/images/I/91IkcVD3rjL._SL1500_.jpg"
    ],
    "Green Blue Floral": [
      "https://m.media-amazon.com/images/I/91QN4ntNriL._SL1500_.jpg"
    ],
    "Army Green": [
      "https://m.media-amazon.com/images/I/71vkEOopFAL._SL1500_.jpg"
    ],
    "Floral Colorful": [
      "https://m.media-amazon.com/images/I/81KMnhaVCML._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/71RENPwX44L._SL1500_.jpg"
    ],
    "Navy Blue": [
      "https://m.media-amazon.com/images/I/71pZ3ySJ8tL._SL1500_.jpg"
    ],
    "Floral Blue Yellow": [
      "https://m.media-amazon.com/images/I/91s7ZhEJsmL._SL1500_.jpg"
    ],
    "Floral Black": [
      "https://m.media-amazon.com/images/I/811iFpvTAFL._SL1500_.jpg"
    ],
    "Blue Pink Flower": [
      "https://m.media-amazon.com/images/I/81AIm9AA67L._SL1500_.jpg"
    ],
    "Floral White": [
      "https://m.media-amazon.com/images/I/815qHH7gApL._SL1500_.jpg"
    ],
    "Print Green White Floral": [
      "https://m.media-amazon.com/images/I/919wpi6lV0L._SL1500_.jpg"
    ],
    "Navy Blue Floral Hem": [
      "https://m.media-amazon.com/images/I/819o47q+MWL._SL1500_.jpg"
    ],
    "Floral Green": [
      "https://m.media-amazon.com/images/I/91LtwaSEXjL._SL1500_.jpg"
    ],
    "Floral Black Purple": [
      "https://m.media-amazon.com/images/I/91HfjaXiwgL._SL1500_.jpg"
    ],
    "Floral Blue White": [
      "https://m.media-amazon.com/images/I/91oULXeSVbL._SL1500_.jpg"
    ],
    "Deep Purple": [
      "https://m.media-amazon.com/images/I/71kqyseaSxL._SL1500_.jpg"
    ],
    "Floral Green Purple": [
      "https://m.media-amazon.com/images/I/91uVnDu4u1L._SL1500_.jpg"
    ],
    "Pink Round Dot": [
      "https://m.media-amazon.com/images/I/71M8tax2mOL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress-cocktail-bodycon",
      "title": "Womens Dress Cocktail Bodycon",
      "price": 47.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61NfEwzl3xL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-one-shoulder-maxi-formal",
      "title": "Womens Maxi Dress Evening One Shoulder Maxi Formal",
      "price": 69.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/5150AIQL4eL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail",
      "title": "Womens Dress Cocktail",
      "price": 103.54,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61JApwce25L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-formal-bodycon-evening-sleeveless",
      "title": "Womens Maxi Dress Maxi Formal Bodycon Evening Sleeveless",
      "price": 61.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61s8qg6u1VL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 158.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71PmRANW40L._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress-bodycon-split-ruched-off-shoulder",
      "title": "Womens Dress Bodycon Split Ruched Off Shoulder",
      "price": 38.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/41JjYcPgcpL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 95.61,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Work",
      "images": [
        "https://m.media-amazon.com/images/I/71hVgSIB1jL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 138.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51PZNrlyY9L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-split-evening-formal",
      "title": "Womens Maxi Dress Split Evening Formal",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51BZ1BqPx8L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 65.97,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/81wr8PDg55L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-v-neck",
      "title": "Womens Dress V Neck",
      "price": 82.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/710bSTpZ9hL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 278.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/91YXeyW506L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening-long-sleeve",
      "title": "Womens Maxi Dress Formal Evening Long Sleeve",
      "price": 87.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61nnk+flvaL._SL1500_.jpg"
      ]
    }
  ]
}