{
  "id": "womens-maxi-dress-long-sleeve-bodycon",
  "handle": "womens-maxi-dress-long-sleeve-bodycon",
  "sku": "JC2124",
  "asin": "B0FGC4H7S6",
  "title": "Womens Maxi Dress Long Sleeve Bodycon",
  "title_original": "OFEEFAN Sweater Dresses for Women 2025 Fall Winter Puff Long Sleeve Crewneck Bodycon Fleece Ribbed Pullover Fashion Clothing",
  "brand": "Visit the OFEEFAN Store",
  "price": 24.99,
  "social_proof": {
    "bought_past_month": 324,
    "text": "324+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/71QMld59wPL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71w9pvf5K4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81uz+QqoJvL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81NpwE-mMFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/816qkOchggL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ySraph7lL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/713KRUar7sL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71G6wk+FUCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81itpJPdfPL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71fjHzNJJ0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71BWMNJpDdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71gy3K2u8ZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71E0Go89MtL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81k76LtSk0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81apLW6GppL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71dILERZUaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71j+wji-OmL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/71QMld59wPL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71w9pvf5K4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81uz+QqoJvL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81NpwE-mMFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/816qkOchggL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ySraph7lL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/713KRUar7sL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71G6wk+FUCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81itpJPdfPL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71fjHzNJJ0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71BWMNJpDdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71gy3K2u8ZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71E0Go89MtL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81k76LtSk0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81apLW6GppL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71dILERZUaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71j+wji-OmL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ July 2, 2025",
    "ASIN ‏": "‎ B0FGCDMNCR",
    "Best Sellers Rank": "#4,502 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #17 in Women's Casual Dresses",
    "Customer Reviews": "4.3 4.3 out of 5 stars (294)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Brown",
      "Blue",
      "Cream",
      "Khaki Plaid",
      "Apricot",
      "Black",
      "Red",
      "Pink",
      "White",
      "Red Plaid",
      "Black Plaid",
      "Caramel",
      "Green"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.3,
    "count": 294,
    "customers_say": "Customers love this dress for fall and winter wear, describing it as a form-fitting, comfortable, and super soft piece that fits true to size. The length receives mixed feedback - while some find it perfect with tights and boots, others say it's a bit shorter than expected. The material quality also gets mixed reviews, with some praising the fabric while others note it's not what they expected, describing it as polyester rather than sweater material. Generated from the text of customer reviews Select to learn more Quality (57) Fit (44) Comfort (33) Soft material (31) Size (12) Fall/winter dress (9) Material quality (20) Length (12) 57 customers mention quality, 51 positive, 6 negative 57 customers mention \"Quality\" 51 positive 6 negative Customers find the dress's quality amazing, noting that it looks exactly like the picture and has a simple style. \" ...Color/pattern is very bright and cute ! Size is true to your normal size! I'm 5'3 and weigh 125 pounds. A size XS fits perfectly!... \" Read more \" I returned because it just wasn’t my style but it was very cute and good quality \" Read more \" Super cute ! Nice material. Fits true to size. \" Read more \" Very cute she will love it... \" Read more 44 customers mention fit, 35 positive, 9 negative 44 customers mention \"Fit\" 35 positive 9 negative Customers like how the dress fits, describing it as amazing and form-fitting, with one customer noting it hits at the mid-thigh. \" Absolutely love this dress!! Fits perfect and the material is amazing!! Super soft and comfortable!... \" Read more \" ...The color is gorgeous and unique, the material is soft and the fit is perfect and comfortable.... \" Read more \" Love this dress. Fits great and is super soft!!! \" Read more \" Super soft comfy fabric, runs a little big , i could have done a size down. \" Read more 33 customers mention comfort, 32 positive, 1 negative 33 customers mention \"Comfort\" 32 positive 1 negative Customers find the dress comfortable. \" ...and unique, the material is soft and the fit is perfect and comfortable . I’m going to buy another in a different color, I love it so much! \" Read more \" I got these in practically every color. They’re soft, comfy and figure flattering. As one reviewer mentioned, they’re cut in an hourglass shape.... \" Read more \" It fit true-to-size and was very comfortable \" Read more \" Love this dress it was super comfy \" Read more 31 customers mention soft material, 30 positive, 1 negative 31 customers mention \"Soft material\" 30 positive 1 negative Customers find the dress's material super soft. \" I got these in practically every color. They’re soft , comfy and figure flattering. As one reviewer mentioned, they’re cut in an hourglass shape.... \" Read more \" ...Returned and will buy a medium. The material is soft and the style is very flattering on me, just need a size up with this color. \" Read more \" This dress is very soft and stretchy. Worked for me as a maternity dress. It’s also perfect for fall. \" Read more \" ...Fits perfect and the material is amazing!! Super soft and comfortable! I definitely will be ordering this in more colors. \" Read more 12 customers mention size, 9 positive, 3 negative 12 customers mention \"Size\" 9 positive 3 negative Customers find the dress runs true to size, with one mentioning it's suitable for plus sizes. \" True to size . I’m 5’8, 210 pounds and I ordered a Large it fit like a glove but is a little too short for the event I’m attending.... \" Read more \" ...Wore it for family pictures and it looked really great! Size was true ! \" Read more \" Beautiful dress! Runs slightly small . \" Read more \" True size , good quality. \" Read more 9 customers mention fall/winter dress, 9 positive, 0 negative 9 customers mention \"Fall/winter dress\" 9 positive 0 negative Customers love this dress for fall and winter occasions, finding it perfect for casual wear and family pictures. \" ...I love the style and how it fits. The fabric is so soft. It's perfect for fall pictures . \" Read more \" Great Dress casual but can have accessories to make for a look little bit dressy. \" Read more \" ...Worked for me as a maternity dress. It’s also perfect for fall . \" Read more \" ...slide up slightly when first standing up, but overall it was a win for a fall wedding & will probably be a repeat wear for the Christmas season. \" Read more 20 customers mention material quality, 12 positive, 8 negative 20 customers mention \"Material quality\" 12 positive 8 negative Customers have mixed opinions about the dress's material quality, with some loving it while others find it cheaply made. \" ...I am 5'3 and weigh 170 lb. I love the feel of the material . This will be one of my favorite fall and winter dresses! \" Read more \" Very cute dress. Luv the cut and color. It's very thin though. Not sweater material . \" Read more \" love it! if you have any sensory issues this is the perfect fabric , i’ve literally had people pet my arm and compliment how soft it feels.... \" Read more \" Inaccurate description looks like a long sweatshirt. Cheaply made fabric is not as shown. \" Read more 12 customers mention length, 5 positive, 7 negative 12 customers mention \"Length\" 5 positive 7 negative Customers have mixed opinions about the dress's length, with some finding it perfect for layering with tights and boots, while others note it runs a bit shorter than expected. \" ...pounds and I ordered a Large it fit like a glove but is a little too short for the event I’m attending.... \" Read more \" ...The material is soft and warm. It was very comfortable. The length was perfect on me . I am short and it's hard to find dresses that aren't too long.... \" Read more \" This dress is so buttery soft & flattering. It’s a bit short , I expected it to be right above my knees because I assumed the model was tall, but it... \" Read more \" ...It is also not very short ; just a couple of inches above the knee. I will be buying this in other colors! \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Super comfy and soft!",
        "body": "Most comfortable dress I have ever owned! Color/pattern is very bright and cute! Size is true to your normal size! I'm 5'3 and weigh 125 pounds. A size XS fits perfectly! Quality of material is great! Super stretchy and soft! Read more",
        "author": "Melissa Wilkinson",
        "rating": 5.0,
        "date": "November 19, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Soft, comfy, beautiful",
        "body": "I love this sweater dress! The color is gorgeous and unique, the material is soft and the fit is perfect and comfortable. I’m going to buy another in a different color, I love it so much! Read more",
        "author": "Jess P",
        "rating": 5.0,
        "date": "December 11, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars True to size!!!",
        "body": "True to size. I’m 5’8, 210 pounds and I ordered a Large it fit like a glove but is a little too short for the event I’m attending. I love it so much that I decided to keep this one and u just ordered another one in XL so hopefully it won’t be too big and it will be a little longer!!! It’s extremely cute and fitted. Good quality and looks like the picture!!! I’m usually not a fan of clothes from Amazon but definitely worth the money!!!! It does have stretch to it!!! UPDATE- I received the XL and it’s too big and not any longer haha it looks worse actually so I’ll be returning and just keeping the original L that I ordered. Read more",
        "author": "Josie",
        "rating": 5.0,
        "date": "December 11, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71e7oA3bUbL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71TQSUk5TvL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "4.0 out of 5 stars cute but not for me",
        "body": "baggy on me, thick material. cute but not for me Read more",
        "author": "Customer",
        "rating": 4.0,
        "date": "December 20, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars 10/10 recommend!!",
        "body": "love it! if you have any sensory issues this is the perfect fabric, i’ve literally had people pet my arm and compliment how soft it feels. it washes easily, the length is comfortable and lands about mid thigh on me (5’3” size S), though I like to layer a long skirt over it for a more comfortable option. looks exactly like the picture! obsessed with the sleeves/cuffs. i legit bought a second one so i can rotate which one i wear while the other goes through the laundry. Read more",
        "author": "Morgan Mickle",
        "rating": 5.0,
        "date": "December 5, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "1.0 out of 5 stars Save your money",
        "body": "I feel like I write nothing, but bad reviews now here. But they're honest. I used to buy ALL clothes from Amazon bc I hate clothes shopping. I don't have time or patience. But this whole year (2025) all I've gotten is crap. Cheap crap. The same crap u get from Shein or Temu just more expensive. I guess it's all the same bc u get free shipping with Amazon. Shein and Temu is cheaper clothes but u pay shipping. Either way it's all the same cheap silky shiny feeling clothes. This dress could have been cute, but they decided to make the sleeves at the wrist big & puffy Read more",
        "author": "Kshe Johnson",
        "rating": 1.0,
        "date": "November 24, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Perfect dress!",
        "body": "I absolutely LOVED this dress. I wished I would have had a black belt to go around me but I used a long necklace instead. I wore this for our family christmas pictures and I was not disappointed. It is sewn to fit close around the waist instead of just being a straight dress. The baggy sleeve bottoms add a nice touch for style. It came with some wrinkles but they quickly came out because of the stretchy material. The color was true to the image and it is definitely high quality. It is warm and versatile making this the perfect dress for any winter event. Read more",
        "author": "Savannah Marie Scott",
        "rating": 5.0,
        "date": "November 25, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61CZMJjGEJL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71RPP2G+ceL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Soft, comfortable, amazing fitting dress",
        "body": "I love this dress. I will buy it in more colors. The dress is form fitting but the high neck line and the loose sleeves make it appropriate to wear without looking like you are going to a club. The material is soft and warm. It was very comfortable. The length was perfect on me. I am short and it's hard to find dresses that aren't too long. This hit about mid thigh. I would highly recommend! Read more",
        "author": "Jia J",
        "rating": 5.0,
        "date": "December 16, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Long Sleeve Bodycon is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.",
  "about_this_item": "Womens Maxi Dress Long Sleeve Bodycon is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.",
  "long_description": "Womens Maxi Dress Long Sleeve Bodycon is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Brown, Blue, Cream, Khaki Plaid, Apricot, Black, Red, Pink, White, Red Plaid, Black Plaid, Caramel, Green. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Long Sleeve Bodycon is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Brown, Blue, Cream, Khaki Plaid, Apricot, Black, Red, Pink, White, Red Plaid, Black Plaid, Caramel, Green. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "f821b665-db25-4fe0-b560-91b1d61a36f3",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f821b665-db25-4fe0-b560-91b1d61a36f3/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f821b665-db25-4fe0-b560-91b1d61a36f3/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/15ccd658-c89a-405a-85ac-3bfe9567b593.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "5c4b2edd-e46a-4db0-9cda-e455016d2365",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5c4b2edd-e46a-4db0-9cda-e455016d2365/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5c4b2edd-e46a-4db0-9cda-e455016d2365/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/15ccd658-c89a-405a-85ac-3bfe9567b593.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "b34dc3ee-3db4-4e41-a38a-fc48da807761",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b34dc3ee-3db4-4e41-a38a-fc48da807761/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b34dc3ee-3db4-4e41-a38a-fc48da807761/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/15ccd658-c89a-405a-85ac-3bfe9567b593.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "cb38b084-6b99-4427-8069-deca83101484",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/cb38b084-6b99-4427-8069-deca83101484/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/cb38b084-6b99-4427-8069-deca83101484/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/15ccd658-c89a-405a-85ac-3bfe9567b593.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "b4d535da-7a67-4eb8-9b28-c41e3a8e0d06",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b4d535da-7a67-4eb8-9b28-c41e3a8e0d06/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b4d535da-7a67-4eb8-9b28-c41e3a8e0d06/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/15ccd658-c89a-405a-85ac-3bfe9567b593.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "e92ac9b9-ce4c-4429-8084-3884dfa5cbd6",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e92ac9b9-ce4c-4429-8084-3884dfa5cbd6/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e92ac9b9-ce4c-4429-8084-3884dfa5cbd6/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/15ccd658-c89a-405a-85ac-3bfe9567b593.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "1112ec5e-9dac-46cd-8293-14aed1ae65d8",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1112ec5e-9dac-46cd-8293-14aed1ae65d8/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1112ec5e-9dac-46cd-8293-14aed1ae65d8/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/15ccd658-c89a-405a-85ac-3bfe9567b593.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "c11ee788-9418-4900-84b5-24df7c9c7d5c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c11ee788-9418-4900-84b5-24df7c9c7d5c/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c11ee788-9418-4900-84b5-24df7c9c7d5c/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/15ccd658-c89a-405a-85ac-3bfe9567b593.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "3a70be19-742d-4f04-b0b9-f4f347ffed59",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3a70be19-742d-4f04-b0b9-f4f347ffed59/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3a70be19-742d-4f04-b0b9-f4f347ffed59/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/15ccd658-c89a-405a-85ac-3bfe9567b593.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "5c3e65af-87ef-4147-b7b6-e706eb99b172",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5c3e65af-87ef-4147-b7b6-e706eb99b172/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5c3e65af-87ef-4147-b7b6-e706eb99b172/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/15ccd658-c89a-405a-85ac-3bfe9567b593.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "e4a7269e-9dc4-432f-b721-5f04382666c6",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e4a7269e-9dc4-432f-b721-5f04382666c6/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e4a7269e-9dc4-432f-b721-5f04382666c6/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/15ccd658-c89a-405a-85ac-3bfe9567b593.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "b624967f-be71-4f13-9143-3221f9fccace",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b624967f-be71-4f13-9143-3221f9fccace/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b624967f-be71-4f13-9143-3221f9fccace/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/15ccd658-c89a-405a-85ac-3bfe9567b593.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Brown": "https://m.media-amazon.com/images/I/31fkTDkhFBL._AC_SR38,50_.jpg",
    "Blue": "https://m.media-amazon.com/images/I/31Z1Xx1pMNL._AC_SR38,50_.jpg",
    "Cream": "https://m.media-amazon.com/images/I/31ncSl--ksL._AC_SR38,50_.jpg",
    "Khaki Plaid": "https://m.media-amazon.com/images/I/4187CJTIKSL._AC_SR38,50_.jpg",
    "Apricot": "https://m.media-amazon.com/images/I/31T98FKVQgL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31ZJMzv3GUL._AC_SR38,50_.jpg",
    "Red": "https://m.media-amazon.com/images/I/310PoE85C0L._AC_SR38,50_.jpg",
    "Pink": "https://m.media-amazon.com/images/I/31BSYE-k-JL._AC_SR38,50_.jpg",
    "White": "https://m.media-amazon.com/images/I/31lBIoPnEJL._AC_SR38,50_.jpg",
    "Red Plaid": "https://m.media-amazon.com/images/I/413SR2BDV1L._AC_SR38,50_.jpg",
    "Black Plaid": "https://m.media-amazon.com/images/I/51BXZ-ZCiWL._AC_SR38,50_.jpg",
    "Caramel": "https://m.media-amazon.com/images/I/31OnC376chL._AC_SR38,50_.jpg",
    "Green": "https://m.media-amazon.com/images/I/31uBSWSu0CL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Brown": "71ySraph7lL",
    "Blue": "713KRUar7sL",
    "Cream": "71G6wk+FUCL",
    "Khaki Plaid": "81itpJPdfPL",
    "Apricot": "71fjHzNJJ0L",
    "Black": "71QMld59wPL",
    "Red": "71BWMNJpDdL",
    "Pink": "71gy3K2u8ZL",
    "White": "71E0Go89MtL",
    "Red Plaid": "81k76LtSk0L",
    "Black Plaid": "81apLW6GppL",
    "Caramel": "71dILERZUaL",
    "Green": "71j+wji-OmL"
  },
  "color_images": {
    "Brown": [
      "https://m.media-amazon.com/images/I/71ySraph7lL._SL1500_.jpg"
    ],
    "Blue": [
      "https://m.media-amazon.com/images/I/713KRUar7sL._SL1500_.jpg"
    ],
    "Cream": [
      "https://m.media-amazon.com/images/I/71G6wk+FUCL._SL1500_.jpg"
    ],
    "Khaki Plaid": [
      "https://m.media-amazon.com/images/I/81itpJPdfPL._SL1500_.jpg"
    ],
    "Apricot": [
      "https://m.media-amazon.com/images/I/71fjHzNJJ0L._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/71QMld59wPL._SL1500_.jpg"
    ],
    "Red": [
      "https://m.media-amazon.com/images/I/71BWMNJpDdL._SL1500_.jpg"
    ],
    "Pink": [
      "https://m.media-amazon.com/images/I/71gy3K2u8ZL._SL1500_.jpg"
    ],
    "White": [
      "https://m.media-amazon.com/images/I/71E0Go89MtL._SL1500_.jpg"
    ],
    "Red Plaid": [
      "https://m.media-amazon.com/images/I/81k76LtSk0L._SL1500_.jpg"
    ],
    "Black Plaid": [
      "https://m.media-amazon.com/images/I/81apLW6GppL._SL1500_.jpg"
    ],
    "Caramel": [
      "https://m.media-amazon.com/images/I/71dILERZUaL._SL1500_.jpg"
    ],
    "Green": [
      "https://m.media-amazon.com/images/I/71j+wji-OmL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress-ruched-bodycon-sleeveless",
      "title": "Womens Dress Ruched Bodycon Sleeveless",
      "price": 29.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61GXSrzRjgL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 74.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51RX0pNwDVL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-v-neck-long-sleeve-ruched",
      "title": "Womens Maxi Dress V Neck Long Sleeve Ruched",
      "price": 35.9,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/61U3G0X5KOL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-off-shoulder-long-sleeve",
      "title": "Womens Maxi Dress Off Shoulder Long Sleeve",
      "price": 54.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71Ij3RfAevL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-mermaid-off-shoulder-evening-maxi-formal-bodycon",
      "title": "Womens Maxi Dress Mermaid Off Shoulder Evening Maxi Formal Bodycon",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71pUTmVdOjL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-one-shoulder-evening-formal",
      "title": "Womens Maxi Dress One Shoulder Evening Formal",
      "price": 74.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61c-8Xfw+kL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-short-sleeve",
      "title": "Womens Maxi Dress Maxi Short Sleeve",
      "price": 19.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51ww9izCuIL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-v-neck-evening",
      "title": "Womens Maxi Dress V Neck Evening",
      "price": 88.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51uJG32UaoL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-ruched-long-sleeve",
      "title": "Womens Maxi Dress Maxi Ruched Long Sleeve",
      "price": 44.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61X8e51a0bL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-long-sleeve",
      "title": "Womens Maxi Dress Bodycon Long Sleeve",
      "price": 35.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71sEzHZFs6L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-sleeveless-bodycon",
      "title": "Womens Dress Sleeveless Bodycon",
      "price": 29.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/71ZyZt+SGML._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-evening-mermaid-formal-one-shoulder",
      "title": "Womens Maxi Dress Maxi Evening Mermaid Formal One Shoulder",
      "price": 72.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51+4CGpYBtL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail",
      "title": "Womens Dress Cocktail",
      "price": 55.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71lQNHvgTIL._SL1500_.jpg"
      ]
    }
  ]
}