{
  "id": "womens-maxi-dress-long-sleeve",
  "handle": "womens-maxi-dress-long-sleeve",
  "sku": "JC3247",
  "asin": "B0FGXRCZ5J",
  "title": "Womens Maxi Dress Long Sleeve",
  "title_original": "ZESICA Women's Long Sleeve Midi Sweater Dress 2026 Fall Crewneck Knit A Line Pleated Flowy Long Dresses with Belt",
  "brand": "Visit the ZESICA Store",
  "price": 54.98,
  "social_proof": {
    "bought_past_month": 400,
    "text": "400+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/71ES22A0NiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71CVb3uxafL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/711FGLWPYiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61XUr5qqnLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71zExR6IqpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71trMbrW0jL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81SvDkoZMFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71yF3-udq4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71xzoNkKGwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71qEBiR+ylL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71uMCM8veVL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71FrDPEXwnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71b-GzcQzwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71jZWHPBgSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61A44suTqYL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71upUTJtOUL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/71ES22A0NiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71CVb3uxafL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/711FGLWPYiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61XUr5qqnLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71zExR6IqpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71trMbrW0jL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81SvDkoZMFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71yF3-udq4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71xzoNkKGwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71qEBiR+ylL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71uMCM8veVL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71FrDPEXwnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71b-GzcQzwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71jZWHPBgSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61A44suTqYL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71upUTJtOUL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Product Dimensions ‏": "‎ 1.97 x 0.79 x 0.39 inches; 3.53 ounces",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ July 7, 2025",
    "ASIN ‏": "‎ B0FWQP6MF7",
    "Best Sellers Rank": "#10,181 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #57 in Women's Casual Dresses",
    "Customer Reviews": "4.6 4.6 out of 5 stars (125)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Khaki",
      "Pink",
      "Rust",
      "Eggplant",
      "Apricot",
      "Dark Blue",
      "Black",
      "Teal",
      "Coffee"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.6,
    "count": 125,
    "customers_say": "Customers find the sweater dress well-made, beautiful, and super soft, with one customer noting it's a mid-weight fabric suitable for three seasons. The dress fits well, with one mentioning it's a true tea length, and customers appreciate its color and comfort, with one noting it's not itchy. Customers disagree on the sizing, with some finding it runs a tad small. Select to learn more Fit Quality Style Comfort Fabric quality Material softness Color Size 28 customers mention \"Fit\" 24 positive 4 negative Customers like how the dress fits, with one mentioning it's the perfect length below the knee. \" Fits beautifully , very stylish, Love it!!\" Read more \"This dress seems to be well-made and fits well . Definitely worth the money.\" Read more \"...Knit fabric is beautiful!, I am 5’4” 125lbs, fits perfectly ! It is a great dress for casual or dressy depending how you accessorize!...\" Read more \"This dress fits great . Perfect length below the knee and is so soft to the touch. Great for fall wear.\" Read more 21 customers mention \"Quality\" 21 positive 0 negative Customers praise the dress's quality, describing it as well-made and a lovely belted sweater dress. \"wore for my engagement photos.. so cute and good quality !\" Read more \" Great dress ! Just the right thickness - not too thin, not too thick. Super soft and very comfortable....\" Read more \"This dress is wonderful ! Beautiful on and really well designed and made! I will purchase again in another color....\" Read more \"I absolutely Love the dress . It fit me exceptionally well\" Read more 20 customers mention \"Style\" 20 positive 0 negative Customers find the dress beautiful and well-designed. \"I wore this beautiful dress to church this morning. It is very warm and I lots of compliments on it....\" Read more \" Beautiful , comfortable winter knit dress....\" Read more \" Gorgeous and classy. I think it runs a tad small—right if the box is fairly tight on my upper body. I’m ca 126 lbs and normally wear a medium....\" Read more \" Absolutely beautiful dress , I felt so pretty and I got a ton of compliments. I bought it for a Pink out at my church for Breast Cancer Month.\" Read more 10 customers mention \"Comfort\" 10 positive 0 negative Customers find the dress comfortable, with one mentioning it's not itchy. \"...The rest of course is as you see, roomy and comfortable . The fabric is nice and heavy, heavier than I expected.\" Read more \"...Super soft and very comfortable . I am 5’6”, 122lbs, 34A. This was perfect for a holiday luncheon I attended. I got lot of compliments!\" Read more \"The fabric was very comfortable but the fit was not good. The illusion v-neck in the front is not flattering. The belt is also very tight.\" Read more \"...It fit great, and was super nice quality. Soft and not itchy either....\" Read more 9 customers mention \"Fabric quality\" 9 positive 0 negative Customers appreciate the fabric quality of the dress, describing it as beautiful knit. \"...The rest of course is as you see, roomy and comfortable. The fabric is nice and heavy, heavier than I expected.\" Read more \"...It is made very well, Made, the fabric is of great quality . They don’t have a larges size so I wasn’t able to size up....\" Read more \"Nice fit, good fabric and great value price.\" Read more \"Gorgeous. Material good quality . Very flattering\" Read more 7 customers mention \"Material softness\" 6 positive 1 negative Customers find the dress's material soft. \"...It fit great, and was super nice quality. Soft and not itchy either....\" Read more \"This dress fits great. Perfect length below the knee and is so soft to the touch . Great for fall wear.\" Read more \"...Super comfortable and warm. The material is soft and stretchy and the color is vibrant....\" Read more \"Great dress! Just the right thickness - not too thin, not too thick. Super soft and very comfortable....\" Read more 6 customers mention \"Color\" 6 positive 0 negative Customers love the dress's color, describing it as gorgeous and vibrant. \"Beautiful dress very nice material beautiful color that made me look too fat\" Read more \"Beautiful knit fabric and rich color that fits perfect. I am a regular full size 12 and the dress I ordered in size 12 fits perfect....\" Read more \"...The material is soft and stretchy and the color is vibrant ....\" Read more \"This is a lovely belted sweater dress with a pretty pink color , though not quite what I am looking for. Sadly returned.\" Read more 6 customers mention \"Size\" 3 positive 3 negative Customers have mixed opinions about the dress's size, with some finding it runs a tad small. \"This is very njce dress I love the color Size is perfect Can not wait to wear if Good for cold weather\" Read more \"Gorgeous and classy. I think it runs a tad small —right if the box is fairly tight on my upper body. I’m ca 126 lbs and normally wear a medium....\" Read more \"... Cut tru to size . Mid-weight fabric for three seasons.\" Read more \"...The smaller size will fit but the larger size will be smaller and not fit the way it is described. The dress should be made for just one size....\" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Love this dress!",
        "body": "This dress is very classy. It hangs very nicely, and the belt makes a very nice decoration. The length is a true tea length. I wore it with dark opaque stockings.But I feel like if you wanted to dress it up a little bit,you could always buy a patterned or a sheer hose. And if you wanted to wear it in warmer (fall, early spring) weather, rather than winter weather, you could certainly go without hosiery or if you have nice legs. ( Mine are winter white at the moment so I felt like hosiery was the better idea.) The dress has a modest neckline, but I feel like it's very flattering to the bust area in a very subtle way. I wore mine with heels, but I'm sure you could put on a cute pair of boots and it would look great too. Read more",
        "author": "Kathy M. Habberjam",
        "rating": 5.0,
        "date": "December 19, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Beautiful dress, get it!",
        "body": "The dress is beautiful, great quality. Fits great, is heavy and warm. Got so many compliments! Read more",
        "author": "Customer",
        "rating": 5.0,
        "date": "December 3, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Beautiful and very comfortable",
        "body": "I wore this beautiful dress to church this morning. It is very warm and I lots of compliments on it. Fits as expected and it has a lot of stretch, which I love.. Read more",
        "author": "Marsha",
        "rating": 5.0,
        "date": "December 7, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Beautiful, comfortable winter knit dress.",
        "body": "Great dress! Just the right thickness - not too thin, not too thick. Super soft and very comfortable. I am 5’6”, 122lbs, 34A. This was perfect for a holiday luncheon I attended. I got lot of compliments! Read more",
        "author": "S. Timmons",
        "rating": 5.0,
        "date": "December 18, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61zszXpyIXL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "4.0 out of 5 stars Needs to be made a one size dress",
        "body": "I am putting a 4 because it is supposed to be for 2 sizes. The smaller size will fit but the larger size will be smaller and not fit the way it is described. The dress should be made for just one size. If you are a size 14 size up. To have it flowing. I really love this dress. It is made very well, Made, the fabric is of great quality. They don’t have a larges size so I wasn’t able to size up. I am going to keep the dress . I really like many of there dresses but they are all 2 sizes together so will have to pass on their other dresses. Read more",
        "author": "Kindle Customer",
        "rating": 4.0,
        "date": "November 3, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Great dress",
        "body": "Really nice dress. The quality is way better than I expected. This is fitted on top with a smooth flowy mid length skirt (I’m 5’3”). It looks like a dress that would be a few hundred dollars if it had a designer label. The belt is not my favorite (my opinion only, it’s fine) but that’s easily changed out. Cut tru to size. Mid-weight fabric for three seasons. Read more",
        "author": "Amazon Addict",
        "rating": 5.0,
        "date": "December 22, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Beautiful dress in high quality material!",
        "body": "Beautiful knit fabric and rich color that fits perfect. I am a regular full size 12 and the dress I ordered in size 12 fits perfect. The knit belt is lovely with dress also. Read more",
        "author": "JTP",
        "rating": 5.0,
        "date": "November 17, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Love it!",
        "body": "I was very happy with everything about this dress! It fit great, and was super nice quality. Soft and not itchy either. I normally don't chance to buy online, but am thrilled I took the chanc e. Lots of compliments also.! Read more",
        "author": "Sharon C",
        "rating": 5.0,
        "date": "November 28, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.",
  "about_this_item": "Womens Maxi Dress Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.",
  "long_description": "Womens Maxi Dress Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Khaki, Pink, Rust, Eggplant, Apricot, Dark Blue, Black, Teal, Coffee. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Khaki, Pink, Rust, Eggplant, Apricot, Dark Blue, Black, Teal, Coffee. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "72a95887-4c90-49e2-83c9-c5d758ae19ba",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/72a95887-4c90-49e2-83c9-c5d758ae19ba/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/72a95887-4c90-49e2-83c9-c5d758ae19ba/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/79eec8f6-c1e0-4b0c-8a92-0b58faaab762.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "96de3ab9-c673-4ab5-96ea-8bc478d95cf4",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/96de3ab9-c673-4ab5-96ea-8bc478d95cf4/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/96de3ab9-c673-4ab5-96ea-8bc478d95cf4/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/79eec8f6-c1e0-4b0c-8a92-0b58faaab762.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "123c1fb4-4e36-416e-8b5c-5f84690f7698",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/123c1fb4-4e36-416e-8b5c-5f84690f7698/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/123c1fb4-4e36-416e-8b5c-5f84690f7698/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/79eec8f6-c1e0-4b0c-8a92-0b58faaab762.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "42ffc201-b0cd-43ae-aab6-0de3f82ced3a",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/42ffc201-b0cd-43ae-aab6-0de3f82ced3a/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/42ffc201-b0cd-43ae-aab6-0de3f82ced3a/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/79eec8f6-c1e0-4b0c-8a92-0b58faaab762.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "d397f6fd-5909-4e21-817c-c86e77123ae0",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d397f6fd-5909-4e21-817c-c86e77123ae0/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d397f6fd-5909-4e21-817c-c86e77123ae0/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/79eec8f6-c1e0-4b0c-8a92-0b58faaab762.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "1f5e61de-3919-414b-b462-d2ae703a749a",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1f5e61de-3919-414b-b462-d2ae703a749a/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1f5e61de-3919-414b-b462-d2ae703a749a/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/79eec8f6-c1e0-4b0c-8a92-0b58faaab762.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "0419e91a-a915-4768-b028-e5162714e1ca",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0419e91a-a915-4768-b028-e5162714e1ca/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0419e91a-a915-4768-b028-e5162714e1ca/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/79eec8f6-c1e0-4b0c-8a92-0b58faaab762.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "5631fe3f-2e5d-4217-9015-da630d9d5953",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5631fe3f-2e5d-4217-9015-da630d9d5953/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5631fe3f-2e5d-4217-9015-da630d9d5953/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/79eec8f6-c1e0-4b0c-8a92-0b58faaab762.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "2100c8ac-88a5-4667-a143-1d19bdc7680a",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2100c8ac-88a5-4667-a143-1d19bdc7680a/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2100c8ac-88a5-4667-a143-1d19bdc7680a/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/79eec8f6-c1e0-4b0c-8a92-0b58faaab762.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "9c7b3072-4cda-467e-83b0-9459f7d49584",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9c7b3072-4cda-467e-83b0-9459f7d49584/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9c7b3072-4cda-467e-83b0-9459f7d49584/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/79eec8f6-c1e0-4b0c-8a92-0b58faaab762.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "c4f47281-f53f-4e6f-bd51-5dcaeea41d31",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c4f47281-f53f-4e6f-bd51-5dcaeea41d31/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c4f47281-f53f-4e6f-bd51-5dcaeea41d31/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/79eec8f6-c1e0-4b0c-8a92-0b58faaab762.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "e2693bf8-8ca2-4aed-b82e-e8ed5e0fd28d",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e2693bf8-8ca2-4aed-b82e-e8ed5e0fd28d/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e2693bf8-8ca2-4aed-b82e-e8ed5e0fd28d/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/79eec8f6-c1e0-4b0c-8a92-0b58faaab762.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Khaki": "https://m.media-amazon.com/images/I/31AABLKlIWL._AC_SR38,50_.jpg",
    "Pink": "https://m.media-amazon.com/images/I/31bt2tEbhxL._AC_SR38,50_.jpg",
    "Rust": "https://m.media-amazon.com/images/I/3154CCiL9cL._AC_SR38,50_.jpg",
    "Eggplant": "https://m.media-amazon.com/images/I/31jE0yB2E-L._AC_SR38,50_.jpg",
    "Apricot": "https://m.media-amazon.com/images/I/31w342RS06L._AC_SR38,50_.jpg",
    "Dark Blue": "https://m.media-amazon.com/images/I/31PzgGSzZnL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31g9dR3i9OL._AC_SR38,50_.jpg",
    "Teal": "https://m.media-amazon.com/images/I/31uXo9pNpcL._AC_SR38,50_.jpg",
    "Coffee": "https://m.media-amazon.com/images/I/31txUVNCWTL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Khaki": "71xzoNkKGwL",
    "Pink": "71qEBiR+ylL",
    "Rust": "71uMCM8veVL",
    "Eggplant": "71FrDPEXwnL",
    "Apricot": "71b-GzcQzwL",
    "Dark Blue": "71jZWHPBgSL",
    "Black": "61A44suTqYL",
    "Teal": "71ES22A0NiL",
    "Coffee": "71upUTJtOUL"
  },
  "color_images": {
    "Khaki": [
      "https://m.media-amazon.com/images/I/71xzoNkKGwL._SL1500_.jpg"
    ],
    "Pink": [
      "https://m.media-amazon.com/images/I/71qEBiR+ylL._SL1500_.jpg"
    ],
    "Rust": [
      "https://m.media-amazon.com/images/I/71uMCM8veVL._SL1500_.jpg"
    ],
    "Eggplant": [
      "https://m.media-amazon.com/images/I/71FrDPEXwnL._SL1500_.jpg"
    ],
    "Apricot": [
      "https://m.media-amazon.com/images/I/71b-GzcQzwL._SL1500_.jpg"
    ],
    "Dark Blue": [
      "https://m.media-amazon.com/images/I/71jZWHPBgSL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/61A44suTqYL._SL1500_.jpg"
    ],
    "Teal": [
      "https://m.media-amazon.com/images/I/71ES22A0NiL._SL1500_.jpg"
    ],
    "Coffee": [
      "https://m.media-amazon.com/images/I/71upUTJtOUL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress-cocktail-bodycon",
      "title": "Womens Dress Cocktail Bodycon",
      "price": 47.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61NfEwzl3xL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-one-shoulder-maxi-formal",
      "title": "Womens Maxi Dress Evening One Shoulder Maxi Formal",
      "price": 69.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/5150AIQL4eL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail",
      "title": "Womens Dress Cocktail",
      "price": 103.54,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61JApwce25L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-formal-bodycon-evening-sleeveless",
      "title": "Womens Maxi Dress Maxi Formal Bodycon Evening Sleeveless",
      "price": 61.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61s8qg6u1VL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 158.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71PmRANW40L._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress-bodycon-split-ruched-off-shoulder",
      "title": "Womens Dress Bodycon Split Ruched Off Shoulder",
      "price": 38.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/41JjYcPgcpL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 95.61,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Work",
      "images": [
        "https://m.media-amazon.com/images/I/71hVgSIB1jL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 138.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51PZNrlyY9L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-split-evening-formal",
      "title": "Womens Maxi Dress Split Evening Formal",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51BZ1BqPx8L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 65.97,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/81wr8PDg55L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-v-neck",
      "title": "Womens Dress V Neck",
      "price": 82.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/710bSTpZ9hL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 278.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/91YXeyW506L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening-long-sleeve",
      "title": "Womens Maxi Dress Formal Evening Long Sleeve",
      "price": 87.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61nnk+flvaL._SL1500_.jpg"
      ]
    }
  ]
}