{
  "id": "womens-maxi-dress-long-sleeve",
  "handle": "womens-maxi-dress-long-sleeve",
  "sku": "JC3245",
  "asin": "B0FHJRBFNY",
  "title": "Womens Maxi Dress Long Sleeve",
  "title_original": "ZESICA Women's Long Sleeve Midi Dresses 2026 Fall Elegant Crewneck Swing A Line Wedding Guest Party Dress with Pockets",
  "brand": "Visit the ZESICA Store",
  "price": 59.99,
  "social_proof": {
    "bought_past_month": 1655,
    "text": "1655+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/51lIams4plL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/510vfhhiotL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51fTJPScWUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51qUOM0xOgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51OwVQ1TkcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/6175oosHXqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81mmGMiK6KL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51CLrh5MZ5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/512aFp8m3JL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51tyX3u3O8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/515p2WTO57L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51c44dQXSBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51Z9a76-beL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51Q7zvimohL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51Mtd2x8IlL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/51lIams4plL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/510vfhhiotL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51fTJPScWUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51qUOM0xOgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51OwVQ1TkcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/6175oosHXqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81mmGMiK6KL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51CLrh5MZ5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/512aFp8m3JL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51tyX3u3O8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/515p2WTO57L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51c44dQXSBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51Z9a76-beL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51Q7zvimohL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51Mtd2x8IlL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Product Dimensions ‏": "‎ 1.97 x 0.79 x 0.39 inches",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ July 15, 2025",
    "ASIN ‏": "‎ B0FHKR29SH",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#28,177 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #91 in Women's Cocktail Dresses",
    "Customer Reviews": "4.2 4.2 out of 5 stars (127)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Wine",
      "Brown",
      "Navy",
      "Pink",
      "White",
      "Blue",
      "Apricot",
      "Black",
      "Green"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.2,
    "count": 127,
    "customers_say": "Customers find the dress fits perfectly, with one noting it hits mid-calf, and appreciate its beautiful style, particularly the navy color. The dress is well-made with pockets, has a nice heavy fabric that's thick enough for fall, and is comfortable to wear. They like its appropriate sizing and consider it good value for money. Select to learn more Fit Style Quality Fabric weight Comfort Material thickness Value for money Size 30 customers mention \"Fit\" 21 positive 9 negative Customers are satisfied with how the dress fits, noting that the length is perfect, with one customer mentioning it hits at the mid-calf. \"The dress fits true to size . I’m a comfortable medium and the medium fit beautifully....\" Read more \" Dress fit nice but came very wrinkled with a few spots on it. Put it in the cleaners and it was okay....\" Read more \"The dress is very long , I'm 5'1\" & this obviously was a return because it was rolled up in the bag & wrinkled....\" Read more \"...This is definitely a form-fitting dress . I purchased a small and wear a size 4.\" Read more 25 customers mention \"Style\" 24 positive 1 negative Customers find the dress beautiful, particularly appreciating its navy color, and one customer describes it as feminine. \" Beautiful dress . Skirt portion has perfect pleats to give it body. Many compliments. I would give 5 stars but it's difficult to get off....\" Read more \" Very pretty , but not long enough for me. I will have to return.\" Read more \"I love my dress , it’s cute and comfortable\" Read more \"You would look like a dream in this dress, It is elegant , well made,...\" Read more 18 customers mention \"Quality\" 16 positive 2 negative Customers find the dress well made, with one customer specifically noting its beautiful design with pockets. \" Great dress .Fit well was comfortable and good quality fabric... traveled well.\" Read more \"Nice heavy fabric. Well made . Size appropriate. Looked great on. Loved the pockets.\" Read more \"I love my dress , it’s cute and comfortable\" Read more \" Dress is well made . The Size is accurate.\" Read more 13 customers mention \"Fabric weight\" 12 positive 1 negative Customers like the fabric of the dress, describing it as nice and heavy, making it suitable for fall wear. \"...The fabric is nice but it does cling so the waist line made a roll between my lower bra line and the dress waist.\" Read more \" Nice heavy fabric . Well made. Size appropriate. Looked great on. Loved the pockets.\" Read more \"Love the Navy color. The fabric is so nice . Not too thick and definitely not thin. I am 5’4” and 132 lbs. somewhat busty. I purchased a Medium....\" Read more \"...Yes, the material is heavy but the way it looks and feels— there’s no richness to it....\" Read more 7 customers mention \"Comfort\" 6 positive 1 negative Customers find the dress comfortable. \"...It is comfortable and now I’m thinking I may get it in a different color because it’s fits so well!!!...\" Read more \"Such a fun and very comfortable dress ! It’s true to size, light weight yet heavy enough for fall....\" Read more \"Great dress.Fit well was comfortable and good quality fabric... traveled well.\" Read more \"I love my dress , it’s cute and comfortable \" Read more 7 customers mention \"Material thickness\" 6 positive 1 negative Customers appreciate the dress's material thickness, noting that it is thick enough to keep them warm. \"Fit is perfect and stretchy for the curves. Material is thick . Great price!\" Read more \"I loved it! the fit was great and the fabric is not thin but nice heavy fabric.\" Read more \"Love the Navy color. The fabric is so nice. Not too thick and definitely not thin. I am 5’4” and 132 lbs. somewhat busty. I purchased a Medium....\" Read more \"...high quality 2) thick 3) durable yet somehow 4) so dainty and feminine....\" Read more 7 customers mention \"Value for money\" 6 positive 1 negative Customers find the dress offers good value for money. \"Fit is perfect and stretchy for the curves. Material is thick. Great price !\" Read more \"It’s worth the price really comfortable love it...\" Read more \"Absolutely love this dress. So flattering. Great quality and the price is right . Easily beautified with colorful jewelry. Highly recommend\" Read more \"...The pricing was very reasonable .\" Read more 5 customers mention \"Size\" 5 positive 0 negative Customers find that the dress fits appropriately. \"Such a fun and very comfortable dress! It’s true to size , light weight yet heavy enough for fall....\" Read more \"Dress is well made . The Size is accurate .\" Read more \"Nice heavy fabric. Well made. Size appropriate . Looked great on. Loved the pockets.\" Read more \"Dress is lovely. The size is as it says . You'll love it!!!\" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars An awesome dress!",
        "body": "This is a beautiful dress. The only complaint I have is that due to the packaging, there were so many wrinkles that remained for weeks. I had to actually iron it prior to wearing. Other than that complaint, the fit was perfect. I am 130lbs and 5’2”, so I ordered a medium (8-10), and it could not have fit better. I wore this to my grandson’s wedding and received many compliments. I would definitely recommend this dress for dressy events, as well as for a night out. The pricing was very reasonable. Read more",
        "author": "Graneez",
        "rating": 5.0,
        "date": "December 3, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Great dress option!",
        "body": "Such a fun and very comfortable dress! It’s true to size, light weight yet heavy enough for fall. So so soft and great style and dress ability where you can dress it up or down. Read more",
        "author": "Addi Huss",
        "rating": 5.0,
        "date": "November 29, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71J+x-GJ9ML._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Zesica long sleeve midi dress",
        "body": "Dress as shown. Great fit just a little long due to my height of only 5’3. Material is slightly thick. Great for any season. I’m 5’3 current weight 159 lbs. got this in a Large. Got a lot of compliments. Read more",
        "author": "Gorgeous1",
        "rating": 5.0,
        "date": "December 17, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Material not as lovely in person",
        "body": "The dress fits true to size. I’m a comfortable medium and the medium fit beautifully. The color was exactly as pictured and it had a beautiful cut to it, i.e. it looks as pretty as the picture shows it. However, the quality of the material is not great in person. Yes, the material is heavy but the way it looks and feels— there’s no richness to it. I tend to be very picky with materials - so it may not bother you, but I couldn’t look past that and I returned it. Read more",
        "author": "MamaLama",
        "rating": 3.0,
        "date": "October 16, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "2.0 out of 5 stars not what i was expecting",
        "body": "this dress is short barely cover the knee, could be better quality Read more",
        "author": "Diane",
        "rating": 2.0,
        "date": "December 16, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars SO cute for a black tie moment",
        "body": "I had low expectations after ordering 10 dresses on amazon days before an expensive black tie wedding and was THRILLED to find this dress was 1) high quality 2) thick 3) durable yet somehow 4) so dainty and feminine. It hasn't wrinkled, stained, no odor and the color is effortlessly black. Gorgeous dress and would highly recommend to anyone nervous about what to wear for a big event. Read more",
        "author": "Laura Elizabeth",
        "rating": 5.0,
        "date": "December 19, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Good Nice Dress",
        "body": "The length is great. It's a little loose up top but nothing to be alamed about. The material is nice and heavy. Overall a good buy. Read more",
        "author": "Joaquin S.",
        "rating": 4.0,
        "date": "December 5, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Stunning!",
        "body": "My daughter needed a modest dress to wear to to a chassadic jew-ish winter wedding. The dress fit her as if it were tailored made just for her. The length was perfect for the venue. The fabric was thick enough to keep her warm - as the tradition is to have the Chuppah ceremony outdoors (no matter the weather). She found a stylish dressy belt that she wore with this paired with a pair of pumps. She looked absolutely stunning. The dress looked more expensive than its actual price. Read more",
        "author": "K.M.B.",
        "rating": 5.0,
        "date": "December 6, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.",
  "about_this_item": "Womens Maxi Dress Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.",
  "long_description": "Womens Maxi Dress Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Wine, Brown, Navy, Pink, White, Blue, Apricot, Black, Green. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Wine, Brown, Navy, Pink, White, Blue, Apricot, Black, Green. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "1300ddfc-496f-4b00-9fd8-f45ee6847e59",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1300ddfc-496f-4b00-9fd8-f45ee6847e59/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1300ddfc-496f-4b00-9fd8-f45ee6847e59/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "21de8c05-089a-4c5f-9901-3b99dbd28236",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/21de8c05-089a-4c5f-9901-3b99dbd28236/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/21de8c05-089a-4c5f-9901-3b99dbd28236/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "41886fe6-69bc-40af-aba3-336a9fbe1ede",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/41886fe6-69bc-40af-aba3-336a9fbe1ede/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/41886fe6-69bc-40af-aba3-336a9fbe1ede/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "86dae4ae-4a5a-4eb0-b33f-7f8de43ef776",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/86dae4ae-4a5a-4eb0-b33f-7f8de43ef776/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/86dae4ae-4a5a-4eb0-b33f-7f8de43ef776/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "99c6e585-85e3-4498-ab4e-20f5d7d5c7cc",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/99c6e585-85e3-4498-ab4e-20f5d7d5c7cc/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/99c6e585-85e3-4498-ab4e-20f5d7d5c7cc/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "123c1fb4-4e36-416e-8b5c-5f84690f7698",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/123c1fb4-4e36-416e-8b5c-5f84690f7698/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/123c1fb4-4e36-416e-8b5c-5f84690f7698/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "58d605c5-9049-4e15-8298-a33dbcad36b2",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/58d605c5-9049-4e15-8298-a33dbcad36b2/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/58d605c5-9049-4e15-8298-a33dbcad36b2/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "5da41009-ef7d-44ac-abba-a3e27b1d9f2c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5da41009-ef7d-44ac-abba-a3e27b1d9f2c/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5da41009-ef7d-44ac-abba-a3e27b1d9f2c/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "e100d07b-d5cc-4e8f-ae7e-b2c104ce6290",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e100d07b-d5cc-4e8f-ae7e-b2c104ce6290/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e100d07b-d5cc-4e8f-ae7e-b2c104ce6290/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "51f2851b-a738-428d-b314-49e1875e2e2c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/51f2851b-a738-428d-b314-49e1875e2e2c/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/51f2851b-a738-428d-b314-49e1875e2e2c/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "ec5640fa-1ac5-4486-91c5-9299aef21521",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ec5640fa-1ac5-4486-91c5-9299aef21521/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ec5640fa-1ac5-4486-91c5-9299aef21521/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "68194b09-0d83-495a-9827-f77b858de1fb",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/68194b09-0d83-495a-9827-f77b858de1fb/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/68194b09-0d83-495a-9827-f77b858de1fb/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Wine": "https://m.media-amazon.com/images/I/31lQpebPc-L._AC_SR38,50_.jpg",
    "Brown": "https://m.media-amazon.com/images/I/310DLtOVMYL._AC_SR38,50_.jpg",
    "Navy": "https://m.media-amazon.com/images/I/31I2EWeQ0tL._AC_SR38,50_.jpg",
    "Pink": "https://m.media-amazon.com/images/I/31qUBkJa1iL._AC_SR38,50_.jpg",
    "White": "https://m.media-amazon.com/images/I/31JlZ9tXSpL._AC_SR38,50_.jpg",
    "Blue": "https://m.media-amazon.com/images/I/31QJMTPjq0L._AC_SR38,50_.jpg",
    "Apricot": "https://m.media-amazon.com/images/I/315MYpLJyKL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31C9aA6oPnL._AC_SR38,50_.jpg",
    "Green": "https://m.media-amazon.com/images/I/31oerJUYCfL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Wine": "51CLrh5MZ5L",
    "Brown": "512aFp8m3JL",
    "Navy": "51tyX3u3O8L",
    "Pink": "515p2WTO57L",
    "White": "51c44dQXSBL",
    "Blue": "51Z9a76-beL",
    "Apricot": "51Q7zvimohL",
    "Black": "51lIams4plL",
    "Green": "51Mtd2x8IlL"
  },
  "color_images": {
    "Wine": [
      "https://m.media-amazon.com/images/I/51CLrh5MZ5L._SL1500_.jpg"
    ],
    "Brown": [
      "https://m.media-amazon.com/images/I/512aFp8m3JL._SL1500_.jpg"
    ],
    "Navy": [
      "https://m.media-amazon.com/images/I/51tyX3u3O8L._SL1500_.jpg"
    ],
    "Pink": [
      "https://m.media-amazon.com/images/I/515p2WTO57L._SL1500_.jpg"
    ],
    "White": [
      "https://m.media-amazon.com/images/I/51c44dQXSBL._SL1500_.jpg"
    ],
    "Blue": [
      "https://m.media-amazon.com/images/I/51Z9a76-beL._SL1500_.jpg"
    ],
    "Apricot": [
      "https://m.media-amazon.com/images/I/51Q7zvimohL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/51lIams4plL._SL1500_.jpg"
    ],
    "Green": [
      "https://m.media-amazon.com/images/I/51Mtd2x8IlL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress-cocktail-bodycon",
      "title": "Womens Dress Cocktail Bodycon",
      "price": 47.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61NfEwzl3xL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-one-shoulder-maxi-formal",
      "title": "Womens Maxi Dress Evening One Shoulder Maxi Formal",
      "price": 69.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/5150AIQL4eL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail",
      "title": "Womens Dress Cocktail",
      "price": 103.54,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61JApwce25L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-formal-bodycon-evening-sleeveless",
      "title": "Womens Maxi Dress Maxi Formal Bodycon Evening Sleeveless",
      "price": 61.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61s8qg6u1VL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 158.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71PmRANW40L._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress-bodycon-split-ruched-off-shoulder",
      "title": "Womens Dress Bodycon Split Ruched Off Shoulder",
      "price": 38.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/41JjYcPgcpL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 95.61,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Work",
      "images": [
        "https://m.media-amazon.com/images/I/71hVgSIB1jL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 138.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51PZNrlyY9L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-split-evening-formal",
      "title": "Womens Maxi Dress Split Evening Formal",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51BZ1BqPx8L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 65.97,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/81wr8PDg55L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-v-neck",
      "title": "Womens Dress V Neck",
      "price": 82.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/710bSTpZ9hL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 278.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/91YXeyW506L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening-long-sleeve",
      "title": "Womens Maxi Dress Formal Evening Long Sleeve",
      "price": 87.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61nnk+flvaL._SL1500_.jpg"
      ]
    }
  ]
}