{
  "id": "womens-maxi-dress-long-sleeve-v-neck",
  "handle": "womens-maxi-dress-long-sleeve-v-neck",
  "sku": "JC3104",
  "asin": "B0FJ26HV77",
  "title": "Womens Maxi Dress Long Sleeve V Neck",
  "title_original": "Womens V Neck Long Sleeve Cable Knit Fall Dresses Elegant Babydoll Sweater Dress",
  "brand": "Visit the VAFOLY Store",
  "price": 47.99,
  "social_proof": {
    "bought_past_month": 122,
    "text": "122+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/71wrQhLd-8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71W+daPBPoL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81bH3a-GPZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81HpY-WEi6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71pP79eAx2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81YjiT1grEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71rYSbNBtHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81Lz5D31TuL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81cXOQcXebL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/717FPfnV9rL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81ZNb22jZ1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71-tdvEs6QL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71TjW1Ifz2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71qkZElR0SL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/71wrQhLd-8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71W+daPBPoL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81bH3a-GPZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81HpY-WEi6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71pP79eAx2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81YjiT1grEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71rYSbNBtHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81Lz5D31TuL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81cXOQcXebL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/717FPfnV9rL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81ZNb22jZ1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71-tdvEs6QL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71TjW1Ifz2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71qkZElR0SL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ July 18, 2025",
    "ASIN ‏": "‎ B0FJ2CYN1K",
    "Best Sellers Rank": "#8,542 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #55 in Women's Casual Dresses",
    "Customer Reviews": "4.1 4.1 out of 5 stars (94)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Red",
      "Brown",
      "Pink",
      "White",
      "Beige",
      "Blue",
      "Raspberry Powder",
      "Dark Blue",
      "Black",
      "Light Beige",
      "Green"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.1,
    "count": 94,
    "customers_say": "Customers find the dress fits well, with one mentioning it hits just above the knee, and they appreciate its cute design and soft material. The dress is high-quality, not flimsy, and it will be warm in winter. Comfort and fabric thickness receive mixed feedback - while some find it comfortable and appreciate the nice thick material, others find it uncomfortable. Customers disagree on whether the dress runs true to size. Generated from the text of customer reviews Select to learn more Fit (20) Cute dress (13) Soft material (9) Quality (7) Warmth (4) Comfort (6) Fabric thickness (6) Size (6) 20 customers mention fit, 14 positive, 6 negative 20 customers mention \"Fit\" 14 positive 6 negative Customers like how the dress fits, with one mentioning it sits mid-thigh and another noting it hits just above the knee. \" ...Perfect winter wear. Size was appropriate. Hits just above the knee . \" Read more \" ...It’s warm, and perfect for fall, and winter. Well made. Not itchy. Wasn’t too short since I’m 5’3. Perfect! \" Read more \" Very cute, soft and fits well; just very short . \" Read more \" ...I am 5'3 and weigh 165 lb. I ordered a large and it quite loose but not baggy . \" Read more 13 customers mention cute dress, 13 positive, 0 negative 13 customers mention \"Cute dress\" 13 positive 0 negative Customers find the dress cute, with one mentioning it is feminine and another noting its high quality. \" ...Bought a small for my daughter who is 5’9”, 135 pounds, 22 years old, cute and stylish and not super short.... \" Read more \" Very pretty and feminine, heavy not flimsy, and bell sleeves add a nice touch. Colors are true and sizing is as well. I am 5'3 and weigh 165 lb.... \" Read more \" The dress is really cute but sooo short that it can’t be considered a dress but more like just a sweater.... \" Read more \" Cute sweater dress . Came snagged didn’t realize it till I put it on for my work event. Disappointing. \" Read more 9 customers mention soft material, 7 positive, 2 negative 9 customers mention \"Soft material\" 7 positive 2 negative Customers appreciate the dress's soft material, with one mentioning it is very thick and cushy. \" Very cute, soft and fits well; just very short. \" Read more \" This dress is perfect. The fabric is soft and warm and the shape is very feminine. I wore this to a Christmas party and got many compliments.... \" Read more \" Soft material but the sweater pattern looks nothing like the picture. \" Read more \" Material is very scratchy . Fit fine but returned because of the feel. \" Read more 7 customers mention quality, 7 positive, 0 negative 7 customers mention \"Quality\" 7 positive 0 negative Customers find the dress to be high-quality and not flimsy. \" This dress is perfect . The fabric is soft and warm and the shape is very feminine. I wore this to a Christmas party and got many compliments.... \" Read more \" Love this dress! It’s warm, and perfect for fall, and winter. Well made . Not itchy. Wasn’t too short since I’m 5’3. Perfect! \" Read more \" Such a pretty sweater dress. Lil shorter than Id prefer but very well made . \" Read more \" Very pretty and feminine, heavy not flimsy , and bell sleeves add a nice touch. Colors are true and sizing is as well. I am 5'3 and weigh 165 lb.... \" Read more 4 customers mention warmth, 4 positive, 0 negative 4 customers mention \"Warmth\" 4 positive 0 negative Customers find the dress provides good warmth in winter, with one mentioning it's perfect for fall. \" This dress is perfect. The fabric is soft and warm and the shape is very feminine. I wore this to a Christmas party and got many compliments.... \" Read more \" ... Perfect winter wear . Size was appropriate. Hits just above the knee. \" Read more \" ...It is a nice thick material that will be warm in the winter .... \" Read more \" Love this dress! It’s warm , and perfect for fall, and winter. Well made. Not itchy. Wasn’t too short since I’m 5’3. Perfect! \" Read more 6 customers mention comfort, 3 positive, 3 negative 6 customers mention \"Comfort\" 3 positive 3 negative Customers have mixed opinions about the dress's comfort. \" ...It fit well enough that I could wear it and be comfortable , but it has some stretch to it, so I’m going to try a S instead just so I feel like I... \" Read more \" I like this dress it’s thick and high-quality, however, it is a little itchy and I thought it ran large for its size.... \" Read more \" ...It’s warm, and perfect for fall, and winter. Well made. Not itchy . Wasn’t too short since I’m 5’3. Perfect! \" Read more \" This is not soft, it’s very uncomfortable ! \" Read more 6 customers mention fabric thickness, 4 positive, 2 negative 6 customers mention \"Fabric thickness\" 4 positive 2 negative Customers have mixed opinions about the fabric thickness of the dress, with some finding it nice and thick, while others express dissatisfaction. \" ...It is super cute, the material is thick and warm , and it made it super easy to breastfeed without being too revealing. It sits mid thigh.... \" Read more \" ...Unfortunately, at $39.99, it's going back because she's not a fan of the fabric . It's too rough for her. \" Read more \" ...It is a nice thick material that will be warm in the winter.... \" Read more \" Really nice sweater dress, good quality thick fabric without being overly heavy. I’m 5’1” and 140 lbs.,... \" Read more 6 customers mention size, 4 positive, 2 negative 6 customers mention \"Size\" 4 positive 2 negative Customers have mixed experiences with the dress's fit, with some finding it true to size while others report sizing issues. \" ...Comfortable and true to size . \" Read more \" ...high-quality, however, it is a little itchy and I thought it ran large for its size .... \" Read more \" ...Perfect winter wear. Size was appropriate . Hits just above the knee. \" Read more \" ...Colors are true and sizing is as well . I am 5'3 and weigh 165 lb. I ordered a large and it quite loose but not baggy. \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Just as described",
        "body": "Beautiful. Heavy cable knit dress. I paired my cream colored dress with cream colored tights and brown boots. Perfect winter wear. Size was appropriate. Hits just above the knee. Read more",
        "author": "Jo Wray",
        "rating": 5.0,
        "date": "December 21, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Size down for a better fit, good quality",
        "body": "Really nice sweater dress, good quality thick fabric without being overly heavy. I’m 5’1” and 140 lbs., between a size 12/14 women’s and ordered the Medium size based on other reviews even though Amazon recommended size XL. It fit well enough that I could wear it and be comfortable, but it has some stretch to it, so I’m going to try a S instead just so I feel like I have a little bit of a shape. The sleeves are less blousy than the pictures, but still cute. Read more",
        "author": "Eena",
        "rating": 4.0,
        "date": "December 20, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Perfect little dress",
        "body": "This dress is perfect. The fabric is soft and warm and the shape is very feminine. I wore this to a Christmas party and got many compliments. I’m 5’3”, 140 lbs ordered a Medium and the length was appropriate and I paired it with knee high boots. Read more",
        "author": "Jennifer Brooke",
        "rating": 5.0,
        "date": "December 15, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/812E1z1eOgL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "3.0 out of 5 stars SHORT BUT LOVE DESIGN & SOFT $$",
        "body": "SURPRISINGLY SOFT FOR A THICK & HEAVY (NOT SEE THROUGH FABRIC), Love the Wide SLEEVES- I wish Was STLYED WITH LITTLE PUFF AT TOP$. ***ALL XL IN DIFFERENT COLORS LENGTH AND SLEEVE LENGTH ARE ALL DIFFERENT SIZES ***WEIRD*** ON EACH DRESS??? IF IT WAS KNEE LENGTH WOULD BE PERFECT WARMTH FOR LEGS FOR ALL AGES!! SIZE IS SMALLER THAN US SIZE $$.00 DRESS SMELLED OK, WAS AIR TIGHT SEALED....WRINGLED. WASH COLD, HANG TO DRY ( BEING HEAVY FABRIC ) I WOULD ADD CLIPS TO MIDDLE OF SHOULDERS SO NO SAG IN V NECK OR SLEEVES!! BLUE, WHITE, BLACK, ***because of other Honest review with picture*** ORANGEY not raspberry at all....COOL I APPRECIATE TRUTH, THANK YOU MA'AM!! YUP ORDERED ORANGE TOO BECAUSE OF THE WEIGHT, WIDE SLEEVES. CABLE KNIT DESIGN.....I WILL BE SEWING A RUFFLED TO LENGTHEN SKIRT...COOL Pink color dye PURPLE!! Read more",
        "author": "NONAME",
        "rating": 3.0,
        "date": "October 18, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Great buy",
        "body": "I bought this to wear to holiday events and still be able to breastfeed my baby. It is super cute, the material is thick and warm, and it made it super easy to breastfeed without being too revealing. It sits mid thigh. I'm 5'5\" and 155lbs and a medium was great. Read more",
        "author": "Corina Roullier",
        "rating": 5.0,
        "date": "December 16, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/718kDS+8jCL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "1.0 out of 5 stars Way too short.",
        "body": "The dress is really cute but sooo short that it can’t be considered a dress but more like just a sweater. I wish it was at least long enough to cover my bottom without having someone reporting me to security. Read more",
        "author": "Jessi",
        "rating": 1.0,
        "date": "November 22, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Vacuum seal made it wrinkly but it is a nice warm material",
        "body": "It came shrink wrapped, which means that it arrived wrinkly and with the cable knitting oddly not puffy. I put it in the washer/dryer which solved those problems, though it may have led to the dress getting a little shorter as well. (But it still fits great in the arms!) I am 5'3'' and 133 lbs and I got a size small, and it fits. After washing/drying it, the dress passes the finger tip test but is on the shorter side. It is a nice thick material that will be warm in the winter. I got white and it is not see through at all, so the knitting is appropriately tight as well. Read more",
        "author": "Mary",
        "rating": 4.0,
        "date": "December 15, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Soft & Cushy",
        "body": "Very thick cushy material! Fitted in the waist, high quality! Read more",
        "author": "Emily Pawley",
        "rating": 5.0,
        "date": "December 1, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Long Sleeve V Neck is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.",
  "about_this_item": "Womens Maxi Dress Long Sleeve V Neck is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.",
  "long_description": "Womens Maxi Dress Long Sleeve V Neck is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Red, Brown, Pink, White, Beige, Blue, Raspberry Powder, Dark Blue, Black, Light Beige, Green. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Long Sleeve V Neck is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Red, Brown, Pink, White, Beige, Blue, Raspberry Powder, Dark Blue, Black, Light Beige, Green. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "98f1e99d-c130-42f1-bf60-8a162d655ac9",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/98f1e99d-c130-42f1-bf60-8a162d655ac9/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/98f1e99d-c130-42f1-bf60-8a162d655ac9/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/14bdc108-6e3c-4a7d-a940-066d9c6ae4df.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "e57737c9-9290-488d-a15e-d8507946caad",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e57737c9-9290-488d-a15e-d8507946caad/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e57737c9-9290-488d-a15e-d8507946caad/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/14bdc108-6e3c-4a7d-a940-066d9c6ae4df.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "403140be-fd4b-4a91-b250-3fd9b580fd22",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/403140be-fd4b-4a91-b250-3fd9b580fd22/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/403140be-fd4b-4a91-b250-3fd9b580fd22/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/14bdc108-6e3c-4a7d-a940-066d9c6ae4df.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "073e96c0-84bd-4bfd-b223-83987467a3df",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/073e96c0-84bd-4bfd-b223-83987467a3df/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/073e96c0-84bd-4bfd-b223-83987467a3df/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/14bdc108-6e3c-4a7d-a940-066d9c6ae4df.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "c4953598-9907-47ea-90d2-c5088f3af993",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c4953598-9907-47ea-90d2-c5088f3af993/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c4953598-9907-47ea-90d2-c5088f3af993/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/14bdc108-6e3c-4a7d-a940-066d9c6ae4df.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "f62c6f3f-2934-44f3-a56b-5dffd62c6edf",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f62c6f3f-2934-44f3-a56b-5dffd62c6edf/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f62c6f3f-2934-44f3-a56b-5dffd62c6edf/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/14bdc108-6e3c-4a7d-a940-066d9c6ae4df.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "a56025d5-6e1b-4074-9a74-81e787c6b8d7",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a56025d5-6e1b-4074-9a74-81e787c6b8d7/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a56025d5-6e1b-4074-9a74-81e787c6b8d7/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/14bdc108-6e3c-4a7d-a940-066d9c6ae4df.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "c3507a4d-8709-4457-a7a3-e3afc94799ac",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c3507a4d-8709-4457-a7a3-e3afc94799ac/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c3507a4d-8709-4457-a7a3-e3afc94799ac/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/14bdc108-6e3c-4a7d-a940-066d9c6ae4df.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "0c23b6e2-1f63-405d-b84a-89aefe790cfe",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0c23b6e2-1f63-405d-b84a-89aefe790cfe/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0c23b6e2-1f63-405d-b84a-89aefe790cfe/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/14bdc108-6e3c-4a7d-a940-066d9c6ae4df.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "087a1ceb-2594-49ee-927b-9547c4d2d0a6",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/087a1ceb-2594-49ee-927b-9547c4d2d0a6/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/087a1ceb-2594-49ee-927b-9547c4d2d0a6/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/14bdc108-6e3c-4a7d-a940-066d9c6ae4df.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Red": "https://m.media-amazon.com/images/I/41f3sGj2mdL._AC_US100_.jpg",
    "Brown": "https://m.media-amazon.com/images/I/41tBxVRd7ML._AC_SR38,50_.jpg",
    "Pink": "https://m.media-amazon.com/images/I/31gmfNGl1JL._AC_US100_.jpg",
    "White": "https://m.media-amazon.com/images/I/31VWmy4b-bL._AC_US100_.jpg",
    "Beige": "https://m.media-amazon.com/images/I/41jurR2N4mL._AC_SR38,50_.jpg",
    "Blue": "https://m.media-amazon.com/images/I/41-Ep1GCDQL._AC_SR38,50_.jpg",
    "Raspberry Powder": "https://m.media-amazon.com/images/I/41weIL2kFIL._AC_US100_.jpg",
    "Dark Blue": "https://m.media-amazon.com/images/I/41igeRNTQeL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/41v8iiNHq5L._AC_SR38,50_.jpg",
    "Light Beige": "https://m.media-amazon.com/images/I/314RnbYQQ6L._AC_US100_.jpg",
    "Green": "https://m.media-amazon.com/images/I/41Q3uLOTwHL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Red": "71pP79eAx2L",
    "Brown": "81YjiT1grEL",
    "Pink": "71rYSbNBtHL",
    "White": "71wrQhLd-8L",
    "Beige": "81Lz5D31TuL",
    "Blue": "81cXOQcXebL",
    "Raspberry Powder": "717FPfnV9rL",
    "Dark Blue": "81ZNb22jZ1L",
    "Black": "71-tdvEs6QL",
    "Light Beige": "71TjW1Ifz2L",
    "Green": "71qkZElR0SL"
  },
  "color_images": {
    "Red": [
      "https://m.media-amazon.com/images/I/71pP79eAx2L._SL1500_.jpg"
    ],
    "Brown": [
      "https://m.media-amazon.com/images/I/81YjiT1grEL._SL1500_.jpg"
    ],
    "Pink": [
      "https://m.media-amazon.com/images/I/71rYSbNBtHL._SL1500_.jpg"
    ],
    "White": [
      "https://m.media-amazon.com/images/I/71wrQhLd-8L._SL1500_.jpg"
    ],
    "Beige": [
      "https://m.media-amazon.com/images/I/81Lz5D31TuL._SL1500_.jpg"
    ],
    "Blue": [
      "https://m.media-amazon.com/images/I/81cXOQcXebL._SL1500_.jpg"
    ],
    "Raspberry Powder": [
      "https://m.media-amazon.com/images/I/717FPfnV9rL._SL1500_.jpg"
    ],
    "Dark Blue": [
      "https://m.media-amazon.com/images/I/81ZNb22jZ1L._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/71-tdvEs6QL._SL1500_.jpg"
    ],
    "Light Beige": [
      "https://m.media-amazon.com/images/I/71TjW1Ifz2L._SL1500_.jpg"
    ],
    "Green": [
      "https://m.media-amazon.com/images/I/71qkZElR0SL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 41.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71gLnAI8qnL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-ruched-evening-high-split-split",
      "title": "Womens Maxi Dress Maxi Ruched Evening High Split Split",
      "price": 72.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71omaPs6UqL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-short-sleeve-evening",
      "title": "Womens Dress Short Sleeve Evening",
      "price": 89.88,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61vi9CZReDL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-formal-cocktail-evening",
      "title": "Womens Dress Formal Cocktail Evening",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71ctK4kwdWL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 45.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/712FTzeTFLL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-formal-mermaid-evening-ruched",
      "title": "Womens Maxi Dress Formal Mermaid Evening Ruched",
      "price": 74.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61qHc0kmHEL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 37.79,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51WFZKRzSdL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 43.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Work",
      "images": [
        "https://m.media-amazon.com/images/I/81JXmyg5QfL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-sleeveless-split-formal-cocktail-v-neck",
      "title": "Womens Maxi Dress Sleeveless Split Formal Cocktail V Neck",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/51jHZEGYXHL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-ruched",
      "title": "Womens Maxi Dress Long Sleeve Ruched",
      "price": 49.29,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61P6bkbQawL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-one-shoulder-maxi-long-sleeve",
      "title": "Womens Maxi Dress One Shoulder Maxi Long Sleeve",
      "price": 45.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61UljfUsK4L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-long-sleeve-evening-formal",
      "title": "Womens Maxi Dress Cocktail Long Sleeve Evening Formal",
      "price": 46.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/6190eiFreBL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-formal-long-sleeve-evening",
      "title": "Womens Maxi Dress Maxi Formal Long Sleeve Evening",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51enCkUtvSL._SL1500_.jpg"
      ]
    }
  ]
}