{
  "id": "womens-maxi-dress-formal-split-cocktail",
  "handle": "womens-maxi-dress-formal-split-cocktail",
  "sku": "JC2078",
  "asin": "B0FKZG6JSB",
  "title": "Womens Maxi Dress Formal Split Cocktail",
  "title_original": "MUSHARE Women's Cocktail Dresses with Pockets Ruffled Sexy Split Party Long Formal Dress",
  "brand": "MUSHARE",
  "price": 64.99,
  "social_proof": {
    "bought_past_month": 1755,
    "text": "1755+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/51bK4Js46qL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/510QByPh-8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/5109I9nAmkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61yPSzcoiWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51+omyk8ViL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/615WPgXlmHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61iuW7WObwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51puZBeMI8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61G7ZGrM+4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61AGkdGx97L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51mEmPXNdcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51oW6IC9nKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51QRnZwfzvL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51ZhsdF1S5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/513CftpKjFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/616XQUWdnfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51aTY8wv77L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51Gy5vvoNkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61pL7h3JOoL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51NRid3nPjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51C4MnhQg2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/619XJnKTofL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51oipNl3prL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51pHZYIdkdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Olh2fisTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51jPncaIN2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51xmAtEv8vL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/51bK4Js46qL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/510QByPh-8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/5109I9nAmkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61yPSzcoiWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51+omyk8ViL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/615WPgXlmHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61iuW7WObwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51puZBeMI8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61G7ZGrM+4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61AGkdGx97L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51mEmPXNdcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51oW6IC9nKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51QRnZwfzvL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51ZhsdF1S5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/513CftpKjFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/616XQUWdnfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51aTY8wv77L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51Gy5vvoNkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61pL7h3JOoL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51NRid3nPjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51C4MnhQg2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/619XJnKTofL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51oipNl3prL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51pHZYIdkdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Olh2fisTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51jPncaIN2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51xmAtEv8vL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ August 2, 2025",
    "ASIN ‏": "‎ B0FKZDNSCB",
    "Best Sellers Rank": "#97,082 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #349 in Women's Cocktail Dresses #420 in Women's Formal Dresses",
    "Customer Reviews": "4.5 4.5 out of 5 stars (61)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Red",
      "Teal Color",
      "Purple",
      "Burgundy",
      "Magenta",
      "Royal Blue",
      "Black",
      "Navy Blue",
      "Green"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.5,
    "count": 61,
    "customers_say": "Customers find the dress fits perfectly, with one mentioning it's great for weddings. The material is heavy and well-made, and customers appreciate its softness and comfort. They like the dress's beauty, with one describing it as a perfect mix of formal, and appreciate the pockets. The slit receives mixed feedback, with one customer noting it's more modest than expected. Generated from the text of customer reviews Select to learn more Fit (17) Beauty (13) Quality (13) Fabric quality (7) Comfort (5) Pockets (5) Softness (4) Slit (4) 17 customers mention fit, 13 positive, 4 negative 17 customers mention \"Fit\" 13 positive 4 negative Customers are satisfied with how the dress fits, noting that the length is perfect for them. \" ...These are nice and flat to your body. Super cute dress! It is a long dress so if you are on the shorter side you may have to get it hemmed.... \" Read more \" ...I’m 5’9”, 155 lbs, the medium fits perfectly . The dress length is perfect for me, I prefer to wear kitten heels. You cant beat the price! \" Read more \" This dress fits true to size , is very comfortable, the material has a perfect stretch and thickness to it, and is beautiful on!... \" Read more \" ... Very long for a petite person , even with a 3 or 4-inch heels.... \" Read more 13 customers mention beauty, 12 positive, 1 negative 13 customers mention \"Beauty\" 12 positive 1 negative Customers find the dress beautiful, with one mentioning it's a perfect mix of formal and casual elements. \" Elegant and beautiful . \" Read more \" ...my parents' 50th anniversary gala, it is the perfect mix of formal / elegant and easy.... \" Read more \" ...These are nice and flat to your body. Super cute dress ! It is a long dress so if you are on the shorter side you may have to get it hemmed.... \" Read more \" ...I bought this dress for a wedding I was attending. This dress looks great on . I received many complements for other guests.... \" Read more 13 customers mention quality, 13 positive, 0 negative 13 customers mention \"Quality\" 13 positive 0 negative Customers love this dress, with one mentioning it's perfect for a wedding. \" Perfect dress for a wedding. Fits perfect and is great quality \" Read more \" Great dress !!... \" Read more \" This is a really beautiful well made dress . \" Read more \" ...It fit perfectly, and I will use it again! Quality was great , and it was not see through, so I didn’t need to worry about wearing twelve layers of... \" Read more 7 customers mention fabric quality, 7 positive, 0 negative 7 customers mention \"Fabric quality\" 7 positive 0 negative Customers like the fabric quality of the dress, noting that the material is amazing and on the heavier side. \" ...But it was very slight. Material was awesome , very soft, and durable. Lots of stretch to it....AND....it had pockets!!! \" Read more \" ...It was very flattering, and I loved the weight of the fabric . The quality is quite good, though not the softest. It is stretchy but not see through.... \" Read more \" I can't believe this dress isnt rated 5 stars! The material is amazing ! I love that the material is on the heavier side. True to size.... \" Read more \" The material is okay (4-star) for a night out or a semi formal event but not for a formal event.... \" Read more 5 customers mention comfort, 5 positive, 0 negative 5 customers mention \"Comfort\" 5 positive 0 negative Customers find the dress comfortable. \" ...I bought it for a wedding. It is very classy and comfortable . The material is thick and wonderful quality. This can be easily dressed up or down. \" Read more \" ...I received many complements for other guests. This Dres is very comfortable and the perfect length for me in flats as a 5'10\" woman. \" Read more \" Absolutely gorgeous and so comfortable !!! Very versatile and will absolutely use it again!! It fit perfectly, and I will use it again!... \" Read more \" ...Style is beautiful, I am large busted and the high neckline was comfortable and didn't require fussing or tugging at all.... \" Read more 5 customers mention pockets, 5 positive, 0 negative 5 customers mention \"Pockets\" 5 positive 0 negative Customers like the dress's pockets. \" ...Lots of stretch to it....AND.... it had pockets !!! \" Read more \" Fits great! Much prettier in person. I love that it has pockets . I bought it for a wedding. It is very classy and comfortable.... \" Read more \" ...weight without being heavy, DID NOT WRINKLE in a long car ride and HAS POCKETS !... \" Read more \" ...It also has great pockets ! It was very long, and even with 3 1/2 inch heels it brushed the ground.... \" Read more 4 customers mention softness, 3 positive, 1 negative 4 customers mention \"Softness\" 3 positive 1 negative Customers find the dress soft. \" ...It was really long but we hemmed it easily. It’s a soft material with a little stretch to it. She’s 5’3”, and the S fit her great. \" Read more \" ...But it was very slight. Material was awesome, very soft , and durable. Lots of stretch to it....AND....it had pockets!!! \" Read more \" ...The quality is quite good, though not the softest . It is stretchy but not see through.... \" Read more \" ...I am 5' 7\" 179lbs. Love that it has side pockets and they are not fluffy .... \" Read more 4 customers mention slit, 1 positive, 3 negative 4 customers mention \"Slit\" 1 positive 3 negative Customers have mixed opinions about the dress's slit: one finds it modest, while another notes it's high, and a third mentions a slight armpit nudge. \" ...Cap sleeves were great for the church portion. Slit is a little high but easily fixed with a few stitches if desired.... \" Read more \" The material is of good quality and not thin. The slit is more modest , stopping just above the knee rather than mid thigh like some others.... \" Read more \" ...Fit was great and the slit was perfect on thigh .... \" Read more \" ...pit area was just a smidge more open then id like, gave a very slight front armpit nudge I'm not fond of. But it was very slight.... \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars LOVE THIS DRESS!",
        "body": "This dress is absolutely fabulous. I bought it based on other reviews and agree when others say to not hesitate, just buy it! I wore it for my parents' 50th anniversary gala, it is the perfect mix of formal / elegant and easy. The fabric has good weight without being heavy, DID NOT WRINKLE in a long car ride and HAS POCKETS! Style is beautiful, I am large busted and the high neckline was comfortable and didn't require fussing or tugging at all. Length is long, I'm 5'09\" and wore a medium heel which was perfect (if wearing flats, it would be on the floor). Cap sleeves were great for the church portion. Slit is a little high but easily fixed with a few stitches if desired. Overall , this is now my favorite semi formal dress to wear. Grab it ! Read more",
        "author": "Chad Pryor",
        "rating": 5.0,
        "date": "November 2, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Perfect formal dress, Very flattering and",
        "body": "Very happy with this dress! I needed it for a bridesmaid dress and it is exactly what I hoped for! I ordered the green and color is a little bit darker and more blueish than the picture, but it works for what I need. I’m 5’6 and 125 lbs, and I ordered a Small. Initially it looked too big, but once I put it on it fit very well! It was very flattering, and I loved the weight of the fabric. The quality is quite good, though not the softest. It is stretchy but not see through. The slit comes mid-calf but the weight of the fabric keeps it from feeling like it opens. It’s perfect for if you need a more modest formal dress. It also has great pockets! It was very long, and even with 3 1/2 inch heels it brushed the ground. Overall very happy, especially since it’s on the less expensive end of formal dresses. It shipped very fast and I’m very happy with this purchase! Read more",
        "author": "echank",
        "rating": 5.0,
        "date": "October 1, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71TrlT6nq1L._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/713GaXkruRL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/81sPIwEcohL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "4.0 out of 5 stars Nice dress but very long for a petite person",
        "body": "The material is okay (4-star) for a night out or a semi formal event but not for a formal event. Very long for a petite person, even with a 3 or 4-inch heels. Will need to remove at least 6 inches for hem, but because the hem line is continuous with the ruffle side of the dress, hemming will be a bit complicated. For the money, it might be okay. Nice style. Read more",
        "author": "Katie",
        "rating": 4.0,
        "date": "November 30, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Amazing dress, great quality and love the fabric!",
        "body": "I can't believe this dress isnt rated 5 stars! The material is amazing! I love that the material is on the heavier side. True to size. I bought for a wedding in November. I had a baby 3 months ago. I bought a medium. I am 5' 7\" 179lbs. Love that it has side pockets and they are not fluffy. Ive bought dresses before where they have pockets and the pockets make you look like you have huge hips. These are nice and flat to your body. Super cute dress! It is a long dress so if you are on the shorter side you may have to get it hemmed. Worth every penny. Can't wait to wear it!! Read more",
        "author": "Customer",
        "rating": 5.0,
        "date": "October 21, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Go ahead and get it sis.",
        "body": "Fits great! Much prettier in person. I love that it has pockets. I bought it for a wedding. It is very classy and comfortable. The material is thick and wonderful quality. This can be easily dressed up or down. Read more",
        "author": "Tasha D",
        "rating": 5.0,
        "date": "November 8, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Beautiful and pockets!!",
        "body": "Loved this dress! Alittle long, but being short I expected it and would just wear higher heels. Fit was great and the slit was perfect on thigh. The arm pit area was just a smidge more open then id like, gave a very slight front armpit nudge I'm not fond of. But it was very slight. Material was awesome, very soft, and durable. Lots of stretch to it....AND....it had pockets!!! Read more",
        "author": "yvette",
        "rating": 5.0,
        "date": "October 16, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Fabulous versatile dress!!",
        "body": "Absolutely gorgeous and so comfortable!!! Very versatile and will absolutely use it again!! It fit perfectly, and I will use it again! Quality was great, and it was not see through, so I didn’t need to worry about wearing twelve layers of tummy tuckers to suck me in!! Read more",
        "author": "Maggie",
        "rating": 5.0,
        "date": "November 2, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Great dress",
        "body": "The material is of good quality and not thin. The slit is more modest, stopping just above the knee rather than mid thigh like some others. The fit is great throughout. Read more",
        "author": "Gary L Townsend",
        "rating": 5.0,
        "date": "November 15, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Formal Split Cocktail is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.",
  "about_this_item": "Womens Maxi Dress Formal Split Cocktail is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.",
  "long_description": "Womens Maxi Dress Formal Split Cocktail is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Red, Teal Color, Purple, Burgundy, Magenta, Royal Blue, Black, Navy Blue, Green. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Formal Split Cocktail is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Red, Teal Color, Purple, Burgundy, Magenta, Royal Blue, Black, Navy Blue, Green. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "src": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/7faf3b20-120f-4ca1-9d43-2980ccf357e3.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG&quot;,&quot;videoSrc&quot;:&quot;https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/7faf3b20-120f-4ca1-9d43-2980ccf357e3.mp4/productVideoOptimized.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/7faf3b20-120f-4ca1-9d43-2980ccf357e3.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG&quot;,&quot;videoSrc&quot;:&quot;https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/7faf3b20-120f-4ca1-9d43-2980ccf357e3.mp4/productVideoOptimized.mp4"
        }
      ]
    },
    {
      "src": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/7faf3b20-120f-4ca1-9d43-2980ccf357e3.mp4/productVideoOptimized.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/7faf3b20-120f-4ca1-9d43-2980ccf357e3.mp4/productVideoOptimized.mp4"
        }
      ]
    },
    {
      "src": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/7faf3b20-120f-4ca1-9d43-2980ccf357e3.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/7faf3b20-120f-4ca1-9d43-2980ccf357e3.mp4"
        }
      ]
    },
    {
      "src": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/11d647ca-dfef-42ec-a912-aa830455a776.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG&quot;,&quot;videoSrc&quot;:&quot;https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/11d647ca-dfef-42ec-a912-aa830455a776.mp4/productVideoOptimized.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/11d647ca-dfef-42ec-a912-aa830455a776.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG&quot;,&quot;videoSrc&quot;:&quot;https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/11d647ca-dfef-42ec-a912-aa830455a776.mp4/productVideoOptimized.mp4"
        }
      ]
    },
    {
      "src": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/11d647ca-dfef-42ec-a912-aa830455a776.mp4/productVideoOptimized.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/11d647ca-dfef-42ec-a912-aa830455a776.mp4/productVideoOptimized.mp4"
        }
      ]
    },
    {
      "src": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/11d647ca-dfef-42ec-a912-aa830455a776.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/11d647ca-dfef-42ec-a912-aa830455a776.mp4"
        }
      ]
    },
    {
      "src": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/976b8139-aff1-4882-abc3-cb0c72f23da2.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG&quot;,&quot;videoSrc&quot;:&quot;https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/976b8139-aff1-4882-abc3-cb0c72f23da2.mp4/productVideoOptimized.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/976b8139-aff1-4882-abc3-cb0c72f23da2.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG&quot;,&quot;videoSrc&quot;:&quot;https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/976b8139-aff1-4882-abc3-cb0c72f23da2.mp4/productVideoOptimized.mp4"
        }
      ]
    },
    {
      "src": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/976b8139-aff1-4882-abc3-cb0c72f23da2.mp4/productVideoOptimized.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/976b8139-aff1-4882-abc3-cb0c72f23da2.mp4/productVideoOptimized.mp4"
        }
      ]
    },
    {
      "src": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/976b8139-aff1-4882-abc3-cb0c72f23da2.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/976b8139-aff1-4882-abc3-cb0c72f23da2.mp4"
        }
      ]
    },
    {
      "src": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/878bb79a-8d28-49a0-9467-660a1a9f3cd8.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG&quot;,&quot;videoSrc&quot;:&quot;https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/878bb79a-8d28-49a0-9467-660a1a9f3cd8.mp4/productVideoOptimized.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/878bb79a-8d28-49a0-9467-660a1a9f3cd8.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG&quot;,&quot;videoSrc&quot;:&quot;https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/878bb79a-8d28-49a0-9467-660a1a9f3cd8.mp4/productVideoOptimized.mp4"
        }
      ]
    },
    {
      "src": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/878bb79a-8d28-49a0-9467-660a1a9f3cd8.mp4/productVideoOptimized.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/878bb79a-8d28-49a0-9467-660a1a9f3cd8.mp4/productVideoOptimized.mp4"
        }
      ]
    },
    {
      "src": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/878bb79a-8d28-49a0-9467-660a1a9f3cd8.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/878bb79a-8d28-49a0-9467-660a1a9f3cd8.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Red": "https://m.media-amazon.com/images/I/31zrSJLzikL._AC_SR38,50_.jpg",
    "Teal Color": "https://m.media-amazon.com/images/I/31kdd0GGPXL._AC_SR38,50_.jpg",
    "Purple": "https://m.media-amazon.com/images/I/31tN4CVchYL._AC_SR38,50_.jpg",
    "Burgundy": "https://m.media-amazon.com/images/I/31nesUx+8wL._AC_SR38,50_.jpg",
    "Magenta": "https://m.media-amazon.com/images/I/31+AIykp6dL._AC_SR38,50_.jpg",
    "Royal Blue": "https://m.media-amazon.com/images/I/31dYfSy4gXL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31fBADkL+jL._AC_SR38,50_.jpg",
    "Navy Blue": "https://m.media-amazon.com/images/I/31olOpn1XJL._AC_SR38,50_.jpg",
    "Green": "https://m.media-amazon.com/images/I/31uNya9AR5L._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Red": "61yPSzcoiWL",
    "Teal Color": "61iuW7WObwL",
    "Purple": "61AGkdGx97L",
    "Burgundy": "51QRnZwfzvL",
    "Magenta": "616XQUWdnfL",
    "Royal Blue": "61pL7h3JOoL",
    "Black": "51bK4Js46qL",
    "Navy Blue": "619XJnKTofL",
    "Green": "61Olh2fisTL"
  },
  "color_images": {
    "Red": [
      "https://m.media-amazon.com/images/I/61yPSzcoiWL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/51+omyk8ViL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/615WPgXlmHL._SL1500_.jpg"
    ],
    "Teal Color": [
      "https://m.media-amazon.com/images/I/61iuW7WObwL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/51puZBeMI8L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61G7ZGrM+4L._SL1500_.jpg"
    ],
    "Purple": [
      "https://m.media-amazon.com/images/I/61AGkdGx97L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/51mEmPXNdcL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/51oW6IC9nKL._SL1500_.jpg"
    ],
    "Burgundy": [
      "https://m.media-amazon.com/images/I/51QRnZwfzvL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/51ZhsdF1S5L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/513CftpKjFL._SL1500_.jpg"
    ],
    "Magenta": [
      "https://m.media-amazon.com/images/I/616XQUWdnfL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/51aTY8wv77L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/51Gy5vvoNkL._SL1500_.jpg"
    ],
    "Royal Blue": [
      "https://m.media-amazon.com/images/I/61pL7h3JOoL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/51NRid3nPjL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/51C4MnhQg2L._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/51bK4Js46qL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/510QByPh-8L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/5109I9nAmkL._SL1500_.jpg"
    ],
    "Navy Blue": [
      "https://m.media-amazon.com/images/I/619XJnKTofL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/51oipNl3prL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/51pHZYIdkdL._SL1500_.jpg"
    ],
    "Green": [
      "https://m.media-amazon.com/images/I/61Olh2fisTL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/51jPncaIN2L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/51xmAtEv8vL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-off-shoulder",
      "title": "Womens Maxi Dress Off Shoulder",
      "price": 159.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/71gSdMwmvyL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-sleeveless",
      "title": "Womens Maxi Dress Maxi Sleeveless",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51H-uo2AY8L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-maxi",
      "title": "Womens Maxi Dress Long Sleeve Maxi",
      "price": 129.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71KBQddIZrL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-long-sleeve-ruched",
      "title": "Womens Maxi Dress Bodycon Long Sleeve Ruched",
      "price": 38.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/718YKBFbs3L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 14.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/817AIn3TieL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-long-sleeve-formal-maxi-bodycon-ruched-cocktail",
      "title": "Womens Maxi Dress Long Sleeve Formal Maxi Bodycon Ruched Cocktail",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61it3lHFcYL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-bodycon-ruched-short-sleeve",
      "title": "Womens Dress Bodycon Ruched Short Sleeve",
      "price": 24.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51R-e5ibY+L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-boat-neck-sleeveless",
      "title": "Womens Dress Boat Neck Sleeveless",
      "price": 31.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61C-UtxdN+L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-long-sleeve",
      "title": "Womens Maxi Dress Maxi Long Sleeve",
      "price": 19.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61TSujQqvnL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-bodycon-sleeveless",
      "title": "Womens Dress Bodycon Sleeveless",
      "price": 27.89,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61hT6+S9ShL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-v-neck-maxi-long-sleeve",
      "title": "Womens Maxi Dress V Neck Maxi Long Sleeve",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71sKNyjrUTL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-maxi-cocktail-mermaid-evening",
      "title": "Womens Maxi Dress Formal Maxi Cocktail Mermaid Evening",
      "price": 55.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51xwRNp-naL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-v-neck-long-sleeve",
      "title": "Womens Maxi Dress Maxi V Neck Long Sleeve",
      "price": 58.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61Xhe4CweyL._SL1500_.jpg"
      ]
    }
  ]
}