{
  "id": "womens-maxi-dress-bodycon-long-sleeve",
  "handle": "womens-maxi-dress-bodycon-long-sleeve",
  "sku": "JC1843",
  "asin": "B0FM7CZC94",
  "title": "Womens Maxi Dress Bodycon Long Sleeve",
  "title_original": "Long Sleeve Dress for Women Ribbed Knit Crew Neck Fall Dresses Bodycon Mini Short Dresses Fashion Clothes 2026",
  "brand": "Visit the Chongbaijia Store",
  "price": 11.99,
  "social_proof": {
    "bought_past_month": 644,
    "text": "644+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/71M2aqj8NxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71vC63lm2FL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71lqkdwTDWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61VRo6wvdTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71sRp00wS-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71a81uhoTHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71tW+5fKaIL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81Bhq0VpFPL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81vbPEVdsqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81whKgZRDNL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61LrLVc0HYL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71SUr+aqa9L._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/71M2aqj8NxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71vC63lm2FL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71lqkdwTDWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61VRo6wvdTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71sRp00wS-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71a81uhoTHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71tW+5fKaIL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81Bhq0VpFPL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81vbPEVdsqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81whKgZRDNL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61LrLVc0HYL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71SUr+aqa9L._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ August 13, 2025",
    "ASIN ‏": "‎ B0FM7DKHJV",
    "Best Sellers Rank": "#11,191 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #38 in Women's Club & Night Out Dresses #73 in Women's Casual Dresses",
    "Customer Reviews": "4.6 4.6 out of 5 stars (124)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Red",
      "Brown",
      "Gray",
      "Pink",
      "White",
      "Black",
      "Navy Blue",
      "Green"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.6,
    "count": 124,
    "customers_say": "Customers find the dress comfortable and well-fitting, with soft fabric that has a supple give. The length is perfect, and one customer notes how the long sleeves add a nice contrast. They appreciate its quality and consider it good value for money. The material thickness receives mixed feedback, with some customers saying it's thick enough while others find it very thin. Generated from the text of customer reviews Select to learn more Fit (15) Looks (15) Comfort (10) Fabric quality (9) Length (9) Quality (6) Value for money (6) Material thickness (5) 15 customers mention fit, 12 positive, 3 negative 15 customers mention \"Fit\" 12 positive 3 negative Customers love the fit of the dress. \" Too short for what I bought it for, but it looks and fits great , so now it will be a going out dress. I got a lot of compliments on it.... \" Read more \" NICE FIT , MEDIUM WEIGHT SOFT FABRIC, WILL BE JUST RIGHT WITH SOME TIGHTS FOR COLDER DAYS AND NIGHTS ! FOR UNDER $10?????? \" Read more \" Love the fit ❤️❤️❤️❤️ \" Read more \" ...No weird material. It was a little big on me so I do not recommend sizing up. \" Read more 15 customers mention looks, 14 positive, 1 negative 15 customers mention \"Looks\" 14 positive 1 negative Customers find the dress pretty, with one mentioning that the long sleeves add a delicious contrast, while another notes it's a good black dress for winter styles. \" This dress is sexy and very comfortable love this dress \" Read more \" Cute , and affordable \" Read more \" Great fabric, cut and cute dress . White is a no go because it’s see through. I think the other colors would be better and not see through \" Read more \" Dress is cute , but unfortunately runs a bit big and it’s not as form fitting as I would hope.... \" Read more 10 customers mention comfort, 10 positive, 0 negative 10 customers mention \"Comfort\" 10 positive 0 negative Customers find the dress comfortable. \" I needed a dress last minute, I loved how it hugged my body; very comfortable and pretty. I got a size small. I’m 5’0 and the length was perfect. \" Read more \" Just like picture color was exact the length was up to knees very comfortable dress . \" Read more \" Beautiful and comfortable ! I ordered a medium with is what I normally order and it was perfect! I’m 5’5 and 148 lbs \" Read more \" I love this dress!! It’s stretchy, comfy , perfect length, and the price point is insane!... \" Read more 9 customers mention fabric quality, 8 positive, 1 negative 9 customers mention \"Fabric quality\" 8 positive 1 negative Customers appreciate the fabric of the dress, describing it as soft with a supple give. \" Soft fabric but thinner than expected.... \" Read more \" Super cute, exactly like the picture, a ribbed material . I got a the smallest size for a skin tight feel but it was too tight. \" Read more \" Great fabric , cut and cute dress. White is a no go because it’s see through. I think the other colors would be better and not see through \" Read more \" ...Its sleek fabric clings to the body in all the right places, tracing the curve of the waist and the rise of the hips like a slow, deliberate touch.... \" Read more 9 customers mention length, 7 positive, 2 negative 9 customers mention \"Length\" 7 positive 2 negative Customers like the length of the dress, with several finding it perfect, and one mentioning it provides warmth with long sleeves. \" ...I got a size small. I’m 5’0 and the length was perfect . \" Read more \" Beautiful dress, very good material. True to sizr. The length is perfect . Material is thick enough. Buy it \" Read more \" Very comfortable and affordable, great length , I wore to a party and was comfortable all night \" Read more \" Surprisingly the dress fit good it’s a little short in the back but will be wearing with leggings \" Read more 6 customers mention quality, 6 positive, 0 negative 6 customers mention \"Quality\" 6 positive 0 negative Customers find the dress to be of great quality, with one mentioning it's perfect for any occasion. \" Absolutely loved this dress, the quality was amazing and the length was dress right. I would definitely buy again and refer a friend! \" Read more \" ...It is very thin, but with a nice coat and some fleece tights you'll be fine.... \" Read more \" Great dress ... \" Read more \" Nice Dress ... \" Read more 6 customers mention value for money, 6 positive, 0 negative 6 customers mention \"Value for money\" 6 positive 0 negative Customers find the dress offers good value for money. \" Very comfortable and affordable , great length, I wore to a party and was comfortable all night \" Read more \" ...I would say to the young ladies to buy this - it is so inexpensive , it's a steal, I think. \" Read more \" ...It’s stretchy, comfy, perfect length, and the price point is insane !... \" Read more \" Nice for price . Very thin so wear a coat and fleece tights... \" Read more 5 customers mention material thickness, 2 positive, 3 negative 5 customers mention \"Material thickness\" 2 positive 3 negative Customers have mixed opinions about the material thickness of the dress, with some finding it thick enough while others describe it as very thin. \" I think it's a good black dress for winter styles. It is very thin , but with a nice coat and some fleece tights you'll be fine.... \" Read more \" ...True to sizr. The length is perfect. Material is thick enough . Buy it \" Read more \" Soft fabric but thinner than expected .... \" Read more \" ...Sleeve length is perfect, not too long or too short. Not too thick of material (it does show VPL) but not sheer. \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Perfect for any occasion.",
        "body": "I needed a dress last minute, I loved how it hugged my body; very comfortable and pretty. I got a size small. I’m 5’0 and the length was perfect. Read more",
        "author": "Daniela Figueroa Guerrero",
        "rating": 5.0,
        "date": "November 18, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71bDqVc9xrL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Great dress",
        "body": "Very comfortable dress, stretchy and conforms to your body Read more",
        "author": "Georgia DeSimone",
        "rating": 5.0,
        "date": "December 19, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Long sleeve for warmth but still cute",
        "body": "Very comfortable and affordable, great length, I wore to a party and was comfortable all night Read more",
        "author": "Zion Bilen",
        "rating": 5.0,
        "date": "December 18, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Nice!",
        "body": "Too short for what I bought it for, but it looks and fits great, so now it will be a going out dress. I got a lot of compliments on it. Wish the material was just a little thicker, but it isnt see through or anything. Read more",
        "author": "Amanda M",
        "rating": 5.0,
        "date": "December 9, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Buy it",
        "body": "Beautiful dress, very good material. True to sizr. The length is perfect. Material is thick enough. Buy it Read more",
        "author": "Miss Nayya",
        "rating": 5.0,
        "date": "December 15, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Nice for price. Very thin so wear a coat and fleece tights",
        "body": "I think it's a good black dress for winter styles. It is very thin, but with a nice coat and some fleece tights you'll be fine. The material isn't super nice quality, but I don't find it itchy or bothersome (and I'm usually really picky about materials). It is a ribbed material which makes it look kinda cheap. But it looked good on me and definitely accentuates the curves. Read more",
        "author": "PD",
        "rating": 4.0,
        "date": "November 25, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/41K6TTd5whL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Commands Attention",
        "body": "The long-sleeve bodycon dress whispers allure with every contour. Its sleek fabric clings to the body in all the right places, tracing the curve of the waist and the rise of the hips like a slow, deliberate touch. The long sleeves add a delicious contrast—modest coverage that only heightens the drama of its fit. The material has a supple give, smoothing the silhouette while keeping every movement fluid and confident. The neckline draws the eye upward, while the snug hemline invites glances that linger a second too long. It’s a piece that doesn’t just adorn the body—it claims it, wrapping confidence and seduction into one seamless form. Read more",
        "author": "Vixen Vega",
        "rating": 5.0,
        "date": "November 9, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Color not as pictured",
        "body": "-2 stars because the color I received isn’t royal blue as pictured—It is a navy blue. Still, it fits great and is comfortable. Sleeve length is perfect, not too long or too short. Not too thick of material (it does show VPL) but not sheer. Read more",
        "author": "Emily",
        "rating": 3.0,
        "date": "October 24, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/81v0388ZSUL._SY88._SL1500_.jpg"
        ]
      }
    ]
  },
  "short_description": "Womens Maxi Dress Bodycon Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.",
  "about_this_item": "Womens Maxi Dress Bodycon Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.",
  "long_description": "Womens Maxi Dress Bodycon Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Red, Brown, Gray, Pink, White, Black, Navy Blue, Green. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Bodycon Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Red, Brown, Gray, Pink, White, Black, Navy Blue, Green. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "ef3ffb0d-5305-4b1e-b7f3-6320fff1156e",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ef3ffb0d-5305-4b1e-b7f3-6320fff1156e/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ef3ffb0d-5305-4b1e-b7f3-6320fff1156e/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/40366724-aae6-4ea0-ad14-012d8fa94876.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "a0b92457-0a8e-400f-9d11-90a937cd5bd9",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a0b92457-0a8e-400f-9d11-90a937cd5bd9/embedded.cc.default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a0b92457-0a8e-400f-9d11-90a937cd5bd9/embedded.cc.default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/40366724-aae6-4ea0-ad14-012d8fa94876.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "857e665e-69a2-4312-828a-7be07a043a7d",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/857e665e-69a2-4312-828a-7be07a043a7d/embedded.cc.default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/857e665e-69a2-4312-828a-7be07a043a7d/embedded.cc.default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/40366724-aae6-4ea0-ad14-012d8fa94876.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "3607571e-36a9-49a8-aaca-c4c7781e188f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3607571e-36a9-49a8-aaca-c4c7781e188f/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3607571e-36a9-49a8-aaca-c4c7781e188f/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/40366724-aae6-4ea0-ad14-012d8fa94876.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "9a10b971-ea94-436e-81e8-622b2f991f78",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9a10b971-ea94-436e-81e8-622b2f991f78/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9a10b971-ea94-436e-81e8-622b2f991f78/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/40366724-aae6-4ea0-ad14-012d8fa94876.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "2dea0e7f-fe1e-49c0-bcee-b07602abdb6c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2dea0e7f-fe1e-49c0-bcee-b07602abdb6c/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2dea0e7f-fe1e-49c0-bcee-b07602abdb6c/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/40366724-aae6-4ea0-ad14-012d8fa94876.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Red": "https://m.media-amazon.com/images/I/31hAUNtgBjL._AC_SR38,50_.jpg",
    "Brown": "https://m.media-amazon.com/images/I/31wtgqyBVSL._AC_SR38,50_.jpg",
    "Gray": "https://m.media-amazon.com/images/I/31mChBRPCTL._AC_SR38,50_.jpg",
    "Pink": "https://m.media-amazon.com/images/I/41I1saFvLvL._AC_SR38,50_.jpg",
    "White": "https://m.media-amazon.com/images/I/31dcjeW5xzL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31iIBQgOnlL._AC_SR38,50_.jpg",
    "Navy Blue": "https://m.media-amazon.com/images/I/31IZK4grqIL._AC_SR38,50_.jpg",
    "Green": "https://m.media-amazon.com/images/I/31rxA28iIJL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Red": "71a81uhoTHL",
    "Brown": "71tW+5fKaIL",
    "Gray": "81Bhq0VpFPL",
    "Pink": "81vbPEVdsqL",
    "White": "81whKgZRDNL",
    "Black": "71M2aqj8NxL",
    "Navy Blue": "61LrLVc0HYL",
    "Green": "71SUr+aqa9L"
  },
  "color_images": {
    "Red": [
      "https://m.media-amazon.com/images/I/71a81uhoTHL._SL1500_.jpg"
    ],
    "Brown": [
      "https://m.media-amazon.com/images/I/71tW+5fKaIL._SL1500_.jpg"
    ],
    "Gray": [
      "https://m.media-amazon.com/images/I/81Bhq0VpFPL._SL1500_.jpg"
    ],
    "Pink": [
      "https://m.media-amazon.com/images/I/81vbPEVdsqL._SL1500_.jpg"
    ],
    "White": [
      "https://m.media-amazon.com/images/I/81whKgZRDNL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/71M2aqj8NxL._SL1500_.jpg"
    ],
    "Navy Blue": [
      "https://m.media-amazon.com/images/I/61LrLVc0HYL._SL1500_.jpg"
    ],
    "Green": [
      "https://m.media-amazon.com/images/I/71SUr+aqa9L._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-v-neck-long-sleeve",
      "title": "Womens Maxi Dress V Neck Long Sleeve",
      "price": 42.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61ESKKVXeyL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 174.91,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71SN6Oih0hL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-cocktail-v-neck",
      "title": "Womens Maxi Dress Long Sleeve Cocktail V Neck",
      "price": 58.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/615ijFkMCdL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-v-neck-bodycon",
      "title": "Womens Maxi Dress Long Sleeve V Neck Bodycon",
      "price": 47.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61QbwpUJEwL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 24.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61H3TuaNRDL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-cocktail-split-formal",
      "title": "Womens Maxi Dress Cocktail Split Formal",
      "price": 57.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51TDVOmSHDL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi",
      "title": "Womens Maxi Dress Maxi",
      "price": 35.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/6135-lSmLWL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 55.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/81BWIeE3JdL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 169.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51Cd8onMJbL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 35.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71xNIsc8O6L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-evening-v-neck-mermaid-bodycon",
      "title": "Womens Dress Evening V Neck Mermaid Bodycon",
      "price": 84.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61VKe8rgggL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-ruched-sleeveless-maxi-cocktail",
      "title": "Womens Maxi Dress Bodycon Ruched Sleeveless Maxi Cocktail",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51KEafj4npL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-sleeveless-cocktail",
      "title": "Womens Dress Sleeveless Cocktail",
      "price": 43.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61yL+tI8RDL._SL1500_.jpg"
      ]
    }
  ]
}