{
  "id": "womens-dress-sleeveless",
  "handle": "womens-dress-sleeveless",
  "sku": "JC1492",
  "asin": "B0FMFGS7PD",
  "title": "Womens Dress Sleeveless",
  "title_original": "Fisoew Women's Plaid Christmas Dress Mini Sleeveless Round Neck A Line Short Xmas Party Dresses",
  "brand": "Visit the Fisoew Store",
  "price": 38.99,
  "social_proof": {
    "bought_past_month": 1860,
    "text": "1860+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/71k2m3FTEwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71QNRSCcyBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81jzNGQHCNL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81Fl-LhT8ZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81a2gXzMIcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71jAqxDN07L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71hTdGMSrbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/710sNfb8fSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71K8Hg59OKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/712J7MKoS0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71NcMCB-1ML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ro35mcrkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71-Eth6e6eL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71UY027Y91L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71uqyWYRs4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71K-Ca0e6pL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71BOZV9E+EL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71d2-ZaiQSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71BgUtwh5FL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81L32frEbmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71iyIkqAnyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71j14itOZzL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71H9FH7IyjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81PZoaI6kjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71sAoVTAXqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81agxKd0YbL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/71k2m3FTEwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71QNRSCcyBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81jzNGQHCNL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81Fl-LhT8ZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81a2gXzMIcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71jAqxDN07L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71hTdGMSrbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/710sNfb8fSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71K8Hg59OKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/712J7MKoS0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71NcMCB-1ML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ro35mcrkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71-Eth6e6eL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71UY027Y91L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71uqyWYRs4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71K-Ca0e6pL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71BOZV9E+EL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71d2-ZaiQSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71BgUtwh5FL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81L32frEbmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71iyIkqAnyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71j14itOZzL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71H9FH7IyjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81PZoaI6kjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71sAoVTAXqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81agxKd0YbL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Item model number ‏": "‎ PY1947",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ September 5, 2023",
    "ASIN ‏": "‎ B0CH9J8WWP",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#120,850 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #1,425 in Women's Casual Dresses",
    "Customer Reviews": "3.6 3.6 out of 5 stars (43)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Red",
      "Navy",
      "Khaki",
      "Black",
      "Coffee",
      "Green"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 3.6,
    "count": 43,
    "customers_say": "Customers find the dress perfect for Christmas time festivities and appreciate its style. The fit receives mixed feedback, with some finding it a perfect match while others say it runs small. The fabric and material quality also get mixed reviews - while some find the fabric soft, others say the material isn't the best, and opinions about comfort are divided. Generated from the text of customer reviews Select to learn more Style (10) Quality (5) Holiday appeal (4) Fit (13) Fabric softness (5) Material quality (5) Material comfort (3) 10 customers mention style, 9 positive, 1 negative 10 customers mention \"Style\" 9 positive 1 negative Customers find the dress super cute. \" ...I could say is I wish it was more tailored, but Other than that it’s super cute . \" Read more \" This dress is cute , but it was made inside out. The fluffy soft side is on the outside and the crisp patterned side is on the inside.... \" Read more \" Adorable dress , prefect for your Christmas time festivities! Nice quality! \" Read more \" Beautiful dress , but a little short and fit's a little small \" Read more 5 customers mention quality, 4 positive, 1 negative 5 customers mention \"Quality\" 4 positive 1 negative Customers find the dress to be of good quality. \" Adorable dress, prefect for your Christmas time festivities! Nice quality ! \" Read more \" I love a good flannel print and this dress was also comfortable. I’ve watched it and it’s held up well too. Great for the holidays! \" Read more \" Actually waaaay better quality than I expected. I ordered a size up and planned to tack it if need be but it fits well.... \" Read more \" ...is very noticeable when you look at the side and makes the dress look very cheaply made . \" Read more 4 customers mention holiday appeal, 4 positive, 0 negative 4 customers mention \"Holiday appeal\" 4 positive 0 negative Customers find the dress appealing for holiday occasions, with one mentioning it's perfect for holiday cards. \" ...I’ve watched it and it’s held up well too. Great for the holidays ! \" Read more \" I’m still undecided about this dress. It is the perfect Christmas plaid . It honestly fits me like a glove. The material is a little odd.... \" Read more \" Adorable dress, prefect for your Christmas time festivities ! Nice quality! \" Read more \" A heavier weight than you would expect. A great fit and perfect for holiday cards ! \" Read more 13 customers mention fit, 8 positive, 5 negative 13 customers mention \"Fit\" 8 positive 5 negative Customers have mixed opinions about the dress's fit, with some finding it perfect while others report it runs small and is too tight in the chest. \" A heavier weight than you would expect. A great fit and perfect for holiday cards! \" Read more \" Too tight in chest , too big in hips \" Read more \" Love this dress! Fabric is soft and not itchy, comfortable and fit tts \" Read more \" ...It is the perfect Christmas plaid. It honestly fits me like a glove . The material is a little odd.... \" Read more 5 customers mention fabric softness, 3 positive, 2 negative 5 customers mention \"Fabric softness\" 3 positive 2 negative Customers have mixed opinions about the dress's fabric softness, with some finding it very soft, while one customer describes it as almost like a plush blanket. \" While the fabric is very soft and the fit is nice, the plaid does not match from the front to the back.... \" Read more \" This dress is cute, but it was made inside out. The fluffy soft side is on the outside and the crisp patterned side is on the inside.... \" Read more \" Love this dress! Fabric is soft and not itchy, comfortable and fit tts \" Read more \" ...The material is a little odd. The outside is almost like a plush blanket and fuzzier than I was expecting.... \" Read more 5 customers mention material quality, 2 positive, 3 negative 5 customers mention \"Material quality\" 2 positive 3 negative Customers have mixed opinions about the dress's material quality, with several noting that it is not the best. \" ...It honestly fits me like a glove. The material is a little odd . The outside is almost like a plush blanket and fuzzier than I was expecting.... \" Read more \" ...It has lining and the fabric feels strong. \" Read more \" ...Disappointed as I love how dress fits and looks. Unfortunately material is not the best . \" Read more \" ... Thick material and great bargain. \" Read more 3 customers mention material comfort, 2 positive, 1 negative 3 customers mention \"Material comfort\" 2 positive 1 negative Customers have mixed opinions about the dress's material comfort, with some finding it comfortable while another customer mentions it being slightly itchy. \" I love a good flannel print and this dress was also comfortable . I’ve watched it and it’s held up well too. Great for the holidays! \" Read more \" ...When putting it on it gave me a boxy look. The material was slightly itchy but I did like how it looked and the color. \" Read more \" Love this dress! Fabric is soft and not itchy, comfortable and fit tts \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Great fit",
        "body": "Adorable dress, prefect for your Christmas time festivities! Nice quality! Read more",
        "author": "clittrell",
        "rating": 5.0,
        "date": "December 16, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Cute fall dress",
        "body": "Love this dress! Fabric is soft and not itchy, comfortable and fit tts Read more",
        "author": "Customer",
        "rating": 4.0,
        "date": "November 30, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Wanted to love it, but the pattern doesn’t line up at the sides.",
        "body": "I really wanted to love this dress! Where it fell down for me was the odd extra room in the hips and the fact that the patterns do not match up on the front and back at the side seam. It just didn’t have the quality look that I was hoping for. So back it went. Other than that, the fit was great and the quality of the fabric seemed like it would’ve washed well. I am 5’10” and the length was great on me. Read more",
        "author": "Bryn",
        "rating": 3.0,
        "date": "December 2, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "2.0 out of 5 stars Cute but didn’t love",
        "body": "I wanted to love this dress but it just had no shape to it. When putting it on it gave me a boxy look. The material was slightly itchy but I did like how it looked and the color. Read more",
        "author": "Reli Arnold",
        "rating": 2.0,
        "date": "August 23, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Super Cute",
        "body": "Adorable holiday outfit. Paired with a long coat and boots. A little small in the chest area, so I added a long sleeve underneath. Thick material and great bargain. Read more",
        "author": "Heather Domenico",
        "rating": 5.0,
        "date": "December 19, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "1.0 out of 5 stars Dress is made inside out out",
        "body": "This dress is cute, but it was made inside out. The fluffy soft side is on the outside and the crisp patterned side is on the inside. It’s supposed to be reversed. Read more",
        "author": "Beth Maroney",
        "rating": 1.0,
        "date": "October 19, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/8119phEW95L._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/81I0NCHuE0L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Perfect Fit for Petite Sizes – Stylish & Well Made!",
        "body": "I’m 5’1”, 120 lbs and ordered a Small – it fits perfectly! I can see why some mentioned it might feel itchy if worn alone, but with a long sleeve shirt underneath I didn’t notice any itchiness at all. The quality feels very well made, and I especially love that it’s not super long – such a rare find when you’re on the shorter side. Highly recommend! Read more",
        "author": "Amy",
        "rating": 5.0,
        "date": "September 26, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71zNGT4X1sL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/61peZvT7NSL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "4.0 out of 5 stars Outstanding for the holidays!",
        "body": "I’m still undecided about this dress. It is the perfect Christmas plaid. It honestly fits me like a glove. The material is a little odd. The outside is almost like a plush blanket and fuzzier than I was expecting. I had hopes it would feel more like wool/wool blend. The inside is soft and has a very textural feeling to me. Another reviewer actually said they felt like it was sewn inside-out. When/if I keep this and wear it, I will have on a blouse and tights so the inside won’t really be on my skin. The fact that it is such a perfect fit has me leaning towards keeping it. It was not overly expensive, so a couple uses out of it will make me feel like I got my money’s worth. Read more",
        "author": "S.Lang",
        "rating": 4.0,
        "date": "December 14, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71qE21OmrXL._SY88._SL1500_.jpg"
        ]
      }
    ]
  },
  "short_description": "Womens Dress Sleeveless is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.",
  "about_this_item": "Womens Dress Sleeveless is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.",
  "long_description": "Womens Dress Sleeveless is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Red, Navy, Khaki, Black, Coffee, Green. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Dress Sleeveless is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Red, Navy, Khaki, Black, Coffee, Green. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "c0b74cfc-aedb-48c8-b708-91d799ed9488",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c0b74cfc-aedb-48c8-b708-91d799ed9488/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c0b74cfc-aedb-48c8-b708-91d799ed9488/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/0935ce63-c45c-456f-8a91-23b11d5398e7.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "8b20f323-2b42-4c1b-b019-18616e2fffd8",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8b20f323-2b42-4c1b-b019-18616e2fffd8/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8b20f323-2b42-4c1b-b019-18616e2fffd8/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/0935ce63-c45c-456f-8a91-23b11d5398e7.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "47f3d23f-6cf2-4d5e-b9a3-be6592f6df68",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/47f3d23f-6cf2-4d5e-b9a3-be6592f6df68/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/47f3d23f-6cf2-4d5e-b9a3-be6592f6df68/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/0935ce63-c45c-456f-8a91-23b11d5398e7.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "000be915-6c26-4465-925c-83d4b89ec9da",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/000be915-6c26-4465-925c-83d4b89ec9da/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/000be915-6c26-4465-925c-83d4b89ec9da/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/0935ce63-c45c-456f-8a91-23b11d5398e7.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "e3349b68-70ad-4306-8fdf-41eee47c74b9",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e3349b68-70ad-4306-8fdf-41eee47c74b9/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e3349b68-70ad-4306-8fdf-41eee47c74b9/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/0935ce63-c45c-456f-8a91-23b11d5398e7.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "8b374515-f531-4848-b37c-865b1bc139ba",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8b374515-f531-4848-b37c-865b1bc139ba/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8b374515-f531-4848-b37c-865b1bc139ba/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/0935ce63-c45c-456f-8a91-23b11d5398e7.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "febe86b6-e070-459f-b1cd-87a4d3431019",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/febe86b6-e070-459f-b1cd-87a4d3431019/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/febe86b6-e070-459f-b1cd-87a4d3431019/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/0935ce63-c45c-456f-8a91-23b11d5398e7.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "dba8d1b7-6a15-4583-a907-729bc376fc9d",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/dba8d1b7-6a15-4583-a907-729bc376fc9d/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/dba8d1b7-6a15-4583-a907-729bc376fc9d/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/0935ce63-c45c-456f-8a91-23b11d5398e7.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "f70f6f2b-a48d-44bb-8a2e-6977a59d8751",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f70f6f2b-a48d-44bb-8a2e-6977a59d8751/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f70f6f2b-a48d-44bb-8a2e-6977a59d8751/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/0935ce63-c45c-456f-8a91-23b11d5398e7.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "4f8cb311-bdc3-42a3-9d42-aeb017e681da",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4f8cb311-bdc3-42a3-9d42-aeb017e681da/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4f8cb311-bdc3-42a3-9d42-aeb017e681da/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/0935ce63-c45c-456f-8a91-23b11d5398e7.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "4e10a276-3179-40ff-923a-11660fd8f3f5",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4e10a276-3179-40ff-923a-11660fd8f3f5/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4e10a276-3179-40ff-923a-11660fd8f3f5/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/0935ce63-c45c-456f-8a91-23b11d5398e7.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "023e8495-0cf9-4f9e-802b-3e2fe2553695",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/023e8495-0cf9-4f9e-802b-3e2fe2553695/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/023e8495-0cf9-4f9e-802b-3e2fe2553695/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/0935ce63-c45c-456f-8a91-23b11d5398e7.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Red": "https://m.media-amazon.com/images/I/41oVe0AqHTL._AC_SR38,50_.jpg",
    "Navy": "https://m.media-amazon.com/images/I/41jFeB7R3GL._AC_SR38,50_.jpg",
    "Khaki": "https://m.media-amazon.com/images/I/41nGXSseb1L._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/41Ybgqf0C9L._AC_SR38,50_.jpg",
    "Coffee": "https://m.media-amazon.com/images/I/41SVUwlI0EL._AC_SR38,50_.jpg",
    "Green": "https://m.media-amazon.com/images/I/41sLWNZojSL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Red": "71k2m3FTEwL",
    "Navy": "71jAqxDN07L",
    "Khaki": "712J7MKoS0L",
    "Black": "71UY027Y91L",
    "Coffee": "71d2-ZaiQSL",
    "Green": "71j14itOZzL"
  },
  "color_images": {
    "Red": [
      "https://m.media-amazon.com/images/I/71k2m3FTEwL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71QNRSCcyBL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81jzNGQHCNL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81Fl-LhT8ZL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81a2gXzMIcL._SL1500_.jpg"
    ],
    "Navy": [
      "https://m.media-amazon.com/images/I/71jAqxDN07L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71hTdGMSrbL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/710sNfb8fSL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71K8Hg59OKL._SL1500_.jpg"
    ],
    "Khaki": [
      "https://m.media-amazon.com/images/I/712J7MKoS0L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71NcMCB-1ML._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71ro35mcrkL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71-Eth6e6eL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/71UY027Y91L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71uqyWYRs4L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71K-Ca0e6pL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71BOZV9E+EL._SL1500_.jpg"
    ],
    "Coffee": [
      "https://m.media-amazon.com/images/I/71d2-ZaiQSL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71BgUtwh5FL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81L32frEbmL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71iyIkqAnyL._SL1500_.jpg"
    ],
    "Green": [
      "https://m.media-amazon.com/images/I/71j14itOZzL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71H9FH7IyjL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81PZoaI6kjL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71sAoVTAXqL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81agxKd0YbL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-one-shoulder-long-sleeve-maxi-formal",
      "title": "Womens Maxi Dress One Shoulder Long Sleeve Maxi Formal",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51osX5ku23L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 29.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/714NKRHRX2L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-sleeveless-formal-cocktail-v-neck-evening",
      "title": "Womens Maxi Dress Sleeveless Formal Cocktail V Neck Evening",
      "price": 72.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61q-2Wqi91L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail-bodycon-v-neck-sleeveless-ruched",
      "title": "Womens Dress Cocktail Bodycon V Neck Sleeveless Ruched",
      "price": 43.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51K9NAs7S1L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-long-sleeve",
      "title": "Womens Maxi Dress Cocktail Long Sleeve",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61rn8pl8A6L._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress-formal",
      "title": "Womens Dress Formal",
      "price": 74.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/517I6+Y980L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 10.95,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/81VSldp0TJL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 199.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/51rRJcl6flL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-v-neck-long-sleeve-bodycon",
      "title": "Womens Maxi Dress V Neck Long Sleeve Bodycon",
      "price": 30.59,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Sweaters > Pullovers",
      "images": [
        "https://m.media-amazon.com/images/I/71a0x4LTzmL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-ruched-bodycon-formal-cocktail-long-sleeve",
      "title": "Womens Maxi Dress Maxi Ruched Bodycon Formal Cocktail Long Sleeve",
      "price": 56.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/51HFt7oTd4L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-mermaid",
      "title": "Womens Maxi Dress Evening Mermaid",
      "price": 108.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51a9Odw5waL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail",
      "title": "Womens Dress Cocktail",
      "price": 34.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/81SP-ORh7dL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-sleeveless-cocktail-bodycon",
      "title": "Womens Dress Sleeveless Cocktail Bodycon",
      "price": 36.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61NaDgRQ-DL._SL1500_.jpg"
      ]
    }
  ]
}