{
  "id": "womens-maxi-dress-long-sleeve",
  "handle": "womens-maxi-dress-long-sleeve",
  "sku": "JC2119",
  "asin": "B0FV33JNJT",
  "title": "Womens Maxi Dress Long Sleeve",
  "title_original": "OFEEFAN Long Sleeve Dress for Women Crew Neck Tunic Dress with Pockets Decorative Buttons",
  "brand": "Visit the OFEEFAN Store",
  "price": 36.99,
  "social_proof": {
    "bought_past_month": 51,
    "text": "51+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/71We0qM+KKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/817PHX5rM-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71LM4b4XotL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71QdhbCZy+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81RzepC-A0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Vvszv95-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71XvkvgkwBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71uoHKVQa0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81Ws0NfYeAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71QD2lZZ3YL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/713ohM1VCtL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81v94l2IrNL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/8170+RyB0rL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71n6rnzXkAL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/71We0qM+KKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/817PHX5rM-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71LM4b4XotL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71QdhbCZy+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81RzepC-A0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Vvszv95-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71XvkvgkwBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71uoHKVQa0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81Ws0NfYeAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71QD2lZZ3YL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/713ohM1VCtL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81v94l2IrNL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/8170+RyB0rL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71n6rnzXkAL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ August 29, 2025",
    "ASIN ‏": "‎ B0FP4KFDWR",
    "Best Sellers Rank": "#26,780 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #218 in Women's Casual Dresses",
    "Customer Reviews": "4.4 4.4 out of 5 stars (153)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Red",
      "Brown Plaid",
      "Purple",
      "Dark Grey",
      "Black Blue",
      "Black",
      "Caramel",
      "Coffee",
      "Green",
      "Red Black Plaid"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.4,
    "count": 153,
    "customers_say": "Customers find the dress comfortable, beautiful, and well-made, with one mentioning it hits just above the knee. They appreciate its softness, feeling it like pajamas, and note it's not too heavy. The sizing receives mixed feedback - while some say it's true to size, others find it bigger than expected. The material thickness is a concern, with several customers noting it's thin. Generated from the text of customer reviews Select to learn more Fit (18) Comfort (16) Style (16) Quality (13) Softness (13) Material weight (7) Size (12) Material thickness (8) 18 customers mention fit, 14 positive, 4 negative 18 customers mention \"Fit\" 14 positive 4 negative Customers like how the dress fits, with one mentioning it's loose enough to wear a belt and another noting it hits just above the knee. \" Fits Perfectly im 5.5 Small very comfortable!! I'll wear this dress Often! \" Read more \" ...It turns out, I love it. The fit is very flattering , the black is a true black and it is very soft and a good value for the money.... \" Read more \" ...I am 5’4”, 134lbs and this dress hits me just above the knee . Wore it with black tights and 2” heal ankle boots. Received several compliments!... \" Read more \" Pretty fall dress. Good weight. Runs a bit big . \" Read more 16 customers mention comfort, 15 positive, 1 negative 16 customers mention \"Comfort\" 15 positive 1 negative Customers find the dress comfortable. \" ...Soft, comfortable . It has almost a lavender cast to it in different lights. Supposed to be brown but doesn't look brown to me. However, I love it \" Read more \" This dress is so comfy , feels like pajamas. Not the highest quality, for good quality. Perfect for a day of errands \" Read more \" ...I chose not to wear one and it was very comfortable . Would definitely recommend as it's very lightweight. \" Read more \" This dress is so comfortable ! I was pleasantly surprised at how nice this dress is for the price!♥️ \" Read more 16 customers mention style, 15 positive, 1 negative 16 customers mention \"Style\" 15 positive 1 negative Customers find the dress beautiful and love its color. \" This is a cute dress but the material is so thin that there’s no way I could where it in the fall/winter which is what I bought it for to pair with... \" Read more \" This dress is super cute ! I was pleasantly surprised by this dress. It fits well. If you like a snug fit I would order a size down.... \" Read more \" Cute . Love the button detail. Color is radiant. Wore for Christmas photos and loved it. Fits true to size. \" Read more \" Very nice , a little bigger than expected, but acceptable. Perfect length, very comfortable \" Read more 13 customers mention quality, 12 positive, 1 negative 13 customers mention \"Quality\" 12 positive 1 negative Customers find the dress to be of good quality. \" Great dress , perfect to size, warm \" Read more \" ...The material is soft, stretchy, warm, and good quality . Not see through and thick enough to keep a cold wind from getting through.... \" Read more \" Nice dress . True to size \" Read more \" Decent dress for the price. This is a perfect little dress to throw on with tights or boots for the fall and winter.... \" Read more 13 customers mention softness, 13 positive, 0 negative 13 customers mention \"Softness\" 13 positive 0 negative Customers love the softness of the dress, describing it as feeling like pajamas. \" ...The fit is very flattering, the black is a true black and it is very soft and a good value for the money. Recommend this to all.... \" Read more \" ... Soft , comfortable. It has almost a lavender cast to it in different lights. Supposed to be brown but doesn't look brown to me. However, I love it \" Read more \" This dress is so comfy, feels like pajamas . Not the highest quality, for good quality. Perfect for a day of errands \" Read more \" ...blue as described...Did not go with Navy nor Black leggings .the material was soft and comfortable \" Read more 7 customers mention material weight, 6 positive, 1 negative 7 customers mention \"Material weight\" 6 positive 1 negative Customers appreciate that the dress is not too heavy. \" 4 stars for light and a little bit of see through material. It would be a 10 star if the material was heavier.... \" Read more \" This dress feels like a good quality and I love the weight of the material . It's not too heavy but still wrinkle free and warm.... \" Read more \" ...The material is fairly lightweight so I don't think it will be too hot.... \" Read more \" ...Would definitely recommend as it's very lightweight . \" Read more 12 customers mention size, 8 positive, 4 negative 12 customers mention \"Size\" 8 positive 4 negative Customers have mixed opinions about the dress size, with some finding it true to size while others say it runs bigger than expected. \" True to size but the color was an off gray not black/ blue as described...Did not go with Navy nor Black leggings .the material was soft and... \" Read more \" Runs quite large ...returning item to get a smaller size. \" Read more \" Great dress, perfect to size , warm \" Read more \" ...Fits loosely, not snug, just as expected. True to size and color . Unfortunately though, it came with a hole in the pocket.... \" Read more 8 customers mention material thickness, 2 positive, 6 negative 8 customers mention \"Material thickness\" 2 positive 6 negative Customers find the material of the dress to be thin, with one customer noting it has a see-through quality. \" Sadly, I was disappointed with this dress. The material was thin and truly not comfortable on me. The other problem was it was way too short.... \" Read more \" This was a nice fit, but the material is very thin . \" Read more \" ...The material is soft, stretchy, warm, and good quality. Not see through and thick enough to keep a cold wind from getting through.... \" Read more \" This is a cute dress but the material is so thin that there’s no way I could where it in the fall/winter which is what I bought it for to pair with... \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Comfortable and cute fit",
        "body": "Comfortable and love the way it fits! Flattering to my plus sized curves and doesn't showcase my belly. The material is soft, stretchy, warm, and good quality. Not see through and thick enough to keep a cold wind from getting through. I love the style and bought another in black! Read more",
        "author": "Bonnie",
        "rating": 5.0,
        "date": "November 21, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Great dress! Love the softness of it!!",
        "body": "This dress is so comfortable! I was pleasantly surprised at how nice this dress is for the price!♥️ Read more",
        "author": "Annie Coyne",
        "rating": 5.0,
        "date": "November 21, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Great Product",
        "body": "Love the color and style. Side pockets and stops at the top of my knee. Not fitting at the waist, but not extremely full. Fabric is soft with a sweater like feel. The buttons on the side of the sleeves are wooden colored that adds a nice touch. Read more",
        "author": "Michelle Carson",
        "rating": 5.0,
        "date": "October 28, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Cute dress",
        "body": "Sleeves are quite long. On me. They were as long as my hands Read more",
        "author": "Leslie Schoenfeld",
        "rating": 4.0,
        "date": "October 15, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Great fit & quality",
        "body": "This dress feels like a good quality and I love the weight of the material. It's not too heavy but still wrinkle free and warm. I love the long sleeves and the fit is great. I'm 5'4\" and size Medium. Great dress, especially at this price. Recommend. Read more",
        "author": "Julianne",
        "rating": 5.0,
        "date": "November 15, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Something I would expect from a thrift store.",
        "body": "Cute dress. Very soft and comfy material. Fits loosely, not snug, just as expected. True to size and color. Unfortunately though, it came with a hole in the pocket. (Inside the pocket. Not where you can see it.) I didn’t buy it at a thrift store for $3, it’s not cheep and I expect more for what I payed. I called Amazon and requested a replacement, but they said that was not an option for this item. I gave it a 3 star because it frustrates me that I have to do work to fix their mistakes. Read more",
        "author": "HH4",
        "rating": 3.0,
        "date": "October 24, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Comfy, light and pockets!",
        "body": "Love the fit, it's comfy and it has pockets. Read more",
        "author": "Rosalinda",
        "rating": 5.0,
        "date": "November 22, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Soft, comfortable runs larger",
        "body": "It runs a little large but I love it It will have to be altered because sleeves cover my hands. Soft, comfortable. It has almost a lavender cast to it in different lights. Supposed to be brown but doesn't look brown to me. However, I love it Read more",
        "author": "K.J. S.",
        "rating": 5.0,
        "date": "October 9, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.",
  "about_this_item": "Womens Maxi Dress Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.",
  "long_description": "Womens Maxi Dress Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Red, Brown Plaid, Purple, Dark Grey, Black Blue, Black, Caramel, Coffee, Green, Red Black Plaid. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Red, Brown Plaid, Purple, Dark Grey, Black Blue, Black, Caramel, Coffee, Green, Red Black Plaid. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [],
  "color_swatches": {
    "Red": "https://m.media-amazon.com/images/I/31vw1jGgvwL._AC_SR38,50_.jpg",
    "Brown Plaid": "https://m.media-amazon.com/images/I/419s0HBmoRL._AC_SR38,50_.jpg",
    "Purple": "https://m.media-amazon.com/images/I/41DGjuxS8HL._AC_SR38,50_.jpg",
    "Dark Grey": "https://m.media-amazon.com/images/I/4107-VMv2gL._AC_SR38,50_.jpg",
    "Black Blue": "https://m.media-amazon.com/images/I/41Ij9XYCIrL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31vPu45LDqL._AC_SR38,50_.jpg",
    "Caramel": "https://m.media-amazon.com/images/I/41uDk12LbPL._AC_SR38,50_.jpg",
    "Coffee": "https://m.media-amazon.com/images/I/41DYhGqP9UL._AC_SR38,50_.jpg",
    "Green": "https://m.media-amazon.com/images/I/41ulNfkCv7L._AC_SR38,50_.jpg",
    "Red Black Plaid": "https://m.media-amazon.com/images/I/412GRMBzyOL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Red": "71We0qM+KKL",
    "Brown Plaid": "71Vvszv95-L",
    "Purple": "71XvkvgkwBL",
    "Dark Grey": "71uoHKVQa0L",
    "Black Blue": "81Ws0NfYeAL",
    "Black": "71QD2lZZ3YL",
    "Caramel": "713ohM1VCtL",
    "Coffee": "81v94l2IrNL",
    "Green": "8170+RyB0rL",
    "Red Black Plaid": "71n6rnzXkAL"
  },
  "color_images": {
    "Red": [
      "https://m.media-amazon.com/images/I/71We0qM+KKL._SL1500_.jpg"
    ],
    "Brown Plaid": [
      "https://m.media-amazon.com/images/I/71Vvszv95-L._SL1500_.jpg"
    ],
    "Purple": [
      "https://m.media-amazon.com/images/I/71XvkvgkwBL._SL1500_.jpg"
    ],
    "Dark Grey": [
      "https://m.media-amazon.com/images/I/71uoHKVQa0L._SL1500_.jpg"
    ],
    "Black Blue": [
      "https://m.media-amazon.com/images/I/81Ws0NfYeAL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/71QD2lZZ3YL._SL1500_.jpg"
    ],
    "Caramel": [
      "https://m.media-amazon.com/images/I/713ohM1VCtL._SL1500_.jpg"
    ],
    "Coffee": [
      "https://m.media-amazon.com/images/I/81v94l2IrNL._SL1500_.jpg"
    ],
    "Green": [
      "https://m.media-amazon.com/images/I/8170+RyB0rL._SL1500_.jpg"
    ],
    "Red Black Plaid": [
      "https://m.media-amazon.com/images/I/71n6rnzXkAL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress-cocktail-bodycon",
      "title": "Womens Dress Cocktail Bodycon",
      "price": 47.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61NfEwzl3xL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-one-shoulder-maxi-formal",
      "title": "Womens Maxi Dress Evening One Shoulder Maxi Formal",
      "price": 69.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/5150AIQL4eL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail",
      "title": "Womens Dress Cocktail",
      "price": 103.54,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61JApwce25L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-formal-bodycon-evening-sleeveless",
      "title": "Womens Maxi Dress Maxi Formal Bodycon Evening Sleeveless",
      "price": 61.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61s8qg6u1VL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 158.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71PmRANW40L._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress-bodycon-split-ruched-off-shoulder",
      "title": "Womens Dress Bodycon Split Ruched Off Shoulder",
      "price": 38.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/41JjYcPgcpL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 95.61,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Work",
      "images": [
        "https://m.media-amazon.com/images/I/71hVgSIB1jL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 138.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51PZNrlyY9L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-split-evening-formal",
      "title": "Womens Maxi Dress Split Evening Formal",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51BZ1BqPx8L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 65.97,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/81wr8PDg55L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-v-neck",
      "title": "Womens Dress V Neck",
      "price": 82.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/710bSTpZ9hL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 278.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/91YXeyW506L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening-long-sleeve",
      "title": "Womens Maxi Dress Formal Evening Long Sleeve",
      "price": 87.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61nnk+flvaL._SL1500_.jpg"
      ]
    }
  ]
}