{
  "id": "womens-dress-evening-one-shoulder-bodycon",
  "handle": "womens-dress-evening-one-shoulder-bodycon",
  "sku": "JC2803",
  "asin": "B0C9C9BDLF",
  "title": "Womens Dress Evening One Shoulder Bodycon",
  "title_original": "Wenrine Women's One Shoulder Velvet Dresses Slim Fitted Slit Faux Wrap Sexy Bodycon Evening Dress",
  "brand": "Visit the Wenrine Store",
  "price": 39.99,
  "social_proof": {
    "bought_past_month": 53,
    "text": "53+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/61oVfV66vuL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71RqvdE1q9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71NBjCzePuL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/711rtzqkAOL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81-+fv5OONL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61miKEKuy+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Y2YzOeHSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/713LoLE3U0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71jbLFXXiNL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81nUmuZEqBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/619AehFtTDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/719C2TXWXbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/716EbgO3H+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81VjSI+KQKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81HI4Bw0qxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61bcpojNHML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ctEudLdvL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Ws21oNSML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71k7yb3zvxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81ItaOvBZ1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51fgKqQCJTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71gqTveCqGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ARNtYkFdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71A7IN6XAYL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81NqRGH6WnL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/61oVfV66vuL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71RqvdE1q9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71NBjCzePuL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/711rtzqkAOL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81-+fv5OONL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61miKEKuy+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Y2YzOeHSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/713LoLE3U0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71jbLFXXiNL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81nUmuZEqBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/619AehFtTDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/719C2TXWXbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/716EbgO3H+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81VjSI+KQKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81HI4Bw0qxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61bcpojNHML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ctEudLdvL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Ws21oNSML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71k7yb3zvxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81ItaOvBZ1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51fgKqQCJTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71gqTveCqGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ARNtYkFdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71A7IN6XAYL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81NqRGH6WnL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Item model number ‏": "‎ H8B174",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ June 26, 2023",
    "ASIN ‏": "‎ B0DNMTJ75R",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#67,524 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #358 in Women's Club & Night Out Dresses",
    "Customer Reviews": "4.4 4.4 out of 5 stars (101)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Red",
      "Brown",
      "Navy",
      "Black",
      "Green"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.4,
    "count": 101,
    "customers_say": "Customers find the dress comfortable and flattering, with one noting it accentuates all the right places. Moreover, the dress receives positive feedback for its fit, quality, and value for money. However, the color accuracy receives mixed reviews, with some saying it matches the description while others disagree. Additionally, the fabric quality is also mixed, with some customers liking it while one describes it as slightly rough. Generated from the text of customer reviews Select to learn more Fit (19) Looks (17) Comfort (13) Quality (13) Flattering (6) Value for money (6) Color accuracy (8) Fabric quality (6) 19 customers mention fit, 18 positive, 1 negative 19 customers mention \"Fit\" 18 positive 1 negative Customers like how the dress fits. \" ...I’m normally a 6 and a medium but I got a small and it fits well . The ruching is flattering and the material is decently stretchy.... \" Read more \" ...some like sparkles behind which wad odd but other than that it was a good fit and if it was the color I wanted it'd would have perfect. \" Read more \" Dress fit great and was super comfortable! \" Read more \" Beautiful and comfortable! The dress is fitted yet has a nice stretch so it’s not too tight.... \" Read more 17 customers mention looks, 16 positive, 1 negative 17 customers mention \"Looks\" 16 positive 1 negative Customers find the dress stunning and expensive-looking, with one mentioning it accentuates all the right places, while another notes it's appealing for a winter wedding. \" ...It was flattering and classy ! I wore it to a wedding rehearsal dinner who requested semi-formal attire.... \" Read more \" Very cute dress and true to size! I originally ordered this for a wedding but ended up choosing a different dress.... \" Read more \" ...Under certain light it can look a little blue. Beautiful and easy to wear, one should is on the right and the faux wra goes towards the left \" Read more \" Love love love the dress!! Fitted on all the right places looks expensive and is really affordable. It feels good and there's no complains.... \" Read more 13 customers mention comfort, 13 positive, 0 negative 13 customers mention \"Comfort\" 13 positive 0 negative Customers find the dress comfortable, with one mentioning it allows them to sit in a bar height stool. \" I really enjoyed this dress. It was comfortable , stretchy (but not too lose), and very flattering. I got many compliments throughout the night!... \" Read more \" ...It was very comfortable and for someone younger would be a good value for the money. \" Read more \" Size guide is tts, material is so comfy , love this and can’t wait to wear it out. \" Read more \" Fits perfect! Very comfy ! \" Read more 13 customers mention quality, 12 positive, 1 negative 13 customers mention \"Quality\" 12 positive 1 negative Customers find the dress to be of good quality, with one customer noting it doesn't feel cheap at all. \" The dress was very well made and looked great. I wore this to a formal family wedding and it was comfortable and looked really nice.... \" Read more \" The dress is nice . I was expecting a different color. This is more of a blue color than a green, which is what I needed. \" Read more \" Love love love the dress !! Fitted on all the right places looks expensive and is really affordable. It feels good and there's no complains.... \" Read more \" ...The material was soft and did not feel cheap at all . I received many compliments at the wedding I attended in this dress! \" Read more 6 customers mention flattering, 6 positive, 0 negative 6 customers mention \"Flattering\" 6 positive 0 negative Customers find the dress flattering, with one mentioning it's forgiving for those with curves. \" ...It was comfortable, stretchy (but not too lose), and very flattering . I got many compliments throughout the night!... \" Read more \" ...This dress has stretch and is forgiving if you have curves. It was flattering and classy!... \" Read more \" ...The ruching is flattering and the material is decently stretchy. Not double lined or anything like that but quality for the price. \" Read more \" ...It is very flattering when on , and the slit adds a nice touch that makes it especially appealing for a winter wedding. Great quality and fit overall. \" Read more 6 customers mention value for money, 6 positive, 0 negative 6 customers mention \"Value for money\" 6 positive 0 negative Customers find the dress to be good value for money. \" ...The size was perfect as well. True to size. Stunning dress for the price . \" Read more \" ...Not double lined or anything like that but quality for the price . \" Read more \" I know the price point , but I was hoping for higher quality material.... \" Read more \" If you are looking for a great value for the money , this is the one! This dress has stretch and is forgiving if you have curves.... \" Read more 8 customers mention color accuracy, 5 positive, 3 negative 8 customers mention \"Color accuracy\" 5 positive 3 negative Customers have mixed opinions about the dress's color accuracy, with some finding it as described while others report it was not correct. \" Pros: The color is gorgeous . It isn’t rust, but a warm shade close to bronze rather than pumpkin.... \" Read more \" Wore to a gala, received many compliments. The green color is off from pictures but still happy with it. Very comfortable to move and dance it.... \" Read more \" Returned. Fabric is very cheap. Fit was ok. Color was as described . \" Read more \" Very comfortable. True to size great quality. Vibrant color . Flattering fit. \" Read more 6 customers mention fabric quality, 2 positive, 4 negative 6 customers mention \"Fabric quality\" 2 positive 4 negative Customers have mixed opinions about the fabric quality of the dress. \" Returned. Fabric is very cheap . Fit was ok. Color was as described. \" Read more \" Lovely material , thick enough doesn’t show panty lines. Hard to find formal dresses that aren’t too long.... \" Read more \" Velour was crushed where it was folded in the bag, very thin and looked very cheaply made. This dress was returned, However, the fit was good. \" Read more \" ...This is made from the shiny, synthetic velvet that junior and young adult dresses use. I am older and wanted a higher quality looking material.... \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Very cute dress for Winter Wedding",
        "body": "Very cute dress and true to size! I originally ordered this for a wedding but ended up choosing a different dress. It is very flattering when on, and the slit adds a nice touch that makes it especially appealing for a winter wedding. Great quality and fit overall. Read more",
        "author": "Lauren Buckley",
        "rating": 5.0,
        "date": "December 18, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Well made and looks great",
        "body": "The dress was very well made and looked great. I wore this to a formal family wedding and it was comfortable and looked really nice. True to size and doesn’t really wrinkle. Read more",
        "author": "Lauren",
        "rating": 5.0,
        "date": "November 6, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Good fit",
        "body": "I got a sixe XL, it fit well. It was more of an brunt orange color then brown tho. It did leave some like sparkles behind which wad odd but other than that it was a good fit and if it was the color I wanted it'd would have perfect. Read more",
        "author": "Viridiana Lemus",
        "rating": 3.0,
        "date": "September 24, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71e3GThPY3L._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/61GawqPev0L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "4.0 out of 5 stars Gorgeous color, fabric is slightly rough",
        "body": "Pros: The color is gorgeous. It isn’t rust, but a warm shade close to bronze rather than pumpkin. It works well with a variety of shades for accessories. The bodice fits perfectly with no bunching or pulling. I love the single shoulder design as I wanted to cover a surgical scar without looking dowdy. I was worried that the bow might be fussy, but it isn’t at all. Cons: The fabric is less soft than I expected. It’s much rougher than other cheap velvet garments I have bought online in past years, but the three velvet dresses I purchased this month were notably not velvety in texture. I’ve bought cheap velour throws that were softer. It’s not a problem for skin contact, but may be why the skirt of this dress doesn’t drape perfectly. The slightly rougher texture seems to cause the fabric to catch on itself where the sides of the skirt have an overlap to create the split. I adjusted the skirt and it would hang perfectly, but each time I moved, the draping snagged in a new spot. Overall: By far the best looking out of three similar velvet dresses that I tried in the same price range. The other two also had fabric with a rough texture, but also slight color inconsistencies. The color compensates for the texture and the draping issue for this dress will probably only be noticeable in photos. It would probably be even more gorgeous in black. Read more",
        "author": "Alicia M. Hall",
        "rating": 4.0,
        "date": "December 13, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Beautiful Dress!!!",
        "body": "Wore to a gala, received many compliments. The green color is off from pictures but still happy with it. Very comfortable to move and dance it. Highly recommend this dress for a nice/ fancy event. Read more",
        "author": "ju",
        "rating": 5.0,
        "date": "December 23, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Black and Classy!",
        "body": "If you are looking for a great value for the money, this is the one! This dress has stretch and is forgiving if you have curves. It was flattering and classy! I wore it to a wedding rehearsal dinner who requested semi-formal attire. The dress was very well made and comfortable for a long night. I could comfortably sit in a bar height stool and still be covered in all the right places. I think people of all sizes can pull this one off! Read more",
        "author": "Charlee Ann",
        "rating": 5.0,
        "date": "March 7, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Wow!",
        "body": "Couldn't have been more impressed with this dress. For someone who is very self-conscious of their midsection, this dress accentuated all the right places. I've never gotten so many compliments. I'm 5'3\", 135 lbs and ordered a medium. Read more",
        "author": "Chelsea De La Garza",
        "rating": 5.0,
        "date": "December 8, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71rKUdwTX1L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Great dress",
        "body": "Very comfortable. True to size great quality. Vibrant color. Flattering fit. Read more",
        "author": "Dodger Fam",
        "rating": 5.0,
        "date": "October 23, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Dress Evening One Shoulder Bodycon is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.",
  "about_this_item": "Womens Dress Evening One Shoulder Bodycon is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.",
  "long_description": "Womens Dress Evening One Shoulder Bodycon is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Red, Brown, Navy, Black, Green. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Dress Evening One Shoulder Bodycon is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Red, Brown, Navy, Black, Green. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "05c4aae9-20bb-45a6-a10a-e2108b8ec8ba",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/05c4aae9-20bb-45a6-a10a-e2108b8ec8ba/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/05c4aae9-20bb-45a6-a10a-e2108b8ec8ba/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "17023cef-b755-4c66-a19c-23ad66590ba7",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/17023cef-b755-4c66-a19c-23ad66590ba7/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/17023cef-b755-4c66-a19c-23ad66590ba7/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "6761c5f4-cf77-426f-869c-3c6e3bac32ed",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6761c5f4-cf77-426f-869c-3c6e3bac32ed/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6761c5f4-cf77-426f-869c-3c6e3bac32ed/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "5f26e7d4-4a5f-4518-bf7f-b6a3f75bc281",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5f26e7d4-4a5f-4518-bf7f-b6a3f75bc281/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5f26e7d4-4a5f-4518-bf7f-b6a3f75bc281/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "07847360-61dc-42d4-bc56-d5e489265a25",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/07847360-61dc-42d4-bc56-d5e489265a25/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/07847360-61dc-42d4-bc56-d5e489265a25/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "e95b8734-0ae2-48ee-9b5d-de4711ac3e2f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e95b8734-0ae2-48ee-9b5d-de4711ac3e2f/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e95b8734-0ae2-48ee-9b5d-de4711ac3e2f/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "e1f9bb51-b404-4acf-8e7d-5f0837029dea",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e1f9bb51-b404-4acf-8e7d-5f0837029dea/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e1f9bb51-b404-4acf-8e7d-5f0837029dea/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "9368570e-ffb6-4f57-827b-8c502fd74c80",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9368570e-ffb6-4f57-827b-8c502fd74c80/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9368570e-ffb6-4f57-827b-8c502fd74c80/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "b3ef5105-7927-425c-8580-b732a9af5c3b",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b3ef5105-7927-425c-8580-b732a9af5c3b/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b3ef5105-7927-425c-8580-b732a9af5c3b/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "52251cc8-06f3-49a3-a724-7b4fb1a9dd08",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/52251cc8-06f3-49a3-a724-7b4fb1a9dd08/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/52251cc8-06f3-49a3-a724-7b4fb1a9dd08/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "3e01ce80-1bb6-49bd-be12-a09c335cf524",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3e01ce80-1bb6-49bd-be12-a09c335cf524/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3e01ce80-1bb6-49bd-be12-a09c335cf524/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "db687e43-1a22-4616-a184-906dbf28ac7e",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/db687e43-1a22-4616-a184-906dbf28ac7e/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/db687e43-1a22-4616-a184-906dbf28ac7e/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Red": "https://m.media-amazon.com/images/I/31h3t615c9L._AC_SR38,50_.jpg",
    "Brown": "https://m.media-amazon.com/images/I/41ZhVdJDLdL._AC_SR38,50_.jpg",
    "Navy": "https://m.media-amazon.com/images/I/31OerKXPSCL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31uDWUlwn4L._AC_SR38,50_.jpg",
    "Green": "https://m.media-amazon.com/images/I/41bhmW+ZuAL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Red": "61miKEKuy+L",
    "Brown": "619AehFtTDL",
    "Navy": "61bcpojNHML",
    "Black": "51fgKqQCJTL",
    "Green": "61oVfV66vuL"
  },
  "color_images": {
    "Red": [
      "https://m.media-amazon.com/images/I/61miKEKuy+L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71Y2YzOeHSL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/713LoLE3U0L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71jbLFXXiNL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81nUmuZEqBL._SL1500_.jpg"
    ],
    "Brown": [
      "https://m.media-amazon.com/images/I/619AehFtTDL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/719C2TXWXbL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/716EbgO3H+L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81VjSI+KQKL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81HI4Bw0qxL._SL1500_.jpg"
    ],
    "Navy": [
      "https://m.media-amazon.com/images/I/61bcpojNHML._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71ctEudLdvL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71Ws21oNSML._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71k7yb3zvxL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81ItaOvBZ1L._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/51fgKqQCJTL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71gqTveCqGL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71ARNtYkFdL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71A7IN6XAYL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81NqRGH6WnL._SL1500_.jpg"
    ],
    "Green": [
      "https://m.media-amazon.com/images/I/61oVfV66vuL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71RqvdE1q9L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71NBjCzePuL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/711rtzqkAOL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81-+fv5OONL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress-split-sleeveless",
      "title": "Womens Dress Split Sleeveless",
      "price": 9.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61Bjb160OWL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-formal-long-sleeve",
      "title": "Womens Maxi Dress Evening Formal Long Sleeve",
      "price": 74.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/618+oXPMn5L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 55.3,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51vZsyftCnL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-bodycon",
      "title": "Womens Dress Bodycon",
      "price": 43.95,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61YjFG1hBeL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-off-shoulder-v-neck-formal",
      "title": "Womens Maxi Dress Evening Off Shoulder V Neck Formal",
      "price": 89.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71H1Q7tFSyL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-long-sleeve-mermaid",
      "title": "Womens Maxi Dress Long Sleeve Mermaid",
      "price": 129.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Wedding Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/515xYN8ieuL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-v-neck-sleeveless-bodycon-cocktail-ruched",
      "title": "Womens Dress V Neck Sleeveless Bodycon Cocktail Ruched",
      "price": 47.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61VDchNCZVL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-ruched-one-shoulder-formal-cocktail-bodycon-maxi",
      "title": "Womens Maxi Dress Ruched One Shoulder Formal Cocktail Bodycon Maxi",
      "price": 47.89,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/612sxL+Ey-L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-long-sleeve",
      "title": "Womens Maxi Dress Bodycon Long Sleeve",
      "price": 33.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/615f4ikn5fL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 43.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71ptIcXoLzL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-sleeveless-bodycon",
      "title": "Womens Dress Sleeveless Bodycon",
      "price": 19.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/918m917C4jL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi",
      "title": "Womens Maxi Dress Maxi",
      "price": 100.3,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51t4lk6vzyL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-short-sleeve-cocktail-off-shoulder",
      "title": "Womens Dress Short Sleeve Cocktail Off Shoulder",
      "price": 54.96,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/51su2B1tubL._SL1500_.jpg"
      ]
    }
  ]
}