{
  "id": "womens-maxi-dress-formal-maxi-evening-cocktail-bodycon-ruched",
  "handle": "womens-maxi-dress-formal-maxi-evening-cocktail-bodycon-ruched",
  "sku": "JC1121",
  "asin": "B0DCZJ53T9",
  "title": "Womens Maxi Dress Formal Maxi Evening Cocktail Bodycon Ruched",
  "title_original": "Atizon Elegant Ruched Bodycon Evening Dresses for Women Cocktail Party Formal Maxi Mermaid Dress",
  "brand": "Visit the Atizon Store",
  "price": 53.99,
  "social_proof": {
    "bought_past_month": 164,
    "text": "164+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/61FIQsn+WdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71YMCBb9z0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71zM-+xgD8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71VUZab0IpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61MUVNgzErL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71hjyJeOCJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71VVYXlRbaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71xj5Lqb7OL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61nRkMKGFJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71xCh7QUOYL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71HdD+10gaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ceSUVQZOL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61KlHA6x+tL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71mHCa5yEYL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71eV6MI5W9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71yAw0YlT3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61V6yio2--L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71iEtJyFrOL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71X8BRGFxqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/713pYaj6+gL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/61FIQsn+WdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71YMCBb9z0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71zM-+xgD8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71VUZab0IpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61MUVNgzErL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71hjyJeOCJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71VVYXlRbaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71xj5Lqb7OL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61nRkMKGFJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71xCh7QUOYL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71HdD+10gaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ceSUVQZOL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61KlHA6x+tL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71mHCa5yEYL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71eV6MI5W9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71yAw0YlT3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61V6yio2--L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71iEtJyFrOL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71X8BRGFxqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/713pYaj6+gL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Date First Available ‏": "‎ August 13, 2024",
    "ASIN ‏": "‎ B0DCZGCR5Q",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#90,013 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #1,220 in Women's Club & Night Out Dresses",
    "Customer Reviews": "4.4 4.4 out of 5 stars (248)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Dark Green",
      "Wine Red",
      "White",
      "Black",
      "Navy Blue"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.4,
    "count": 248,
    "customers_say": "Customers find this dress elegant, with one noting it makes them feel attractive, and many saying it looks expensive. The dress receives positive feedback for its perfect fit, comfortable stretchy material, and flattering ruched design that creates an hourglass shape. They appreciate its versatility as a wedding guest dress, particularly for fall events, and praise its nice material and emerald color. Generated from the text of customer reviews Select to learn more Elegance (56) Fit (35) Comfort (30) Flattering (25) Dress quality (15) Stretchiness (15) Material quality (12) Color (10) 56 customers mention elegance, 54 positive, 2 negative 56 customers mention \"Elegance\" 54 positive 2 negative Customers find the dress beautiful and of great quality, with one customer noting it looks expensive. \" Beautiful dress I worn it to a wedding and everybody loved it. Lots of compliments. \" Read more \" This dress is beautiful . It's a comfortable material with stretch, but it's not flattering for plus size women \" Read more \" Great dress for a great conservative wedding, could have went down a size. The dress is stretchy \" Read more \" ...It is comfortable, classy , fun! This 2 of 2 reviews I’ve ever written on Amazon, worth the extra few minutes! Recommend. \" Read more 35 customers mention fit, 32 positive, 3 negative 35 customers mention \"Fit\" 32 positive 3 negative Customers are satisfied with how the dress fits. \" Perfect fit and great price \" Read more \" This dress has high quality material and fit like a glove ! It was very comfortable and had nice stretch. Super flattering! \" Read more \" Fits well a good bargain for the price very pretty on \" Read more \" Loved this dress! So comfy and fit perfectly \" Read more 30 customers mention comfort, 30 positive, 0 negative 30 customers mention \"Comfort\" 30 positive 0 negative Customers find the dress comfortable, particularly noting the stretchy material, and one customer mentions it is very forgiving. \" So stretchy and comfortable . Wore to a black tie wedding while six months pregnant and could wear again when not. Very flattering \" Read more \" ...The color is a soft jade. Very comfortable and flattering. Im debating on removing one of the bottom ruffles just bc its a bit longer on me.... \" Read more \" ...This one has really nice material, and is comfy . True to size and does have some stretch. Really excellent quality for the price! Looks very high end \" Read more \" ...The material was stretchy so it was comfortable to wear all evening . \" Read more 25 customers mention flattering, 22 positive, 3 negative 25 customers mention \"Flattering\" 22 positive 3 negative Customers find the dress flattering, with individual reviews noting how it creates an hourglass shape and hugs the body in all the right places. \" ...The color is a soft jade. Very comfortable and flattering . Im debating on removing one of the bottom ruffles just bc its a bit longer on me.... \" Read more \" ...The color is a very nice emerald color and very flattering . \" Read more \" This dress is so flattering ! It hides ANY imperfections. When it arrives it won’t look great but as soon as you put it on it is an immediate wow!... \" Read more \" The most comfortable and flattering dress I own! 100/10 would recommend. Color and fabric are both fantastic.... \" Read more 15 customers mention dress quality, 13 positive, 2 negative 15 customers mention \"Dress quality\" 13 positive 2 negative Customers find the dress to be of good quality, particularly noting it works well as a wedding guest outfit, especially for fall events. \" The dress was okay but didn’t stand out in any particular way.... \" Read more \" Perfect for fall wedding \" Read more \" Favorite wedding guest dress ! Got so many compliments! Very sharp and classy! \" Read more \" 10/10 highly recommend! Perfect for any occasion ! The material is stretchy and gives you a hourglass shape. \" Read more 15 customers mention stretchiness, 14 positive, 1 negative 15 customers mention \"Stretchiness\" 14 positive 1 negative Customers like the dress's stretchiness. \" ...Fabric was great as well, lots of stretch and ruching. Received many compliments on this dress. Would definitely order again for another occasion. \" Read more \" So stretchy and comfortable. Wore to a black tie wedding while six months pregnant and could wear again when not. Very flattering \" Read more \" ...When i wear it- ill throw spanx on - it’s forgiving but stretchy . The color is a soft jade. Very comfortable and flattering.... \" Read more \" ...The material was stretchy so it was comfortable to wear all evening. \" Read more 12 customers mention material quality, 12 positive, 0 negative 12 customers mention \"Material quality\" 12 positive 0 negative Customers like the material of the dress. \" Obsessed! I will be getting it in more colors! Thick, great material . 5'10, 165 lbs, and a size small was perfect! \" Read more \" Dress material is thick and comfy. Fits really well \" Read more \" ... Fabric was great as well, lots of stretch and ruching. Received many compliments on this dress. Would definitely order again for another occasion. \" Read more \" So flattering and the fabric is not cheap at all . Great length for wedding guest dress. \" Read more 10 customers mention color, 7 positive, 3 negative 10 customers mention \"Color\" 7 positive 3 negative Customers like the dress's color, describing it as a very nice emerald shade. \" Wore to an out door wedding venue, the green is beautiful . \" Read more \" Yes I received lots of compliments and looks!. True to size. Gorgeous blue \" Read more \" ...It does have a purple undertone which I didnt care for. It's not a true white , but it fit wonderfully. Its sheer, but not see through. Great stretch!... \" Read more \" ...The color is a soft jade . Very comfortable and flattering. Im debating on removing one of the bottom ruffles just bc its a bit longer on me.... \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars BUY THIS DRESS",
        "body": "I bought this as a wedding guest for a black tie wedding, it looks expensive, fits perfectly and its so stretchy and comfortable. I love this dress. Read more",
        "author": "Ashlie",
        "rating": 5.0,
        "date": "November 24, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Great dress!",
        "body": "Love it! It does have a purple undertone which I didnt care for. It's not a true white, but it fit wonderfully. Its sheer, but not see through. Great stretch! I need it in other colors. Read more",
        "author": "Millie Zaranyika",
        "rating": 5.0,
        "date": "December 21, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71QmtG9yelL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars winner winner chicken dinner",
        "body": "so i ordered 3 dresses hoping maybe one would look good. last minute, the black tie wedding was in 3 days. this dress ended up being my pick. it is SO comfortable. just felt like wearing a comfy long fitted tee or something. it's just cool and different. i went with this one cause i didn't need to get it shortened. and also cause it was the most comfy. the sheer is great. if you're a shorty like me, it's not fully the best for pics. if you take a pic in it, just make sure you accentuate your curves:) lots of compliments. i could not have been happier with it!! very glad that it's now a part of my wardrobe. Read more",
        "author": "Nina B. Gettes",
        "rating": 5.0,
        "date": "November 2, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61kvmWAwwXL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/61m8jCkqlQL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/61Ts7Fa7N7L._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71FoNti1uBL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars This is a wow dress",
        "body": "This dress is so flattering! It hides ANY imperfections. When it arrives it won’t look great but as soon as you put it on it is an immediate wow! Would purchase again! Read more",
        "author": "Customer",
        "rating": 5.0,
        "date": "November 2, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Seems to be true to size!",
        "body": "Nice sizing and fit. Beautiful material. More of a Teal Jade than Emerald I thought it would be, but still very pretty. I paid about $50 which is high in comparison to other dresses I’ve purchased with similar material/design,but I needed it for an event, otherwise would have waited for the price to come down. 3.5-4stars Water from being outside all day during our school’s annual Pumpkin Run. Purchased to be a citizen of the Emerald City. Read more",
        "author": "DIANA",
        "rating": 3.0,
        "date": "November 9, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/81Yn-VgaLdL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "4.0 out of 5 stars Excellent quality for the price",
        "body": "I love this dress and it fits perfect. It's soft and comfortable. It's stretches with your body. Read more",
        "author": "Customer",
        "rating": 4.0,
        "date": "February 8, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Beautiful dress.",
        "body": "This is a very elegant dress. It fits great and it’s comfortable. It makes a person look thinner as well. Read more",
        "author": "Customer",
        "rating": 5.0,
        "date": "October 29, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Dress is decent",
        "body": "It is good Read more",
        "author": "Nisypop 13",
        "rating": 5.0,
        "date": "November 24, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Formal Maxi Evening Cocktail Bodycon Ruched is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.",
  "about_this_item": "Womens Maxi Dress Formal Maxi Evening Cocktail Bodycon Ruched is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.",
  "long_description": "Womens Maxi Dress Formal Maxi Evening Cocktail Bodycon Ruched is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Dark Green, Wine Red, White, Black, Navy Blue. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Formal Maxi Evening Cocktail Bodycon Ruched is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Dark Green, Wine Red, White, Black, Navy Blue. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "c210d5bf-12f2-46be-9c8a-27950855e07b",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c210d5bf-12f2-46be-9c8a-27950855e07b/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c210d5bf-12f2-46be-9c8a-27950855e07b/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "f0a77b4b-2e10-45d4-9a09-9a3ef3279c08",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f0a77b4b-2e10-45d4-9a09-9a3ef3279c08/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f0a77b4b-2e10-45d4-9a09-9a3ef3279c08/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "deb8c70a-5a6f-48c8-8a86-73e990a042be",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/deb8c70a-5a6f-48c8-8a86-73e990a042be/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/deb8c70a-5a6f-48c8-8a86-73e990a042be/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "e10188b1-7ed2-4449-aa6d-03405286c4aa",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e10188b1-7ed2-4449-aa6d-03405286c4aa/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e10188b1-7ed2-4449-aa6d-03405286c4aa/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "48447d17-175d-4e16-9b4f-fab18c37fb83",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/48447d17-175d-4e16-9b4f-fab18c37fb83/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/48447d17-175d-4e16-9b4f-fab18c37fb83/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "3cb10bb5-efa8-48e7-baca-072c0700686e",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3cb10bb5-efa8-48e7-baca-072c0700686e/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3cb10bb5-efa8-48e7-baca-072c0700686e/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "40f3cfdc-e1ef-4242-914f-67b8a6613e8a",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/40f3cfdc-e1ef-4242-914f-67b8a6613e8a/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/40f3cfdc-e1ef-4242-914f-67b8a6613e8a/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "f3e91e31-f44c-4fd3-b1d8-4a7440aecae1",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f3e91e31-f44c-4fd3-b1d8-4a7440aecae1/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f3e91e31-f44c-4fd3-b1d8-4a7440aecae1/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "5b82feb3-68c6-4dc4-881a-239123512932",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5b82feb3-68c6-4dc4-881a-239123512932/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5b82feb3-68c6-4dc4-881a-239123512932/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "d90f737e-a2eb-47be-956c-c054e1518ab3",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d90f737e-a2eb-47be-956c-c054e1518ab3/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d90f737e-a2eb-47be-956c-c054e1518ab3/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "9a797fe2-f824-4d22-8399-cf72ddd1cbe7",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9a797fe2-f824-4d22-8399-cf72ddd1cbe7/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9a797fe2-f824-4d22-8399-cf72ddd1cbe7/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "d4b2478b-5ea6-45c2-b0dc-6c09fe66563e",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d4b2478b-5ea6-45c2-b0dc-6c09fe66563e/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d4b2478b-5ea6-45c2-b0dc-6c09fe66563e/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Dark Green": "https://m.media-amazon.com/images/I/31mqoNIH1LL._AC_SR38,50_.jpg",
    "Wine Red": "https://m.media-amazon.com/images/I/317mwVs8rSL._AC_SR38,50_.jpg",
    "White": "https://m.media-amazon.com/images/I/31veW+3BeOL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31yysHODu0L._AC_SR38,50_.jpg",
    "Navy Blue": "https://m.media-amazon.com/images/I/31ZDWt0GCGL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Dark Green": "61MUVNgzErL",
    "Wine Red": "61nRkMKGFJL",
    "White": "61KlHA6x+tL",
    "Black": "61FIQsn+WdL",
    "Navy Blue": "61V6yio2--L"
  },
  "color_images": {
    "Dark Green": [
      "https://m.media-amazon.com/images/I/61MUVNgzErL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71hjyJeOCJL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71VVYXlRbaL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71xj5Lqb7OL._SL1500_.jpg"
    ],
    "Wine Red": [
      "https://m.media-amazon.com/images/I/61nRkMKGFJL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71xCh7QUOYL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71HdD+10gaL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71ceSUVQZOL._SL1500_.jpg"
    ],
    "White": [
      "https://m.media-amazon.com/images/I/61KlHA6x+tL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71mHCa5yEYL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71eV6MI5W9L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71yAw0YlT3L._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/61FIQsn+WdL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71YMCBb9z0L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71zM-+xgD8L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71VUZab0IpL._SL1500_.jpg"
    ],
    "Navy Blue": [
      "https://m.media-amazon.com/images/I/61V6yio2--L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71iEtJyFrOL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71X8BRGFxqL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/713pYaj6+gL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-formal-short-sleeve",
      "title": "Womens Maxi Dress Formal Short Sleeve",
      "price": 74.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61+9wlrmMfL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-formal-evening",
      "title": "Womens Maxi Dress Long Sleeve Formal Evening",
      "price": 84.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/81CsI4q6KXL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-v-neck-cocktail-long-sleeve",
      "title": "Womens Maxi Dress V Neck Cocktail Long Sleeve",
      "price": 42.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71rt9J0Y2tL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-sleeveless-v-neck",
      "title": "Womens Dress Sleeveless V Neck",
      "price": 12.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/815jjeATxuL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-split-cocktail",
      "title": "Womens Dress Split Cocktail",
      "price": 44.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61OgZnIb96L._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-bodycon-long-sleeve",
      "title": "Womens Maxi Dress Bodycon Long Sleeve",
      "price": 37.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71aSg8G5uwL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-maxi-bodycon",
      "title": "Womens Maxi Dress Long Sleeve Maxi Bodycon",
      "price": 39.97,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51KrRZOevJL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 568.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71q84fXVudL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 29.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/615tNO0Gy2L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-v-neck-long-sleeve-formal-maxi",
      "title": "Womens Maxi Dress V Neck Long Sleeve Formal Maxi",
      "price": 56.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71GACW7ZGeL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-short-sleeve",
      "title": "Womens Dress Short Sleeve",
      "price": 27.58,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61wgoeEWaML._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-sleeveless-cocktail-maxi",
      "title": "Womens Maxi Dress Sleeveless Cocktail Maxi",
      "price": 57.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51KBy6HsbSL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-sleeveless",
      "title": "Womens Dress Sleeveless",
      "price": 27.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/714+pDb6hQL._SL1500_.jpg"
      ]
    }
  ]
}