{
  "id": "womens-maxi-dress-off-shoulder-bodycon-evening-long-sleeve-formal",
  "handle": "womens-maxi-dress-off-shoulder-bodycon-evening-long-sleeve-formal",
  "sku": "JC3153",
  "asin": "B09JRW3FQR",
  "title": "Womens Maxi Dress Off Shoulder Bodycon Evening Long Sleeve Formal",
  "title_original": "YMDUCH Women's Sexy Elegant Long Sleeve Off Shoulder Bodycon Long Evening Formal Dress",
  "brand": "Visit the YMDUCH Store",
  "price": 55.99,
  "social_proof": {
    "bought_past_month": 1037,
    "text": "1037+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/61JH8Uav-aL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81-1010mOjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91CYmpFaHjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81pUPm0xzzL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61U88cRp-dL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81-KCfYUqHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Mj06N6z1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81RP9PXYJwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71A1ib4ZSdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61lrXVo79KL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61b4b43URDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61onoX07kaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ZKeBQaTLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61VsiH4cJJL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/61JH8Uav-aL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81-1010mOjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91CYmpFaHjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81pUPm0xzzL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61U88cRp-dL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81-KCfYUqHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Mj06N6z1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81RP9PXYJwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71A1ib4ZSdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61lrXVo79KL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61b4b43URDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61onoX07kaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ZKeBQaTLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61VsiH4cJJL._SL1500_.jpg"
  ],
  "aplus_images": [
    "https://m.media-amazon.com/images/I/31%2B-Fd8dFHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31BCQRw0WSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31ZAEWslNeL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31s%2BPsBOTtL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/3167ljMV2kL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31fYBgez9fL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/318NhRc3iaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31pBUmaNdvL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31vRdcSitnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31qpCLEjzeL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31uFq52Ik%2BL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31mK1UGKWBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31kQ7RmhYJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31fk48IRA4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31Y%2BsE936DL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31yPtkIER6L._SL1500_.jpg"
  ],
  "description_images": [
    "https://m.media-amazon.com/images/I/31%2B-Fd8dFHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31BCQRw0WSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31ZAEWslNeL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31s%2BPsBOTtL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/3167ljMV2kL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31fYBgez9fL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/318NhRc3iaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31pBUmaNdvL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31vRdcSitnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31qpCLEjzeL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31uFq52Ik%2BL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31mK1UGKWBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31kQ7RmhYJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31fk48IRA4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31Y%2BsE936DL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31yPtkIER6L._SL1500_.jpg"
  ],
  "bullets": [],
  "specs": {
    "Item model number ‏": "‎ YM133",
    "Department ‏": "‎ Women",
    "Date First Available ‏": "‎ October 19, 2021",
    "ASIN ‏": "‎ B09JS3MBBM",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#16,209 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #240 in Women's Dresses",
    "Customer Reviews": "4.2 4.2 out of 5 stars (2,995)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Red",
      "Winered",
      "Navy",
      "Royal Blue",
      "Black",
      "Green"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.2,
    "count": 2995,
    "customers_say": "Customers find the dress chic and expensive-looking, with thick scuba material that's comfortable enough for dancing all night. The dress is flattering for curvy figures, accentuating all curves, and one customer notes it feels like an expensive quality gown. The length receives mixed feedback - while it's great with heels, some find it runs a little long. Generated from the text of customer reviews Select to learn more Elegance (348) Fit (341) Quality (222) Material quality (211) Comfort (129) Flattering (114) Stretchiness (94) Length (122) 348 customers mention elegance, 323 positive, 25 negative 348 customers mention \"Elegance\" 323 positive 25 negative Customers find the dress elegant, describing it as chic and sexy, with several noting it looks expensive. \" Its was absolutely beautiful dress . Perfect lenght but a little wide on the shoulders. It stretches great also. So I could of gone a size smaller.... \" Read more \" ...To summarize, this dress is very hit-or-miss. It's beautiful and elegant in the pictures but doesn't always live up to the advertised look once it's... \" Read more \" Tried it on & it is soooo elegant great material thick But not too heavy! Purchased for my niece’s formal wedding cannot wait to wear.... \" Read more \" ...If you want classy , comfortable, affordable, then this is the dress. I wore it to a Black and White Ball, and I got compliments the entire night.... \" Read more 341 customers mention fit, 285 positive, 56 negative 341 customers mention \"Fit\" 285 positive 56 negative Customers like how the dress fits, with one mentioning it accommodates all body curves. \" ...Ansolutely perfect fit , no wrinkling no need to iron ahead of time. I am not a curvy shape, but this really brought an hour glass shape to my body.... \" Read more \" ...Also, it fit perfectly and no alternations were required. I am only 5'2 so I usually need all my evening gowns hemmed, but not this one. \" Read more \" Even better than expected!! Fit perfect ! Great amount of stretch! Fabric was thicker than expected but worked perfectly. No need for bra or panties!... \" Read more \" I am 5’3” & 198 lbs. I ordered this in a large and it fit like a glove . Hugs the body in all the right places, quality durable material, & under $50. \" Read more 222 customers mention quality, 210 positive, 12 negative 222 customers mention \"Quality\" 210 positive 12 negative Customers praise the dress's quality, describing it as fantastic and incredible, with one customer noting it feels like an expensive gown. \" Great dress , perfect for attending a black tie winter wedding. I am 5’10” 178 lbs athletic build ordered an XL in hopes it would be long enough.... \" Read more \" Great quality and thickness! Fits all the curves in just the right places! Super comfy and easy to adjust sleeves and shoulders the way you want.... \" Read more \" This dress is so sexy and perfect , that I had to buy it in another color \" Read more \" Love this dress … I needed ones size larger to be comfortable. \" Read more 211 customers mention material quality, 165 positive, 46 negative 211 customers mention \"Material quality\" 165 positive 46 negative Customers like the dress's material, noting it is nice, thick, and forgiving, with one customer mentioning it is breathable. \" The fact that this dress is 53 dollars is insane!! The material is thick but not too thick, the neckline falls perfectly, and it’s exactly like the... \" Read more \" Just AMAZING. Thick material , bought it to wear for a wedding (I’ll post more pictures soon!) but this is the try on. Fits perfectly all around!... \" Read more \" Great material and overall look. My hips weren't wide enough to look flattering though. \" Read more \" Cheap fabric and does not look like in the pictures \" Read more 129 customers mention comfort, 125 positive, 4 negative 129 customers mention \"Comfort\" 125 positive 4 negative Customers find the dress comfortable, with some mentioning they can dance all night in it. \" Great fit, great quality of dress i was comfortable and will wear the dress again. I reached many compliments on i how beautiful I look in dress \" Read more \" ...It was a bit long but with wedges it didn’t bother. It was very comfortable and not too hot but the dress was very well made.... \" Read more \" ...This dress was amazing it was so comfortable it was extremely flattering true to size, and just didn't make me feel like I was in a formal.... \" Read more \" ...I’m 5’9” 163lb, I purchased the large. It fit perfectly. It’s super comfortable and stretchy but doesn’t lose fit or form the longer you wear it.... \" Read more 114 customers mention flattering, 104 positive, 10 negative 114 customers mention \"Flattering\" 104 positive 10 negative Customers find the dress flattering, particularly noting how it accentuates and displays their curves in a beautiful way. \" LOVED LOVED LOVED this dress for a gala I attended. It’s very flattering , and classy, and hugged my curves in all the right places, but wasn’t tight.... \" Read more \" This dress is very pretty. The material is very nice, and it's mostly flattering . The off-shoulder part was weird and didn't lay right at all on me.... \" Read more \" ...This dress is super flattering and very pretty on. I would d definitely suggest buying, it fit very well I’m 5’4 135lbs, purchased a medium.... \" Read more \" This dress is so flattering ! Thick fabric that hangs just right, soft and flowy. I wore this to the Nutcracker Ballet and it worked out wonderfully.... \" Read more 94 customers mention stretchiness, 84 positive, 10 negative 94 customers mention \"Stretchiness\" 84 positive 10 negative Customers appreciate the dress's stretchiness, noting that it is made with a thicker material and is comfortable to wear. \" ...The fabric is substantial and stretchy but also very tight. The fabric itself is comfy but I find the dress wanted to continually shift and ride up.... \" Read more \" This dress fits like a glove,‘it’s very stretchy and I was able to put it on without unzipping it. I am 5ft 150 pounds and bought a medium.... \" Read more \" ...This was perfect. It isn't sheer at all, the fabric is stretchy , & it held up wonderfully to a night of dancing. Would definitely purchase again! \" Read more \" This dress is everything!! It fits like a glove. Super stretchy but form fitting in all the right places.... \" Read more 122 customers mention length, 64 positive, 58 negative 122 customers mention \"Length\" 64 positive 58 negative Customers have mixed opinions about the dress's length, with some finding it perfect while others say it runs a little long, particularly noting that the sleeves are longer than expected. \" ...It hugs all the right places & is the perfect length . I’m 5’3” 135lbs & size small fit like a glove. I definitely do not regret this buy. \" Read more \" This was not flattering on me at all. It’s too long , hugs in the wrong spots. The color was pretty and I actually didn’t mind the fabric itself.... \" Read more \" ...The length was perfect , as I am 5'9\" and weigh 260. I received several compliments and think you'll be very pleased with purchasing. \" Read more \" ...of complements throughout the night however this dress is heavy and very long , it also didn't give me the elegant feel while I had it on even though... \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Great quality/Nice fabric/Crazy low price",
        "body": "First of all, I was impressed with the high quality fabric. It's the perfect weight and has a nice stretch. This dress is unbelievable for the cost!!! I ordered this and am Xscape dress to try for an upcoming ball. The Xscape dress was crazy flattering and won hands down. HOWEVER, i'm not returning this gown because it also looked great! Plus, it's an insane bargain! I think the top looked best pulled down on both shoulders. i loved the mermaid look at the bottom of the dress. This dress would pack easy and would be perfect for a formal night on a cruise, etc. I kept it because you never know when you might need a formal gown and I couldn't justify returning this beautiful bargain gown. Also, it's very form fitting, but is the kind of dress that I know I'll still be able to wear when I lose weight because the fabric is stretchy and allows you to bunch it up to create a nice illusion to flatter your tummy. If I wouldn't have ordered the Xscape dress that was super flattering, I absolutely would have felt great wearing this dress to a ball. I really cannot believe how great the quality is for this low price! LOVE it! Read more",
        "author": "M. Smith",
        "rating": 5.0,
        "date": "February 23, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Great dress - size details here",
        "body": "This dress is beautiful. I ordered 3 to ensure I got the size right. I am 5’9 175 with a smaller chest and larger bottom. It suggested the large was the right size for me - it was very form fitting - which I don’t love. The XL was very roomy and comfortable and just left me feeling more comfortable - I did still wear spanx (just my comfort zone). If you are comfortable and confident with your body, order the suggested size. If you are less comfortable or like a roomier fit, size up. Oddly, the green came with a zipper in the back (xl). The blue (l and xl) did not. It wasn’t needed due to the wide neck - just stepped right in. The material is very thick so covers problem areas. Length was amazing - plenty of length for heels if you want or it liked great dragging a bit. Exceptional dress for a great price! Read more",
        "author": "Amelia V",
        "rating": 5.0,
        "date": "November 6, 2024",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Wonderful Dreas",
        "body": "This dress was perfect. The fabric was nice and it fits perfectly. Read more",
        "author": "Yancy Freeman",
        "rating": 5.0,
        "date": "November 28, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Show stopper",
        "body": "This dress is stunning. I'm 5\"3 with narrow waist and curvy hips and ordered based on hip measurements. I did have to have it tailored because it was too long and too much fabric on top. Absolutely worth it though! I received many compliments. I did take one star off because although the fabric is thick and feels great, it snags incredibly easily. I'll likely only get a few wears out of it before it's too snagged. Also the dye bleeds badly. I had a French manicure for the formal event and my hands and nails were completely black by the end of the night. It was quite embarrassing. Read more",
        "author": "grace",
        "rating": 4.0,
        "date": "December 21, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71ZT+DBr1DL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Buy the dress!!",
        "body": "Buy this dress! I needed a dress for a wedding and was hesitant to order this one, but super glad I did! I’m 5’9” 163lb, I purchased the large. It fit perfectly. It’s super comfortable and stretchy but doesn’t lose fit or form the longer you wear it. I wore a 1” heel, the length was perfect with that heel. Read more",
        "author": "Customer",
        "rating": 5.0,
        "date": "November 23, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71mbT5Dd7yL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Beautiful",
        "body": "This dress was so elegant. Everyone made great compliments. This dress has the perfect material for the fall weather. Covers your feet. Peers well with heels or flats. For extra support and warmth, i wore a highwasted seamless shaping legging under it. Flattened and shaped all the right places. This dress is great for the big arm girlies, comfortable to. Read more",
        "author": "Marsha",
        "rating": 5.0,
        "date": "November 5, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71T7kphYlPL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71XgAZVbZhL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71WRsbfxgkL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "3.0 out of 5 stars Weird cut on bottom and, most importantly, USED.",
        "body": "I loved the color, and it was solid, thick material. I did try one of the two that was sent me on and it had a weird cut toward the bottom. However, BOTH of the \"new\" dresses that were sent to me were very clearly used. One had cat scratches and cat hair all over it, and the other had deodorant stains and was inside out. It's a shame I now have to go to one of the drop off spots because they keep sending me used things. I had 7 things shipped, and of those, ONE was new. You can tell because they now send it back directly in the plastic bags people return them in. Gross and lazy. Read more",
        "author": "KC",
        "rating": 3.0,
        "date": "November 12, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Beautiful, classy, sophisticated",
        "body": "This dress is beautiful! Drapes nicely, very figure flattering and I love the weight of the fabric. I purchased one in black and one in red. I’m 6’ tall and the length is perfect for me. You cannot beat this gown for the price - it is classy, sophisticated, elegant and complimentary to most figures. Read more",
        "author": "Amazonian",
        "rating": 5.0,
        "date": "December 11, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Off Shoulder Bodycon Evening Long Sleeve Formal is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.",
  "about_this_item": "Womens Maxi Dress Off Shoulder Bodycon Evening Long Sleeve Formal is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.",
  "long_description": "Womens Maxi Dress Off Shoulder Bodycon Evening Long Sleeve Formal is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Red, Winered, Navy, Royal Blue, Black, Green. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Off Shoulder Bodycon Evening Long Sleeve Formal is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/31%2B-Fd8dFHL._SL1500_.jpg",
      "alt": "Womens Maxi Dress Off Shoulder Bodycon Evening Long Sleeve Formal details image 1"
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/31BCQRw0WSL._SL1500_.jpg",
      "alt": "Womens Maxi Dress Off Shoulder Bodycon Evening Long Sleeve Formal details image 2"
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/31ZAEWslNeL._SL1500_.jpg",
      "alt": "Womens Maxi Dress Off Shoulder Bodycon Evening Long Sleeve Formal details image 3"
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/31s%2BPsBOTtL._SL1500_.jpg",
      "alt": "Womens Maxi Dress Off Shoulder Bodycon Evening Long Sleeve Formal details image 4"
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Red, Winered, Navy, Royal Blue, Black, Green. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/3167ljMV2kL._SL1500_.jpg",
      "alt": "Womens Maxi Dress Off Shoulder Bodycon Evening Long Sleeve Formal details image 5"
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "73e60404-a451-4c31-8336-58eac95d2007",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/73e60404-a451-4c31-8336-58eac95d2007/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/73e60404-a451-4c31-8336-58eac95d2007/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "66f29aba-8b36-49ab-b447-a12468d381b4",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/66f29aba-8b36-49ab-b447-a12468d381b4/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/66f29aba-8b36-49ab-b447-a12468d381b4/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "f898d519-7a03-4681-a18f-cfdf4811bcfa",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f898d519-7a03-4681-a18f-cfdf4811bcfa/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f898d519-7a03-4681-a18f-cfdf4811bcfa/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "f75f6936-6f0b-4674-be27-b0bbc771ef4e",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f75f6936-6f0b-4674-be27-b0bbc771ef4e/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f75f6936-6f0b-4674-be27-b0bbc771ef4e/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "b4161ab3-d49e-49ee-9679-bc39989f825d",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b4161ab3-d49e-49ee-9679-bc39989f825d/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b4161ab3-d49e-49ee-9679-bc39989f825d/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "e891d916-1d87-4374-b198-9d1abf4eff1d",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e891d916-1d87-4374-b198-9d1abf4eff1d/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e891d916-1d87-4374-b198-9d1abf4eff1d/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "df110f33-20b7-4fa4-b36c-67f7f88ad1a0",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/df110f33-20b7-4fa4-b36c-67f7f88ad1a0/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/df110f33-20b7-4fa4-b36c-67f7f88ad1a0/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "40d72793-f178-4105-a900-ab9b91cc78a1",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/40d72793-f178-4105-a900-ab9b91cc78a1/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/40d72793-f178-4105-a900-ab9b91cc78a1/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "c360ec6e-9c41-476f-aabf-9d0f4ee1ac3c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c360ec6e-9c41-476f-aabf-9d0f4ee1ac3c/embedded.cc.default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c360ec6e-9c41-476f-aabf-9d0f4ee1ac3c/embedded.cc.default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "23a7d8ad-affd-40e8-9e44-5414abc59c4d",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/23a7d8ad-affd-40e8-9e44-5414abc59c4d/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/23a7d8ad-affd-40e8-9e44-5414abc59c4d/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "a9352dc9-8b25-4a15-a6a3-5b6445b36fff",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a9352dc9-8b25-4a15-a6a3-5b6445b36fff/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a9352dc9-8b25-4a15-a6a3-5b6445b36fff/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "74bd59d5-ae00-464a-9502-0a967fafc576",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/74bd59d5-ae00-464a-9502-0a967fafc576/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/74bd59d5-ae00-464a-9502-0a967fafc576/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Red": "https://m.media-amazon.com/images/I/31dFe31u6UL._AC_SR38,50_.jpg",
    "Winered": "https://m.media-amazon.com/images/I/31dInWZA3LL._AC_SR38,50_.jpg",
    "Navy": "https://m.media-amazon.com/images/I/31yjxPFIR+L._AC_SR38,50_.jpg",
    "Royal Blue": "https://m.media-amazon.com/images/I/31mB+1QrCOL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31SjgJtYRuL._AC_SR38,50_.jpg",
    "Green": "https://m.media-amazon.com/images/I/313cIiCo9jL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Red": "61lrXVo79KL",
    "Winered": "61b4b43URDL",
    "Navy": "61onoX07kaL",
    "Royal Blue": "61ZKeBQaTLL",
    "Black": "61JH8Uav-aL",
    "Green": "61VsiH4cJJL"
  },
  "color_images": {
    "Red": [
      "https://m.media-amazon.com/images/I/61lrXVo79KL._SL1500_.jpg"
    ],
    "Winered": [
      "https://m.media-amazon.com/images/I/61b4b43URDL._SL1500_.jpg"
    ],
    "Navy": [
      "https://m.media-amazon.com/images/I/61onoX07kaL._SL1500_.jpg"
    ],
    "Royal Blue": [
      "https://m.media-amazon.com/images/I/61ZKeBQaTLL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/61JH8Uav-aL._SL1500_.jpg"
    ],
    "Green": [
      "https://m.media-amazon.com/images/I/61VsiH4cJJL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress-cocktail-v-neck",
      "title": "Womens Dress Cocktail V Neck",
      "price": 42.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/81Ct0tUZJRL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-boat-neck-sleeveless-bodycon",
      "title": "Womens Dress Boat Neck Sleeveless Bodycon",
      "price": 28.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71syDniLRxL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-bodycon",
      "title": "Womens Maxi Dress Long Sleeve Bodycon",
      "price": 37.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51NkOoxZo2L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-formal-evening-mermaid",
      "title": "Womens Dress Formal Evening Mermaid",
      "price": 104.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61xiU0h91KL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-off-shoulder-bodycon-long-sleeve-maxi",
      "title": "Womens Maxi Dress Off Shoulder Bodycon Long Sleeve Maxi",
      "price": 53.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/611pJhxTuIL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 145.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71vASW6UUCL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-one-shoulder-formal-mermaid",
      "title": "Womens Maxi Dress Evening One Shoulder Formal Mermaid",
      "price": 69.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/613xHpbpN5L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-bodycon",
      "title": "Womens Dress Bodycon",
      "price": 46.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/41ewiZh+h2L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 29.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/615tNO0Gy2L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-maxi",
      "title": "Womens Maxi Dress Long Sleeve Maxi",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61ZkyE5mF6L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 102.73,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71oZZ-eNBuL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-off-shoulder",
      "title": "Womens Maxi Dress Off Shoulder",
      "price": 94.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71jV7MTpGTL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61gWE-dhQNL._SL1500_.jpg"
      ]
    }
  ]
}