{
  "id": "womens-maxi-dress-maxi-long-sleeve-formal-bodycon-cocktail",
  "handle": "womens-maxi-dress-maxi-long-sleeve-formal-bodycon-cocktail",
  "sku": "JC1988",
  "asin": "B0FJ1LKQN2",
  "title": "Womens Maxi Dress Maxi Long Sleeve Formal Bodycon Cocktail",
  "title_original": "MEROKEETY Women's Fall Cocktail Formal Wedding Guest Dress Long Sleeve Maxi Bodycon Floral Mesh Winter Party Dresses",
  "brand": "Visit the MEROKEETY Store",
  "price": 54.99,
  "social_proof": {
    "bought_past_month": 50,
    "text": "50+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/51Bb91rcI1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71vSiZpfVyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71W5IzbszbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71fp25M-xhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/611+OIOLpnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71vUURH-ymL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61FXPM-eLDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61QmS9aW2CL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61RGSm18bpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61dUdpaZhIL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61aSUg2PS4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61jtGWGSYQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61idW2oN3JL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61v-CIfNVAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61h5qnoKgbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61XTYvFunUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Pn9MF3V7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61qFX8-YZPL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61GiLaG0x9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61KuAF134iL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/51Bb91rcI1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71vSiZpfVyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71W5IzbszbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71fp25M-xhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/611+OIOLpnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71vUURH-ymL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61FXPM-eLDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61QmS9aW2CL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61RGSm18bpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61dUdpaZhIL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61aSUg2PS4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61jtGWGSYQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61idW2oN3JL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61v-CIfNVAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61h5qnoKgbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61XTYvFunUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Pn9MF3V7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61qFX8-YZPL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61GiLaG0x9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61KuAF134iL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Item model number ‏": "‎ Fall Long Sleeve Maxi Dresses",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ August 20, 2025",
    "ASIN ‏": "‎ B0FJ1YVFVZ",
    "Best Sellers Rank": "#13,442 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #13 in Women's Cocktail Dresses",
    "Customer Reviews": "4.6 4.6 out of 5 stars (96)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Wine",
      "Brown",
      "Blue",
      "Burgundy",
      "Apricot",
      "Black",
      "Armygreen",
      "Red",
      "Navy",
      "Pink",
      "Graygreen",
      "Browngold",
      "Teal",
      "Green",
      "Grey"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.6,
    "count": 96,
    "customers_say": "Customers find the dress beautiful, with one noting its deep reddish shade is festive, and many appreciating its perfect fit and length. They describe it as comfortable, flattering, and of great quality, while also noting its stretchiness and softness. One customer mentions it's particularly suitable for pregnancy. Generated from the text of customer reviews Select to learn more Color (23) Fit (23) Comfort (14) Flattering (8) Quality (7) Stretchiness (6) Softness (5) Dress size (3) 23 customers mention color, 22 positive, 1 negative 23 customers mention \"Color\" 22 positive 1 negative Customers find the dress pretty, with one mentioning that the deep reddish shade is festive. \" This is a beautiful dress . It looks really classy on, however it was a little short for me. The quality and softness of the material was great. \" Read more \" Oh my gosh! I got so many compliments on how beautiful and stunning I looked. This dress was perfect! \" Read more \" Nice dress , alittle thin! \" Read more \" gorgeous dress ! got this for a fall wedding and got so many compliments!! \" Read more 23 customers mention fit, 18 positive, 5 negative 23 customers mention \"Fit\" 18 positive 5 negative Customers are satisfied with how the dress fits, noting its perfect length and beautiful silhouette, with one customer specifically mentioning its form-fitting design. \" ...I wore it for a fall wedding and got so many compliments on it. It fit perfectly and the cut is very flattering. \" Read more \" Love the fit of this dress ! It’s a good length, good quality and comfortable/stretchy! 10/10 recommend. Price is worth it. \" Read more \" I’m 63 inches, athletic build, approx 138 lbs, 34D cup. This dress fit so nicely ! Recommendation!!!! \" Read more \" Sent back. Not well made. Runs way too small . \" Read more 14 customers mention comfort, 14 positive, 0 negative 14 customers mention \"Comfort\" 14 positive 0 negative Customers find the dress comfortable, with one mentioning it is very forgiving. \" Love the fit of this dress! It’s a good length, good quality and comfortable /stretchy! 10/10 recommend. Price is worth it. \" Read more \" ...I got to wear at a wedding. The fabric has a good weight and it’s very comfortable . Can’t wait to wear this weekend. \" Read more \" Amazing right out of the box. Fits perfectly and so comfortable . I bought a very expensive dress to wear to a gala and ended up wearing this instead.... \" Read more \" So pretty! And actually really comfortable , to my surprise. It’s slightly baggy in the arms so I might buy a small to compare.... \" Read more 8 customers mention flattering, 7 positive, 1 negative 8 customers mention \"Flattering\" 7 positive 1 negative Customers find the dress flattering. \" This would make a beautiful holiday dress. It is flattering and the deep reddish shade is a festive yet elegant color.... \" Read more \" Great dress! Super flattering and comfortable \" Read more \" ...It fit perfectly and the cut is very flattering . \" Read more \" Makes your butt look good . \" Read more 7 customers mention quality, 6 positive, 1 negative 7 customers mention \"Quality\" 6 positive 1 negative Customers find the dress to be of great quality, with one mentioning it was amazing right out of the box. \" Great dress ! Super flattering and comfortable \" Read more \" ...This dress was perfect ! \" Read more \" The dress is nice it just looks a bit frumpy for a wedding, which is why I’d bought it. \" Read more \" Beautiful feminine dress. Great quality , double lined, not see through It is a body con fit!... \" Read more 6 customers mention stretchiness, 6 positive, 0 negative 6 customers mention \"Stretchiness\" 6 positive 0 negative Customers appreciate the dress's stretchiness. \" Stunning dress, form fitting but stretchy and comfortable. I got lots of compliments on it. Travels well. \" Read more \" ...it because that grey-green color is not for me but the material is very stretchy and soft. I chose a Medium, I’m 25 weeks pregnant, 5’8ft 170lbs. \" Read more \" So many compliments on this dress. It is a stretchy fabric and very comfortable to wear \" Read more \" ...The material has just the right amount of stretch without feeling thin or cheap.... \" Read more 5 customers mention softness, 5 positive, 0 negative 5 customers mention \"Softness\" 5 positive 0 negative Customers find the dress soft. \" ...grey-green color is not for me but the material is very stretchy and soft . I chose a Medium, I’m 25 weeks pregnant, 5’8ft 170lbs. \" Read more \" ... Super soft material and really comfortable.... \" Read more \" I ordered this for a wedding and it did not disappoint. It has a nice texture without being too toned.... \" Read more \" ...The length is perfect for my height. I love the subtle pattern and the soft , form-fitting silhouette.... \" Read more 3 customers mention dress size, 3 positive, 0 negative 3 customers mention \"Dress size\" 3 positive 0 negative Customers find the dress suitable for various occasions, with one mentioning it's great for weddings and another noting it's perfect for formal events. \" ...It was perfect for this occasion and it came fast \" Read more \" ...I have since ordered it in 2 more colors, great for weddings , celebrations of life, and any occasion.... \" Read more \" Great dress por pregnancy ... \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Very flattering",
        "body": "I’m currently 9 pregnant with my third, so a little bump is already showing, and this dress is AMAZING. I wasn’t sure how it would look with my early bump, but it fits beautifully and is super flattering from every angle. The material has just the right amount of stretch without feeling thin or cheap. It hugs in all the right places while still being comfortable enough to move and breathe in. The length is perfect for my height. I love the subtle pattern and the soft, form-fitting silhouette. I’ve worn a lot of dresses through multiple pregnancies, and this is easily one of my new favorites. It will be cute with a bigger bump too as it has some stretch to it! If you’re petite or newly pregnant and want something that makes you feel put together and confident, this dress is absolutely worth it. Highly recommend! Read more",
        "author": "maggie",
        "rating": 5.0,
        "date": "November 24, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61vW1x-VC-L._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/614+LB5zmvL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/717CsFnJAHL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Great fitting dress",
        "body": "I ordered this for a wedding and it did not disappoint. It has a nice texture without being too toned. It’s a little bit long, but the wedding was formal black tie so I wore it with black suede pumps. It looks great on, it’s very forgiving and it’s probably the most comfortable dress I own. Kept this in the medium. The large was too big. Read more",
        "author": "Maria T",
        "rating": 5.0,
        "date": "November 16, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Beautiful dress, very comfortable and flattering.",
        "body": "Stunning dress, form fitting but stretchy and comfortable. I got lots of compliments on it. Travels well. Read more",
        "author": "Me",
        "rating": 5.0,
        "date": "November 4, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Beautiful dress",
        "body": "I am 5'5\" tall, 133 lbs, 36C bra size and Medium is perfect fit (Small would have been much too tight and uncomfortable). I purchased the Gray-Green for a December wedding and have Emerald satin shoes that match perfectly Read more",
        "author": "Clare S",
        "rating": 4.0,
        "date": "November 16, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Might want to size up at least one size.",
        "body": "Beautiful feminine dress. Great quality, double lined, not see through It is a body con fit! I sized up one size (small to a medium)for a better fit on me. Reference 5.3’, 128, straight figure, average bust and hip size. Read more",
        "author": "linda c",
        "rating": 5.0,
        "date": "December 11, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Loveeeee",
        "body": "I got this to wear to a wedding and love it. It’s so comfortable, flattering, and beautiful. Read more",
        "author": "Cassidy",
        "rating": 5.0,
        "date": "December 12, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars 10/10 buy!",
        "body": "Love the fit of this dress! It’s a good length, good quality and comfortable/stretchy! 10/10 recommend. Price is worth it. Read more",
        "author": "Hunter household essentials",
        "rating": 5.0,
        "date": "November 1, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "2.0 out of 5 stars Eh",
        "body": "Looked more matronly than I thought it would look just based on the Amazon pictures Read more",
        "author": "Gabby",
        "rating": 2.0,
        "date": "December 8, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Maxi Long Sleeve Formal Bodycon Cocktail is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.",
  "about_this_item": "Womens Maxi Dress Maxi Long Sleeve Formal Bodycon Cocktail is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.",
  "long_description": "Womens Maxi Dress Maxi Long Sleeve Formal Bodycon Cocktail is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Wine, Brown, Blue, Burgundy, Apricot, Black, Armygreen, Red, Navy, Pink, Graygreen, Browngold, Teal, Green. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Maxi Long Sleeve Formal Bodycon Cocktail is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Wine, Brown, Blue, Burgundy, Apricot, Black, Armygreen, Red, Navy, Pink, Graygreen, Browngold, Teal, Green. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "ab7c3edc-6a06-448b-99fb-f1fbb24b7be5",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ab7c3edc-6a06-448b-99fb-f1fbb24b7be5/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ab7c3edc-6a06-448b-99fb-f1fbb24b7be5/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/14bdc108-6e3c-4a7d-a940-066d9c6ae4df.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "874319d3-efaa-46e1-8956-276ebad1e6bb",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/874319d3-efaa-46e1-8956-276ebad1e6bb/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/874319d3-efaa-46e1-8956-276ebad1e6bb/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/14bdc108-6e3c-4a7d-a940-066d9c6ae4df.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "c114ff64-19df-423c-a0ba-0d5ce3a8c363",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c114ff64-19df-423c-a0ba-0d5ce3a8c363/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c114ff64-19df-423c-a0ba-0d5ce3a8c363/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/14bdc108-6e3c-4a7d-a940-066d9c6ae4df.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "73647cdc-6f44-4e04-bf3f-601c6509765b",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/73647cdc-6f44-4e04-bf3f-601c6509765b/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/73647cdc-6f44-4e04-bf3f-601c6509765b/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/14bdc108-6e3c-4a7d-a940-066d9c6ae4df.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "2b21172f-f733-4a4e-a9e7-1ed2ae2d2577",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2b21172f-f733-4a4e-a9e7-1ed2ae2d2577/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2b21172f-f733-4a4e-a9e7-1ed2ae2d2577/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/14bdc108-6e3c-4a7d-a940-066d9c6ae4df.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "ed0f21c5-f0e1-4a02-9acd-6a190338c423",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ed0f21c5-f0e1-4a02-9acd-6a190338c423/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ed0f21c5-f0e1-4a02-9acd-6a190338c423/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/14bdc108-6e3c-4a7d-a940-066d9c6ae4df.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "7656d125-ab36-445f-8130-8eef92ab4393",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7656d125-ab36-445f-8130-8eef92ab4393/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7656d125-ab36-445f-8130-8eef92ab4393/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/14bdc108-6e3c-4a7d-a940-066d9c6ae4df.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "30fed128-8ae6-45b9-82f0-75e1052f1ffe",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/30fed128-8ae6-45b9-82f0-75e1052f1ffe/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/30fed128-8ae6-45b9-82f0-75e1052f1ffe/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/14bdc108-6e3c-4a7d-a940-066d9c6ae4df.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "4ce9571d-7bf9-4942-9c20-2f0a9da1b959",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4ce9571d-7bf9-4942-9c20-2f0a9da1b959/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4ce9571d-7bf9-4942-9c20-2f0a9da1b959/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/14bdc108-6e3c-4a7d-a940-066d9c6ae4df.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "7c90ec0b-209a-49ee-9978-92be7184ebc7",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7c90ec0b-209a-49ee-9978-92be7184ebc7/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7c90ec0b-209a-49ee-9978-92be7184ebc7/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/14bdc108-6e3c-4a7d-a940-066d9c6ae4df.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "81d8451a-26b6-491a-87e2-82fb23dce9a5",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/81d8451a-26b6-491a-87e2-82fb23dce9a5/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/81d8451a-26b6-491a-87e2-82fb23dce9a5/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/14bdc108-6e3c-4a7d-a940-066d9c6ae4df.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "8430ac74-4bdd-4176-a18d-bc0f4ab05de8",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8430ac74-4bdd-4176-a18d-bc0f4ab05de8/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8430ac74-4bdd-4176-a18d-bc0f4ab05de8/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/14bdc108-6e3c-4a7d-a940-066d9c6ae4df.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Wine": "https://m.media-amazon.com/images/I/31i7V8mFU0L._AC_SR38,50_.jpg",
    "Brown": "https://m.media-amazon.com/images/I/319Xd1jR7bL._AC_SR38,50_.jpg",
    "Blue": "https://m.media-amazon.com/images/I/31gjfmQ3iDL._AC_SR38,50_.jpg",
    "Burgundy": "https://m.media-amazon.com/images/I/41Z-ZUI0tLL._AC_SR38,50_.jpg",
    "Apricot": "https://m.media-amazon.com/images/I/31GMWbG44gL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31BpWs4+BaL._AC_SR38,50_.jpg",
    "Armygreen": "https://m.media-amazon.com/images/I/41T7GsqjNOL._AC_SR38,50_.jpg",
    "Red": "https://m.media-amazon.com/images/I/31nk6I8SPJL._AC_SR38,50_.jpg",
    "Navy": "https://m.media-amazon.com/images/I/41VbUwkIqLL._AC_SR38,50_.jpg",
    "Pink": "https://m.media-amazon.com/images/I/31kr6r65FAL._AC_SR38,50_.jpg",
    "Graygreen": "https://m.media-amazon.com/images/I/41kQh5qafkL._AC_SR38,50_.jpg",
    "Browngold": "https://m.media-amazon.com/images/I/31lJSrRR1CL._AC_SR38,50_.jpg",
    "Teal": "https://m.media-amazon.com/images/I/41+zPauDJiL._AC_SR38,50_.jpg",
    "Green": "https://m.media-amazon.com/images/I/41zoXAPlA5L._AC_SR38,50_.jpg",
    "Grey": "https://m.media-amazon.com/images/I/315uz101ZDL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Wine": "61FXPM-eLDL",
    "Brown": "61QmS9aW2CL",
    "Blue": "61RGSm18bpL",
    "Burgundy": "61dUdpaZhIL",
    "Apricot": "61aSUg2PS4L",
    "Black": "51Bb91rcI1L",
    "Armygreen": "61jtGWGSYQL",
    "Red": "61idW2oN3JL",
    "Navy": "61v-CIfNVAL",
    "Pink": "61h5qnoKgbL",
    "Graygreen": "61XTYvFunUL",
    "Browngold": "61Pn9MF3V7L",
    "Teal": "61qFX8-YZPL",
    "Green": "61GiLaG0x9L",
    "Grey": "61KuAF134iL"
  },
  "color_images": {
    "Wine": [
      "https://m.media-amazon.com/images/I/61FXPM-eLDL._SL1500_.jpg"
    ],
    "Brown": [
      "https://m.media-amazon.com/images/I/61QmS9aW2CL._SL1500_.jpg"
    ],
    "Blue": [
      "https://m.media-amazon.com/images/I/61RGSm18bpL._SL1500_.jpg"
    ],
    "Burgundy": [
      "https://m.media-amazon.com/images/I/61dUdpaZhIL._SL1500_.jpg"
    ],
    "Apricot": [
      "https://m.media-amazon.com/images/I/61aSUg2PS4L._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/51Bb91rcI1L._SL1500_.jpg"
    ],
    "Armygreen": [
      "https://m.media-amazon.com/images/I/61jtGWGSYQL._SL1500_.jpg"
    ],
    "Red": [
      "https://m.media-amazon.com/images/I/61idW2oN3JL._SL1500_.jpg"
    ],
    "Navy": [
      "https://m.media-amazon.com/images/I/61v-CIfNVAL._SL1500_.jpg"
    ],
    "Pink": [
      "https://m.media-amazon.com/images/I/61h5qnoKgbL._SL1500_.jpg"
    ],
    "Graygreen": [
      "https://m.media-amazon.com/images/I/61XTYvFunUL._SL1500_.jpg"
    ],
    "Browngold": [
      "https://m.media-amazon.com/images/I/61Pn9MF3V7L._SL1500_.jpg"
    ],
    "Teal": [
      "https://m.media-amazon.com/images/I/61qFX8-YZPL._SL1500_.jpg"
    ],
    "Green": [
      "https://m.media-amazon.com/images/I/61GiLaG0x9L._SL1500_.jpg"
    ],
    "Grey": [
      "https://m.media-amazon.com/images/I/61KuAF134iL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-sleeveless-off-shoulder",
      "title": "Womens Maxi Dress Sleeveless Off Shoulder",
      "price": 169.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Wedding Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/51AHia0uolL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-formal",
      "title": "Womens Dress Formal",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51LM+Ha2gSL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-evening-maxi",
      "title": "Womens Maxi Dress Cocktail Evening Maxi",
      "price": 32.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51IY8AkWJoL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-formal-long-sleeve-v-neck",
      "title": "Womens Maxi Dress Evening Formal Long Sleeve V Neck",
      "price": 84.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61aiovx0c8L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-formal",
      "title": "Womens Maxi Dress Evening Formal",
      "price": 75.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Wedding Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/51U3YUlzbEL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-mermaid-off-shoulder",
      "title": "Womens Maxi Dress Mermaid Off Shoulder",
      "price": 134.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61mr0w2Md+L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-off-shoulder",
      "title": "Womens Maxi Dress Off Shoulder",
      "price": 176.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/81O+xvlECgL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 27.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61Xr-CW12GL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-long-sleeve-evening-ruched-cocktail-formal",
      "title": "Womens Maxi Dress Bodycon Long Sleeve Evening Ruched Cocktail Formal",
      "price": 42.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/513qPgA8SIL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 175.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71-LVQohVZL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 35.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61TbkvcOffL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-formal-mermaid",
      "title": "Womens Dress Formal Mermaid",
      "price": 78.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/51SEIN1NZHL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-v-neck-long-sleeve",
      "title": "Womens Maxi Dress Cocktail V Neck Long Sleeve",
      "price": 55.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71phLwOEidL._SL1500_.jpg"
      ]
    }
  ]
}