{
  "id": "womens-maxi-dress-long-sleeve-v-neck-split",
  "handle": "womens-maxi-dress-long-sleeve-v-neck-split",
  "sku": "JC2436",
  "asin": "B0FBRW3V9R",
  "title": "Womens Maxi Dress Long Sleeve V Neck Split",
  "title_original": "Sampeel Dresses for Women 2025 Casual Long Sleeve V Neck Tshirt Dress Side Split Fashion Fall Outfits",
  "brand": "Visit the SAMPEEL Store",
  "price": 9.99,
  "social_proof": {
    "bought_past_month": 63,
    "text": "63+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/61rDQSA6d3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61XGAp7GsPL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61qvk89SI5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61xDr6gl8wL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Rud3uBz7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71H0xKBhZpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61akiMJqBZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61RU0VXD57L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61vx156ASqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71GUQqxBpKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61f14rzFkeL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61neZ6l-i-L._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/61rDQSA6d3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61XGAp7GsPL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61qvk89SI5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61xDr6gl8wL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Rud3uBz7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71H0xKBhZpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61akiMJqBZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61RU0VXD57L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61vx156ASqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71GUQqxBpKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61f14rzFkeL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61neZ6l-i-L._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Is Discontinued By Manufacturer ‏": "‎ Yes",
    "Package Dimensions ‏": "‎ 9.8 x 7.9 x 0.4 inches; 4.94 ounces",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ June 3, 2025",
    "ASIN ‏": "‎ B0FBRS4MCC",
    "Best Sellers Rank": "#6,162 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #23 in Women's Casual Dresses",
    "Customer Reviews": "4.3 4.3 out of 5 stars (318)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Red",
      "Beige",
      "Blue",
      "Black",
      "Caramel",
      "Coffee",
      "Navy Blue",
      "Green"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.3,
    "count": 318,
    "customers_say": "Customers find the dress comfortable and appreciate its thick, high-end fabric that hugs in all the right places. They like its versatility, noting it can be dressed up or worn casually, and one customer specifically mentions it's perfect for Texas fall weather. The dress receives positive feedback for its fit and appearance, with one review highlighting how the sleeves bring balance and elegance. While some it runs true to size, others mention it runs slightly big. Select to learn more Fit Looks Quality Fabric quality Comfort Soft fabric Wearability Size 42 customers mention \"Fit\" 36 positive 6 negative Customers like how the dress fits, with one mentioning it pairs well with boots or sneakers. \" Great fit , and color! Perfect for a Texas fall. It’s comfortable and get for the money. I bought 2 more colors!\" Read more \"...It's a good black dress to have in your closet. Fits true to size , great length. You can dress it up or down. Love Love Love!!!\" Read more \"Feels good. Fits well . Not too tight. A bit short for an older lady like me to wear, but I’m wearing it anyway! 5’4”. 125 lbs....\" Read more \"Great quality. Doesn't wrinkle and fits perfectly . Now I want more colors\" Read more 34 customers mention \"Looks\" 31 positive 3 negative Customers find the dress looks very cute, with one mentioning that the sleeves bring balance and elegance to the design. \"This dress is cute and the fit was good. I did order according to the sizing guide and sized down....\" Read more \"Comfy and stylish ! Great for travel!...\" Read more \" Absolutely beautiful dress , the fit is perfect. Love the stretchy fabric. Cannot wait to wear it\" Read more \" Beautiful casual dress ! Wore it to work and down afterwards. Lots of compliments.\" Read more 31 customers mention \"Quality\" 27 positive 4 negative Customers find the dress well-made, with one describing it as a great capsule piece. \"It’s a great dress . Can be worn dressed up or casual I suggest going up a size especially if you carry weight in stomach/ rear or are bustier.\" Read more \"... Perfect dress !\" Read more \" Nice dress but it runs big. I normally wear a medium but I had to reorder a small in this one. I also bought the brownish color. I wasn’t a fan of it.\" Read more \" Great quality . Doesn't wrinkle and fits perfectly. Now I want more colors\" Read more 26 customers mention \"Fabric quality\" 21 positive 5 negative Customers love the material of the dress, noting its perfect thickness and how it hugs in all the right places. \"Beautiful dress snug fit. Nice material \" Read more \" Great material . Very soft and looks nice, not cheap. Perfect length not too long or short.\" Read more \"...I prefer it with a belt and boots. It’s a tshirt material and fairly thin but perfect for fall days in the South. Would look cute with a jacket....\" Read more \"...While it fit, I found it very unflattering. The fabric was nice and soft, but it was completely shapeless and the hem hit right at the thickest...\" Read more 24 customers mention \"Comfort\" 24 positive 0 negative Customers find the dress comfortable. \"Very cute and comfortable . I was in between a medium and large and the large is perfect. No tummy control, if that is something you are looking for.\" Read more \"...Nice length and weight with cute side slits.material is warm and very comfortable . You can wear with leggings or tights. I’m going to order one more.\" Read more \"True fit Fabric is soft and comfy Easy wash and dry\" Read more \"This dress is so comfortable . Great for travel Can wear casual or dress up. Highly recommend. True to size\" Read more 23 customers mention \"Soft fabric\" 23 positive 0 negative Customers find the dress's fabric soft, with one mentioning a leather-like sensation wrapping the calves. \"...While it fit, I found it very unflattering. The fabric was nice and soft , but it was completely shapeless and the hem hit right at the thickest...\" Read more \" Super soft and comfortable. I prefer it with a belt and boots. It’s a tshirt material and fairly thin but perfect for fall days in the South....\" Read more \"This dress is very soft , fits well. Im a 4/6. 5'3\" 126 lbs and the Small fit perfect. I may order in a few more colors.\" Read more \"True fit Fabric is soft and comfy Easy wash and dry\" Read more 21 customers mention \"Wearability\" 20 positive 1 negative Customers find the dress versatile, noting it can be dressed up or worn casually, and one customer mentions it can be paired with leggings or tights. \"Great dress it can be dressed up or down . True to size. I ordered 2 more. Perfect for fall or cool weather to wear with tights....\" Read more \"...Fits true to size, great length. You can dress it up or down . Love Love Love!!!\" Read more \"Nice Casual Dress can be worn with sneakers or dress it up the black color is nice.\" Read more \"...I dressed it up with a chain belt. Perfect for church ....\" Read more 21 customers mention \"Size\" 13 positive 8 negative Customers have mixed opinions about the dress's sizing, with some saying it fits perfectly while others mention it runs slightly large. \"I like this tunic-shirt very much. It is true to size so I respect the Seller a lot for this. It is comfortable, well-sewn, and lovely....\" Read more \"The first purchase size was medium and was too small . Returned item and bought a large.\" Read more \" Accurate sizing . I am 5’2 and 160 and it didn’t pull or squeeze any where. Very soft material. Not see-thru\" Read more \"...I was in between a medium and large and the large is perfect . No tummy control, if that is something you are looking for.\" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Absolute wardrobe capsule piece!",
        "body": "Absolute keeper. Great dress. Super soft & comfortable. Material isn't clingy, not see through, great weight, fits true to size. Not baggy, but not too fitted. I am 5'1\" & 119 lbs & the small is a perfect fit. Not too long on my short frame. Ordered in caramel & color is gorgeous. Versatile, dress up with boots or heels, scarf & long sweater or down with cute sneakers & denim jacket. Ordered in navy too. Great capsule piece. Read more",
        "author": "Gina",
        "rating": 5.0,
        "date": "October 22, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Soft and wearable for winter",
        "body": "I blame the entire internet. Why y'all out here gatekeeping these dresses?They are so pretty and wearable. Falls nicely over the body, slight sinch in the waste. I think it would flatter many body types. Lots of colors. Really soft, easy to iron material. I styled it with a cute scarf, tights, and knee length boots. I am about to buy more colors for the winter--crew neck and v-neck. Nicely done Sampeel. Read more",
        "author": "Mambo's Daughter",
        "rating": 5.0,
        "date": "November 8, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Great find - bought multiple colors",
        "body": "This dress is the absolute smoothest material I’ve ever felt! I ordered a medium as I’m usually wear a medium and it fit perfectly! Read more",
        "author": "Laura",
        "rating": 4.0,
        "date": "November 27, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Stylish",
        "body": "Great dress it can be dressed up or down. True to size. I ordered 2 more. Perfect for fall or cool weather to wear with tights. The fabric is not too heavy but will be warm enough on a cool day. Read more",
        "author": "EB",
        "rating": 5.0,
        "date": "December 18, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Extremely comfortable and stylish dress",
        "body": "Love this dress. The length is perfect and the fabric is so soft. Perfect for transitioning into fall. Read more",
        "author": "Elizabeth Melde",
        "rating": 5.0,
        "date": "November 12, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Tight fitting in a large",
        "body": "Great silhouette, but runs small Read more",
        "author": "Pediatric Nurse for HIM",
        "rating": 3.0,
        "date": "November 11, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Very versatile - good buy!",
        "body": "This dress feels as soft as butter! It can be styled in various ways, and I love it. I ordered both a medium and a large. I'm 4’10”, 130 pounds, with a 38DD bust, so I'm not sure what size will suit me best. The large is really loose—there's a lot of room—so I plan to return it for a medium. The medium fits comfortably without being baggy. I received many compliments, and the dress washed and dried very well. My only complaint is the lack of pockets. I have this v-neck dress in both long and sleeveless versions. They're versatile for many occasions—paired with sneakers for travel or with boots and a jacket for lunch or dinner. The price is very reasonable, and I think I’ve already gotten my money’s worth. I plan to buy more in different colors. Read more",
        "author": "emc0963",
        "rating": 5.0,
        "date": "November 28, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "1.0 out of 5 stars Terrible Product",
        "body": "This is a horrible product! Do not purchase. The fabric is strange and clings to my body even though the dress is too large and too long. I would return it but they will only pay pennies on the purchase price. Do not buy from this company! Read more",
        "author": "Customer",
        "rating": 1.0,
        "date": "December 4, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Long Sleeve V Neck Split is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.",
  "about_this_item": "Womens Maxi Dress Long Sleeve V Neck Split is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.",
  "long_description": "Womens Maxi Dress Long Sleeve V Neck Split is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Red, Beige, Blue, Black, Caramel, Coffee, Navy Blue, Green. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Long Sleeve V Neck Split is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Red, Beige, Blue, Black, Caramel, Coffee, Navy Blue, Green. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "89e3577e-4b05-433c-9fa6-36b6599035b3",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/89e3577e-4b05-433c-9fa6-36b6599035b3/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/89e3577e-4b05-433c-9fa6-36b6599035b3/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/fb46c84e-b15c-457b-96ab-116c4d25c05a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "5b957550-6373-43a9-9c6f-04eae3a3610a",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5b957550-6373-43a9-9c6f-04eae3a3610a/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5b957550-6373-43a9-9c6f-04eae3a3610a/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/fb46c84e-b15c-457b-96ab-116c4d25c05a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "53c0c1ff-a8a1-4ad2-9953-b2dae71fa95f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/53c0c1ff-a8a1-4ad2-9953-b2dae71fa95f/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/53c0c1ff-a8a1-4ad2-9953-b2dae71fa95f/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/fb46c84e-b15c-457b-96ab-116c4d25c05a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "12adb5af-0d13-4bdc-8a7a-a78a7d131f08",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/12adb5af-0d13-4bdc-8a7a-a78a7d131f08/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/12adb5af-0d13-4bdc-8a7a-a78a7d131f08/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/fb46c84e-b15c-457b-96ab-116c4d25c05a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Red": "https://m.media-amazon.com/images/I/31N-UBI128L._AC_SR38,50_.jpg",
    "Beige": "https://m.media-amazon.com/images/I/31tTCjLmIjL._AC_SR38,50_.jpg",
    "Blue": "https://m.media-amazon.com/images/I/31G3QutcGCL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31YJoJdMlOL._AC_SR38,50_.jpg",
    "Caramel": "https://m.media-amazon.com/images/I/31Xyecs31hL._AC_SR38,50_.jpg",
    "Coffee": "https://m.media-amazon.com/images/I/31XNe7LQpIL._AC_SR38,50_.jpg",
    "Navy Blue": "https://m.media-amazon.com/images/I/31tG7ypjgwL._AC_SR38,50_.jpg",
    "Green": "https://m.media-amazon.com/images/I/31znv5kLYsL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Red": "71H0xKBhZpL",
    "Beige": "61akiMJqBZL",
    "Blue": "61RU0VXD57L",
    "Black": "61rDQSA6d3L",
    "Caramel": "61vx156ASqL",
    "Coffee": "71GUQqxBpKL",
    "Navy Blue": "61f14rzFkeL",
    "Green": "61neZ6l-i-L"
  },
  "color_images": {
    "Red": [
      "https://m.media-amazon.com/images/I/71H0xKBhZpL._SL1500_.jpg"
    ],
    "Beige": [
      "https://m.media-amazon.com/images/I/61akiMJqBZL._SL1500_.jpg"
    ],
    "Blue": [
      "https://m.media-amazon.com/images/I/61RU0VXD57L._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/61rDQSA6d3L._SL1500_.jpg"
    ],
    "Caramel": [
      "https://m.media-amazon.com/images/I/61vx156ASqL._SL1500_.jpg"
    ],
    "Coffee": [
      "https://m.media-amazon.com/images/I/71GUQqxBpKL._SL1500_.jpg"
    ],
    "Navy Blue": [
      "https://m.media-amazon.com/images/I/61f14rzFkeL._SL1500_.jpg"
    ],
    "Green": [
      "https://m.media-amazon.com/images/I/61neZ6l-i-L._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 34.39,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71l7SpDyHyL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-v-neck-evening-cocktail-split-sleeveless",
      "title": "Womens Maxi Dress V Neck Evening Cocktail Split Sleeveless",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61iTIlfCryL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-ruched-bodycon-long-sleeve-cocktail",
      "title": "Womens Maxi Dress Ruched Bodycon Long Sleeve Cocktail",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51y+kPKhl4L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-boat-neck-long-sleeve",
      "title": "Womens Maxi Dress Boat Neck Long Sleeve",
      "price": 29.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51Jm7sZ4nyL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-short-sleeve",
      "title": "Womens Maxi Dress Maxi Short Sleeve",
      "price": 36.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61J4Ur7wG9L._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-long-sleeve-ruched-bodycon",
      "title": "Womens Maxi Dress Long Sleeve Ruched Bodycon",
      "price": 53.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61xdzSpDdiL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-bodycon-one-shoulder",
      "title": "Womens Dress Bodycon One Shoulder",
      "price": 38.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51LTPZDa1AL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-long-sleeve-ruched",
      "title": "Womens Maxi Dress Bodycon Long Sleeve Ruched",
      "price": 36.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61yFldWfTJL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-evening-split-bodycon-mermaid",
      "title": "Womens Maxi Dress Cocktail Evening Split Bodycon Mermaid",
      "price": 59.97,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/51yI6WYjFpL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-one-shoulder",
      "title": "Womens Maxi Dress One Shoulder",
      "price": 74.96,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51Co1jV0F1L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-mermaid-evening-formal-long-sleeve",
      "title": "Womens Maxi Dress Mermaid Evening Formal Long Sleeve",
      "price": 89.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/617AQwGzPJL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail",
      "title": "Womens Dress Cocktail",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61dvvjCFiwL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-sleeveless",
      "title": "Womens Dress Sleeveless",
      "price": 37.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51UJzutsULL._SL1500_.jpg"
      ]
    }
  ]
}