{
  "id": "womens-maxi-dress-maxi-high-split-evening-one-shoulder-split-ruched",
  "handle": "womens-maxi-dress-maxi-high-split-evening-one-shoulder-split-ruched",
  "sku": "JC1955",
  "asin": "B0DYJ58FXM",
  "title": "Womens Maxi Dress Maxi High Split Evening One Shoulder Split Ruched",
  "title_original": "Memoriesea Women's Sexy One Shoulder Ruched High Split Evening Maxi Formal Dress",
  "brand": "Visit the Memoriesea Store",
  "price": 43.99,
  "social_proof": {
    "bought_past_month": 670,
    "text": "670+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/514KbxCadKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71WnpiMRp-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71xTEsahwCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/710P-yPX+qL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71cUF3z0IfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/717YD+ylvrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Rnmc6qzZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61oYvHg84QL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/514KbxCadKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71WnpiMRp-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71xTEsahwCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/710P-yPX+qL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71cUF3z0IfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/717YD+ylvrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Rnmc6qzZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61oYvHg84QL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Product Dimensions ‏": "‎ 6.3 x 4.72 x 0.39 inches; 14.11 ounces",
    "Item model number ‏": "‎ ME094",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ February 26, 2025",
    "ASIN ‏": "‎ B0DYJP58KX",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#81,150 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #315 in Women's Formal Dresses",
    "Customer Reviews": "4.3 4.3 out of 5 stars (80)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Red",
      "Purple",
      "Black"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.3,
    "count": 80,
    "customers_say": "Customers find the dress comfortable, elegant, and sexy, with good stretchability and soft fabric. They appreciate its fit and quality, with one customer noting it offers amazing value for $40. The material quality receives mixed feedback, with some finding it good while others describe it as terrible. The length also gets mixed reviews. Generated from the text of customer reviews Select to learn more Fit (17) Style (13) Quality (9) Comfort (5) Fabric softness (4) Stretchability (4) Material quality (8) Length (5) 17 customers mention fit, 13 positive, 4 negative 17 customers mention \"Fit\" 13 positive 4 negative Customers are satisfied with how the dress fits. \" ...I ordered a small, which is my typical size and it fit perfectly . I am 5'6, 135lbs, 35 bust, 27 waist, 35 hips. Update:... \" Read more \" ...The fit was true to size . Because of a hip injury, she had to wear flats so the dress was a little long. \" Read more \" ...The material was comfortable and it wasn’t too tight . It was worth the money i spent. \" Read more \" ...My suggested size is XL, However it fit a little big I should have order a Large. The price was affordable. This dress does have good stretch.... \" Read more 13 customers mention style, 13 positive, 0 negative 13 customers mention \"Style\" 13 positive 0 negative Customers find the dress elegant and sexy. \" Beautiful dress but very long. I had to cut it. \" Read more \" This dress is so affordable, sexy , elegant the material is so nice and sexy and feels so good. It is not see through which is always a plus.... \" Read more \" Beautiful and Comfortable The dress looks exactly like the picture. The red color is vibrant and very elegant.... \" Read more \" ...Absolutely disgusting! The style was lovely but obviously unwearable. \" Read more 9 customers mention quality, 8 positive, 1 negative 9 customers mention \"Quality\" 8 positive 1 negative Customers find the dress to be of good quality, with one customer noting it offers amazing value for $40. \" Lovely dress but the item I received was used and filthy.... \" Read more \" Nice Dress , But Not Flattering on Me... \" Read more \" The dress was absolutely amazing . My suggested size is XL, However it fit a little big I should have order a Large. The price was affordable.... \" Read more \" ...It’s so nice and it’s perfect. \" Read more 5 customers mention comfort, 5 positive, 0 negative 5 customers mention \"Comfort\" 5 positive 0 negative Customers find the dress comfortable. \" ...She said it was very comfortable , it wasn’t see through and it stretch where it needed to. The fit was true to size.... \" Read more \" Loved the dress and just my style. The material was comfortable and it wasn’t too tight. It was worth the money i spent. \" Read more \" Beautiful and Comfortable The dress looks exactly like the picture. The red color is vibrant and very elegant.... \" Read more \" Comfortable beautiful and easy... \" Read more 4 customers mention fabric softness, 4 positive, 0 negative 4 customers mention \"Fabric softness\" 4 positive 0 negative Customers appreciate the dress's soft fabric. \" ...The red color is vibrant and very elegant. The fabric feels soft and fits the body nicely without being uncomfortable.... \" Read more \" The initial fit was great and the fabric felt soft but the fabric kept riding up and the slit would get too high. \" Read more \" Amazing soft dress ! Looks just like the picture !... \" Read more \" ...so affordable, sexy, elegant the material is so nice and sexy and feels so good . It is not see through which is always a plus.... \" Read more 4 customers mention stretchability, 4 positive, 0 negative 4 customers mention \"Stretchability\" 4 positive 0 negative Customers like the dress's stretchability. \" ...I bought for a black tie wedding and it worked perfectly. Great stretch and fit. It’s definitely meant for heels or a tall girl because it is long.... \" Read more \" ...The price was affordable. This dress does have good stretch . The material of the dress dosen't is not see through at all. \" Read more \" ...said it was very comfortable, it wasn’t see through and it stretch where it needed to . The fit was true to size.... \" Read more \" ...It is not see through which is always a plus. It has minimal amount of stretch but it is also true to size, and it fit great.... \" Read more 8 customers mention material quality, 4 positive, 4 negative 8 customers mention \"Material quality\" 4 positive 4 negative Customers have mixed opinions about the dress material, with some finding it pretty good while others describe it as terrible. \" True to size, good material , and just like the picture \" Read more \" Dress is not what I thought, material is terrible , fit was even worse! \" Read more \" This dress is so affordable, sexy, elegant the material is so nice and sexy and feels so good. It is not see through which is always a plus.... \" Read more \" Didn’t really like the material \" Read more 5 customers mention length, 3 positive, 2 negative 5 customers mention \"Length\" 3 positive 2 negative Customers have mixed opinions about the dress's length, with one finding it perfect while another mentions it runs long. \" ...I’m 5’7 and wore 4inch heels with it, and it was the perfect length ! But overall, amazing quality for $40!! \" Read more \" ...Because of a hip injury, she had to wear flats so the dress was a little long . \" Read more \" Love love this dress it fits me perfect and it’s long enough because I’m 6ft. It’s so nice and it’s perfect. \" Read more \" Beautiful dress but very long . I had to cut it. \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Beautiful dress with great stretch",
        "body": "I received so many compliments on this dress. I bought for a black tie wedding and it worked perfectly. Great stretch and fit. It’s definitely meant for heels or a tall girl because it is long. I am 5’2” and wore with heels and the back dragged like a train which honestly was cute. The front is open so I didn’t step on the dress any. Read more",
        "author": "Angela Thomas",
        "rating": 5.0,
        "date": "October 28, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Lovely Dress",
        "body": "Loved the dress and just my style. The material was comfortable and it wasn’t too tight. It was worth the money i spent. Read more",
        "author": "Teresa",
        "rating": 5.0,
        "date": "November 5, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71NrZRY3CML._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Definitely worth the $40!!",
        "body": "**I did wear this while 8 months pregnant! Bought an XL to accommodate the bump, and honestly could have gotten away with a large! But, I loved this dress. Very comfortable. It kind of has a bit of versatility to it that you could absolutely dress up to be more formal, or dress down for a more semi-formal approach. (I wore it as a maid of honor dress!) The style is very nice, and the slit is not too high. There was no strange smell, which does sometimes happen, but not with this one! It is on the thinner side, so I’d suggest wearing nipple covers or a strapless bra. I’m 5’7 and wore 4inch heels with it, and it was the perfect length! But overall, amazing quality for $40!! Read more",
        "author": "Kalaya",
        "rating": 5.0,
        "date": "November 6, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/613-1w5W8WL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/51AgxGDSdeL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Worth y",
        "body": "Amazing soft dress ! Looks just like the picture ! I my issue is that I’m super short ( 5,1) and I constantly had to keep holding the end of the dress! Other than that it was great and I received a lot of compliments. Read more",
        "author": "Customer",
        "rating": 5.0,
        "date": "November 17, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "1.0 out of 5 stars Dirty used dress",
        "body": "Lovely dress but the item I received was used and filthy. There was a safety pin holding the back together, stains all over the bust of the dress and it smelled of stale perfume and body odor. Absolutely disgusting! The style was lovely but obviously unwearable. Read more",
        "author": "C. Koberg",
        "rating": 1.0,
        "date": "December 12, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71k0hWlIxUL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71ZDsIbdJtL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/815+VBtRdtL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "4.0 out of 5 stars True to size",
        "body": "The dress has a feeling of elegance, Perfect fit true to size will purchase from the company again. Read more",
        "author": "joann",
        "rating": 4.0,
        "date": "August 27, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Love it!",
        "body": "I loved this dress. Great fit and conforms to the body! Read more",
        "author": "Customer",
        "rating": 5.0,
        "date": "December 19, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Nice dress but not best material",
        "body": "The initial fit was great and the fabric felt soft but the fabric kept riding up and the slit would get too high. Read more",
        "author": "Regina Sudu",
        "rating": 3.0,
        "date": "November 14, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Maxi High Split Evening One Shoulder Split Ruched is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.",
  "about_this_item": "Womens Maxi Dress Maxi High Split Evening One Shoulder Split Ruched is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.",
  "long_description": "Womens Maxi Dress Maxi High Split Evening One Shoulder Split Ruched is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Red, Purple, Black. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Maxi High Split Evening One Shoulder Split Ruched is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Red, Purple, Black. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "53fefbfe-7c1a-458e-ad52-155e3e7f47d7",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/53fefbfe-7c1a-458e-ad52-155e3e7f47d7/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/53fefbfe-7c1a-458e-ad52-155e3e7f47d7/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "a4f66da1-cc4d-46a9-927f-a73ce72f5b16",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a4f66da1-cc4d-46a9-927f-a73ce72f5b16/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a4f66da1-cc4d-46a9-927f-a73ce72f5b16/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Red": "https://m.media-amazon.com/images/I/31y6QYxGKKL._AC_SR38,50_.jpg",
    "Purple": "https://m.media-amazon.com/images/I/31zeur5O9LL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31WcGhmYS0L._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Red": "61Rnmc6qzZL",
    "Purple": "61oYvHg84QL",
    "Black": "514KbxCadKL"
  },
  "color_images": {
    "Red": [
      "https://m.media-amazon.com/images/I/61Rnmc6qzZL._SL1500_.jpg"
    ],
    "Purple": [
      "https://m.media-amazon.com/images/I/61oYvHg84QL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/514KbxCadKL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-formal",
      "title": "Womens Maxi Dress Formal",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61WXd1uwpzL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi",
      "title": "Womens Maxi Dress Maxi",
      "price": 8.95,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61vF2-+OmxL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-formal-v-neck-bodycon",
      "title": "Womens Dress Formal V Neck Bodycon",
      "price": 36.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Work",
      "images": [
        "https://m.media-amazon.com/images/I/51qWqaIAjEL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-formal-evening",
      "title": "Womens Maxi Dress Long Sleeve Formal Evening",
      "price": 84.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/81CsI4q6KXL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-mermaid-evening-formal",
      "title": "Womens Maxi Dress Mermaid Evening Formal",
      "price": 68.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/614T3t3zbcL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-long-sleeve-maxi",
      "title": "Womens Maxi Dress Long Sleeve Maxi",
      "price": 49.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/614poFYh9cL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-sleeveless-v-neck-cocktail-maxi-bodycon",
      "title": "Womens Maxi Dress Sleeveless V Neck Cocktail Maxi Bodycon",
      "price": 44.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51eoMzKwaqL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-boat-neck",
      "title": "Womens Maxi Dress Long Sleeve Boat Neck",
      "price": 22.49,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51grOMBZciL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-maxi",
      "title": "Womens Maxi Dress Formal Maxi",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71vrdaLYp0L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-boat-neck-ruched-sleeveless",
      "title": "Womens Dress Boat Neck Ruched Sleeveless",
      "price": 38.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61P82AgAZlL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-short-sleeve",
      "title": "Womens Dress Short Sleeve",
      "price": 139.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61DGsPsr6EL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail",
      "title": "Womens Dress Cocktail",
      "price": 49.9,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/81zZy1L7QKL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71ldsPt7VmL._SL1500_.jpg"
      ]
    }
  ]
}