{
  "id": "womens-maxi-dress-high-split-formal-sleeveless-split-evening-one-shoulder",
  "handle": "womens-maxi-dress-high-split-formal-sleeveless-split-evening-one-shoulder",
  "sku": "JC3160",
  "asin": "B09NSMYDZN",
  "title": "Womens Maxi Dress High Split Formal Sleeveless Split Evening One Shoulder",
  "title_original": "YMDUCH Women's Sexy Sleeveless One Shoulder Ruffle High Split Party Evening Long Formal Dress",
  "brand": "Visit the YMDUCH Store",
  "price": 49.99,
  "social_proof": {
    "bought_past_month": 864,
    "text": "864+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/411HiwOwYYL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41hFQtq5kXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61E2V33IYLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61juswU843L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71PXAq9eS1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71YEqvRyn4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/417EjOyx35L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41GuX7CFByL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41IndAeIGUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41QfciZy5vL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41aVZIkNMOL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/411HiwOwYYL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41hFQtq5kXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61E2V33IYLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61juswU843L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71PXAq9eS1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71YEqvRyn4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/417EjOyx35L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41GuX7CFByL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41IndAeIGUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41QfciZy5vL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41aVZIkNMOL._SL1500_.jpg"
  ],
  "aplus_images": [
    "https://m.media-amazon.com/images/I/31vfANmrAlL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/3150r0mX6VL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31Ur%2BrNxmTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31RwaNoMfFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/313RPG5r%2BlL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/319FWEUVJYL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31L78CmA38L._SL1500_.jpg"
  ],
  "description_images": [
    "https://m.media-amazon.com/images/I/31vfANmrAlL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/3150r0mX6VL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31Ur%2BrNxmTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31RwaNoMfFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/313RPG5r%2BlL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/319FWEUVJYL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31L78CmA38L._SL1500_.jpg"
  ],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ December 18, 2021",
    "ASIN ‏": "‎ B09NSLR7TJ",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#47,503 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #138 in Women's Formal Dresses",
    "Customer Reviews": "4.5 4.5 out of 5 stars (3,184)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Red",
      "Winered",
      "White",
      "Royal Blue",
      "Black",
      "Green"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.5,
    "count": 3184,
    "customers_say": "Customers find the dress fits well and is comfortable, with stretchy fabric that accommodates various body types. The material receives positive feedback for its quality, and customers appreciate how it flatters curvy bodies, with one noting it accentuates every little curve on the body. They describe it as classy and perfect for bridesmaids, with one customer mentioning it's comfortable even for short girls. The length receives mixed reviews, with some finding it good while others say it's not long enough. Generated from the text of customer reviews Select to learn more Fit (320) Quality (272) Beauty (234) Stretchiness (134) Material quality (125) Comfort (112) Flattering (75) Length (80) 320 customers mention fit, 301 positive, 19 negative 320 customers mention \"Fit\" 301 positive 19 negative Customers are satisfied with how the dress fits, describing it as amazing and sexy. \" This dress was a perfect fit . The material is stretchy, and the look is elegant. I wore this dress to my son's masquerade ball at his school. \" Read more \" The dress is beautiful and fits perfectly ! I went with my normal size (XL) and I’m very pleased. Delivery speed was great also. It only took 2 days. \" Read more \" I love this dress. Great fit , it complimented my full figure without making me look or feel big. I received a lot of compliments.... \" Read more \" This dress was amazing. Fit perfectly had to it hemmed in the front. But left the back long to give it an appearance of having a slight train. I'm.... \" Read more 272 customers mention quality, 259 positive, 13 negative 272 customers mention \"Quality\" 259 positive 13 negative Customers find the dress to be of excellent quality, describing it as sexy and perfect for bridesmaids' attire. \" ...It ended up being my first choice for prom. Great quality . I’m 5’4 196lbs and purchased an XL because the reviews recommended I size up. It fit great. \" Read more \" ...My seamless undergarments you could not see when I tried it on. Great dress . If you're hesitant don't be. Buy this. Like yesterday \" Read more \" ...Elegant and sexy . The material is stretchy and a little thicker which was perfect for end of March weather in NJ. Overall this was a TOTAL win!!... \" Read more \" Beautiful dress, good quality came looking like what was expected. It does stretch well. However, it isn't flattering to my curvy shape.... \" Read more 234 customers mention beauty, 228 positive, 6 negative 234 customers mention \"Beauty\" 228 positive 6 negative Customers find the dress classy and beautiful, particularly for weddings, with one customer noting it has sparkles. \" ...I received lots of compliments!!! I wore this beautiful dress to a Gala. I absolutely love love it. I bought and Xl and it does have stretch to it.... \" Read more \" This dress is so beautiful , I will definitely buy again. Material is perfect, true to size. Got alot of good compliments. Definitely will recommend. \" Read more \" This dress is elegant and beautifully constructed! I'm a size 16, height 5'9 which causes a lot of issue with finding a dress that sweeps the floor.... \" Read more \" ...I need up returning it because it’s chose something else but it was gorgeous . So high end and the detail at the shoulder was really flattering \" Read more 134 customers mention stretchiness, 123 positive, 11 negative 134 customers mention \"Stretchiness\" 123 positive 11 negative Customers appreciate the dress's stretchiness, particularly noting that it accommodates stomach size and allows for comfortable movement. \" I like that it was easy to put on, stretchy and comfortable. I’m 5’2 and was expecting it to be much longer but I won’t need a high heel to carry it.... \" Read more \" Love this dress. Very stretchy and fitted. I’m 5’3” about 190 lbs measurements B-40, W- 34, H-48. ordered a XL and wish I would have ordered a large.... \" Read more \" ...I got a size medium and it is the PERFECT LENGTH AND FIT. it is stretchy material while also being form fitting and flattering.... \" Read more \" ...The material is thick and has good stretch . The only thing to consider is the dress length. It fit me perfectly at 5'4 inches with 4.5 inch heels. \" Read more 125 customers mention material quality, 106 positive, 19 negative 125 customers mention \"Material quality\" 106 positive 19 negative Customers appreciate the dress's material, describing it as awesome, nice, and forgiving, with one customer noting it feels expensive. \" This dress is everything!! I could have went down a size! It had great material and not cheaply made!!!! You won’t be disappointed!!! \" Read more \" I absolutely love this dress. It was a good material . It’s true to size with not much stretch. I would definitely recommend and buy again!!!! \" Read more \" The dress is awesome fit perfect I love the material I will definitely recommend I will buy again & again \" Read more \" Nice material and fit to size \" Read more 112 customers mention comfort, 111 positive, 1 negative 112 customers mention \"Comfort\" 111 positive 1 negative Customers find the dress comfortable, with one mentioning it feels better than more expensive options. \" I like that it was easy to put on, stretchy and comfortable . I’m 5’2 and was expecting it to be much longer but I won’t need a high heel to carry it.... \" Read more \" This dress has a lot of stretch and was very comfortable !! The only thing is it came really wrinkled around the bottom and I had to steam it out!... \" Read more \" ...I got so many compliments and was SO comfortable ! I wish I would have saved it to wear to an upcoming wedding I’ll be attending. Definitely recommend. \" Read more \" ...the dress in an extra large instead of a large and it was extremely comfortable and not tight which being 5'10, 42DD was just perfect.... \" Read more 75 customers mention flattering, 71 positive, 4 negative 75 customers mention \"Flattering\" 71 positive 4 negative Customers find the dress flattering, particularly noting how it accentuates curves and compliments full figures. \" Beautiful bold blue color, very comfortable and flattering . I'm 5'8, 215 lbs ordered the XL and if fit perfectly. I received lots of compliments. \" Read more \" Gorgeous and super soft! Very flattering and the slit was perfect, not too high! Floor length for me and I'm 5'10 ! \" Read more \" ...It hugged all the right places and was super flattering. I have ordered MULTIPLE dresses for an upcoming wedding.... \" Read more \" ...This dress is extremely flattering and look just like the picture displayed on Amazon.... \" Read more 80 customers mention length, 49 positive, 31 negative 80 customers mention \"Length\" 49 positive 31 negative Customers have mixed opinions about the dress length, with some finding it good and down to the heel, while others say it's not long enough. \" Perfect stretch, very formal fitting, perfect length ... just as described and true to size! I'm 5'3... 137lbs I loved it..so did everyone else! \" Read more \" ...Beautiful dress. A little long but can be hemmed. Great stretchy material. I would order a size down just for the top portion.... \" Read more \" ...the split was a nice height without being too much and the length was perfect — dress hit the floor but didn’t drag (I’m 5’3” and wore a 3.5” heel). \" Read more \" ...I got compliments all night wearing this dress at my work Gala. It was long , stretchy, and the fabric was thick it was such great quality. \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Beautiful Dress!!",
        "body": "I love this dress. True to color and the dress looks exactly like the image. It's a fitted dress true to size and it is very comfortable. Excellent quality and material. Very affordable. Perfect for a wedding, date or prom. Be mindful of your shoe choise as my shoes had large rhinestones that occasionally snagged the dress. I accessorized the dress with this beautiful belt also an Amazon find https://a.co/d/j86JIOu. Would recommend. 10 out of 10. Read more",
        "author": "Kiesha H.",
        "rating": 5.0,
        "date": "February 16, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61PMBI+FbZL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71BKHIhAWRL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Love this dress!",
        "body": "Love this dress! Fit my curves perfectly. Very elegant. Material is very good. Read more",
        "author": "Tinnarella",
        "rating": 5.0,
        "date": "December 21, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Great buy - nice looking dress",
        "body": "The dress is stunning. Great craftsman's ship and the material is great! I am 5.2 and weigh 140lbs and the sizing is accurate. Read more",
        "author": "Elizabeth",
        "rating": 5.0,
        "date": "November 4, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Buy the dress",
        "body": "Great material, soft and stretchy. It hugs all the right places. The slit isn’t too high, it’s just the right height. For reference, 5’5, 150lb, and the medium fit perfect. I got compliments all night long. Just buy the dress!! Read more",
        "author": "BB",
        "rating": 5.0,
        "date": "November 9, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Fantastic dress!!!",
        "body": "This dress is gorgeous and the material is comfortably thick. This dress looks high end and is well made. I only gave 4 stars because I have a large bust and am short so it’s not the most flattering on me. I am returning it but wish I could wear it. This color red is perfection. Read more",
        "author": "Colleen O'Brien",
        "rating": 4.0,
        "date": "August 5, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars The material is super nice!",
        "body": "Exquisite, want a dress for banquet and this was it. I am 5’5” 178lbs and I got a large and it fit me very well , I love this dress Read more",
        "author": "Rosie",
        "rating": 5.0,
        "date": "December 13, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/81sL2zEOrFL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Beautiful dress",
        "body": "Nice thick material, true to size, I'm 5'7\" and the dress is long so the length is perfect with heels. Read more",
        "author": "Vernette",
        "rating": 5.0,
        "date": "December 16, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars awesome dress",
        "body": "The dress is awesome fit perfect I love the material I will definitely recommend I will buy again & again Read more",
        "author": "Georgiana Ouida Morgan",
        "rating": 4.0,
        "date": "November 14, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress High Split Formal Sleeveless Split Evening One Shoulder is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.",
  "about_this_item": "Womens Maxi Dress High Split Formal Sleeveless Split Evening One Shoulder is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.",
  "long_description": "Womens Maxi Dress High Split Formal Sleeveless Split Evening One Shoulder is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Red, Winered, White, Royal Blue, Black, Green. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress High Split Formal Sleeveless Split Evening One Shoulder is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/31vfANmrAlL._SL1500_.jpg",
      "alt": "Womens Maxi Dress High Split Formal Sleeveless Split Evening One Shoulder details image 1"
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/3150r0mX6VL._SL1500_.jpg",
      "alt": "Womens Maxi Dress High Split Formal Sleeveless Split Evening One Shoulder details image 2"
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/31Ur%2BrNxmTL._SL1500_.jpg",
      "alt": "Womens Maxi Dress High Split Formal Sleeveless Split Evening One Shoulder details image 3"
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/31RwaNoMfFL._SL1500_.jpg",
      "alt": "Womens Maxi Dress High Split Formal Sleeveless Split Evening One Shoulder details image 4"
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Red, Winered, White, Royal Blue, Black, Green. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/313RPG5r%2BlL._SL1500_.jpg",
      "alt": "Womens Maxi Dress High Split Formal Sleeveless Split Evening One Shoulder details image 5"
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "acc42130-64c3-44a4-89cb-9d2a2237af28",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/acc42130-64c3-44a4-89cb-9d2a2237af28/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/acc42130-64c3-44a4-89cb-9d2a2237af28/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "28c5601e-23ec-4e00-807f-dbeff6df2916",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/28c5601e-23ec-4e00-807f-dbeff6df2916/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/28c5601e-23ec-4e00-807f-dbeff6df2916/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "030176cf-61cf-454a-b320-eeb13a00d5f0",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/030176cf-61cf-454a-b320-eeb13a00d5f0/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/030176cf-61cf-454a-b320-eeb13a00d5f0/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "abca8c3e-f069-49f9-b815-ef5ea7c00e2b",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/abca8c3e-f069-49f9-b815-ef5ea7c00e2b/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/abca8c3e-f069-49f9-b815-ef5ea7c00e2b/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "16531746-5caf-40ce-9279-2d056d0b05e9",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/16531746-5caf-40ce-9279-2d056d0b05e9/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/16531746-5caf-40ce-9279-2d056d0b05e9/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "66f96758-5038-4556-97e8-54b35447808f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/66f96758-5038-4556-97e8-54b35447808f/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/66f96758-5038-4556-97e8-54b35447808f/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "76676941-2d55-402c-9673-2a94d0987902",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/76676941-2d55-402c-9673-2a94d0987902/videopreview.jobtemplate.mp4.342X192P_20HZ_350KBPS_VER_1_0.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/76676941-2d55-402c-9673-2a94d0987902/videopreview.jobtemplate.mp4.342X192P_20HZ_350KBPS_VER_1_0.mp4"
        }
      ]
    },
    {
      "id": "75c62e26-db66-47c7-b6b2-a2140d475514",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/75c62e26-db66-47c7-b6b2-a2140d475514/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/75c62e26-db66-47c7-b6b2-a2140d475514/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "7d73ebb3-e167-4d2c-8565-65203bbc0d74",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7d73ebb3-e167-4d2c-8565-65203bbc0d74/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7d73ebb3-e167-4d2c-8565-65203bbc0d74/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "2cf82097-eadc-43d4-8675-8dab8ee6cb25",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2cf82097-eadc-43d4-8675-8dab8ee6cb25/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2cf82097-eadc-43d4-8675-8dab8ee6cb25/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Red": "https://m.media-amazon.com/images/I/31vfANmrAlL._AC_SR38,50_.jpg",
    "Winered": "https://m.media-amazon.com/images/I/31pxZcubx3L._AC_SR38,50_.jpg",
    "White": "https://m.media-amazon.com/images/I/3152BLAhTmL._AC_SR38,50_.jpg",
    "Royal Blue": "https://m.media-amazon.com/images/I/31-kNjPS7pL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31BCQRw0WSL._AC_SR38,50_.jpg",
    "Green": "https://m.media-amazon.com/images/I/31I1PJnCMlL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Red": "417EjOyx35L",
    "Winered": "41GuX7CFByL",
    "White": "41IndAeIGUL",
    "Royal Blue": "41QfciZy5vL",
    "Black": "411HiwOwYYL",
    "Green": "41aVZIkNMOL"
  },
  "color_images": {
    "Red": [
      "https://m.media-amazon.com/images/I/417EjOyx35L._SL1500_.jpg"
    ],
    "Winered": [
      "https://m.media-amazon.com/images/I/41GuX7CFByL._SL1500_.jpg"
    ],
    "White": [
      "https://m.media-amazon.com/images/I/41IndAeIGUL._SL1500_.jpg"
    ],
    "Royal Blue": [
      "https://m.media-amazon.com/images/I/41QfciZy5vL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/411HiwOwYYL._SL1500_.jpg"
    ],
    "Green": [
      "https://m.media-amazon.com/images/I/41aVZIkNMOL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-maxi",
      "title": "Womens Maxi Dress Maxi",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51DHJaoUhmL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-formal-evening",
      "title": "Womens Dress Formal Evening",
      "price": 74.94,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51j+OhQCMyL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-mermaid-formal-bodycon-cocktail-one-shoulder",
      "title": "Womens Maxi Dress Evening Mermaid Formal Bodycon Cocktail One Shoulder",
      "price": 64.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71pyb7q1DFL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-bodycon-ruched",
      "title": "Womens Maxi Dress Long Sleeve Bodycon Ruched",
      "price": 35.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61MQj9KURYL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-v-neck-cocktail-evening-ruched",
      "title": "Womens Maxi Dress Long Sleeve V Neck Cocktail Evening Ruched",
      "price": 53.88,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71IDqGFqZLL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress-bodycon",
      "title": "Womens Dress Bodycon",
      "price": 82.48,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61DaLdgRW7L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-v-neck-bodycon",
      "title": "Womens Dress V Neck Bodycon",
      "price": 71.36,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71Y6PrsU2WL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-mermaid-formal",
      "title": "Womens Maxi Dress Evening Mermaid Formal",
      "price": 69.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51S4tr-XX1L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61udjSNVNzL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 14.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61MePepPHiL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi",
      "title": "Womens Maxi Dress Maxi",
      "price": 14.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71v17W250jL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-long-sleeve-cocktail-formal",
      "title": "Womens Maxi Dress Maxi Long Sleeve Cocktail Formal",
      "price": 44.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/619KL-XB3pL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-v-neck-formal-cocktail",
      "title": "Womens Maxi Dress V Neck Formal Cocktail",
      "price": 46.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51WnM-4ybmL._SL1500_.jpg"
      ]
    }
  ]
}