{
  "id": "womens-jumpsuit-wide-leg-sleeveless-off-shoulder",
  "handle": "womens-jumpsuit-wide-leg-sleeveless-off-shoulder",
  "sku": "JC1001",
  "asin": "B0DGGGB3W8",
  "title": "Womens Jumpsuit Wide Leg Sleeveless Off Shoulder",
  "title_original": "YMDUCH Women's Casual Sleeveless Off Shoulder Wide Leg Long Pant Jumpsuits",
  "brand": "Visit the YMDUCH Store",
  "price": 39.99,
  "social_proof": {
    "bought_past_month": 256,
    "text": "256+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/61r3UFa9bML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81fDvU1rA3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71rl44xCRzL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71pRWU1yBKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81DkgjF2gBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81tKfS90b+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81nD-6WF54L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Wu8rIeWZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61LGty47yZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61KDyPOu5CL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61nLT2PxNXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61-XSE61lPL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61-riX9aKPL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/61r3UFa9bML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81fDvU1rA3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71rl44xCRzL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71pRWU1yBKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81DkgjF2gBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81tKfS90b+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81nD-6WF54L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Wu8rIeWZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61LGty47yZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61KDyPOu5CL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61nLT2PxNXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61-XSE61lPL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61-riX9aKPL._SL1500_.jpg"
  ],
  "aplus_images": [
    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1e9512c1-b023-4a87-a602-7d2feb394a91.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4619b781-8e5f-4ab3-b325-3bef0f843a23.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/988c15d4-e683-41a8-8a2b-d94ca64dd77f.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e2d2514d-ba83-4736-87f1-043c10e6aeed.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
  ],
  "description_images": [
    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1e9512c1-b023-4a87-a602-7d2feb394a91.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4619b781-8e5f-4ab3-b325-3bef0f843a23.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/988c15d4-e683-41a8-8a2b-d94ca64dd77f.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e2d2514d-ba83-4736-87f1-043c10e6aeed.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
  ],
  "bullets": [],
  "specs": {
    "Item model number ‏": "‎ YM207",
    "Department ‏": "‎ Women",
    "Date First Available ‏": "‎ August 22, 2023",
    "ASIN ‏": "‎ B0CG96BYN6",
    "Customer Reviews": "4.2 4.2 out of 5 stars (1,161)"
  },
  "category": "",
  "variations": {
    "sizes": [
      "XS",
      "S",
      "M",
      "L",
      "XL"
    ],
    "colors": [
      "Red",
      "Winered",
      "Navy",
      "Purple",
      "Royalblue",
      "Black",
      "Green"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": null,
      "html": "\n        <table class=\"size-chart\">\n          <thead>\n            <tr>\n              <th>Size</th>\n              <th>Bust (in)</th>\n              <th>Waist (in)</th>\n              <th>Hips (in)</th>\n            </tr>\n          </thead>\n          <tbody>\n            <tr><td>XS</td><td>31-32</td><td>23-24</td><td>33-34</td></tr>\n            <tr><td>S</td><td>33-34</td><td>25-26</td><td>35-36</td></tr>\n            <tr><td>M</td><td>35-36</td><td>27-28</td><td>37-38</td></tr>\n            <tr><td>L</td><td>37-39</td><td>29-31</td><td>39-41</td></tr>\n            <tr><td>XL</td><td>40-42</td><td>32-34</td><td>42-44</td></tr>\n          </tbody>\n        </table>\n        "
    }
  },
  "reviews": {
    "average_rating": 4.2,
    "count": 1161,
    "customers_say": "Customers find the jumpsuit fits well, with one mentioning it's long enough for tall girls, and appreciate its flattering design that compliments body shape while hiding the stomach area. The material is thick and comfortable, with one customer noting it breathes well, while another mentions it's true to size. They like its appearance, with one customer noting it looks good even after multiple washes, and one describing it as \"drop dead gorgeous.\" Generated from the text of customer reviews Select to learn more Fit (179) Looks great (117) Quality (87) Material quality (82) Comfort (61) Flattering (50) Size (39) Color (35) 179 customers mention fit, 140 positive, 39 negative 179 customers mention \"Fit\" 140 positive 39 negative Customers are satisfied with how the jumpsuit fits, particularly noting that it accommodates curves well, with one customer mentioning it's long enough for tall girls. \" Perfect fit ! Material was a little heavy for high temperature but not overwhelming. Good price. Arrival time was on point.... \" Read more \" ...was just as beautiful true to size I’m 5”1 155 lbs and bought medium great fit . Material was great it looks expensive well made. \" Read more \" This jumpsuit is incredibly flattering and fits perfectly ! It hugs in all the right places and I’ve received so many compliments whenever I wear it.... \" Read more \" I loved this but too short for me even with sandals on. I’m 5’7 for reference \" Read more 117 customers mention looks great, 111 positive, 6 negative 117 customers mention \"Looks great\" 111 positive 6 negative Customers find the jumpsuit visually appealing, describing it as cute and classy, with one customer noting it maintains its appearance even after multiple washes. \" ...it 4 stars because the color was more of a plum color but it was still cute just not what I was looking for. \" Read more \" So the outfit is super cute . Loved it, loved the way it fit. However, I wore this to a wedding.... \" Read more \" ...As in, it tightens your stomach area a bit. So comfortable and classy . You can wear it for a backyard wedding or baby shower. \" Read more \" Beautiful Jumpsuit . Used for Ring Ceremony, good material, but heavy but falls nicely 10/10 recommend.... \" Read more 87 customers mention quality, 76 positive, 11 negative 87 customers mention \"Quality\" 76 positive 11 negative Customers find the jumpsuit to be of excellent quality, describing it as absolutely beautifully perfect. \" Wore this to a fashion show and received so many compliments. Great quality and fits my curves just right. \" Read more \" ...I ordered the 2XL and it fit be comfortably and perfect ! The material is thick so it's not see through.... \" Read more \" Such a great outfit and it hides my stomach. As in, it tightens your stomach area a bit. So comfortable and classy.... \" Read more \" ...I ordered it in Red too. Lots of compliments. Great fit and quality \" Read more 82 customers mention material quality, 61 positive, 21 negative 82 customers mention \"Material quality\" 61 positive 21 negative Customers like the material of the jumpsuit, finding it nice and thick, with one customer noting that it breathes well. \" Fit well. Good material , has some stretch. For me, I just wish it was a tab bit longer. Overall a satisfied purchase though \" Read more \" ...The material is nice and stretchy so I didn’t feel suffocated in it. You can also wear the shoulders both off, or either side! \" Read more \" Cheap material \" Read more \" ...I ordered the 2XL and it fit be comfortably and perfect! The material is thick so it's not see through.... \" Read more 61 customers mention comfort, 58 positive, 3 negative 61 customers mention \"Comfort\" 58 positive 3 negative Customers find the jumpsuit comfortable, with one mentioning it is very forgiving. \" This had it all: comfortable , stretchy, brilliant color, flattering, easy on/off. I added the belt (from Amazon) and it absolutely MADE the outfit.... \" Read more \" ...The fit is perfect for my body type. It doesn’t wrinkle and very comfortable .... \" Read more \" I wish I would have taken a photo but I didn't. It was so comfortable but also looks elegant. It didn't wrinkle, which I loved!... \" Read more \" Will order another color! So comfy and I received so many compliments! The dress in the same style is great, too.... \" Read more 50 customers mention flattering, 45 positive, 5 negative 50 customers mention \"Flattering\" 45 positive 5 negative Customers find the jumpsuit flattering from the waist down, complimenting their body shape and hiding their stomach. \" This had it all: comfortable, stretchy, brilliant color, flattering , easy on/off. I added the belt (from Amazon) and it absolutely MADE the outfit.... \" Read more \" Absolutely stunning! Great material and very flattering ! I’m just about 5 ft. I will need my highest heels or I might just fix the length. \" Read more \" ...The material is thick so it's not see through . I did use shape wear to smooth out my problem areas but I would def order in more colors . \" Read more \" ...When I say DROP DEAD GORGEOUS!! This jumpsuit was so flattering and comfortable for her. She felt and looked amazing!... \" Read more 39 customers mention size, 29 positive, 10 negative 39 customers mention \"Size\" 29 positive 10 negative Customers are satisfied with the fit of the jumpsuit, finding it true to size. \" ...The fabric and fit is comfortable. True to size . I gave it 4 not 5 stars because I wasn’t able to get it to stay off the shoulder very well. \" Read more \" This jumpsuit fits very nicely and runs true to size . The fabric irons easily and it’s comfortable while also looking elegant. It’s not see thru.... \" Read more \" Loved it but not true to size . Runs small \" Read more \" The romper was true to size . The material is very nice and stretchy, fits perfect, I am 5 ‘5 170 pounds and the medium fit me perfectly. \" Read more 35 customers mention color, 26 positive, 9 negative 35 customers mention \"Color\" 26 positive 9 negative Customers like the color of the jumpsuit, particularly its bright orange-red shade, with one customer noting it can be paired with any color. \" Black jumpsuit ... \" Read more \" just what i wanted. fits nice and love the color . true to size \" Read more \" The outfit was nice but the color is not purple and also this was a return item when I open the seal the jumpsuit was all turn inside oute, twisted,... \" Read more \" I loved the color and it fit perfectly. Didn't run too big or small and I ordered a large. Very classy looking out for the event I wore it to. \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Perfect!!",
        "body": "I am beyond picky with clothes and I am never satisfied/think anything looks good on me. That being said, I love this!! It was comfortable, quality material, hides the belly, and there are multiple different ways to style the top! I also paired a gold chain belt to help break up the top and bottom. I am 5’3, 160lbs, 32J bra size Medium fit perfectly! I was worried about the pants sense I’m short, but they were fine with small small heels! Read more",
        "author": "Brittany",
        "rating": 5.0,
        "date": "October 9, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61oipQukGtL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/61FWVDOv7BL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Very comfortable and elegant!",
        "body": "This jumpsuit is incredibly comfortable. The fabric is excellent quality, soft, and fits your body beautifully. It hugs your shape in a flattering way and looks very elegant. Perfect for dressing up or down depending on the occasion. I highly recommend it! Read more",
        "author": "Diana Garcia",
        "rating": 5.0,
        "date": "July 26, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Causal night out",
        "body": "Package was on time and fit perfectly! I got a XL but i could have got a L. It was thick as well which i like. Very cute for a casual night out Read more",
        "author": "AJ",
        "rating": 5.0,
        "date": "December 12, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Yes for this jumper.",
        "body": "Get this. This was a great buy. If there was a belt of any kind and pockets, I would have given it 5 stars. The color was good. It is comfortable to wear and easy to slip on/off without touching the zipper. It can be dressed up or down. The back is low enough to be cute but not too low to show your undergarments. I did not wear a strapless bra because a regular bra worked fine without using the right-side strap. The material is has a little stretch so it is flattering but not too much stretch to cheapen the look. The material is thick enough not to be see through but not thick enough to be stiff. The fit is true to size. I'm 5'6, 155-160lbs, 30% body fat, 25.5 bmi and a medium fit perfectly like the model. I can see getting more colors if it washes well and i anticipate that it will wash well based on its good quality. I'll update the review if it does not wash well in the gentle cycle. Update: Washed it 2 times & it still looks like new. Read more",
        "author": "Jay",
        "rating": 4.0,
        "date": "April 30, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61liuiprToL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/61rSiKZrE6L._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/61RUq+oa0ML._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/719+nKdsSEL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71y+HQIhE1L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Fabulous!",
        "body": "I'm 5'10. This jumpsuit fit perfectly. The fabric is very soft and right for the occasion. Easy to get on and off. I didn't need to unzip when using the restroom. I'm ordering more colors. Read more",
        "author": "Aleethea",
        "rating": 5.0,
        "date": "November 24, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61ob+c8h1jL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71FSYuQviML._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Quality, comfortable, vibrant color blue",
        "body": "This outfit was well made and beautiful blue color! Was comfortable to wear all night at wedding, and received so many compliments! Did not get a picture, but I dressed it up with rhinestone necklace, tennis bracelet and earrings, elegant! Read more",
        "author": "Customer",
        "rating": 5.0,
        "date": "October 28, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Cute but maybe size up",
        "body": "Super cute jumpsuit but fits snug on the hips and booty. Read more",
        "author": "Jessie",
        "rating": 3.0,
        "date": "August 8, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars overall cute",
        "body": "Rcvd today. Ordered szM, I’m 5’6 128lbs. It’s pretty baggy and could’ve gone with a szS but need for event tomorrow so will wash and dry in hopes to shrink it. Also, the sleeves do not sit as cute as the pic on the model but will make it work. Returning this and going to reorder due to sewing off seam at bottom of zipper and makes it look like a lump in the butt. Material is a little cheap. Overall is great for the $ and recommend sizing down. Read more",
        "author": "Samanth",
        "rating": 4.0,
        "date": "May 6, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Jumpsuit Wide Leg Sleeveless Off Shoulder is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.",
  "about_this_item": "Womens Jumpsuit Wide Leg Sleeveless Off Shoulder is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.",
  "long_description": "Womens Jumpsuit Wide Leg Sleeveless Off Shoulder is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: XS, S, M, L, XL.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Red, Winered, Navy, Purple, Royalblue, Black, Green. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Jumpsuit Wide Leg Sleeveless Off Shoulder is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: XS, S, M, L, XL."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1e9512c1-b023-4a87-a602-7d2feb394a91.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
      "alt": "Womens Jumpsuit Wide Leg Sleeveless Off Shoulder details image 1"
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4619b781-8e5f-4ab3-b325-3bef0f843a23.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
      "alt": "Womens Jumpsuit Wide Leg Sleeveless Off Shoulder details image 2"
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/S/aplus-media-library-service-media/988c15d4-e683-41a8-8a2b-d94ca64dd77f.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
      "alt": "Womens Jumpsuit Wide Leg Sleeveless Off Shoulder details image 3"
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e2d2514d-ba83-4736-87f1-043c10e6aeed.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
      "alt": "Womens Jumpsuit Wide Leg Sleeveless Off Shoulder details image 4"
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Red, Winered, Navy, Purple, Royalblue, Black, Green. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "c698885f-d211-45e1-8802-36e68be40798",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c698885f-d211-45e1-8802-36e68be40798/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c698885f-d211-45e1-8802-36e68be40798/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "8687d408-aa1c-426f-8760-42207e929c95",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8687d408-aa1c-426f-8760-42207e929c95/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8687d408-aa1c-426f-8760-42207e929c95/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "ac17c2b5-fe16-41b6-8a92-25a37f85d05f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ac17c2b5-fe16-41b6-8a92-25a37f85d05f/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ac17c2b5-fe16-41b6-8a92-25a37f85d05f/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "ad6b86af-e332-4de0-99ca-21b19edd017d",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ad6b86af-e332-4de0-99ca-21b19edd017d/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ad6b86af-e332-4de0-99ca-21b19edd017d/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Red": "https://m.media-amazon.com/images/I/31U4cqkXA3L._AC_SR38,50_.jpg",
    "Winered": "https://m.media-amazon.com/images/I/31sJui7q5HL._AC_SR38,50_.jpg",
    "Navy": "https://m.media-amazon.com/images/I/31F0FLNDFLL._AC_SR38,50_.jpg",
    "Purple": "https://m.media-amazon.com/images/I/31a7uRXeIEL._AC_SR38,50_.jpg",
    "Royalblue": "https://m.media-amazon.com/images/I/31p-59jzhVL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31w4XPeFDOL._AC_SR38,50_.jpg",
    "Green": "https://m.media-amazon.com/images/I/31KFveotDNL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Red": "61Wu8rIeWZL",
    "Winered": "61LGty47yZL",
    "Navy": "61KDyPOu5CL",
    "Purple": "61nLT2PxNXL",
    "Royalblue": "61-XSE61lPL",
    "Black": "61-riX9aKPL",
    "Green": "61r3UFa9bML"
  },
  "color_images": {
    "Red": [
      "https://m.media-amazon.com/images/I/61Wu8rIeWZL._SL1500_.jpg"
    ],
    "Winered": [
      "https://m.media-amazon.com/images/I/61LGty47yZL._SL1500_.jpg"
    ],
    "Navy": [
      "https://m.media-amazon.com/images/I/61KDyPOu5CL._SL1500_.jpg"
    ],
    "Purple": [
      "https://m.media-amazon.com/images/I/61nLT2PxNXL._SL1500_.jpg"
    ],
    "Royalblue": [
      "https://m.media-amazon.com/images/I/61-XSE61lPL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/61-riX9aKPL._SL1500_.jpg"
    ],
    "Green": [
      "https://m.media-amazon.com/images/I/61r3UFa9bML._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-evening-bodycon-sleeveless-off-shoulder-formal",
      "title": "Womens Maxi Dress Evening Bodycon Sleeveless Off Shoulder Formal",
      "price": 53.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/511YfTNHu2L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-long-sleeve-bodycon-formal-off-shoulder",
      "title": "Womens Maxi Dress Evening Long Sleeve Bodycon Formal Off Shoulder",
      "price": 55.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61b4b43URDL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-short-sleeve-split-bodycon-ruched-high-split-boat-neck",
      "title": "Womens Maxi Dress Short Sleeve Split Bodycon Ruched High Split Boat Neck",
      "price": 47.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51NZ2UbUgoL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-pumps-platform-stiletto-suede-cross-strap-open-toe",
      "title": "Womens Pumps Platform Stiletto Suede Cross Strap Open Toe",
      "price": 49.9,
      "category": "Clothing, Shoes & Jewelry > Women > Shoes > Sandals > Heeled Sandals",
      "images": [
        "https://m.media-amazon.com/images/I/71FNcxY2RyL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-pumps-platform-stiletto-suede-cross-strap-open-toe",
      "title": "Womens Pumps Platform Stiletto Suede Cross Strap Open Toe",
      "price": 49.9,
      "category": "Clothing, Shoes & Jewelry > Women > Shoes > Sandals > Heeled Sandals",
      "images": [
        "https://m.media-amazon.com/images/I/71FNcxY2RyL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-bodycon-sleeveless-off-shoulder-formal",
      "title": "Womens Maxi Dress Evening Bodycon Sleeveless Off Shoulder Formal",
      "price": 53.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/511YfTNHu2L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-short-sleeve-split-bodycon-ruched-high-split-boat-neck",
      "title": "Womens Maxi Dress Short Sleeve Split Bodycon Ruched High Split Boat Neck",
      "price": 47.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51NZ2UbUgoL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-long-sleeve-bodycon-formal-off-shoulder",
      "title": "Womens Maxi Dress Evening Long Sleeve Bodycon Formal Off Shoulder",
      "price": 55.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61b4b43URDL._SL1500_.jpg"
      ]
    }
  ]
}