{
  "id": "womens-maxi-dress-bodycon-sleeveless-cocktail-formal-maxi",
  "handle": "womens-maxi-dress-bodycon-sleeveless-cocktail-formal-maxi",
  "sku": "JC2254",
  "asin": "B0D879ST5X",
  "title": "Womens Maxi Dress Bodycon Sleeveless Cocktail Formal Maxi",
  "title_original": "Popilush Women Shapewear Maxi Dress Sleeveless Long Formal Cocktail Party Elegant Bodycon Dresses Built-in Bra",
  "brand": "Visit the Popilush Store",
  "price": 131.99,
  "social_proof": {
    "bought_past_month": 50,
    "text": "50+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/71Rwsuu+GKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71MycZROkrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61D2eF30Q4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81eBypplw-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/715Mb3vIfdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/618RvWepbEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/715QAVFbwcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71UN0Zda81L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/617PpYBObpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81K71z86L6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61KuchoQYEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ssGvKtFUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81I4skMChNL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Nve-2i24L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91BdSvJpPTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71pKdjkUrFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/6190rTWkW+L._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/71Rwsuu+GKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71MycZROkrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61D2eF30Q4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81eBypplw-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/715Mb3vIfdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/618RvWepbEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/715QAVFbwcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71UN0Zda81L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/617PpYBObpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81K71z86L6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61KuchoQYEL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ssGvKtFUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81I4skMChNL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Nve-2i24L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91BdSvJpPTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71pKdjkUrFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/6190rTWkW+L._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ August 29, 2024",
    "ASIN ‏": "‎ B0DFKPMFJN",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#171,884 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #872 in Women's Formal Dresses",
    "Customer Reviews": "3.9 3.9 out of 5 stars (176)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Black",
      "Champagne",
      "Green"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 3.9,
    "count": 176,
    "customers_say": "Customers find the dress elegant with amazing colors and appreciate its comfort, quality, and flattering design that accentuates curves. The material feels luxurious, and they like the built-in shapewear feature. While some it fits great, others find it too snug. Customers consider the dress worth its price. Generated from the text of customer reviews Select to learn more Elegance (23) Comfort (20) Quality (20) Flattering (17) Material quality (14) Shape wear (14) Value for money (10) Fit (25) 23 customers mention elegance, 22 positive, 1 negative 23 customers mention \"Elegance\" 22 positive 1 negative Customers find the dress elegant, with several noting its amazing color, and one mentioning that the design concept is great. \" Pretty dress , fit quite snuggly over the torso. Like the inner spandex. \" Read more \" Comfortable. The built in shapewear ROCKS! The dress looks gorgeous on . Wore it to a wedding and taking on cruise for formal night. \" Read more \" Very elegant but easy to wear. Wasn't even hard to go to the restroom with it and that's a plus for any dress.... \" Read more \" ...that i would feel restricted because of the shape wear but it was so elegant and comfortable! Definitely buying more from this brand! \" Read more 20 customers mention comfort, 19 positive, 1 negative 20 customers mention \"Comfort\" 19 positive 1 negative Customers find the dress comfortable, with one mentioning it is extremely forgiving. \" ...I had no lines! It smoothed me out greatly. It was actually comfortable . There was a cut out in shapewear so you can use the bathroom. Genius!... \" Read more \" Absolutely love this! Very comfortable and flattering. \" Read more \" ...It is a very comfortable dress and I loved the built shareware. \" Read more \" ...It is so comfortable and flattering!! It gives all the perfect curves!! I will be buying more popilush for sure!! 5’4 160 lbs large fits like a glove! \" Read more 20 customers mention quality, 18 positive, 2 negative 20 customers mention \"Quality\" 18 positive 2 negative Customers find the dress to be of great quality, with one customer specifically noting its excellent craftsmanship. \" Great dress love the support that comes built in \" Read more \" 10/10 perfect dress . I got SO MANY compliments. \" Read more \" This is a nice dress . I wore to a formal wedding. I bought a rhinestone belt that tied to dress it up more. The dress material does pull easily.... \" Read more \" ...I ended up washing it. The dress itself was very nice and fit great. Just wished they would inspect returned clothing before sending to customers. \" Read more 17 customers mention flattering, 14 positive, 3 negative 17 customers mention \"Flattering\" 14 positive 3 negative Customers find the dress flattering, with one customer noting how it accentuates every curve including the belly, while another mentions how it elongates the silhouette. \" ...It is so comfortable and flattering !! It gives all the perfect curves!! I will be buying more popilush for sure!! 5’4 160 lbs large fits like a glove! \" Read more \" ...love the shape where built in the outer later is pretty thin, but very flattering just doesn’t have the quality for the price. \" Read more \" It fits just like the picture. This is a very flattering dress and the lining underneath really does help tuck you in just right.... \" Read more \" ...The fit is incredibly flattering – it hugs all the right places while still being comfortable enough to move and breathe easily.... \" Read more 14 customers mention material quality, 11 positive, 3 negative 14 customers mention \"Material quality\" 11 positive 3 negative Customers like the dress's material, describing it as luxurious and nice, with one customer noting its shiny appearance and another mentioning its flexible texture. \" The fabric is so soft ! It’s a little long, but overall very happy so far.... \" Read more \" ...The material was soft but the shape wear inside was so tight it made me feel like I was stuffed into it. \" Read more \" VERY pretty dress. The material was really nice . I'm fitting mostly in Mediums these days, but opted for a large just to be safe.... \" Read more \" Ordered this dress for a summer wedding. Material was not as expected so I returned it. I was told refund would not be processed.... \" Read more 14 customers mention shape wear, 11 positive, 3 negative 14 customers mention \"Shape wear\" 11 positive 3 negative Customers like the shapewear features of the dress, with one mentioning that the bra and shapewear are built in, while another notes how it accentuates the waist. \" The dress is nice and love the shape where built in the outer later is pretty thin, but very flattering just doesn’t have the quality for the price. \" Read more \" Bought for a evening wedding, no need for annoying shapewear with it built in. Very sexy and classy look. Great staple piece at a reasonable price \" Read more \" ...I really liked that the bra and shapewear are built in , as for formal occasions I always seem to be on the hunt for the right bra that won't show... \" Read more \" ...The material was soft but the shape wear inside was so tight it made me feel like I was stuffed into it. \" Read more 10 customers mention value for money, 8 positive, 2 negative 10 customers mention \"Value for money\" 8 positive 2 negative Customers find the dress worth its price. \" ...Also a great price considering it's an \"all in one.\" \" Read more \" ...Do yourself a favor, just buy it already. You won’t regret it. So worth the money in every way. Oh- AND it’s super easy and practical to clean, too.... \" Read more \" ...Definitely worth the price ! \" Read more \" Wasn’t happy with the material for the price and the shape wear is NOT size to fit, it’s definitely smaller \" Read more 25 customers mention fit, 17 positive, 8 negative 25 customers mention \"Fit\" 17 positive 8 negative Customers have mixed experiences with how the dress fits, with some finding it great while others say it's too snug. \" Fits well . \" Read more \" I really liked the compression wear. The dress fit great .... \" Read more \" ...I returned because it was too long on me and didn’t fall nicely. The body shapewear underneath seemed to be comfortable and would be easy to use. \" Read more \" Dress fit beautifully . ordered an xl could have worn the large. Color was amazing and I will be ordering again in another color.... \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Get this dress!",
        "body": "Dress fit beautifully. ordered an xl could have worn the large. Color was amazing and I will be ordering again in another color. I needed a versatile dress I could wear again and again. Ordered for a 50s theme bday party to wear with long gloves and a fascinator. Complements all night! Now I have an alternative cocktail dress to wear during the holidays too. Read more",
        "author": "Twlia",
        "rating": 5.0,
        "date": "November 2, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Best product!",
        "body": "This dress was awesome. I loved the shapewear inside. I had no lines! It smoothed me out greatly. It was actually comfortable. There was a cut out in shapewear so you can use the bathroom. Genius! Highly recommended. I think if I ever need a fancy dress again, I will buy from this brand. So easy! Read more",
        "author": "Alison Hunt",
        "rating": 5.0,
        "date": "September 22, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "1.0 out of 5 stars Unflatering and sadly, it’s not wearable for me.",
        "body": "I was initially very excited about this dress, especially because it came with a built-in girdle, which I thought would offer a flattering fit. As someone who is short and curvy, I was hopeful that it would complement my shape. Unfortunately, I was disappointed when the dress arrived. While the design concept is great, the material is extremely thin and see-through, making it unflattering and revealing in all the wrong ways. It did not provide the coverage or support I expected, and it highlighted every imperfection rather than smoothing them out. Sadly, it’s not wearable for me. Read more",
        "author": "Ariana H.",
        "rating": 1.0,
        "date": "May 4, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Overall- great dress for wedding",
        "body": "This dress worked great for my bridesmaids dress after there was a mishap with my original dress at the tailors. The shapeware really sucks you in, but makes it a little difficult to go to the bathroom. I got a lot of compliments on the dress and the fabric was stretchy and comfortable. The only reason I give 4 stars is I got some of the photos back and in the sun, you can see the outlines of my legs so it was slightly see through. The size fit great and the style was exactly what I was hoping for. Read more",
        "author": "Callie",
        "rating": 4.0,
        "date": "November 4, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Great Dress",
        "body": "Must Buy! I purchased for a formal wedding and the shapewear did it's job! It was a little hard to slip up since shapewear was under but good once it was fully on. Read more",
        "author": "Monica Cepeda",
        "rating": 5.0,
        "date": "October 14, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Comfortable and elegant",
        "body": "Loved this dress! I was worried that i would feel restricted because of the shape wear but it was so elegant and comfortable! Definitely buying more from this brand! Read more",
        "author": "Coral",
        "rating": 5.0,
        "date": "November 7, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Very nice but big flaw",
        "body": "I really liked the compression wear. The dress fit great. I didn't like the string at the shoulders that control where the neckline sits, on or off shoulder Read more",
        "author": "Customer",
        "rating": 3.0,
        "date": "December 21, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71b1bUJhzDL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71ZDXdvyECL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/81-8adGOiEL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Date night",
        "body": "Amazing sexy evening dress. The material is soft yet stretchy. The length goes to my ankles. The bold bright color is flattering in all lights. Read more",
        "author": "T A.",
        "rating": 5.0,
        "date": "October 6, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Bodycon Sleeveless Cocktail Formal Maxi is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.",
  "about_this_item": "Womens Maxi Dress Bodycon Sleeveless Cocktail Formal Maxi is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.",
  "long_description": "Womens Maxi Dress Bodycon Sleeveless Cocktail Formal Maxi is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Black, Champagne, Green. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Bodycon Sleeveless Cocktail Formal Maxi is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Black, Champagne, Green. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "4f318cae-efcf-40b0-b5f9-41519e5f4fe4",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4f318cae-efcf-40b0-b5f9-41519e5f4fe4/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4f318cae-efcf-40b0-b5f9-41519e5f4fe4/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "bfb8cb20-a6b2-43e9-9d75-547487e63aa8",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bfb8cb20-a6b2-43e9-9d75-547487e63aa8/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bfb8cb20-a6b2-43e9-9d75-547487e63aa8/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "8bd56056-32c1-42b1-8ac1-c4800bcba2a9",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8bd56056-32c1-42b1-8ac1-c4800bcba2a9/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8bd56056-32c1-42b1-8ac1-c4800bcba2a9/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "c274b186-cb79-4ae7-95c4-23b8ecf88e01",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c274b186-cb79-4ae7-95c4-23b8ecf88e01/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c274b186-cb79-4ae7-95c4-23b8ecf88e01/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Black": "https://m.media-amazon.com/images/I/31U4PsJC+DL._AC_SR38,50_.jpg",
    "Champagne": "https://m.media-amazon.com/images/I/31uAu0k3s9L._AC_SR38,50_.jpg",
    "Green": "https://m.media-amazon.com/images/I/31SrKSpT-AL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Black": "71Rwsuu+GKL",
    "Champagne": "715QAVFbwcL",
    "Green": "71ssGvKtFUL"
  },
  "color_images": {
    "Black": [
      "https://m.media-amazon.com/images/I/71Rwsuu+GKL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71MycZROkrL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61D2eF30Q4L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81eBypplw-L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/715Mb3vIfdL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/618RvWepbEL._SL1500_.jpg"
    ],
    "Champagne": [
      "https://m.media-amazon.com/images/I/715QAVFbwcL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71UN0Zda81L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/617PpYBObpL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81K71z86L6L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/715Mb3vIfdL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61KuchoQYEL._SL1500_.jpg"
    ],
    "Green": [
      "https://m.media-amazon.com/images/I/71ssGvKtFUL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81I4skMChNL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71Nve-2i24L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/91BdSvJpPTL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71pKdjkUrFL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/6190rTWkW+L._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-maxi",
      "title": "Womens Maxi Dress Maxi",
      "price": 45.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61k1VRjVZfL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-off-shoulder",
      "title": "Womens Maxi Dress Off Shoulder",
      "price": 159.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/71gSdMwmvyL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-short-sleeve",
      "title": "Womens Dress Short Sleeve",
      "price": 43.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/717xtYbOEOL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-ruched-mermaid-evening-formal",
      "title": "Womens Maxi Dress Ruched Mermaid Evening Formal",
      "price": 82.68,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51-8aH+KY1L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-off-shoulder-evening-mermaid-formal",
      "title": "Womens Maxi Dress Off Shoulder Evening Mermaid Formal",
      "price": 69.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/516t48G6e+L._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 324.43,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/41gTuGV5SBL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-bodycon-evening-cocktail",
      "title": "Womens Dress Bodycon Evening Cocktail",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51XdzLVtavL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-ruched-long-sleeve",
      "title": "Womens Maxi Dress Maxi Ruched Long Sleeve",
      "price": 54.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71jybg4ZruL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-ruched",
      "title": "Womens Maxi Dress Long Sleeve Ruched",
      "price": 38.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61wx6wsmeQL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-formal-long-sleeve-ruched-bodycon",
      "title": "Womens Maxi Dress Maxi Formal Long Sleeve Ruched Bodycon",
      "price": 68.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51eNGYYXt8L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-ruched-formal",
      "title": "Womens Maxi Dress Ruched Formal",
      "price": 89.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51k0HyKFDGL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-maxi",
      "title": "Womens Maxi Dress Long Sleeve Maxi",
      "price": 24.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61KqvtQHyqL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-cocktail-mermaid-evening-split-maxi",
      "title": "Womens Maxi Dress Formal Cocktail Mermaid Evening Split Maxi",
      "price": 72.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71CJS69x3xL._SL1500_.jpg"
      ]
    }
  ]
}