{
  "id": "womens-maxi-dress-long-sleeve-formal-bodycon",
  "handle": "womens-maxi-dress-long-sleeve-formal-bodycon",
  "sku": "JC1987",
  "asin": "B0D5D5JYD3",
  "title": "Womens Maxi Dress Long Sleeve Formal Bodycon",
  "title_original": "MEROKEETY Women's Fall 2025 Long Sleeve Bodycon Sweater Dress Button Crew Neck Winter Formal Mini Dresses",
  "brand": "Visit the MEROKEETY Store",
  "price": 36.99,
  "social_proof": {
    "bought_past_month": 880,
    "text": "880+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/61GBgs5yftL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61bsJpVPhoL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61vD-Ll3oLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61nY8OIAW-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71WsSXExJxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61445QIN2PL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/616yZ0C1cKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Mtp-8ew-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61BtTCoUoML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61LRVyVe+SL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61hwNY1lQIL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Pu6lWCnYL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61KaJ2Dg8JL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61OLmk1UYfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Z3lbFhrlL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/610CTl59-CL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61sQH2EDPJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61e+0qIMLPL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61EWI22RkPL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61PvoYWWu2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71IX9sbYd9L._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/61GBgs5yftL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61bsJpVPhoL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61vD-Ll3oLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61nY8OIAW-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71WsSXExJxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61445QIN2PL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/616yZ0C1cKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Mtp-8ew-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61BtTCoUoML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61LRVyVe+SL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61hwNY1lQIL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Pu6lWCnYL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61KaJ2Dg8JL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61OLmk1UYfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Z3lbFhrlL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/610CTl59-CL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61sQH2EDPJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61e+0qIMLPL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61EWI22RkPL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61PvoYWWu2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71IX9sbYd9L._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Item model number ‏": "‎ Elegant Formal Mini Dresses",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ July 21, 2024",
    "ASIN ‏": "‎ B0D5D5TCZV",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#17,934 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #149 in Women's Club & Night Out Dresses",
    "Customer Reviews": "4.3 4.3 out of 5 stars (641)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Wine",
      "Dark Coffee",
      "Watermelon",
      "Army Green",
      "Black",
      "Light Yellow",
      "Coffee",
      "Lightgrey",
      "Oatmeal",
      "Taro",
      "Light Blue",
      "Navy",
      "Khaki",
      "Ivory",
      "Light Pink",
      "Green"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.3,
    "count": 641,
    "customers_say": "Customers find the dress chic with beautiful gold buttons and appreciate its quality construction, with one noting it feels like a high-end purchase. The fabric receives positive feedback for being soft and well-presented, and customers find it comfortable and not itchy for a sweater dress, with many colors to choose from. While some customers find it true to size, others report it runs large, and opinions about the length are mixed, with some loving it while others find it too short. Generated from the text of customer reviews Select to learn more Style (117) Quality (104) Fit (86) Fabric quality (63) Comfort (40) Color variety (27) Size (45) Length (27) 117 customers mention style, 109 positive, 8 negative 117 customers mention \"Style\" 109 positive 8 negative Customers appreciate the dress's style, describing it as chic, classic, and sophisticated, with beautiful gold buttons that make it look more expensive. \" I got this dress yesterday, in a word - it's BEAUTIFUL ! The knit fabric feels luxurious, the buttons are placed perfectly, and the color is gorgeous.... \" Read more \" Beautiful dress wonderful fabric great for winter time just returning it because it's too big and it's the same color as the bridesmaids dresses \" Read more \" Cute dress but ran big.. I usually wear a medium/size 10, but this was big — the sleeves, waist and the shoulder seam hung off my shoulders.... \" Read more \" Cute & comfy wish it was a tad longer... \" Read more 104 customers mention quality, 100 positive, 4 negative 104 customers mention \"Quality\" 100 positive 4 negative Customers praise the dress's construction, describing it as a perfect fall piece, though some note it has cheap quality. \" Great quality , beautiful detail with the gold buttons. So many colors to choose from too. Buy it you won’t regret it!! \" Read more \" Great dress , many compliments - pair with boots in the winter or flats in the spring! Dress up or down! \" Read more \" Really stylish and well made for work or date night. Good quality . Great price. Ordered a large first as suggested, but returned for a medium. \" Read more \" This dress is a winner. Perfect weight, well made and comes in a variety of colors. Looks awesome with boots. Get compliments every time I wear it.... \" Read more 86 customers mention fit, 63 positive, 23 negative 86 customers mention \"Fit\" 63 positive 23 negative Customers are satisfied with how the dress fits, with one mentioning it hits above the knee. \" This was a perfect fit . The fabric was knitted perfectly , great quality and very comfortable. \" Read more \" I love this dress. It’s a perfect work dress for fall/winter. It fits like a glove . Nice quality material. I may just get more in different colors! \" Read more \" ...wonderful fabric great for winter time just returning it because it's too big and it's the same color as the bridesmaids dresses \" Read more \" I ordered the black medium and it was true to my size. Great fit and soft fabric \" Read more 63 customers mention fabric quality, 60 positive, 3 negative 63 customers mention \"Fabric quality\" 60 positive 3 negative Customers appreciate the fabric of the dress, describing it as beautiful, soft, and well-presented. \" ...Fabric is very high quality, soft ,súper stretchy ,fit was fitted yet loose. Length was Mid thigh and the color was just as pictured.... \" Read more \" Beautiful and nice fabric but runs large \" Read more \" Loved this dress. Nice material . Can be dressed up or down. Simple and classy. Returning for a smaller size. I’m 5’4, 125 lbs. Need a medium. \" Read more \" Great material and the fit is perfect \" Read more 40 customers mention comfort, 40 positive, 0 negative 40 customers mention \"Comfort\" 40 positive 0 negative Customers find the dress comfortable and cozy, noting that it's not itchy for a sweater dress. \" Beautiful and comfortable exactly what I was looking for. Thickness is perfect and fair sizing. Machine wash is ok just be careful when ironing it. \" Read more \" This dress is so elegant. It is very comfortable and the material is not cheap or thin. It is lined so the tweed doesn’t bother me at all.... \" Read more \" ...The fabric is gorgeous and the size is perfect . It is so comfortable and I have ordered many in different colors. \" Read more \" This is so comfy and classy dress! I received many compliments. I bought a small, I'm 5'4 and 123 lbs.... \" Read more 27 customers mention color variety, 25 positive, 2 negative 27 customers mention \"Color variety\" 25 positive 2 negative Customers like the dress's color variety, with several mentioning it comes in many shades to choose from, and one customer noting it's a perfect black dress. \" ...Washed and dried (inside out) still perfect shape and color . It’s thick will be nice for winter with some boots. Can be dressy or casual imo. \" Read more \" Fits perfect! Great color ! \" Read more \" This dress is perfect for church, brunch , going out. Needed an easy steam and it looks so polished and expensive. \" Read more \" Perfect black dress for work , church or an event! True to size! Very comfortable and warm for winter months! \" Read more 45 customers mention size, 24 positive, 21 negative 45 customers mention \"Size\" 24 positive 21 negative Customers have mixed experiences with the dress's fit, with some finding it true to size while others report it runs large. \" There’s nothing that I don’t love about this dress. It is true to size and seems of great quality not too thin, not too thick. \" Read more \" It is a cute dress but runs large . I did return it. If purchased again I'd go with one size down. The fabric is nice (doesn't feel cheap!). \" Read more \" Runs big ! \" Read more \" Cute dress but ran big .. I usually wear a medium/size 10, but this was big — the sleeves, waist and the shoulder seam hung off my shoulders.... \" Read more 27 customers mention length, 10 positive, 17 negative 27 customers mention \"Length\" 10 positive 17 negative Customers have mixed opinions about the dress's length, with some loving it while others find it too short, particularly noting it's not suitable for shorter women. \" SO sad! This dress is SO nice but it is too short .... \" Read more \" Great quality, skims the body so there is a subtle shape. \" Read more \" ...I am 5‘2“ and weigh 100 pounds and the dress was too long and too baggy for my frame. Overall, I am very impressed with this dress. \" Read more \" ...Flattering, nicely made..... It was just too long on me ; I'm 5' tall & I wanted it to be above my knee like the model photo.... \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Smart and stylish",
        "body": "Love,love,love- the fit/material/styling. Very well made. Now I have one with long sleeves and the same dress with short sleeves. Highly recommend! Read more",
        "author": "Customer",
        "rating": 5.0,
        "date": "December 5, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Professional and cute",
        "body": "Beautiful and comfortable exactly what I was looking for. Thickness is perfect and fair sizing. Machine wash is ok just be careful when ironing it. Read more",
        "author": "Fernanda Fraide",
        "rating": 5.0,
        "date": "December 17, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/81hQbwkDFtL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "4.0 out of 5 stars The quality is really good!!",
        "body": "This dress is so pretty!! The quality is really good for the cost!! The fabric is soft and not plastic feeling. I want to keep it but it’s not made for my body style-sad!! I may order the next size up and try again!! Read more",
        "author": "B. Murray",
        "rating": 4.0,
        "date": "August 30, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Wonderful dress. 5’2” 158#",
        "body": "Ordered this dress for a funeral. I looked at multiple different stores and couldn’t find anything appropriate. The fit was perfect! The fabric was great, I was concerned since it was a knit it would lose its shape but I wore it for at least twelve hours straight and it still looks great! Couldn’t be happier. Received many compliments. Read more",
        "author": "Sherrie",
        "rating": 5.0,
        "date": "November 18, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Quality style cut and how gorgeous it is",
        "body": "This dress is probably one of the best dresses I ever bought in my entire life. It was mistaken for much higher end brand by many people. I love the look of it, the weight of it and the cut of it. This dress definitely should be a staple in every woman’s wardrobe.! I’m 5’10 and 185lbs for reference Read more",
        "author": "Customer",
        "rating": 5.0,
        "date": "December 17, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Sizing is an issue",
        "body": "The dress is good quality but I had to give it fewer stars because of the sizing. I have purchased 3 of the short sleeve versions of this same dress in small and the fit was perfect for me. I am 4'10\" and 103lbs so the length was never going to be mini on me, but because I'm 70 years old, I'm ok with that. The hem on the short sleeve dresses hits perfectly at the bend of the knee. The long sleeve dress is about a size larger than the short sleeve dresses, all labeled \"S\". The waist is longer and the skirt is midi on me. I like the color very much and I needed a long sleeve dress for cooler days so I am keeping it but the quality control on sizing is not good. Read more",
        "author": "Jane S.",
        "rating": 3.0,
        "date": "November 8, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Love that dress",
        "body": "I own a several dress from this brand. I love it . Its so classy and comfortable Read more",
        "author": "daniela",
        "rating": 5.0,
        "date": "December 18, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars nothing",
        "body": "Material is higher quality than expected fits nice, could have downsized to a med,but with holidays and all. It is a quility peiece for the price. Read more",
        "author": "PattI",
        "rating": 5.0,
        "date": "December 20, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Long Sleeve Formal Bodycon is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.",
  "about_this_item": "Womens Maxi Dress Long Sleeve Formal Bodycon is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.",
  "long_description": "Womens Maxi Dress Long Sleeve Formal Bodycon is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Wine, Dark Coffee, Watermelon, Army Green, Black, Light Yellow, Coffee, Lightgrey, Oatmeal, Taro, Light Blue, Navy, Khaki, Ivory. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Long Sleeve Formal Bodycon is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Wine, Dark Coffee, Watermelon, Army Green, Black, Light Yellow, Coffee, Lightgrey, Oatmeal, Taro, Light Blue, Navy, Khaki, Ivory. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "5f5dafb5-926d-4d42-8dae-6d93ced215f7",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5f5dafb5-926d-4d42-8dae-6d93ced215f7/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5f5dafb5-926d-4d42-8dae-6d93ced215f7/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "954df768-ceea-4abd-a48d-bb4c10f2592e",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/954df768-ceea-4abd-a48d-bb4c10f2592e/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/954df768-ceea-4abd-a48d-bb4c10f2592e/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "a61ad829-11f9-42f0-9efe-3851a35183e7",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a61ad829-11f9-42f0-9efe-3851a35183e7/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a61ad829-11f9-42f0-9efe-3851a35183e7/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "94a91fe0-8180-4c12-bae3-163d1c2ded3f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/94a91fe0-8180-4c12-bae3-163d1c2ded3f/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/94a91fe0-8180-4c12-bae3-163d1c2ded3f/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "e2beeb8d-ad3f-4071-9dd9-55c6c1adacad",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e2beeb8d-ad3f-4071-9dd9-55c6c1adacad/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e2beeb8d-ad3f-4071-9dd9-55c6c1adacad/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "cf373324-da50-42b3-86bc-1a428667d026",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/cf373324-da50-42b3-86bc-1a428667d026/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/cf373324-da50-42b3-86bc-1a428667d026/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "e2c2c392-eb0f-4f00-8305-53696c8d1130",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e2c2c392-eb0f-4f00-8305-53696c8d1130/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e2c2c392-eb0f-4f00-8305-53696c8d1130/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "4d79ed0c-69a4-4b47-a0a7-5d563878f0ef",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4d79ed0c-69a4-4b47-a0a7-5d563878f0ef/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4d79ed0c-69a4-4b47-a0a7-5d563878f0ef/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "68604712-92ff-428c-8e98-c6972293c525",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/68604712-92ff-428c-8e98-c6972293c525/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/68604712-92ff-428c-8e98-c6972293c525/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "38277e01-b6be-4cda-96ef-5c0b9f5b3d45",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/38277e01-b6be-4cda-96ef-5c0b9f5b3d45/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/38277e01-b6be-4cda-96ef-5c0b9f5b3d45/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "aae5c539-4709-4d67-b671-35bb458d36dd",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/aae5c539-4709-4d67-b671-35bb458d36dd/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/aae5c539-4709-4d67-b671-35bb458d36dd/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "03631fd9-c4c8-4732-a5a0-e2f62e5c4c81",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/03631fd9-c4c8-4732-a5a0-e2f62e5c4c81/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/03631fd9-c4c8-4732-a5a0-e2f62e5c4c81/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Wine": "https://m.media-amazon.com/images/I/316toFqRrPL._AC_SR38,50_.jpg",
    "Dark Coffee": "https://m.media-amazon.com/images/I/317mFNao3HL._AC_SR38,50_.jpg",
    "Watermelon": "https://m.media-amazon.com/images/I/31h5f-HVwYL._AC_SR38,50_.jpg",
    "Army Green": "https://m.media-amazon.com/images/I/31uN-3bioXL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31ek+WVgYFL._AC_SR38,50_.jpg",
    "Light Yellow": "https://m.media-amazon.com/images/I/31aPyF-lHWL._AC_SR38,50_.jpg",
    "Coffee": "https://m.media-amazon.com/images/I/31TcW-3NQ0L._AC_SR38,50_.jpg",
    "Lightgrey": "https://m.media-amazon.com/images/I/3158kF-gpDL._AC_SR38,50_.jpg",
    "Oatmeal": "https://m.media-amazon.com/images/I/31XsHaOh1hL._AC_SR38,50_.jpg",
    "Taro": "https://m.media-amazon.com/images/I/314Q8aN4dQL._AC_SR38,50_.jpg",
    "Light Blue": "https://m.media-amazon.com/images/I/31uFgMeSW6L._AC_SR38,50_.jpg",
    "Navy": "https://m.media-amazon.com/images/I/31plw06bI7L._AC_SR38,50_.jpg",
    "Khaki": "https://m.media-amazon.com/images/I/3190dCbT+zL._AC_SR38,50_.jpg",
    "Ivory": "https://m.media-amazon.com/images/I/31aa+clKp2L._AC_SR38,50_.jpg",
    "Light Pink": "https://m.media-amazon.com/images/I/318I7J970sL._AC_SR38,50_.jpg",
    "Green": "https://m.media-amazon.com/images/I/31Jky5hsyGL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Wine": "616yZ0C1cKL",
    "Dark Coffee": "61Mtp-8ew-L",
    "Watermelon": "61BtTCoUoML",
    "Army Green": "61LRVyVe+SL",
    "Black": "61GBgs5yftL",
    "Light Yellow": "61hwNY1lQIL",
    "Coffee": "61Pu6lWCnYL",
    "Lightgrey": "61KaJ2Dg8JL",
    "Oatmeal": "61OLmk1UYfL",
    "Taro": "61Z3lbFhrlL",
    "Light Blue": "610CTl59-CL",
    "Navy": "61sQH2EDPJL",
    "Khaki": "61e+0qIMLPL",
    "Ivory": "61EWI22RkPL",
    "Light Pink": "61PvoYWWu2L",
    "Green": "71IX9sbYd9L"
  },
  "color_images": {
    "Wine": [
      "https://m.media-amazon.com/images/I/616yZ0C1cKL._SL1500_.jpg"
    ],
    "Dark Coffee": [
      "https://m.media-amazon.com/images/I/61Mtp-8ew-L._SL1500_.jpg"
    ],
    "Watermelon": [
      "https://m.media-amazon.com/images/I/61BtTCoUoML._SL1500_.jpg"
    ],
    "Army Green": [
      "https://m.media-amazon.com/images/I/61LRVyVe+SL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/61GBgs5yftL._SL1500_.jpg"
    ],
    "Light Yellow": [
      "https://m.media-amazon.com/images/I/61hwNY1lQIL._SL1500_.jpg"
    ],
    "Coffee": [
      "https://m.media-amazon.com/images/I/61Pu6lWCnYL._SL1500_.jpg"
    ],
    "Lightgrey": [
      "https://m.media-amazon.com/images/I/61KaJ2Dg8JL._SL1500_.jpg"
    ],
    "Oatmeal": [
      "https://m.media-amazon.com/images/I/61OLmk1UYfL._SL1500_.jpg"
    ],
    "Taro": [
      "https://m.media-amazon.com/images/I/61Z3lbFhrlL._SL1500_.jpg"
    ],
    "Light Blue": [
      "https://m.media-amazon.com/images/I/610CTl59-CL._SL1500_.jpg"
    ],
    "Navy": [
      "https://m.media-amazon.com/images/I/61sQH2EDPJL._SL1500_.jpg"
    ],
    "Khaki": [
      "https://m.media-amazon.com/images/I/61e+0qIMLPL._SL1500_.jpg"
    ],
    "Ivory": [
      "https://m.media-amazon.com/images/I/61EWI22RkPL._SL1500_.jpg"
    ],
    "Light Pink": [
      "https://m.media-amazon.com/images/I/61PvoYWWu2L._SL1500_.jpg"
    ],
    "Green": [
      "https://m.media-amazon.com/images/I/71IX9sbYd9L._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/81YEThkfM3L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-formal-long-sleeve-evening",
      "title": "Womens Maxi Dress Maxi Formal Long Sleeve Evening",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51enCkUtvSL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-bodycon",
      "title": "Womens Dress Bodycon",
      "price": 46.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/41ewiZh+h2L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-bodycon-cocktail",
      "title": "Womens Maxi Dress Long Sleeve Bodycon Cocktail",
      "price": 29.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71uLDl8TnLL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-cocktail-ruched-v-neck",
      "title": "Womens Maxi Dress Bodycon Cocktail Ruched V Neck",
      "price": 52.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51cspP+wW9L._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-formal-v-neck-long-sleeve-cocktail",
      "title": "Womens Maxi Dress Formal V Neck Long Sleeve Cocktail",
      "price": 48.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61q6tT7ArCL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-long-sleeve-ruched-cocktail",
      "title": "Womens Maxi Dress Bodycon Long Sleeve Ruched Cocktail",
      "price": 36.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/6131pgbUc-L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-long-sleeve",
      "title": "Womens Maxi Dress Bodycon Long Sleeve",
      "price": 35.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51gYxX9VV7L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-v-neck-maxi-long-sleeve",
      "title": "Womens Maxi Dress V Neck Maxi Long Sleeve",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71kIhEBkvrL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 48.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61jqQrB7P-L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-off-shoulder",
      "title": "Womens Maxi Dress Off Shoulder",
      "price": 145.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61vEt64A2DL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-maxi-split-formal-bodycon-ruched",
      "title": "Womens Maxi Dress Cocktail Maxi Split Formal Bodycon Ruched",
      "price": 60.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61fsQF3-6LL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 119.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71njImAOF6L._SL1500_.jpg"
      ]
    }
  ]
}