{
  "id": "womens-maxi-dress-bodycon-cocktail-maxi-long-sleeve-formal-ruched",
  "handle": "womens-maxi-dress-bodycon-cocktail-maxi-long-sleeve-formal-ruched",
  "sku": "JC1225",
  "asin": "B0D2L9X8CK",
  "title": "Womens Maxi Dress Bodycon Cocktail Maxi Long Sleeve Formal Ruched",
  "title_original": "BTFBM Women Bodycon Maxi Dress Long Sleeve Back Slit Ruched Elegant Party Cocktail Formal Fall Wedding Guest Dresses",
  "brand": "Visit the BTFBM Store",
  "price": 49.99,
  "social_proof": {
    "bought_past_month": 1879,
    "text": "1879+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/51Q-kYjWqFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81CEd2iaowL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71dVVWUx8tL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81oWJrKLfXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71CJHsa+LfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/8143n1ArE5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81UzRdkH4KL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71hHk5oVlAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61nTfimzUcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61zWli4CW5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61vwJXwlE7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61LNbsedxzL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/614jVS4AF5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61z1TYzYLOL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61oCFFYmUPL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/618H8xRJp5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61EFwg75K4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61bL-ErKDnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61-SRPhYlOL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Fz9akG1eL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61xOTkQObpL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/51Q-kYjWqFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81CEd2iaowL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71dVVWUx8tL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81oWJrKLfXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71CJHsa+LfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/8143n1ArE5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81UzRdkH4KL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71hHk5oVlAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61nTfimzUcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61zWli4CW5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61vwJXwlE7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61LNbsedxzL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/614jVS4AF5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61z1TYzYLOL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61oCFFYmUPL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/618H8xRJp5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61EFwg75K4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61bL-ErKDnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61-SRPhYlOL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Fz9akG1eL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61xOTkQObpL._SL1500_.jpg"
  ],
  "aplus_images": [
    "https://m.media-amazon.com/images/I/31qh67TwsNL._SL1500_.jpg"
  ],
  "description_images": [
    "https://m.media-amazon.com/images/I/31qh67TwsNL._SL1500_.jpg"
  ],
  "bullets": [],
  "specs": {
    "Package Dimensions ‏": "‎ 12.33 x 9.65 x 0.72 inches; 1 Pounds",
    "Item model number ‏": "‎ BT492",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ June 23, 2024",
    "ASIN ‏": "‎ B0D2LDN27G",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#10,352 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #8 in Women's Formal Dresses",
    "Customer Reviews": "4.4 4.4 out of 5 stars (827)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Brown",
      "Army Green",
      "Black",
      "Brick Red",
      "Dark Green",
      "Lake Blue",
      "Navy",
      "Wine Red",
      "Dark Grey Blue",
      "Khaki",
      "Pink",
      "Beige",
      "Purple",
      "Royal Blue"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.4,
    "count": 827,
    "customers_say": "Customers find the dress fits well, hitting at the ankles, and appreciate its versatility for both formal and casual occasions. The dress receives positive feedback for its comfort, quality, and flattering design that hugs the curves, with one customer noting how it accentuates curves in the right places. The material is thick and stretchy like a T-shirt, and customers like how it can be dressed up or worn casually. Select to learn more Fit Style Comfort Quality Material quality Flattering Stretchiness Dress style 86 customers mention \"Fit\" 81 positive 5 negative Customers like how the dress fits, noting that it falls perfectly at the ankles, and one customer mentions it has a back slit. \"Great material, thicker than expected. Great fit / true to size.\" Read more \"...After many other purchases and returns, this dress was the one. Perfect fit , no alterations needed....\" Read more \" fits great , It’s form hugging which I love, but the material is rather cheap and therefore I find it bit pricy for what it is....\" Read more \" Nice fit , quality material...form fitting!\" Read more 76 customers mention \"Style\" 67 positive 9 negative Customers find the dress chic, with one mentioning it looks amazing on any size, while another notes it doesn't appear cheap. \"Bold, classy , and head-turning! This dress is a showstopper! The fit is sleek and hugs in all the right places without being uncomfortable....\" Read more \"...and gave it to my sister i love the dress material so nice simple yet elegant so I decided to buy another one however the material weren’t the same...\" Read more \"This dress is beautiful . Dress it up or down. Perfect green color for the holidays. The ruching on the side helps camouflage the tummy....\" Read more \" Beautiful Dress & Great Fit....\" Read more 69 customers mention \"Comfort\" 68 positive 1 negative Customers find the dress comfortable, with one mentioning that the neckline is high and another noting it's not itchy. \"...4 months pregnant and was so impressed with how flattering and comfortable it was—it hugged all the right places without feeling tight or restrictive...\" Read more \"Beautiful fabric. So comfortable and stylish. The inside neckline worries me, in that the stitching is not perfect. It could be improved....\" Read more \"Soft, comfy and stretchy! Can ask for more. Feels casual but looks formal. Can dress up our down and waist looks small with design. Very breathable.\" Read more \"...It really showed off the curves in my waist. It’s very comfortable and I’ll probably be purchasing another one in a different color. Love this dress!\" Read more 58 customers mention \"Quality\" 56 positive 2 negative Customers find the dress to be well-made and of great quality. \"Love this dress, Perfect for winter formal event! Great quality for the price point Lining: No lining, thicker material...\" Read more \"...at the bottom so it’s not fitted at the very bottom but overall great dress .\" Read more \"...Fits very well and good quality . Planning to purchase in black as well.\" Read more \" Love this dress ! Wore it for my maternity pictures and loved them!\" Read more 52 customers mention \"Material quality\" 38 positive 14 negative Customers like the dress's material, noting it is thick and wonderful, though some mention it is thin and light. \"...Light weight and good material . Runs a little big but still falls on your body perfectly! Got a lot of compliments!\" Read more \" cheap material ...\" Read more \"I cannot believe the positive reviews this dress has. The material is thin and not good quality....\" Read more \"My daughter love this dress. Nice material . Right to the size.\" Read more 51 customers mention \"Flattering\" 51 positive 0 negative Customers find the dress flattering, noting how it hugs their curves and body, with one customer mentioning that the ruching on the side helps camouflage the tummy. \"...I wore it while 4 months pregnant and was so impressed with how flattering and comfortable it was—it hugged all the right places without feeling...\" Read more \"...The dress looks really nice on and is very flattering . I received many compliments when I wore it. Highly recommend!\" Read more \"...It was so comfy, nice thick material but very stretchy. Its super flattering and fit nicely on the waist....\" Read more \"This dress is everything! It’s slimming because of the asymmetrical ruching. I wore slim wear under it. It’s a thick cotton with stretch....\" Read more 40 customers mention \"Stretchiness\" 38 positive 2 negative Customers appreciate the dress's stretchiness, noting that the fabric feels like a T-shirt. \"Soft, comfy and stretchy ! Can ask for more. Feels casual but looks formal. Can dress up our down and waist looks small with design. Very breathable.\" Read more \"...It was so comfy, nice thick material but very stretchy . Its super flattering and fit nicely on the waist....\" Read more \"...I was able to pull it down to my ankles because the material is stretchy but the second I raised my hand it went right back up....\" Read more \"I wore this at my baby shower because it is so stretchy and cute! Highly recommend whether you’re pregnant or not!...\" Read more 36 customers mention \"Dress style\" 35 positive 1 negative Customers love the dress's versatility, as it can be dressed up or worn casually, making it perfect for evening events, special dinners, and weddings. \"...is that I’ll be able to keep wearing it post-pregnancy too—it’s that versatile ....\" Read more \"Very comfortable dress. Can be dressed up or down . Not too tight or too loose.\" Read more \"Material feels good on my body. I loved it. It was perfect for work .\" Read more \"Bold, classy, and head-turning! This dress is a showstopper ! The fit is sleek and hugs in all the right places without being uncomfortable....\" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Beautiful Dress & Great Fit.",
        "body": "I loved this dress! It stretches and feels very comfortable. The sizing is accurate. I'm 145 lbs and ordered a size Small, and it fit perfectly. The dress looks really nice on and is very flattering. I received many compliments when I wore it. Highly recommend! Read more",
        "author": "Customer",
        "rating": 5.0,
        "date": "November 2, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Elegance Redefined",
        "body": "This dress is absolutely stunning. I had a formal gala to attend and was searching for something long sleeve when I was looking into gowns. I found this which is not only beautiful, but also it is at a great price point. The dress may look simple but it is very elegant and was a hit with my friends. The fabric is thick so it is not see through, but not too thick that you feel hot in the dress. It fits pretty true to size and has some stretch to it so that it feels comfortable. Read more",
        "author": "Nicole Carlon",
        "rating": 5.0,
        "date": "May 29, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61bvvTekbmL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Versatile, well-made, very comfortable",
        "body": "So comfortable, flattering, and long enough for a tall girl with heels! Fabric has good stretch and is heavy, making it a great fall dress! Originally purchased for a fall outdoor wedding dress but decided on something else. Love this for date nights with my husband. Wear with boots to be casual or add shoes and accessories for more formal events. Super versatile gown! Read more",
        "author": "Jessica Stewart",
        "rating": 5.0,
        "date": "October 22, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71JBtlnYayL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "4.0 out of 5 stars Shorter than expected",
        "body": "Wonderful dress and fits very well except for the length. I was expecting it to be covering my ankles but it was half way up my calf. I was able to pull it down to my ankles because the material is stretchy but the second I raised my hand it went right back up. I got a small and I am 5 foot 4. Read more",
        "author": "Natalie Litmer",
        "rating": 4.0,
        "date": "December 8, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Elegant, Flattering, and Perfect for Any Occasion",
        "body": "This dress was the perfect outfit for a wedding. I loved the way it shaped my curves and offered complete coverage while still making me feel elegant and sexy. The fabric is soft, thick, and breathable, so it never made me feel hot or sweaty. The quality is excellent and it works beautifully for any occasion, especially during the winter months. I would absolutely wear this again for other events. Read more",
        "author": "Kayla Kloulechad",
        "rating": 5.0,
        "date": "August 6, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Adorable dress",
        "body": "The perfect black dress, it's a bit on the longer side but such comfortable material. I am 5'6'' and 180. The XL fit good but if you want a tighter fit maybe size down Read more",
        "author": "Catie",
        "rating": 5.0,
        "date": "October 25, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Nice dress!",
        "body": "Great! Nice soft, thick fabric with good stretch. I’m 25 weeks pregnant, and this is definitely a fall/winger dress, the fabric is such that it would show sweat if you were out in the heat. The subtle ruching and details at the hip and neckline are nice. Creates a nice shape. I wish it was a little longer, I am 5’9 and it hits a few inches above my ankles. Could be dressed up or down. Wish I’d had a chance to order another color, got it on prime day for $20 off. Read more",
        "author": "Customer",
        "rating": 5.0,
        "date": "October 10, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Great feel. True to size. Great for cool weather!",
        "body": "I love this dress! Easy to wear and comfortable! Nice in cool weather! Fit true to size. Length ia great! All the way down almost just like the picture shown. Read more",
        "author": "Christi Haynes",
        "rating": 5.0,
        "date": "December 7, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Bodycon Cocktail Maxi Long Sleeve Formal Ruched is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.",
  "about_this_item": "Womens Maxi Dress Bodycon Cocktail Maxi Long Sleeve Formal Ruched is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.",
  "long_description": "Womens Maxi Dress Bodycon Cocktail Maxi Long Sleeve Formal Ruched is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Brown, Army Green, Black, Brick Red, Dark Green, Lake Blue, Navy, Wine Red, Dark Grey Blue, Khaki, Pink, Beige, Purple, Royal Blue. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Bodycon Cocktail Maxi Long Sleeve Formal Ruched is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/31qh67TwsNL._SL1500_.jpg",
      "alt": "Womens Maxi Dress Bodycon Cocktail Maxi Long Sleeve Formal Ruched details image 1"
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Brown, Army Green, Black, Brick Red, Dark Green, Lake Blue, Navy, Wine Red, Dark Grey Blue, Khaki, Pink, Beige, Purple, Royal Blue. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "2f176caf-07ae-4cf7-8ef4-c805b8b60df2",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2f176caf-07ae-4cf7-8ef4-c805b8b60df2/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2f176caf-07ae-4cf7-8ef4-c805b8b60df2/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "c1c1da67-e8fe-4b3b-ac24-b7b35009a51b",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c1c1da67-e8fe-4b3b-ac24-b7b35009a51b/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c1c1da67-e8fe-4b3b-ac24-b7b35009a51b/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "5c5cafaa-b1ba-4a10-b98e-5a08d4cdc83f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5c5cafaa-b1ba-4a10-b98e-5a08d4cdc83f/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5c5cafaa-b1ba-4a10-b98e-5a08d4cdc83f/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "4e3bf12c-5faa-4d14-b505-01d388d9d953",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4e3bf12c-5faa-4d14-b505-01d388d9d953/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4e3bf12c-5faa-4d14-b505-01d388d9d953/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "207480d7-d341-4abb-9fe8-9cd5152d4f46",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/207480d7-d341-4abb-9fe8-9cd5152d4f46/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/207480d7-d341-4abb-9fe8-9cd5152d4f46/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "8927f943-df6b-4d96-a12c-f3c0350573b4",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8927f943-df6b-4d96-a12c-f3c0350573b4/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8927f943-df6b-4d96-a12c-f3c0350573b4/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "2b5443fb-63b3-41b5-b435-4afc39316981",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2b5443fb-63b3-41b5-b435-4afc39316981/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2b5443fb-63b3-41b5-b435-4afc39316981/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "674b2e0c-e465-4f1e-bf6c-74a5fdbe09e5",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/674b2e0c-e465-4f1e-bf6c-74a5fdbe09e5/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/674b2e0c-e465-4f1e-bf6c-74a5fdbe09e5/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "d64debb1-3cc1-429c-83b8-c7f3952d6fb2",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d64debb1-3cc1-429c-83b8-c7f3952d6fb2/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d64debb1-3cc1-429c-83b8-c7f3952d6fb2/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "3142fb73-a534-40ca-92c6-c849def314a0",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3142fb73-a534-40ca-92c6-c849def314a0/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3142fb73-a534-40ca-92c6-c849def314a0/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "27880828-abec-42ab-b2d1-9066d6e41a0b",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/27880828-abec-42ab-b2d1-9066d6e41a0b/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/27880828-abec-42ab-b2d1-9066d6e41a0b/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "2a780fe1-08ef-4fe9-af9a-3de42554e230",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2a780fe1-08ef-4fe9-af9a-3de42554e230/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2a780fe1-08ef-4fe9-af9a-3de42554e230/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Brown": "https://m.media-amazon.com/images/I/31suPztbefL._AC_SR38,50_.jpg",
    "Army Green": "https://m.media-amazon.com/images/I/31uxhHXDs+L._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31rYtYvWYqL._AC_SR38,50_.jpg",
    "Brick Red": "https://m.media-amazon.com/images/I/31PN7rge2rL._AC_SR38,50_.jpg",
    "Dark Green": "https://m.media-amazon.com/images/I/31wjYEwEDOL._AC_SR38,50_.jpg",
    "Lake Blue": "https://m.media-amazon.com/images/I/318Wlxu+loL._AC_SR38,50_.jpg",
    "Navy": "https://m.media-amazon.com/images/I/31YHUogYm0L._AC_SR38,50_.jpg",
    "Wine Red": "https://m.media-amazon.com/images/I/31XS4EQLdjL._AC_SR38,50_.jpg",
    "Dark Grey Blue": "https://m.media-amazon.com/images/I/31y1mh1wvlL._AC_SR38,50_.jpg",
    "Khaki": "https://m.media-amazon.com/images/I/31F86n0TsWL._AC_SR38,50_.jpg",
    "Pink": "https://m.media-amazon.com/images/I/3198+gM8gAL._AC_SR38,50_.jpg",
    "Beige": "https://m.media-amazon.com/images/I/31Za1js8-8L._AC_SR38,50_.jpg",
    "Purple": "https://m.media-amazon.com/images/I/31fQ8Jlv9-L._AC_SR38,50_.jpg",
    "Royal Blue": "https://m.media-amazon.com/images/I/31ml14IQRIL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Brown": "61nTfimzUcL",
    "Army Green": "61zWli4CW5L",
    "Black": "51Q-kYjWqFL",
    "Brick Red": "61vwJXwlE7L",
    "Dark Green": "61LNbsedxzL",
    "Lake Blue": "614jVS4AF5L",
    "Navy": "61z1TYzYLOL",
    "Wine Red": "61oCFFYmUPL",
    "Dark Grey Blue": "618H8xRJp5L",
    "Khaki": "61EFwg75K4L",
    "Pink": "61bL-ErKDnL",
    "Beige": "61-SRPhYlOL",
    "Purple": "61Fz9akG1eL",
    "Royal Blue": "61xOTkQObpL"
  },
  "color_images": {
    "Brown": [
      "https://m.media-amazon.com/images/I/61nTfimzUcL._SL1500_.jpg"
    ],
    "Army Green": [
      "https://m.media-amazon.com/images/I/61zWli4CW5L._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/51Q-kYjWqFL._SL1500_.jpg"
    ],
    "Brick Red": [
      "https://m.media-amazon.com/images/I/61vwJXwlE7L._SL1500_.jpg"
    ],
    "Dark Green": [
      "https://m.media-amazon.com/images/I/61LNbsedxzL._SL1500_.jpg"
    ],
    "Lake Blue": [
      "https://m.media-amazon.com/images/I/614jVS4AF5L._SL1500_.jpg"
    ],
    "Navy": [
      "https://m.media-amazon.com/images/I/61z1TYzYLOL._SL1500_.jpg"
    ],
    "Wine Red": [
      "https://m.media-amazon.com/images/I/61oCFFYmUPL._SL1500_.jpg"
    ],
    "Dark Grey Blue": [
      "https://m.media-amazon.com/images/I/618H8xRJp5L._SL1500_.jpg"
    ],
    "Khaki": [
      "https://m.media-amazon.com/images/I/61EFwg75K4L._SL1500_.jpg"
    ],
    "Pink": [
      "https://m.media-amazon.com/images/I/61bL-ErKDnL._SL1500_.jpg"
    ],
    "Beige": [
      "https://m.media-amazon.com/images/I/61-SRPhYlOL._SL1500_.jpg"
    ],
    "Purple": [
      "https://m.media-amazon.com/images/I/61Fz9akG1eL._SL1500_.jpg"
    ],
    "Royal Blue": [
      "https://m.media-amazon.com/images/I/61xOTkQObpL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress-short-sleeve-evening",
      "title": "Womens Dress Short Sleeve Evening",
      "price": 53.75,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61rthYhN-yL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-ruched-long-sleeve-bodycon",
      "title": "Womens Maxi Dress Ruched Long Sleeve Bodycon",
      "price": 31.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51zwWMjriiL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 12.45,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/81Zb9tM3L7L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 178.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Work",
      "images": [
        "https://m.media-amazon.com/images/I/61CRGKPz5vL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 42.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71bqoI3Xa8L._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress-cocktail",
      "title": "Womens Dress Cocktail",
      "price": 103.54,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61JApwce25L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 35.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71xNIsc8O6L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-v-neck-formal-long-sleeve",
      "title": "Womens Maxi Dress V Neck Formal Long Sleeve",
      "price": 64.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61+5psDbIgL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-formal-v-neck",
      "title": "Womens Dress Formal V Neck",
      "price": 89.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61u9BDjVnjL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 40.49,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/41U5Uz1Tg-L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-split-long-sleeve-one-shoulder-evening-formal",
      "title": "Womens Maxi Dress Cocktail Split Long Sleeve One Shoulder Evening Formal",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61Dsvmvd6sL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-bodycon-long-sleeve",
      "title": "Womens Maxi Dress Cocktail Bodycon Long Sleeve",
      "price": 45.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61wSPQkVChL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-maxi-ruched-split",
      "title": "Womens Maxi Dress Bodycon Maxi Ruched Split",
      "price": 46.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51z3XNCEBIL._SL1500_.jpg"
      ]
    }
  ]
}