{
  "id": "womens-dress-boat-neck-ruched-bodycon-sleeveless",
  "handle": "womens-dress-boat-neck-ruched-bodycon-sleeveless",
  "sku": "JC1630",
  "asin": "B0FL745RDY",
  "title": "Womens Dress Boat Neck Ruched Bodycon Sleeveless",
  "title_original": "HOCILLE Women's Sexy Bodycon Boat Neck Mini Dresses Sleeveless Ruched Ruffle Hem Club Party Short Dress",
  "brand": "Visit the HOCILLE Store",
  "price": 36.99,
  "social_proof": {
    "bought_past_month": 717,
    "text": "717+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/61NkGKZMqBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61e3+-OOStL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81IEavleo+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/718MosFx9GL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71nEItT7pBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71UdPS8NGdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61J27B3fmkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/616wgiksAsL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61OfbvfoN5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61wYc49zGpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61D2sIDj4wL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/611MRgNrGoL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61cA4GRhhwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61j-Ge9HaJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61-FoMgE-KL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/61NkGKZMqBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61e3+-OOStL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81IEavleo+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/718MosFx9GL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71nEItT7pBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71UdPS8NGdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61J27B3fmkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/616wgiksAsL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61OfbvfoN5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61wYc49zGpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61D2sIDj4wL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/611MRgNrGoL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61cA4GRhhwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61j-Ge9HaJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61-FoMgE-KL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Item model number ‏": "‎ HO836",
    "Date First Available ‏": "‎ April 21, 2025",
    "ASIN ‏": "‎ B0F5Q5G1VC",
    "Best Sellers Rank": "#8,032 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #33 in Women's Club & Night Out Dresses",
    "Customer Reviews": "4.4 4.4 out of 5 stars (342)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Darkgreen",
      "Red",
      "Winered",
      "Baby Blue",
      "Pink",
      "White",
      "Purple",
      "Yellow",
      "Black",
      "Coffee"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.4,
    "count": 342,
    "customers_say": "Customers find the dress flattering, particularly noting how it hugs their curves well, and appreciate its soft, smooth fit. Moreover, the dress is comfortable and versatile, being perfect for both formal and casual occasions, with one customer mentioning it can be dressed up or down. The material quality receives positive feedback, though opinions about the length are mixed, with some finding it perfect while others say it's a little long. Generated from the text of customer reviews Select to learn more Looks (52) Fit (32) Flattering (31) Quality (23) Comfort (18) Dressability (17) Fabric quality (17) Length (15) 52 customers mention looks, 51 positive, 1 negative 52 customers mention \"Looks\" 51 positive 1 negative Customers like the dress's appearance, describing it as a simple black dress with great quality, and one customer notes that the flowy bottom makes it cute. \" This dress is cute . Seems like it will look great on my daughter.... \" Read more \" Such a cute dress . I have 4 stars because it rides up and no one wants their cheeks out but other than that it was great. I’m 5’4” and kept the medium \" Read more \" ...up returning this dress cause I opted for another, but it is a very cute dress . I ordered Medium and for reference i am 5'4\" and weigh 146 pounds.... \" Read more \" This dress is so cute ! I am 5’9, 155-160lbs, 34DD and the medium fit perfect!!!... \" Read more 32 customers mention fit, 30 positive, 2 negative 32 customers mention \"Fit\" 30 positive 2 negative Customers like how the dress fits, describing it as soft and smooth, with one customer noting it can be adjusted for a shorter length. \" Great fit and quality for the price. Wore it to a birthday party and got tons of compliments. I'm 4'11\", weight 120 pounds, and ordered size Small. \" Read more \" Perfect fit ! Wore to a wedding shower and the color is just as it showed and fits perfect. \" Read more \" Fits true to size and very flattering! I love it. \" Read more \" ...The red is certain light looks more orange then red but in any case fit perfectly . 5'7 148lbs. \" Read more 31 customers mention flattering, 29 positive, 2 negative 31 customers mention \"Flattering\" 29 positive 2 negative Customers find the dress flattering, particularly noting how it hugs their curves well. \" Dress is super soft and flattering . I love the neckline and it was super breathable. I am 5'9 and 130 and ordered a small! \" Read more \" ...It’s super stretchy and very flattering . You can wear it with or without a bra which I love! \" Read more \" ...it’s super flattering as well, and the ruffles are such a cute look.... \" Read more \" Lovely product. So flattering , you can adjust the length to be shorter or longer depending on your preference because of the rouched design.... \" Read more 23 customers mention quality, 22 positive, 1 negative 23 customers mention \"Quality\" 22 positive 1 negative Customers find the dress to be of great quality, with several mentioning it's perfect for special occasions like birthdays and graduations. \" Great dress ! Flatters the curves. Is body hugging so size up if you’re on the line. \" Read more \" Great quality ! Very comfortable and flattering \" Read more \" Perfect! Soft material, not see through, true to size, and good quality ! \" Read more \" such a nice dress !... \" Read more 18 customers mention comfort, 18 positive, 0 negative 18 customers mention \"Comfort\" 18 positive 0 negative Customers find the dress comfortable. \" This dress is so comfortable and breathable. I love the way this dress fits and hugs the curves without being restrictive. \" Read more \" This dress for perfectly to size, very comfortable and soft. I received lots of compliments on it. \" Read more \" This dress is perfect for all of your bridal era needs! It is super comfortable , very stretchy and double lined so it’s not see through!... \" Read more \" Cuuuute!!! very comfy and stretchy. not that see through either which is great. and plus is you can wear a regular bra with it!! \" Read more 17 customers mention dressability, 16 positive, 1 negative 17 customers mention \"Dressability\" 16 positive 1 negative Customers appreciate how versatile the dress is, noting it can be dressed up or used casually, with one customer mentioning it can be pulled down for more formal occasions. \" ... Can be dressed up or down , a very versatile piece. \" Read more \" ...not that see through either which is great. and plus is you can wear a regular bra with it!! \" Read more \" Loved this black dress. Can dress up or down . Quality material and lined. Good staple black dress. \" Read more \" Love this dress! It’s comfortable and classy! You can wear a bra with it and it’s flattering on the stomach area.... \" Read more 17 customers mention fabric quality, 12 positive, 5 negative 17 customers mention \"Fabric quality\" 12 positive 5 negative Customers have mixed opinions about the fabric quality of the dress, with some finding it nice while others describe it as cheap. \" Cheap fabric ... \" Read more \" Nice fabric , likely universally flattering. Husband really loved me wearing it on date night! \" Read more \" The length is good but the fabric feels super cheap . \" Read more \" ...It gives you a really smooth look and the material is wonderful .... \" Read more 15 customers mention length, 10 positive, 5 negative 15 customers mention \"Length\" 10 positive 5 negative Customers have mixed opinions about the dress's length, with some finding it perfect and noting it's easy to adjust, while others say it's a little long. \" flattering for those with fully chests. length was good . very comfortable. not see through. \" Read more \" ... Wayyy too short . And I love very short dresses! Cute dress though and decent quality but it's unwearable due to length \" Read more \" I wore on a night out and was comfortable to whole time. Not too short , not riding up.... \" Read more \" ...The length is perfect . You can hike it up a bit for a shorter, flirty look or pull it down for something more formal.... \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Flattering and Versatile Dress",
        "body": "Originally bought this as a panic purchase for a last-minute Halloween costume (I was dressing as Daphne), but I actually ended up loving the look of this dress! The color is true to the photo and the fabric is nicely lined, so I didn’t feel like I needed any shape wear even when wearing it out normally. The length is perfect. You can hike it up a bit for a shorter, flirty look or pull it down for something more formal. The ruching details are super flattering and make it work either way. Definitely exceeded my expectations! Read more",
        "author": "Cheyanne",
        "rating": 5.0,
        "date": "November 6, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71aXlJQD9LL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Comfortable and sexy dress",
        "body": "I wore on a night out and was comfortable to whole time. Not too short, not riding up. I’m 5’11 for reference and the dress was a comfortable length and stayed in place. The material is very soft on the inside and double lined with a lot of stretch. Read more",
        "author": "Lauren",
        "rating": 5.0,
        "date": "December 12, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Bubble gum pink",
        "body": "Cute dress but the color is too bright. Would be great for a Barbie party but not what I wanted. Fits ok, xl for 180 40 DD 5’3 hits just above the knee on me. Pictures make it look really short. Cute ruffle hem, mesh overlay not see through, stretchy. Will return and maybe try another color. Read more",
        "author": "momof threeboys",
        "rating": 4.0,
        "date": "August 20, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/618qcQx7vvL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/61mNjeH-ZrL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Classy Little Black Dress.",
        "body": "Love this dress! It’s comfortable and classy! You can wear a bra with it and it’s flattering on the stomach area. I’m a standard medium in most things and 8-10 in dresses because of my bust. This dress fit like a charm. Read more",
        "author": "Kasey McKane",
        "rating": 5.0,
        "date": "October 13, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61AomRy9BvL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Perfect mini dress!",
        "body": "Lovely product. So flattering, you can adjust the length to be shorter or longer depending on your preference because of the rouched design. Can be dressed up or down, a very versatile piece. Read more",
        "author": "Stormi",
        "rating": 5.0,
        "date": "October 26, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71lVPRfcN3L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Super cute dress",
        "body": "Fit really well, super complimentary, not see through at all. True to size also! Read more",
        "author": "Madeline",
        "rating": 5.0,
        "date": "December 15, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Excellent Quality",
        "body": "Excellent quality and fit true to size. Would highly recommend this dress. It is very fun, flirty, and made nicely. Read more",
        "author": "Jenny Lou Lawless",
        "rating": 5.0,
        "date": "October 30, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Super Flattering & Versatile Dress",
        "body": "This black dress fits so well and I got tons of compliments when I wore it out! It’s the kind of piece you can easily dress up with heels and jewelry or dress down with sneakers and a jacket, which is perfect for nights out or dinner plans. The only downside is that it rides up quite a bit, especially when walking or dancing. This could also just be a me problem. Just something to know before wearing it out! Read more",
        "author": "Kaylyn Meyers",
        "rating": 4.0,
        "date": "November 30, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/81dUJ6GRLXL._SY88._SL1500_.jpg"
        ]
      }
    ]
  },
  "short_description": "Womens Dress Boat Neck Ruched Bodycon Sleeveless is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.",
  "about_this_item": "Womens Dress Boat Neck Ruched Bodycon Sleeveless is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.",
  "long_description": "Womens Dress Boat Neck Ruched Bodycon Sleeveless is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Darkgreen, Red, Winered, Baby Blue, Pink, White, Purple, Yellow, Black, Coffee. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Dress Boat Neck Ruched Bodycon Sleeveless is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Darkgreen, Red, Winered, Baby Blue, Pink, White, Purple, Yellow, Black, Coffee. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "83b8ddb8-3266-4033-8d2f-f5556bfea480",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/83b8ddb8-3266-4033-8d2f-f5556bfea480/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/83b8ddb8-3266-4033-8d2f-f5556bfea480/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "38b6ca92-aaf1-442d-8b39-e767f616278e",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/38b6ca92-aaf1-442d-8b39-e767f616278e/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/38b6ca92-aaf1-442d-8b39-e767f616278e/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "37e8c5f9-aea9-4094-8b3b-028fd2b38ed6",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/37e8c5f9-aea9-4094-8b3b-028fd2b38ed6/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/37e8c5f9-aea9-4094-8b3b-028fd2b38ed6/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "97942b05-b34b-4dba-a099-0807b622fa8e",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/97942b05-b34b-4dba-a099-0807b622fa8e/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/97942b05-b34b-4dba-a099-0807b622fa8e/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "aff5ee8d-0870-4bd3-b6d7-7778abf09b4f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/aff5ee8d-0870-4bd3-b6d7-7778abf09b4f/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/aff5ee8d-0870-4bd3-b6d7-7778abf09b4f/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "c11d063e-aec9-4b2a-8ee0-43bb2ac4b077",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c11d063e-aec9-4b2a-8ee0-43bb2ac4b077/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c11d063e-aec9-4b2a-8ee0-43bb2ac4b077/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "0e9a8dcb-b7cd-4735-aef4-682f9ccefa06",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0e9a8dcb-b7cd-4735-aef4-682f9ccefa06/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0e9a8dcb-b7cd-4735-aef4-682f9ccefa06/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "a93b8853-d53e-40b7-bd16-5d48954d104c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a93b8853-d53e-40b7-bd16-5d48954d104c/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a93b8853-d53e-40b7-bd16-5d48954d104c/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "e2995e2f-4acf-4b49-9c59-8d034c4e9d9a",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e2995e2f-4acf-4b49-9c59-8d034c4e9d9a/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e2995e2f-4acf-4b49-9c59-8d034c4e9d9a/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "82339471-f94f-4598-9476-9153185fdd40",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/82339471-f94f-4598-9476-9153185fdd40/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/82339471-f94f-4598-9476-9153185fdd40/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "e1d174fc-ea97-4c24-bdbe-be5e28ec3a8f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e1d174fc-ea97-4c24-bdbe-be5e28ec3a8f/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e1d174fc-ea97-4c24-bdbe-be5e28ec3a8f/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "6de182a9-c848-4f3d-becc-8709986f8953",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6de182a9-c848-4f3d-becc-8709986f8953/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6de182a9-c848-4f3d-becc-8709986f8953/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Darkgreen": "https://m.media-amazon.com/images/I/31tYB7lj8DL._AC_SR38,50_.jpg",
    "Red": "https://m.media-amazon.com/images/I/31lVzUAJJJL._AC_SR38,50_.jpg",
    "Winered": "https://m.media-amazon.com/images/I/313zO+MfKXL._AC_SR38,50_.jpg",
    "Baby Blue": "https://m.media-amazon.com/images/I/31y5dO-qkmL._AC_SR38,50_.jpg",
    "Pink": "https://m.media-amazon.com/images/I/31rhEb1g7PL._AC_SR38,50_.jpg",
    "White": "https://m.media-amazon.com/images/I/31XeV6fXqBL._AC_SR38,50_.jpg",
    "Purple": "https://m.media-amazon.com/images/I/318byJITArL._AC_SR38,50_.jpg",
    "Yellow": "https://m.media-amazon.com/images/I/31czZzChYsL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31Wfl-vHl+L._AC_SR38,50_.jpg",
    "Coffee": "https://m.media-amazon.com/images/I/31al80xdaML._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Darkgreen": "61J27B3fmkL",
    "Red": "616wgiksAsL",
    "Winered": "61NkGKZMqBL",
    "Baby Blue": "61OfbvfoN5L",
    "Pink": "61wYc49zGpL",
    "White": "61D2sIDj4wL",
    "Purple": "611MRgNrGoL",
    "Yellow": "61cA4GRhhwL",
    "Black": "61j-Ge9HaJL",
    "Coffee": "61-FoMgE-KL"
  },
  "color_images": {
    "Darkgreen": [
      "https://m.media-amazon.com/images/I/61J27B3fmkL._SL1500_.jpg"
    ],
    "Red": [
      "https://m.media-amazon.com/images/I/616wgiksAsL._SL1500_.jpg"
    ],
    "Winered": [
      "https://m.media-amazon.com/images/I/61NkGKZMqBL._SL1500_.jpg"
    ],
    "Baby Blue": [
      "https://m.media-amazon.com/images/I/61OfbvfoN5L._SL1500_.jpg"
    ],
    "Pink": [
      "https://m.media-amazon.com/images/I/61wYc49zGpL._SL1500_.jpg"
    ],
    "White": [
      "https://m.media-amazon.com/images/I/61D2sIDj4wL._SL1500_.jpg"
    ],
    "Purple": [
      "https://m.media-amazon.com/images/I/611MRgNrGoL._SL1500_.jpg"
    ],
    "Yellow": [
      "https://m.media-amazon.com/images/I/61cA4GRhhwL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/61j-Ge9HaJL._SL1500_.jpg"
    ],
    "Coffee": [
      "https://m.media-amazon.com/images/I/61-FoMgE-KL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-maxi-ruched-short-sleeve-cocktail",
      "title": "Womens Maxi Dress Maxi Ruched Short Sleeve Cocktail",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61UL1dUHSfL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-maxi-evening",
      "title": "Womens Maxi Dress Cocktail Maxi Evening",
      "price": 299.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61Igvpr1t+L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-long-sleeve",
      "title": "Womens Maxi Dress Bodycon Long Sleeve",
      "price": 40.84,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51uAJsYocqL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-long-sleeve-maxi-cocktail",
      "title": "Womens Maxi Dress Bodycon Long Sleeve Maxi Cocktail",
      "price": 47.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/81Qz5s7t1VL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 79.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61NPYwb0IuL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-mermaid-evening",
      "title": "Womens Maxi Dress Mermaid Evening",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61mn9ijJ8nL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi",
      "title": "Womens Maxi Dress Maxi",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61APXRO4SEL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-long-sleeve-cocktail-formal",
      "title": "Womens Maxi Dress Maxi Long Sleeve Cocktail Formal",
      "price": 44.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/619KL-XB3pL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 165.9,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71N1D-zbQHL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-mermaid-cocktail-maxi-formal",
      "title": "Womens Maxi Dress Evening Mermaid Cocktail Maxi Formal",
      "price": 39.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71HnBxkEb1L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 117.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/81CtK1yhbfL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-bodycon-ruched",
      "title": "Womens Maxi Dress Cocktail Bodycon Ruched",
      "price": 49.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51+rVhgLHSL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-formal",
      "title": "Womens Maxi Dress Evening Formal",
      "price": 82.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61sqAown2BL._SL1500_.jpg"
      ]
    }
  ]
}