{
  "id": "womens-maxi-dress-high-split-bodycon-split-evening-maxi-off-shoulder",
  "handle": "womens-maxi-dress-high-split-bodycon-split-evening-maxi-off-shoulder",
  "sku": "JC1942",
  "asin": "B0DRFBRD24",
  "title": "Womens Maxi Dress High Split Bodycon Split Evening Maxi Off Shoulder",
  "title_original": "Memoriesea Women's Elegant Off Shoulder High Split Bodycon Evening Wedding Maxi Dress",
  "brand": "Visit the Memoriesea Store",
  "price": 49.99,
  "social_proof": {
    "bought_past_month": 198,
    "text": "198+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/51vRcyCcTtL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61iXv-FOaFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/515Fds7f-jL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71QQW+HfYOL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51rZs84UtgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51qYuPDfSgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51hcjXfXV+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51sSmj8Sm0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51kEGSIEThL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51Ro5Kh9EfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61pMUJGYWrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/515quu+toIL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51IOVBd5GHL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/51vRcyCcTtL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61iXv-FOaFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/515Fds7f-jL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71QQW+HfYOL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51rZs84UtgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51qYuPDfSgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51hcjXfXV+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51sSmj8Sm0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51kEGSIEThL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51Ro5Kh9EfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61pMUJGYWrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/515quu+toIL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51IOVBd5GHL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Product Dimensions ‏": "‎ 6.3 x 4.72 x 0.39 inches; 14.11 ounces",
    "Item model number ‏": "‎ ME089",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ December 25, 2024",
    "ASIN ‏": "‎ B0DRFDHVGZ",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#11,547 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #12 in Women's Formal Dresses",
    "Customer Reviews": "4.2 4.2 out of 5 stars (310)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Darknavy",
      "Red",
      "Rose Red",
      "Deep Blue",
      "Burgundy",
      "Army Green",
      "Black"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.2,
    "count": 310,
    "customers_say": "Customers find the dress elegant, describing it as regal and sexy, with one noting its satin-like appearance. Moreover, the dress fits well, with one customer mentioning it stretches perfectly to accommodate the body, and another highlighting its flattering waistline. Additionally, they appreciate its high-quality construction, silky material, and comfortable, stretchy design. Generated from the text of customer reviews Select to learn more Elegance (55) Fit (47) Quality (36) Material quality (29) Flattering (25) Comfort (21) Stretchiness (20) Soft fabric (17) 55 customers mention elegance, 53 positive, 2 negative 55 customers mention \"Elegance\" 53 positive 2 negative Customers find the dress elegant, describing it as gorgeous with a beautiful shape that makes them feel regal and sexy. \" Beautiful and affordable! The fit was very comfy, it’s a stretchy sporty material that looks like satin. I loveeeed it!... \" Read more \" This dress completely surprised me. It was so elegant and sexy and it was such a perfect fit. The material feels so good on your body.... \" Read more \" BEAUTIFUL dress ! wore this recently for a wedding and received so many compliments. just as pictured and perfect length for my shorter girls.... \" Read more \" ...Overall, it’s the perfect mix of classy and sexy . Definitely a dress that makes you feel confident and ready to turn heads! \" Read more 47 customers mention fit, 34 positive, 13 negative 47 customers mention \"Fit\" 34 positive 13 negative Customers like how the dress fits, with one mentioning it accommodates movement well. \" Very flattering fit . Great color. I purchased the burgundy in a medium. The dress arrived quickly. I'm 5'3 and 165lbs.... \" Read more \" ...It fits really well and feels comfortable too, which is a huge plus. Overall, it’s the perfect mix of classy and sexy.... \" Read more \" ...I would have ordered a size up just because it was a little tight around the chest area for me \" Read more \" Very Stretchy, Durable, the Flow is nice, fits great \" Read more 36 customers mention quality, 33 positive, 3 negative 36 customers mention \"Quality\" 33 positive 3 negative Customers find the dress to be of high quality and perfect for weddings, with one customer mentioning it was suitable for a 14-year-old's homecoming event. \" Great dress , worth the purchase! I received numerous compliments on the dress. Dress was well made and comfortable.... \" Read more \" ...function, and it was absolutely perfect - elegant, flattering, and great quality . \" Read more \" Such a cute dress ! The color was black and the texture was a soft, satin / silk.... \" Read more \" Love the dress , such great material , very flattering . I bought an extra large and I am 5 “7 150 pounds \" Read more 29 customers mention material quality, 21 positive, 8 negative 29 customers mention \"Material quality\" 21 positive 8 negative Customers love the material of the dress, noting that it feels good on the body. \" Love the material . It’s soft on the skin and makes me look great!! It fits perfectly!! I’m 140lb 5’2 and got a small , I’m normally a medium .... \" Read more \" Love the dress , such great material , very flattering . I bought an extra large and I am 5 “7 150 pounds \" Read more \" ...It is mostly spandex giving the appearance of a costume quality dress that formal event.... \" Read more \" ...Great style and material of dress though! \" Read more 25 customers mention flattering, 24 positive, 1 negative 25 customers mention \"Flattering\" 24 positive 1 negative Customers find the dress flattering, noting that it hugs the body and one customer mentions it's perfect for hiding the belly area. \" ...This dress accentuates your waistline and overall flattering . I got so many compliments from my husband and at the concert from strangers!... \" Read more \" So soft. Very flattering . Length to the floor. Silky, stretchy, has extra fabric at the tummy for blending.... \" Read more \" ...This dress feels so good and is super flattering . The bride at the wedding asked me days later to send her this dress link bc it was that good! \" Read more \" Absolutely gorgeous! The ruching is perfect and so flattering . The material is very forgiving and has great stretch. True to size!... \" Read more 21 customers mention comfort, 21 positive, 0 negative 21 customers mention \"Comfort\" 21 positive 0 negative Customers find the dress comfortable. \" Fit perfectly. Super soft and comfortable . I’m not one to wear dresses much but I could wear this one for every occasion. Great quality for the price. \" Read more \" This dress is just how I imagined! It fits like a glove. Super comfortable and stretchy. Styled it for a black tie optional wedding. \" Read more \" Fit perfect for a wedding. True to size and comfy . The color was superb. \" Read more \" ... very comfortable . the fabric is pretty stretchy so definitely room for moving around. very very good price for what you get.... \" Read more 20 customers mention stretchiness, 18 positive, 2 negative 20 customers mention \"Stretchiness\" 18 positive 2 negative Customers like the dress's stretchiness, with one mentioning it's comfortable and another noting it provides shape. \" Amazing! Comfortable, stretchy , no zippers, just step in & pull up. I’m 5’4, 145 lbs & the medium was perfect. The length was perfect for me also!... \" Read more \" Way better in person than expected. Fabric is stretchy and doesn’t wrinkle. It was really nice on. Highly recommend. Great red color.... \" Read more \" ...I sized down and got a medium, which was perfect bc the material is stretchy . I’m 5’3 and 175lbs. \" Read more \" ...The material is so stretchy , soft, and flattering. It fits perfectly everywhere. I am so excited to wear this for my event. \" Read more 17 customers mention soft fabric, 17 positive, 0 negative 17 customers mention \"Soft fabric\" 17 positive 0 negative Customers appreciate the dress's soft fabric, describing it as silky. \" So soft. Very flattering. Length to the floor. Silky , stretchy, has extra fabric at the tummy for blending.... \" Read more \" Fit perfectly. Super soft and comfortable. I’m not one to wear dresses much but I could wear this one for every occasion. Great quality for the price. \" Read more \" The material of this dress i could be buried in, it is SO soft and it is absolutely gorgeous on me.... \" Read more \" Beautiful and soft dress . Super flattering and stretchy so it’s comfortable all night.... \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Perfect dress for a formal event/party",
        "body": "Beautiful and soft dress. Super flattering and stretchy so it’s comfortable all night. As a shorty (5’3), the length was perfect with or without tall shoes. The color was more of a deep mulberry color, the picture doesn’t do it justice. Read more",
        "author": "Corrie",
        "rating": 5.0,
        "date": "December 12, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Wash on delicate, let it dry on warm & the dress to hang for a bit and ready for you to wear!",
        "body": "What a gorgeous dress! This beautiful silky black dress fit comfortably on me from my shoulders right down to the length of my heels. I am 5’3, 148 pounds and ordered a medium, which according to Amazon, is true to my size. This dress accentuates your waistline and overall flattering. I got so many compliments from my husband and at the concert from strangers! What a great value for your money! I highly recommend to purchase this dress, especially now for the Holidays! Read more",
        "author": "Pamela Marquez",
        "rating": 5.0,
        "date": "November 28, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71vg8C-6iAL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Amazing and beautiful",
        "body": "Absolutely stunning in person! I don’t have to wear a faja cuz the slight ruffle is in the perfect spot to hide the belly! The tube top comes with an arm sleeve so the dress is never going to ride down. It’s comfortable, light and silky…feels amazing ! 10/10 would recommend! Read more",
        "author": "Malorie Fabian",
        "rating": 5.0,
        "date": "November 6, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Wonderful! Loved the fabric and fit!",
        "body": "Beautiful and affordable! The fit was very comfy, it’s a stretchy sporty material that looks like satin. I loveeeed it! The fabric weight was perfect and I feel like it held its shape. The only downside was that the top sits verrry low. I tried to keep it up, but because of the way the dress is made, it just sits very low. So all night I was fighting it. Overall a wonderful dress! Read more",
        "author": "Halee Story",
        "rating": 4.0,
        "date": "October 18, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/81bMh0-sMlL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Love it",
        "body": "It is very tight on the breast area and arms but a bit looser in the stomach area. It fits well and looks very pretty. I was wearing a fajafit and it didn’t mark in the front. I do recommend getting a size up and having waist adjusted if you have a hour clock shape. Even if you’re on a heavier size like me. I’m 150 5’2. I reaaaaally love the dress Read more",
        "author": "ty",
        "rating": 5.0,
        "date": "November 16, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71KVibbAsqL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71OEkr5Y6nL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Perfect evening or wedding event gown!",
        "body": "Gorgeous!! Love the material! Read more",
        "author": "Louise Ayersman",
        "rating": 5.0,
        "date": "December 4, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Overall fair-but did return",
        "body": "I wanted to love this BUT the top just wasn’t a great fit. The strapless band part that folds down was thinner than expected and didn’t fold over nicely like it does in the pic. Wasn’t flattering on me. If you have a bigger chest, it probably will be the same for you as well. I am 5’7 and ordered a M. It is true to size. The color and material was actually super nice, not see through and not a lot of stretch…The waist was really beautiful and the slit was a good height but I had to return just for the way the top portion looked on me. Read more",
        "author": "Brittany Fuller",
        "rating": 3.0,
        "date": "July 11, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Very flattering dress",
        "body": "Very flattering fit. Great color. I purchased the burgundy in a medium. The dress arrived quickly. I'm 5'3 and 165lbs. The only complaint I have it that it does ride up a bit when going to sit, not enough to show anything but if you are wearing shorts/spanx underneath it you may see them or have to pull the dress down around your hips frequently. Read more",
        "author": "Customer",
        "rating": 5.0,
        "date": "December 21, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61US2pKy9lL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/61duU1XPN2L._SY88._SL1500_.jpg"
        ]
      }
    ]
  },
  "short_description": "Womens Maxi Dress High Split Bodycon Split Evening Maxi Off Shoulder is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.",
  "about_this_item": "Womens Maxi Dress High Split Bodycon Split Evening Maxi Off Shoulder is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.",
  "long_description": "Womens Maxi Dress High Split Bodycon Split Evening Maxi Off Shoulder is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Darknavy, Red, Rose Red, Deep Blue, Burgundy, Army Green, Black. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress High Split Bodycon Split Evening Maxi Off Shoulder is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Darknavy, Red, Rose Red, Deep Blue, Burgundy, Army Green, Black. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "862541be-5fee-437a-93bc-dd84b9badab9",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/862541be-5fee-437a-93bc-dd84b9badab9/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/862541be-5fee-437a-93bc-dd84b9badab9/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "5a79391e-af95-4e47-bda2-36adfc1d8eb3",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5a79391e-af95-4e47-bda2-36adfc1d8eb3/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5a79391e-af95-4e47-bda2-36adfc1d8eb3/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "0310809b-2943-4208-b65a-8945e0143a3d",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0310809b-2943-4208-b65a-8945e0143a3d/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0310809b-2943-4208-b65a-8945e0143a3d/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "9dea4831-d381-4c4f-895d-0c6581796d20",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9dea4831-d381-4c4f-895d-0c6581796d20/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9dea4831-d381-4c4f-895d-0c6581796d20/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "cd84cffa-0580-4c70-91bc-1242bb7b58ac",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/cd84cffa-0580-4c70-91bc-1242bb7b58ac/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/cd84cffa-0580-4c70-91bc-1242bb7b58ac/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "d5bcf3d9-8eb7-4e8f-bee5-28289acc8388",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d5bcf3d9-8eb7-4e8f-bee5-28289acc8388/embedded.cc.default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d5bcf3d9-8eb7-4e8f-bee5-28289acc8388/embedded.cc.default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "db4544d3-ea0c-4018-aada-358ef0b51df4",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/db4544d3-ea0c-4018-aada-358ef0b51df4/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/db4544d3-ea0c-4018-aada-358ef0b51df4/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "79d9b993-3e7e-4950-9fe6-2d9f2e7d792d",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/79d9b993-3e7e-4950-9fe6-2d9f2e7d792d/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/79d9b993-3e7e-4950-9fe6-2d9f2e7d792d/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "73d6ee52-5872-49ab-92f5-ca2467ab0a5c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/73d6ee52-5872-49ab-92f5-ca2467ab0a5c/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/73d6ee52-5872-49ab-92f5-ca2467ab0a5c/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "71aded45-fada-4789-8844-127a0fe5d6a0",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/71aded45-fada-4789-8844-127a0fe5d6a0/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/71aded45-fada-4789-8844-127a0fe5d6a0/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "f9bc6dfa-62a3-4eb1-b925-a5e48db36a78",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f9bc6dfa-62a3-4eb1-b925-a5e48db36a78/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f9bc6dfa-62a3-4eb1-b925-a5e48db36a78/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "7d80aba7-93b7-4f68-97e4-644a2664c721",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7d80aba7-93b7-4f68-97e4-644a2664c721/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7d80aba7-93b7-4f68-97e4-644a2664c721/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Darknavy": "https://m.media-amazon.com/images/I/31tsbxcZfeL._AC_SR38,50_.jpg",
    "Red": "https://m.media-amazon.com/images/I/31+PyFN67jL._AC_SR38,50_.jpg",
    "Rose Red": "https://m.media-amazon.com/images/I/31m5RHpUerL._AC_SR38,50_.jpg",
    "Deep Blue": "https://m.media-amazon.com/images/I/31sV+P8TUbL._AC_SR38,50_.jpg",
    "Burgundy": "https://m.media-amazon.com/images/I/31UycOWSI6L._AC_SR38,50_.jpg",
    "Army Green": "https://m.media-amazon.com/images/I/31xmXEqNHKL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/311UXyhFt3L._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Darknavy": "51sSmj8Sm0L",
    "Red": "51kEGSIEThL",
    "Rose Red": "51Ro5Kh9EfL",
    "Deep Blue": "61pMUJGYWrL",
    "Burgundy": "515quu+toIL",
    "Army Green": "51IOVBd5GHL",
    "Black": "51vRcyCcTtL"
  },
  "color_images": {
    "Darknavy": [
      "https://m.media-amazon.com/images/I/51sSmj8Sm0L._SL1500_.jpg"
    ],
    "Red": [
      "https://m.media-amazon.com/images/I/51kEGSIEThL._SL1500_.jpg"
    ],
    "Rose Red": [
      "https://m.media-amazon.com/images/I/51Ro5Kh9EfL._SL1500_.jpg"
    ],
    "Deep Blue": [
      "https://m.media-amazon.com/images/I/61pMUJGYWrL._SL1500_.jpg"
    ],
    "Burgundy": [
      "https://m.media-amazon.com/images/I/515quu+toIL._SL1500_.jpg"
    ],
    "Army Green": [
      "https://m.media-amazon.com/images/I/51IOVBd5GHL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/51vRcyCcTtL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress-bodycon-sleeveless-cocktail-ruched-v-neck",
      "title": "Womens Dress Bodycon Sleeveless Cocktail Ruched V Neck",
      "price": 56.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61vGL0kNJYL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 35.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71H37VSr1uL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-v-neck-sleeveless",
      "title": "Womens Dress V Neck Sleeveless",
      "price": 31.27,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61d5+jUT-UL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-sleeveless",
      "title": "Womens Dress Sleeveless",
      "price": 47.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71gSCnzqz-L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi",
      "title": "Womens Maxi Dress Maxi",
      "price": 111.97,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/717cr3ebLRL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-maxi-sleeveless-ruched-evening-one-shoulder-cocktail",
      "title": "Womens Maxi Dress Maxi Sleeveless Ruched Evening One Shoulder Cocktail",
      "price": 37.53,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51HLy9K0aEL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 35.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61dKto0nS0L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 139.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71TANKZawRL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-maxi",
      "title": "Womens Maxi Dress Evening Maxi",
      "price": 14.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/81CIc2WXCaL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 48.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61wYcJrhlVL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail",
      "title": "Womens Dress Cocktail",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61dvvjCFiwL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-formal-maxi-cocktail",
      "title": "Womens Maxi Dress Bodycon Formal Maxi Cocktail",
      "price": 41.59,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61x+lw2lFuL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 82.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Wedding Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/51T8jyoVygL._SL1500_.jpg"
      ]
    }
  ]
}