{
  "id": "womens-maxi-dress-evening-mermaid-cocktail-maxi-formal",
  "handle": "womens-maxi-dress-evening-mermaid-cocktail-maxi-formal",
  "sku": "JC1581",
  "asin": "B0D7HTX153",
  "title": "Womens Maxi Dress Evening Mermaid Cocktail Maxi Formal",
  "title_original": "GRACE KARIN 2025 Velvet Wedding Guest Dresses for Women, Winter Formal Cocktail Maxi Dress, Cowl Neck Mermaid Evening Gown",
  "brand": "Visit the GRACE KARIN Store",
  "price": 39.98,
  "social_proof": {
    "bought_past_month": 50,
    "text": "50+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/71HnBxkEb1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Ws3mTPE2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71b24INp+HL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71U9MBkhaOL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81pMXQDGlAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71HFUfsvS9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/613ZXT-vy8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61VrTZIe0yL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61bPUIGWNLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61B5AYQIwcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71sM0QGPXYL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61WkFVFjNdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51-w2g1ScxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61HiB+irBqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/610aIsmGzsL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61imDUYJUmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61T70EDGJqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61D1y1Ib1qL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/717Kd+wbLqL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/71HnBxkEb1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Ws3mTPE2L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71b24INp+HL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71U9MBkhaOL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81pMXQDGlAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71HFUfsvS9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/613ZXT-vy8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61VrTZIe0yL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61bPUIGWNLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61B5AYQIwcL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71sM0QGPXYL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61WkFVFjNdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51-w2g1ScxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61HiB+irBqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/610aIsmGzsL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61imDUYJUmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61T70EDGJqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61D1y1Ib1qL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/717Kd+wbLqL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ June 19, 2024",
    "ASIN ‏": "‎ B0D7HWB1NB",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#11,268 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #53 in Women's Formal Dresses",
    "Customer Reviews": "4.3 4.3 out of 5 stars (576)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Olive Green",
      "Apricot",
      "Black",
      "Navy Blue",
      "Gray Blue",
      "Dark Green",
      "Red",
      "Rose Red",
      "Wine Red",
      "Pink",
      "Purple",
      "Blue Green",
      "Royal Blue",
      "Bright Red",
      "Gold Brown"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.3,
    "count": 576,
    "customers_say": "Customers find the dress fits well, with one noting it hits at the ankle, and appreciate its flattering design that hugs curves in all the right places. The velvet material is praised for being a decent thickness, comfortable, and stretchy, while the color receives positive feedback. Customers describe the dress as well-made and sexy without being sleazy. Select to learn more Beauty Fit Quality Comfort Flattering Fabric quality Color Stretchability 122 customers mention \"Beauty\" 118 positive 4 negative Customers find the dress gorgeous and sexy without being sleazy. \" Beautiful dress One bad thing is that everything and I mean everything sticks to it Otherwise well made and flattering\" Read more \" Beautiful and elegant dress! I loved the velvety fabric and that it is thick. Size was true to size. I’m 5’5” and the dress reached my ankles....\" Read more \"Great fit - sleek, comfortable , and elegant - perfect for a black tie event, fancy date nt, or festive occasion.\" Read more \" Pretty , good quality, perfect fit, great price. Perfect for weddings or holiday work parties.\" Read more 122 customers mention \"Fit\" 109 positive 13 negative Customers like how the dress fits, describing it as a nice velvet dress that doesn't feel tight, with one customer noting it hits right above the ankles. \"Just received my dressed and its a perfect fit but I noticed some horizontal lines on the back of the dress as if it were snagged or something....\" Read more \"As other reviews have said, this dress is a great fit . Room to move, but hugs the right areas with stretchiness yo accommodate dinner....\" Read more \"This dress was so flattering and fit great . It traveled to the hotel and event really well without wrinkling and the material was great.\" Read more \"Loved this dress fit perfectly and loved how it looks. Thinking of buying a different color and also loved price.\" Read more 78 customers mention \"Quality\" 73 positive 5 negative Customers find the dress to be well-made and perfect for wedding guest attire, though some report receiving a dress with terrible quality. \"It was a great dress , fit well and felt great. But with the seatbelt on the front of it, the fabric started pull apart. I have blue lint everywhere\" Read more \"Very nice fabric. Good quality . I am happy with the product. It fits as stated. I ordered multiple colors.\" Read more \"This dress was great quality , the color was vivid and was a flattering dress for a 5'4 165 lb woman, I ordered a size 14, I would purchase again in...\" Read more \" Nice dress . Not a high quality but value for money\" Read more 60 customers mention \"Comfort\" 60 positive 0 negative Customers find the dress comfortable, with one mentioning it is very forgiving for a bodycon style. \"...The color is perfect for fall. Extremely flattering and comfortable . Can’t say enough good things about this dress! Fit like a glove! I got a size 6.\" Read more \"Elegant dress. Very Comfortable . The Pink is a beautiful. I was recommended a size 8- but I think I could have gotten away with a 6.\" Read more \"...Wearing it to a fall wedding with gold sparkling heels . It’s so comfortable and the neckline sits perfectly ! It’s not too heavy either ....\" Read more \"...The dress was super comfortable . I love the soft material. It was easy to put on and off also.\" Read more 52 customers mention \"Flattering\" 46 positive 6 negative Customers find the dress flattering, particularly around the middle, as it hugs curves in all the right places. \"Perfect for formal winter wedding. Very flattering . Rouching concealed problem areas nicely. Fabric weight was great not too thin and not too heavy.\" Read more \"This dress fit perfectly right out the bag. Lightweight and flattering . Draped on the body like Roman marble statue fabric, sexy and comfy....\" Read more \"...WRONG. It was so flattering and I felt so great in it. Comfy and stretchy but just overall almost the perfect dress. :)\" Read more \"This dress was great quality, the color was vivid and was a flattering dress for a 5'4 165 lb woman, I ordered a size 14, I would purchase again in...\" Read more 50 customers mention \"Fabric quality\" 41 positive 9 negative Customers appreciate the fabric of the dress, describing it as nice, with one customer noting its rich color and texture, and another mentioning its decent thickness. \"Really lovely cut and fabric , sewn extremely well. You would think this is a way more expensive dress....\" Read more \"...Beautiful quality, nice fabric , quality invisible zipper, nice lines and lay of the material AND it fit like it was tailored for me....\" Read more \" Nice material , and great color for a fall wedding. Ordered an XL, I’m a size 16, 5’1” - 195lbs Happy with my puchase....\" Read more \"Wore this to a wedding in Tampa and it was great material and beautiful color! I went up a size and it was perfect!...\" Read more 44 customers mention \"Color\" 41 positive 3 negative Customers like the dress's color. \"Wore this to a wedding in Tampa and it was great material and beautiful color ! I went up a size and it was perfect!...\" Read more \"...I received so many compliments on this dress, its color and the fabric itself. I would definitely recommend this dress!!!\" Read more \"The color is beautiful and very comfortable. 5’6” , 152 lbs. I ordered a M.\" Read more \"...This dress is a wow!!!! loved the color , length, folds/pleats all in the right places, so comfortable yet elegant!! Velvet was the way to go!!...\" Read more 38 customers mention \"Stretchability\" 35 positive 3 negative Customers appreciate the dress's stretchiness, with one mentioning it hugs the right areas and another noting it's light with some flexibility. \"...It has a zipper which isn’t necessary because it’s stretchy but it’s nice. It was on sale when purchased so it is good for the price....\" Read more \"...Such a great deal! Material feels great and has a bit of stretch . Looks flattering and received many compliments.\" Read more \"...The stretchy velvet , the color, and the fit were all fabulous. Sexy and classy!\" Read more \"Gorgeous velvet dress! This dress is very stretchy and flattering. Due to the stretch, I could’ve sized down but a medium still works....\" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Stylish velvet gown",
        "body": "This is really beautiful with the fit (form fitting mermaid style), very flattering and forgiving. The velvet is soft and overall really elegant. Super classy vibes. This is perfect for a black tie/gala event. There's beauty in simplicity as they say, and even though this is simply all black velvety fabric, it's one of the nicest dresses I've tried on, and I'm always on the hunt for my next best flattering fit. It looks great with a necklace for bling and heels to match. Read more",
        "author": "Penny",
        "rating": 5.0,
        "date": "December 4, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Beautiful and flattering",
        "body": "Arrived in one day and wearable right out of the bag! This dress did not disappoint. The fabric is lovely in all ways. It’s soft and nice weight with stretch and the color is beautiful. It has a zipper down the back and it drapes beautifully. I’m 5’1” and 125 lbs and the medium is a perfect fit. On me it’s like a floor length gown but I don’t need to have it hemmed. I’m wearing it to a winter barn wedding and my boots look great with it. Im really glad I ordered it. It had to travel in my suitcase and this fabric was fabulous for that. Came out of the suitcase ready to wear. The fabric is soft and comfortable and not too hot. I received so many compliments on this dress, its color and the fabric itself. I would definitely recommend this dress!!! Read more",
        "author": "Mr. & Mrs. V.",
        "rating": 5.0,
        "date": "December 14, 2024",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/510dTPkH0NL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "4.0 out of 5 stars Bought for a Costume, might wear for Christmas too",
        "body": "Material is stretchy and light but not bad quality. Rather comfortable. I bought the size 18 and it fits as expected. I might need some shapewear because it makes my hips stick out funny but I'm a curvy girl. I am wearing a duster over it so I might skip the shapewear altogether because it will cover my problem areas. Makes me feel fancy. I bought this for an Alberta Haynes costume, and it will be perfect! Read more",
        "author": "Cayden",
        "rating": 4.0,
        "date": "October 6, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Ready for the holiday party!",
        "body": "I ordered this at the last minute for a company holiday party, tried it on after a few other options in my closet and it turned out to be the perfect choice! Great fit, the kick flare at the back doesn’t show up as well in pictures but it gives the dress that extra something. The stretchy velvet, the color, and the fit were all fabulous. Sexy and classy! Read more",
        "author": "Kindle Customer",
        "rating": 5.0,
        "date": "December 14, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71Wd1JEak8L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Photos on Amazon do not do this dress justice!!",
        "body": "This dress is even cuter than photos show!! I only returned it because it is fancier than what I needed. This dress was super soft, very flexible material and I have a bit of a pouch on my lower stomach and this dress did a fairly good job of concealing it with all the gathers along the side. The dress is made to hug those curves of your body. This is definitely a fall or winter dress due to the material. It’s not overly thick, but definitely not see through whatsoever. I loved the color of this dress!! The quality seemed to be really good. I am 5’8”, 140 pounds, 39 hips, bra 34 DDD, and the size 8 (medium) fit perfectly!! The dress was not too short and no hemming needed. If I had a formal event, I would buy this again!! I really liked it. Read more",
        "author": "tom",
        "rating": 5.0,
        "date": "October 3, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71W6AQdzKhL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/716LKOxbX+L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "3.0 out of 5 stars Should be new",
        "body": "Dress is very pretty and fits nicely. Height is 5 ft 3 inches and 179 pounds. The reason I gave it 3 stars was due to seemingly being a returned item, otherwise 4 stars. It did not arrive in its' original packaging. I will return. Read more",
        "author": "PDS",
        "rating": 3.0,
        "date": "November 6, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars LOVE THIS DRESS!",
        "body": "ABSOLUTELY LOVE THIS DRESS! I was shopping for a wedding guest dress and had a different style in mind, but this dress kept coming up in my suggestions. Finally I ordered it if for no other reason than to rule it out. WRONG. It was so flattering and I felt so great in it. Comfy and stretchy but just overall almost the perfect dress. :) Read more",
        "author": "Deborah Tighe",
        "rating": 5.0,
        "date": "December 16, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61BqthCczqL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/61+MUXqlbmL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/61fP9Ex7irL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/51p2i8rb82L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars You NEED this dress",
        "body": "I absolutely love this dress. It is so comfortable and stylish. I've gotten many compliments on the dress - wore it to a fundraiser gala. The velvet material is a decent thickness and the fit clings where it needs to. I want to buy more colors. Read more",
        "author": "Bharmening",
        "rating": 5.0,
        "date": "December 1, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Evening Mermaid Cocktail Maxi Formal is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.",
  "about_this_item": "Womens Maxi Dress Evening Mermaid Cocktail Maxi Formal is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.",
  "long_description": "Womens Maxi Dress Evening Mermaid Cocktail Maxi Formal is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Olive Green, Apricot, Black, Navy Blue, Gray Blue, Dark Green, Red, Rose Red, Wine Red, Pink, Purple, Blue Green, Royal Blue, Bright Red. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Evening Mermaid Cocktail Maxi Formal is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Olive Green, Apricot, Black, Navy Blue, Gray Blue, Dark Green, Red, Rose Red, Wine Red, Pink, Purple, Blue Green, Royal Blue, Bright Red. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "5b5fbc8f-df5b-4997-89f3-1487ef85e3bd",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5b5fbc8f-df5b-4997-89f3-1487ef85e3bd/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5b5fbc8f-df5b-4997-89f3-1487ef85e3bd/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/14bdc108-6e3c-4a7d-a940-066d9c6ae4df.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "9addf41b-13a0-4ccf-9c79-2a2dd2546919",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9addf41b-13a0-4ccf-9c79-2a2dd2546919/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9addf41b-13a0-4ccf-9c79-2a2dd2546919/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/14bdc108-6e3c-4a7d-a940-066d9c6ae4df.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "2331dfca-d161-490a-bd92-f1f1ecad103e",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2331dfca-d161-490a-bd92-f1f1ecad103e/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2331dfca-d161-490a-bd92-f1f1ecad103e/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/14bdc108-6e3c-4a7d-a940-066d9c6ae4df.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "67be3595-6e69-4e73-997a-0f39ea60e777",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/67be3595-6e69-4e73-997a-0f39ea60e777/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/67be3595-6e69-4e73-997a-0f39ea60e777/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/14bdc108-6e3c-4a7d-a940-066d9c6ae4df.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "046f13d2-33b0-427c-b607-942d45f98925",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/046f13d2-33b0-427c-b607-942d45f98925/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/046f13d2-33b0-427c-b607-942d45f98925/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/14bdc108-6e3c-4a7d-a940-066d9c6ae4df.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "1b5ca180-bf10-423b-9da7-087a78505b89",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1b5ca180-bf10-423b-9da7-087a78505b89/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1b5ca180-bf10-423b-9da7-087a78505b89/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/14bdc108-6e3c-4a7d-a940-066d9c6ae4df.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "0e971966-8e7c-46b9-946d-e0604ff6bba1",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0e971966-8e7c-46b9-946d-e0604ff6bba1/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0e971966-8e7c-46b9-946d-e0604ff6bba1/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/14bdc108-6e3c-4a7d-a940-066d9c6ae4df.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "66790687-8238-45a4-8d32-9214ef1fdbea",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/66790687-8238-45a4-8d32-9214ef1fdbea/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/66790687-8238-45a4-8d32-9214ef1fdbea/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/14bdc108-6e3c-4a7d-a940-066d9c6ae4df.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "da094992-2c45-4bfb-89a8-3395828aacd3",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/da094992-2c45-4bfb-89a8-3395828aacd3/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/da094992-2c45-4bfb-89a8-3395828aacd3/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/14bdc108-6e3c-4a7d-a940-066d9c6ae4df.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "462f3b51-2814-42ba-af9e-d65d0673526e",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/462f3b51-2814-42ba-af9e-d65d0673526e/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/462f3b51-2814-42ba-af9e-d65d0673526e/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/14bdc108-6e3c-4a7d-a940-066d9c6ae4df.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "59fdf669-2c5d-432b-a2ba-a5681f4cab9c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/59fdf669-2c5d-432b-a2ba-a5681f4cab9c/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/59fdf669-2c5d-432b-a2ba-a5681f4cab9c/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/14bdc108-6e3c-4a7d-a940-066d9c6ae4df.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "d5a1b072-012e-4f57-aee9-03fd886017de",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d5a1b072-012e-4f57-aee9-03fd886017de/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d5a1b072-012e-4f57-aee9-03fd886017de/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/14bdc108-6e3c-4a7d-a940-066d9c6ae4df.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Olive Green": "https://m.media-amazon.com/images/I/311vFsPKFBL._AC_SR38,50_.jpg",
    "Apricot": "https://m.media-amazon.com/images/I/31rgjMCM8ML._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31BdRXqNw2L._AC_SR38,50_.jpg",
    "Navy Blue": "https://m.media-amazon.com/images/I/31rYpsbJytL._AC_SR38,50_.jpg",
    "Gray Blue": "https://m.media-amazon.com/images/I/31Ifjo7IL-L._AC_SR38,50_.jpg",
    "Dark Green": "https://m.media-amazon.com/images/I/31zyOPCXG4L._AC_SR38,50_.jpg",
    "Red": "https://m.media-amazon.com/images/I/31O84+rVYvL._AC_SR38,50_.jpg",
    "Rose Red": "https://m.media-amazon.com/images/I/41mRhEov5NL._AC_SR38,50_.jpg",
    "Wine Red": "https://m.media-amazon.com/images/I/31ybndiDtRL._AC_SR38,50_.jpg",
    "Pink": "https://m.media-amazon.com/images/I/31rbTirIp0L._AC_SR38,50_.jpg",
    "Purple": "https://m.media-amazon.com/images/I/31z8GZqgBNL._AC_SR38,50_.jpg",
    "Blue Green": "https://m.media-amazon.com/images/I/31bFkgklawL._AC_SR38,50_.jpg",
    "Royal Blue": "https://m.media-amazon.com/images/I/31+TaeKL8VL._AC_SR38,50_.jpg",
    "Bright Red": "https://m.media-amazon.com/images/I/31O84+rVYvL._AC_SR38,50_.jpg",
    "Gold Brown": "https://m.media-amazon.com/images/I/318K7XMd0QL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Olive Green": "613ZXT-vy8L",
    "Apricot": "61VrTZIe0yL",
    "Black": "61bPUIGWNLL",
    "Navy Blue": "61B5AYQIwcL",
    "Gray Blue": "71sM0QGPXYL",
    "Dark Green": "61WkFVFjNdL",
    "Red": "51-w2g1ScxL",
    "Rose Red": "61HiB+irBqL",
    "Wine Red": "71HnBxkEb1L",
    "Pink": "610aIsmGzsL",
    "Purple": "61imDUYJUmL",
    "Blue Green": "61T70EDGJqL",
    "Royal Blue": "61D1y1Ib1qL",
    "Bright Red": "51-w2g1ScxL",
    "Gold Brown": "717Kd+wbLqL"
  },
  "color_images": {
    "Olive Green": [
      "https://m.media-amazon.com/images/I/613ZXT-vy8L._SL1500_.jpg"
    ],
    "Apricot": [
      "https://m.media-amazon.com/images/I/61VrTZIe0yL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/61bPUIGWNLL._SL1500_.jpg"
    ],
    "Navy Blue": [
      "https://m.media-amazon.com/images/I/61B5AYQIwcL._SL1500_.jpg"
    ],
    "Gray Blue": [
      "https://m.media-amazon.com/images/I/71sM0QGPXYL._SL1500_.jpg"
    ],
    "Dark Green": [
      "https://m.media-amazon.com/images/I/61WkFVFjNdL._SL1500_.jpg"
    ],
    "Red": [
      "https://m.media-amazon.com/images/I/51-w2g1ScxL._SL1500_.jpg"
    ],
    "Rose Red": [
      "https://m.media-amazon.com/images/I/61HiB+irBqL._SL1500_.jpg"
    ],
    "Wine Red": [
      "https://m.media-amazon.com/images/I/71HnBxkEb1L._SL1500_.jpg"
    ],
    "Pink": [
      "https://m.media-amazon.com/images/I/610aIsmGzsL._SL1500_.jpg"
    ],
    "Purple": [
      "https://m.media-amazon.com/images/I/61imDUYJUmL._SL1500_.jpg"
    ],
    "Blue Green": [
      "https://m.media-amazon.com/images/I/61T70EDGJqL._SL1500_.jpg"
    ],
    "Royal Blue": [
      "https://m.media-amazon.com/images/I/61D1y1Ib1qL._SL1500_.jpg"
    ],
    "Bright Red": [
      "https://m.media-amazon.com/images/I/51-w2g1ScxL._SL1500_.jpg"
    ],
    "Gold Brown": [
      "https://m.media-amazon.com/images/I/717Kd+wbLqL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress-cocktail",
      "title": "Womens Dress Cocktail",
      "price": 94.96,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61DWMEm-oaL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening-maxi-mermaid-v-neck",
      "title": "Womens Maxi Dress Formal Evening Maxi Mermaid V Neck",
      "price": 80.48,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71s6LmTnh4L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail-v-neck",
      "title": "Womens Dress Cocktail V Neck",
      "price": 42.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71QusYRKDhL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 76.45,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71hOsSjVUNL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 568.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71q84fXVudL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-v-neck-maxi-bodycon-formal-cocktail-evening",
      "title": "Womens Maxi Dress V Neck Maxi Bodycon Formal Cocktail Evening",
      "price": 38.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/514c4tLH1gL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-ruched-cocktail-one-shoulder-maxi-bodycon-formal",
      "title": "Womens Maxi Dress Ruched Cocktail One Shoulder Maxi Bodycon Formal",
      "price": 46.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/5118p9QhJiL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-one-shoulder-bodycon-ruched-formal-sleeveless-maxi",
      "title": "Womens Maxi Dress One Shoulder Bodycon Ruched Formal Sleeveless Maxi",
      "price": 66.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61CkyHi94sL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-formal-long-sleeve",
      "title": "Womens Maxi Dress Evening Formal Long Sleeve",
      "price": 89.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51-DeL2MGRL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail-short-sleeve",
      "title": "Womens Dress Cocktail Short Sleeve",
      "price": 34.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61qT6feocKL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-v-neck-maxi-long-sleeve",
      "title": "Womens Maxi Dress V Neck Maxi Long Sleeve",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71kIhEBkvrL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 84.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61HQu-HMaTL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-sleeveless-bodycon",
      "title": "Womens Dress Sleeveless Bodycon",
      "price": 19.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/918m917C4jL._SL1500_.jpg"
      ]
    }
  ]
}