{
  "id": "womens-maxi-dress-bodycon-high-split-long-sleeve-formal-ruched-off-shoulder",
  "handle": "womens-maxi-dress-bodycon-high-split-long-sleeve-formal-ruched-off-shoulder",
  "sku": "JC2382",
  "asin": "B0FJFGZ4L1",
  "title": "Womens Maxi Dress Bodycon High Split Long Sleeve Formal Ruched Off Shoulder",
  "title_original": "Relipop Women Off Shoulder Dress Long Sleeve Bodycon Mesh Ruched High Split Fall Formal Wedding Guest Maxi Dresses",
  "brand": "Visit the Relipop Store",
  "price": 59.99,
  "social_proof": {
    "bought_past_month": 297,
    "text": "297+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/51FKOu18TAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51ecn9tXSQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51V1Gl3ZWML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61xzT5SgO0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61yDaWvCq3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51YcpxHiNNL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/617z9Sx-kHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61mahahzvpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61mK+MuA75L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/611-oLBWEOL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Dy3v3t51L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61HMRJmW9eL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61-9fljVIbL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/51FKOu18TAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51ecn9tXSQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51V1Gl3ZWML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61xzT5SgO0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61yDaWvCq3L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51YcpxHiNNL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/617z9Sx-kHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61mahahzvpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61mK+MuA75L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/611-oLBWEOL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Dy3v3t51L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61HMRJmW9eL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61-9fljVIbL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ July 22, 2025",
    "ASIN ‏": "‎ B0FJFMHMST",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#34,207 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #194 in Women's Formal Dresses",
    "Customer Reviews": "4.4 4.4 out of 5 stars (73)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Dark Green",
      "Blue",
      "Burgundy",
      "Floral Black Rose Red",
      "Black",
      "Floral Green",
      "Coffee",
      "Floral Brown"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.4,
    "count": 73,
    "customers_say": "Customers find the dress to be a perfect fit with nice construction and true color accuracy. They describe it as gorgeous, comfortable, and true to size, with one customer noting that the ruffling gives a good shape to any body. They appreciate the material thickness, with one mentioning the shoulder part is naked with scrunch material. Generated from the text of customer reviews Select to learn more Fit (13) Style (12) Quality (8) Color accuracy (7) Flattering (7) Size (7) Comfort (4) Material thickness (4) 13 customers mention fit, 10 positive, 3 negative 13 customers mention \"Fit\" 10 positive 3 negative Customers are satisfied with how the dress fits, with one mentioning it's great length and another noting it's flattering for taller women. \" The dress fit great , but the color was much more red than burgundy. \" Read more \" This fit my daughter beautifully for her fall school dance. \" Read more \" Stunning! Comfortable and flattering! Fits true to size . Looks amazing on! The burgundy color is beautiful!... \" Read more \" The dress split is high about a 4 in short. It is too short for the occasion I needed it for \" Read more 12 customers mention style, 12 positive, 0 negative 12 customers mention \"Style\" 12 positive 0 negative Customers find the dress stylish. \" The fit was funny on my body type & was slightly too small. It was beautiful though. I’m a size L usually and got a L. Would size up. \" Read more \" Beautiful dress just not for us tall girls!! The sleeve length was too short and the xl fit more like a large.... \" Read more \" Absolutely stunning and great value for the price. Wore it to a wedding and I got so many compliments \" Read more \" Very cute ! True to size! Bought to wear to a winter wedding! \" Read more 8 customers mention quality, 7 positive, 1 negative 8 customers mention \"Quality\" 7 positive 1 negative Customers appreciate the construction of the dress. \" This is a really well made dress ! For all shapes and sizes! The ruffling gives a really good shape to any body.... \" Read more \" ...The dress is super comfortable & has enough stretch. The quality is great for the price point! \" Read more \" Nice construction of a dress . Flattering if you’re tall - 5’8” and above. \" Read more \" Perfect wedding guest dress ... \" Read more 7 customers mention color accuracy, 5 positive, 2 negative 7 customers mention \"Color accuracy\" 5 positive 2 negative Customers are satisfied with the color accuracy of the dress, with one mentioning that the green is a deep emerald shade. \" ...Fits true to size. Looks amazing on! The burgundy color is beautiful ! I will probably order in another color as well! Get it! \" Read more \" Loved this dress! I got soooo many compliments on it. The color was beautiful .... \" Read more \" Fits good but definitely not brown and more of a burnt orange/red \" Read more \" Sizing was perfect & color is a beautiful blue . The dress is super comfortable & has enough stretch. The quality is great for the price point! \" Read more 7 customers mention flattering, 6 positive, 1 negative 7 customers mention \"Flattering\" 6 positive 1 negative Customers find the dress flattering, with one mentioning that the ruffling gives a good shape to any body, while another notes it hides a mommy tummy. \" Stunning! Comfortable and flattering ! Fits true to size. Looks amazing on! The burgundy color is beautiful!... \" Read more \" Beautiful fancy dress, great material hugs curves and hides mommy tummy \" Read more \" ...For all shapes and sizes! The ruffling gives a really good shape to any body .... \" Read more \" Nice construction of a dress. Flattering if you’re tall - 5’8” and above. \" Read more 7 customers mention size, 6 positive, 1 negative 7 customers mention \"Size\" 6 positive 1 negative Customers are satisfied with the dress's sizing, noting it runs true to size and is suitable for various body types. \" ...The green is a deep emerald green and so elegant. True to size . I’m a 10 and the M is perfect. \" Read more \" LOVED. So comfortable and sizing was accurate ! \" Read more \" Sizing was perfect & color is a beautiful blue. The dress is super comfortable & has enough stretch. The quality is great for the price point! \" Read more \" This is a really well made dress! For all shapes and sizes ! The ruffling gives a really good shape to any body.... \" Read more 4 customers mention comfort, 4 positive, 0 negative 4 customers mention \"Comfort\" 4 positive 0 negative Customers find the dress comfortable. \" LOVED. So comfortable and sizing was accurate! \" Read more \" Sizing was perfect & color is a beautiful blue. The dress is super comfortable & has enough stretch. The quality is great for the price point! \" Read more \" Stunning! Comfortable and flattering! Fits true to size. Looks amazing on! The burgundy color is beautiful!... \" Read more \" Beautiful fit and very comfortable ! I’m a size 16 and I ordered an XL \" Read more 4 customers mention material thickness, 3 positive, 1 negative 4 customers mention \"Material thickness\" 3 positive 1 negative Customers like the material of the dress, with one mentioning that the shoulder part is made of scrunch material. \" ...The length was perfect and the material was thick . It was super stretchy as well. I’m definitely keeping this stress for future weddings, and events. \" Read more \" ...Very soft, nice material . Could not see my underwear lines or anything else through the dress.... \" Read more \" ...There did seem to be excess fabric in the waist area which also wasn’t good. \" Read more \" Beautiful fancy dress, great material hugs curves and hides mommy tummy \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Stunning dress!",
        "body": "Loved this dress! I got soooo many compliments on it. The color was beautiful. I was so happy I went with this green dress because everybody at the gala was wearing the same style but in black so it was nice to stand out. The length was perfect and the material was thick. It was super stretchy as well. I’m definitely keeping this stress for future weddings, and events. Read more",
        "author": "Yvonne",
        "rating": 5.0,
        "date": "December 18, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Must buy!",
        "body": "Stunning! Comfortable and flattering! Fits true to size. Looks amazing on! The burgundy color is beautiful! I will probably order in another color as well! Get it! Read more",
        "author": "Angela Finnegan",
        "rating": 5.0,
        "date": "November 12, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Stylish, Flattering, and Perfect for Events",
        "body": "I was really impressed with this Relipop off-shoulder dress. The fit is flattering, the ruching hides problem areas nicely, and the mesh sleeves add a classy touch. The material is comfortable and has a good stretch without feeling cheap. The high split gives it a sleek, elegant look that’s perfect for fall events, date nights, or anything a bit more formal. I bought a medium, I'm 5'3, 150lbs and it looked really nice but would look even better if I had shapewear on; however, its too snug for my personal liking, so I ordered the large to see how that will feel and look. Overall, it’s a beautiful dress that looks even better in person and the color is beautiful. Highly recommend! Read more",
        "author": "DNooch",
        "rating": 4.0,
        "date": "November 24, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71kN3qwWyKL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/61rHuyoGNeL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/612f4COOxLL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/61H-zbkJKnL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Great quality, so cute and flattering (even with my rectangular body shape)",
        "body": "Just got it. I am usually a medium in everything, so I ordered a medium and it fits perfect! There is a good stretch to it too, so it doesn’t seem like it will be too restricting on the dance floor. (Wearing to a wedding) Very soft, nice material. Could not see my underwear lines or anything else through the dress. I love how the shoulder part is naked with scrunch material, so you won’t have to worry about constantly fixing/ pulling the shoulders up. Love the sheer sleeves too. Read more",
        "author": "Avery Pauley",
        "rating": 5.0,
        "date": "October 14, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61dkanH-RRL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/61q2PF0aqNL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "3.0 out of 5 stars Size up",
        "body": "The fit was funny on my body type & was slightly too small. It was beautiful though. I’m a size L usually and got a L. Would size up. Read more",
        "author": "Meridian",
        "rating": 3.0,
        "date": "December 18, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Great dress",
        "body": "Sizing was perfect & color is a beautiful blue. The dress is super comfortable & has enough stretch. The quality is great for the price point! Read more",
        "author": "Miss Kayylala",
        "rating": 5.0,
        "date": "November 10, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/81sVx1-Z5aL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Perfect fit!",
        "body": "Absolutely stunning and great value for the price. Wore it to a wedding and I got so many compliments Read more",
        "author": "Marissa Bufalini",
        "rating": 5.0,
        "date": "November 12, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Buy this! Got so many compliments! Don’t think twice!",
        "body": "This is a really well made dress! For all shapes and sizes! The ruffling gives a really good shape to any body. It is double layered so it feels high quality and kinda thick but it’s not warm thick. It’s like a cotton layer first and then a mesh layer on top for the ruffling. Read more",
        "author": "Sam Andres",
        "rating": 5.0,
        "date": "November 19, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/816TaVg4ACL._SY88._SL1500_.jpg"
        ]
      }
    ]
  },
  "short_description": "Womens Maxi Dress Bodycon High Split Long Sleeve Formal Ruched Off Shoulder is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.",
  "about_this_item": "Womens Maxi Dress Bodycon High Split Long Sleeve Formal Ruched Off Shoulder is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.",
  "long_description": "Womens Maxi Dress Bodycon High Split Long Sleeve Formal Ruched Off Shoulder is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Dark Green, Blue, Burgundy, Floral Black Rose Red, Black, Floral Green, Coffee, Floral Brown. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Bodycon High Split Long Sleeve Formal Ruched Off Shoulder is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Dark Green, Blue, Burgundy, Floral Black Rose Red, Black, Floral Green, Coffee, Floral Brown. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "901926b2-218d-43e4-ab29-ecd197db88dd",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/901926b2-218d-43e4-ab29-ecd197db88dd/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/901926b2-218d-43e4-ab29-ecd197db88dd/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/14bdc108-6e3c-4a7d-a940-066d9c6ae4df.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "b20872d4-1763-42a1-a894-dcd25d9d6332",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b20872d4-1763-42a1-a894-dcd25d9d6332/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b20872d4-1763-42a1-a894-dcd25d9d6332/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/14bdc108-6e3c-4a7d-a940-066d9c6ae4df.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "5e1f18e4-4df9-4ada-8fbd-4b822f32d0cf",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5e1f18e4-4df9-4ada-8fbd-4b822f32d0cf/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5e1f18e4-4df9-4ada-8fbd-4b822f32d0cf/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/14bdc108-6e3c-4a7d-a940-066d9c6ae4df.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "95b089e1-0158-4c02-83c8-2a4f2a7c725d",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/95b089e1-0158-4c02-83c8-2a4f2a7c725d/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/95b089e1-0158-4c02-83c8-2a4f2a7c725d/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/14bdc108-6e3c-4a7d-a940-066d9c6ae4df.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "f3a41868-8a24-4438-a5f5-8625e9d6c459",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f3a41868-8a24-4438-a5f5-8625e9d6c459/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f3a41868-8a24-4438-a5f5-8625e9d6c459/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/14bdc108-6e3c-4a7d-a940-066d9c6ae4df.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "284a13c9-b6ca-4a32-94f2-e11a05a82f34",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/284a13c9-b6ca-4a32-94f2-e11a05a82f34/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/284a13c9-b6ca-4a32-94f2-e11a05a82f34/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/14bdc108-6e3c-4a7d-a940-066d9c6ae4df.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "109090ae-c495-429e-b9e5-7fa97f3377dd",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/109090ae-c495-429e-b9e5-7fa97f3377dd/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/109090ae-c495-429e-b9e5-7fa97f3377dd/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/14bdc108-6e3c-4a7d-a940-066d9c6ae4df.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "974eca87-5e64-4300-90e3-ceaaa7e016c4",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/974eca87-5e64-4300-90e3-ceaaa7e016c4/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/974eca87-5e64-4300-90e3-ceaaa7e016c4/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/14bdc108-6e3c-4a7d-a940-066d9c6ae4df.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Dark Green": "https://m.media-amazon.com/images/I/31ZonAaCkbL._AC_SR38,50_.jpg",
    "Blue": "https://m.media-amazon.com/images/I/312eaNpKNvL._AC_SR38,50_.jpg",
    "Burgundy": "https://m.media-amazon.com/images/I/31i4PD89DcL._AC_SR38,50_.jpg",
    "Floral Black Rose Red": "https://m.media-amazon.com/images/I/31nD0ghvMRL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31eXfg24qKL._AC_SR38,50_.jpg",
    "Floral Green": "https://m.media-amazon.com/images/I/31zpAj4E+xL._AC_SR38,50_.jpg",
    "Coffee": "https://m.media-amazon.com/images/I/31nh4oFLjyL._AC_SR38,50_.jpg",
    "Floral Brown": "https://m.media-amazon.com/images/I/31hx2YsE+qL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Dark Green": "617z9Sx-kHL",
    "Blue": "61mahahzvpL",
    "Burgundy": "61mK+MuA75L",
    "Floral Black Rose Red": "611-oLBWEOL",
    "Black": "51FKOu18TAL",
    "Floral Green": "61Dy3v3t51L",
    "Coffee": "61HMRJmW9eL",
    "Floral Brown": "61-9fljVIbL"
  },
  "color_images": {
    "Dark Green": [
      "https://m.media-amazon.com/images/I/617z9Sx-kHL._SL1500_.jpg"
    ],
    "Blue": [
      "https://m.media-amazon.com/images/I/61mahahzvpL._SL1500_.jpg"
    ],
    "Burgundy": [
      "https://m.media-amazon.com/images/I/61mK+MuA75L._SL1500_.jpg"
    ],
    "Floral Black Rose Red": [
      "https://m.media-amazon.com/images/I/611-oLBWEOL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/51FKOu18TAL._SL1500_.jpg"
    ],
    "Floral Green": [
      "https://m.media-amazon.com/images/I/61Dy3v3t51L._SL1500_.jpg"
    ],
    "Coffee": [
      "https://m.media-amazon.com/images/I/61HMRJmW9eL._SL1500_.jpg"
    ],
    "Floral Brown": [
      "https://m.media-amazon.com/images/I/61-9fljVIbL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-off-shoulder-mermaid-formal-maxi-evening-bodycon",
      "title": "Womens Maxi Dress Off Shoulder Mermaid Formal Maxi Evening Bodycon",
      "price": 69.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/614sEnQiCGL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-split",
      "title": "Womens Dress Split",
      "price": 33.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71xNQJ9jv0L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-v-neck-short-sleeve",
      "title": "Womens Dress V Neck Short Sleeve",
      "price": 37.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/61sIwTfl-EL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 158.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71PmRANW40L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-high-split-formal-long-sleeve-split",
      "title": "Womens Maxi Dress High Split Formal Long Sleeve Split",
      "price": 42.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/519SM4mHYtL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress-cocktail-v-neck",
      "title": "Womens Dress Cocktail V Neck",
      "price": 42.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71QusYRKDhL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-mermaid-formal",
      "title": "Womens Maxi Dress Mermaid Formal",
      "price": 94.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61O6TbpPQXL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-long-sleeve",
      "title": "Womens Maxi Dress Bodycon Long Sleeve",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61Lk930NvWL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-maxi",
      "title": "Womens Maxi Dress Long Sleeve Maxi",
      "price": 42.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61szS4nFPcL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail-v-neck-bodycon",
      "title": "Womens Dress Cocktail V Neck Bodycon",
      "price": 19.95,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/611HBMEYCCL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-sleeveless-off-shoulder",
      "title": "Womens Maxi Dress Sleeveless Off Shoulder",
      "price": 169.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Wedding Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/51AHia0uolL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-long-sleeve",
      "title": "Womens Maxi Dress Maxi Long Sleeve",
      "price": 44.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61bWsxlCkLL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-formal-maxi-off-shoulder-long-sleeve-cocktail",
      "title": "Womens Maxi Dress Bodycon Formal Maxi Off Shoulder Long Sleeve Cocktail",
      "price": 29.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61BkDrZjF1L._SL1500_.jpg"
      ]
    }
  ]
}