{
  "id": "womens-maxi-dress-cocktail-maxi-long-sleeve-ruched-bodycon",
  "handle": "womens-maxi-dress-cocktail-maxi-long-sleeve-ruched-bodycon",
  "sku": "JC1995",
  "asin": "B0D818MJL7",
  "title": "Womens Maxi Dress Cocktail Maxi Long Sleeve Ruched Bodycon",
  "title_original": "MEROKEETY Women's Long Sleeve Fall Wedding Guest Dress 2025 Bodycon Floral Mesh Ruched Cocktail Maxi Dresses",
  "brand": "Visit the MEROKEETY Store",
  "price": 38.99,
  "social_proof": {
    "bought_past_month": 626,
    "text": "626+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/61MnvapCR4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/718d+Ya+inL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81t5miRdTGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71v2Oq2NvAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71pa+XC1qmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81U9EhfOx+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/817QxCGxe9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71gknOZ9fpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61E0d4TtmSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61IunHgzxRL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61R+BBJ81SL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61QHmXgNHNL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61SW0weQmxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61rnaA3cv4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71VoSMgQCgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61srkY1gdhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71rxhcXhNUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/613+zJh6zCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ScKfasYML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71i8xD0oB1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61my75+OLWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61KIq1QDOeL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ttuNrXsVL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ypkDQbrZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71t2QJxD7UL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/61MnvapCR4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/718d+Ya+inL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81t5miRdTGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71v2Oq2NvAL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71pa+XC1qmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81U9EhfOx+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/817QxCGxe9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71gknOZ9fpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61E0d4TtmSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61IunHgzxRL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61R+BBJ81SL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61QHmXgNHNL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61SW0weQmxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61rnaA3cv4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71VoSMgQCgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61srkY1gdhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71rxhcXhNUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/613+zJh6zCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ScKfasYML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71i8xD0oB1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61my75+OLWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61KIq1QDOeL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ttuNrXsVL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ypkDQbrZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71t2QJxD7UL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Item model number ‏": "‎ Long Sleeve Tie Dye Dress",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ July 20, 2024",
    "ASIN ‏": "‎ B0D81BN6JT",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#19,036 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #213 in Women's Casual Dresses",
    "Customer Reviews": "4.6 4.6 out of 5 stars (841)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Brown",
      "Blue",
      "Blackred",
      "Apricot",
      "Black",
      "Brownfloral",
      "Blackfloral",
      "Tealfloral",
      "Plaidblack",
      "Neon",
      "Plum",
      "Darkblue",
      "Leopard",
      "Brownblue",
      "Teal",
      "Navypink",
      "White Blue",
      "Green"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.6,
    "count": 841,
    "customers_say": "Customers find this dress beautiful and well-made, with a soft, form-fitting design that accentuates curves in the right places. The dress is comfortable, stretchy, and true to color, with one customer noting it's great for different weather conditions. They appreciate its versatility, with one mentioning it can be dressed up with a jacket if needed. Generated from the text of customer reviews Select to learn more Fit (168) Style (167) Comfort (121) Quality (110) Flattering (101) Color (70) Stretchiness (54) Material quality (41) 168 customers mention fit, 143 positive, 25 negative 168 customers mention \"Fit\" 143 positive 25 negative Customers like how the dress fits, with one mentioning it's soft and form-fitting, while another notes it's not too tight around the neck. \" Bought 1 size up from my normal and it’s a perfect fit ! Lightweight, stylish, comfortable and easy on & off. \" Read more \" This dress is absolutely stunning!!! Fits great ! Has some stretch and hugs my curves in all right places! Can’t wait to wear it to my nieces wedding \" Read more \" This dress was more that what I had expected and so flattering. It fit perfectly and just hugs my body unlike many fitted dresses.... \" Read more \" ...It is gorgeous! I wasn’t sure what to expect but it fits perfectly and is very stretchy. The ruching is forgiving and gives some shape.... \" Read more 167 customers mention style, 164 positive, 3 negative 167 customers mention \"Style\" 164 positive 3 negative Customers find the dress gorgeous, with one mentioning its attractive ruching at the waist and one shoulder, and another noting how it suits different body types. \" Beautiful dress , form fitting, and it stretches a little in case You eat a little more at the wedding! You will not go wrong if you purchase \" Read more \" ...It felt both respectful and beautiful — exactly what I hoped for on such a meaningful day. Highly recommend this dress for any special occasion. \" Read more \" Long length and cute . When you try it on its actually nice. Colors are bright.... \" Read more \" This dress is gorgeous . It was so flattering and very stretchy where it needed to be. It was the perfect weight for a fall wedding.... \" Read more 121 customers mention comfort, 118 positive, 3 negative 121 customers mention \"Comfort\" 118 positive 3 negative Customers find the dress comfortable and forgiving, with one mentioning that the stretchy material makes it particularly pleasant to wear. \" 5'4, 139lbs. Fits beautifully, comfortable , looks more expensive than you would expect. Perfect for 50+ hiding any flaws, but showing nice shape.... \" Read more \" Very comfortable . Stretchy if not too tight. Very flattering on the right body. Love the ruching on the left waist and the shoulders.... \" Read more \" The fit of this is so nice! I was so comfortable and got so many compliments. There is a zipper on the side but I was able to slide this right on.... \" Read more \" This dress was comfy and really accentuates your curves. I received so many compliments on this dress. I often refer between a medium and large.... \" Read more 110 customers mention quality, 107 positive, 3 negative 110 customers mention \"Quality\" 107 positive 3 negative Customers find the dress beautifully made and of better quality than expected. \" great dress at a great price, I got compliments all night at a friend's wedding. The slight ruching helps accentuate the good and hide the bad.... \" Read more \" ...I liked the material and felt that it was good quality . It was sheer in the correct places and I liked the lining. It didn't bunch.... \" Read more \" Love this dress ! Have worn on a couple of occasions and have gotten lots of compliments! Travels really well and doesn’t wrinkle \" Read more \" ...The dress is beautiful and great quality however the neckline ruined it. Size down for a more fitted look. Beautiful dress! \" Read more 101 customers mention flattering, 97 positive, 4 negative 101 customers mention \"Flattering\" 97 positive 4 negative Customers find the dress flattering, particularly for curvy bodies, as it hugs them in the right places and makes them look slender. One customer mentions that the ruching in the tummy area helps hide a small belly. \" This dress is flattering and stretchy. Very happy with the dress and got a ton of compliments. I could have sized down for a more fitted look. \" Read more \" So comfortable, and very flattering . The fabric is soft and the fit is true to size. I received a ton of compliments on this dress.... \" Read more \" I absolutely love this dress! It is so flattering and sexy without being revealing. I love the length as a 5'10\" athletically built woman.... \" Read more \" Absolutely love. Received so many compliments. Super flattering , incredibly comfortable. Amazing price. Can’t say enough good things about this dress \" Read more 70 customers mention color, 61 positive, 9 negative 70 customers mention \"Color\" 61 positive 9 negative Customers love the color of the dress, describing it as vibrant, with one customer noting the green lining under-dress. \" ...The color , the fit - perfect for any occasion. Absolutely love the green color combinations! \" Read more \" ...The quality of the material was great and the color was beautiful but it did not work with my body very well. \" Read more \" ...Pros: Super comfortable, easy to get on and off, beautiful color , very stretchy, overall a great dress.... \" Read more \" Loved the color and true to fit size. I received so many wonderful compliments on it. \" Read more 54 customers mention stretchiness, 52 positive, 2 negative 54 customers mention \"Stretchiness\" 52 positive 2 negative Customers appreciate the dress's stretchiness, with one mentioning it accommodates bumps well. \" I got the blue and it’s such Y2K fun and comfy dress! Great length, stretchy , modest, wore for a winter wedding and the mesh sleeves were great for... \" Read more \" This dress is gorgeous. It was so flattering and very stretchy where it needed to be. It was the perfect weight for a fall wedding.... \" Read more \" ...Comfortable, stretchy material and very flattering style for any body type. I’m 5’6” and 115 lbs and the small fit great. \" Read more \" very flattering, great stretch . I bought two!! Love it so much I’m 5’9” and 150# I bought a medium and fits perfectly \" Read more 41 customers mention material quality, 38 positive, 3 negative 41 customers mention \"Material quality\" 38 positive 3 negative Customers like the dress's material, describing it as nice and breathable, with one customer noting it's great for different weather conditions. \" This dress hits in all the right spots. It is so comfortable and great material . Definitely, buy this one!! \" Read more \" True to size, loved the color and material , very comfortable! \" Read more \" This dress is super comfortable! The material is not see through at all . It’s stretchy and the colors are so pretty! \" Read more \" This dress is EVERYTHING! The colors are gorgeous and the material is forgiving ! I will be buying more colors!... \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Very nice, comfortable, classy",
        "body": "This was not the right color. I should have ordered thd green so it's going back. ( video said it was teal one but it wasn't). I ordered xl. Was big at the waist. I'm 5'7\" and 165 lbs. I'll be ordering the L in the right color. I have another dress that I bought at navy's very similar to this fabric and construction. Very Cindy. Had an almost full lining. Goes down to 2 inches above my ankle. The sleeves are not lined but the material's pattern doesn't really let your arms show thru much, if that makes sense. I can't wait to exchange this for the one I wanted. It's really nice and comfortable. No one would believe you only paid this price. Four thumbs up lol Read more",
        "author": "Vee",
        "rating": 5.0,
        "date": "December 23, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Flattering and Durable",
        "body": "Bought it for a funeral. So cute and appropriate. Quality was better than expected. It was comfortable enough to dress down w/ flats and a denim jacket to wear on plane and then dress up with heels after landing to head straight to the funeral. Fit true to size and is flattering to shape although not too revealing. Read more",
        "author": "TiffnLB",
        "rating": 5.0,
        "date": "October 11, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Loved this flattering dress even after jet lag!",
        "body": "Wore this for family photos in Rome. Beautiful dress, soft fabric and perfect thickness. The length fit me perfectly at 5’0” and this was a 5/5 as far as beauty and comfort! I haven’t washed it yet but will run on delicates or hand wash. Read more",
        "author": "Chelsea Bond",
        "rating": 5.0,
        "date": "December 10, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/718bkoNcVdL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/610Oc6Bek3L._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/51Z54cBiRCL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Great dress for semi-forma to possibly formal occasions.",
        "body": "5'4, 139lbs. Fits beautifully, comfortable, looks more expensive than you would expect. Perfect for 50+ hiding any flaws, but showing nice shape. Well-lined. Not see through where it counts. Fabric is soft, very wrinkle resistant. Looks dressy vs casual, but has the comfort of a casual dress. Read more",
        "author": "Max Henderly",
        "rating": 5.0,
        "date": "December 14, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Maxi dress in style",
        "body": "The color of this dress is spot on from online view. Looks elegant for a great price. Size it true to fit. Read more",
        "author": "Dawn",
        "rating": 4.0,
        "date": "October 28, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Perfect wedding guest dress",
        "body": "This dress is wonderful!! One of my favorite Amazon finds ever. Great quality and very comfortable. The style is very flattering and the materiel is thick enough to hide any undergarment lines. I’m planning to order in other colors. I’m typically a size 6 or 8 in dresses. I ordered the medium and it fit perfectly. Read more",
        "author": "Customer",
        "rating": 5.0,
        "date": "December 16, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Great find, will definitely be wearing again!",
        "body": "I’m 5’4” 155-160lbs, I ordered a Medium and it’s fit perfectly and was so flattering even without shapewear. I have a slightly larger bust (36 DD), and this dress made for a very elegant silhouette. The length hit right above my ankles so even for shorter/average girlies it won’t be too long. I was afraid when I pulled it out of the packaging that I was too short for it, but paired it with a modest sized heel and it all came together. You may need to steam it, depending on which material you choose, because mine was darker and I was in a dark lighting the wrinkles weren’t obvious. For the price this is so worth it. Read more",
        "author": "Customer",
        "rating": 5.0,
        "date": "September 30, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Beautiful and elegant",
        "body": "I wore this dress for my husband’s celebration of life, and it was absolutely perfect. The style is elegant and flattering, and the floral mesh design added just the right touch of softness and grace. I received so many compliments throughout the day. The fit was true to size and comfortable to wear for several hours. It felt both respectful and beautiful — exactly what I hoped for on such a meaningful day. Highly recommend this dress for any special occasion. Read more",
        "author": "Monica W",
        "rating": 5.0,
        "date": "November 4, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Cocktail Maxi Long Sleeve Ruched Bodycon is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.",
  "about_this_item": "Womens Maxi Dress Cocktail Maxi Long Sleeve Ruched Bodycon is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.",
  "long_description": "Womens Maxi Dress Cocktail Maxi Long Sleeve Ruched Bodycon is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Brown, Blue, Blackred, Apricot, Black, Brownfloral, Blackfloral, Tealfloral, Plaidblack, Neon, Plum, Darkblue, Leopard, Brownblue. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Cocktail Maxi Long Sleeve Ruched Bodycon is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Brown, Blue, Blackred, Apricot, Black, Brownfloral, Blackfloral, Tealfloral, Plaidblack, Neon, Plum, Darkblue, Leopard, Brownblue. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "50cc89de-8cfc-494b-b6dc-d85ecfa950e0",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/50cc89de-8cfc-494b-b6dc-d85ecfa950e0/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/50cc89de-8cfc-494b-b6dc-d85ecfa950e0/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/552b0439-6111-44e5-a207-24971b1cbf4a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "4f1f97da-a001-4681-9c89-154c06c9593a",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4f1f97da-a001-4681-9c89-154c06c9593a/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4f1f97da-a001-4681-9c89-154c06c9593a/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/552b0439-6111-44e5-a207-24971b1cbf4a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "015a144c-3af7-4952-8eeb-784edfb9d32a",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/015a144c-3af7-4952-8eeb-784edfb9d32a/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/015a144c-3af7-4952-8eeb-784edfb9d32a/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/552b0439-6111-44e5-a207-24971b1cbf4a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "14ae57ff-d05e-4c71-b8ea-f6d9ac86b83f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/14ae57ff-d05e-4c71-b8ea-f6d9ac86b83f/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/14ae57ff-d05e-4c71-b8ea-f6d9ac86b83f/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/552b0439-6111-44e5-a207-24971b1cbf4a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "6c82f4a4-2237-438d-a35f-0cc91d234532",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6c82f4a4-2237-438d-a35f-0cc91d234532/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6c82f4a4-2237-438d-a35f-0cc91d234532/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/552b0439-6111-44e5-a207-24971b1cbf4a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "57150e7a-4dc3-4692-b392-04fe3f87a53e",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/57150e7a-4dc3-4692-b392-04fe3f87a53e/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/57150e7a-4dc3-4692-b392-04fe3f87a53e/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/552b0439-6111-44e5-a207-24971b1cbf4a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "ea05ede9-6b87-4a4c-9c4e-660e5bc61921",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ea05ede9-6b87-4a4c-9c4e-660e5bc61921/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ea05ede9-6b87-4a4c-9c4e-660e5bc61921/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/552b0439-6111-44e5-a207-24971b1cbf4a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "1b5793f9-13b2-4153-89ae-ceffc1d92ed7",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1b5793f9-13b2-4153-89ae-ceffc1d92ed7/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1b5793f9-13b2-4153-89ae-ceffc1d92ed7/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/552b0439-6111-44e5-a207-24971b1cbf4a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "b132cc83-bcc8-484e-8426-b72143a91e61",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b132cc83-bcc8-484e-8426-b72143a91e61/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b132cc83-bcc8-484e-8426-b72143a91e61/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/552b0439-6111-44e5-a207-24971b1cbf4a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "239130aa-7537-4850-8cf1-ce63a119ae5b",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/239130aa-7537-4850-8cf1-ce63a119ae5b/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/239130aa-7537-4850-8cf1-ce63a119ae5b/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/552b0439-6111-44e5-a207-24971b1cbf4a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "c1fcd293-845d-4563-b349-5c89e5db0434",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c1fcd293-845d-4563-b349-5c89e5db0434/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c1fcd293-845d-4563-b349-5c89e5db0434/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/552b0439-6111-44e5-a207-24971b1cbf4a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "7aba652d-5e75-4cbc-830c-a79cb2f28722",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7aba652d-5e75-4cbc-830c-a79cb2f28722/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7aba652d-5e75-4cbc-830c-a79cb2f28722/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/552b0439-6111-44e5-a207-24971b1cbf4a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Brown": "https://m.media-amazon.com/images/I/316QfBiGvWL._AC_SR38,50_.jpg",
    "Blue": "https://m.media-amazon.com/images/I/31fTgt1ce5L._AC_SR38,50_.jpg",
    "Blackred": "https://m.media-amazon.com/images/I/318Hcn4nOfL._AC_SR38,50_.jpg",
    "Apricot": "https://m.media-amazon.com/images/I/31cNvIqCArL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/41zloeyoIvL._AC_SR38,50_.jpg",
    "Brownfloral": "https://m.media-amazon.com/images/I/31TqPM00HeL._AC_SR38,50_.jpg",
    "Blackfloral": "https://m.media-amazon.com/images/I/41HcV6NwoVL._AC_SR38,50_.jpg",
    "Tealfloral": "https://m.media-amazon.com/images/I/318EF6dWRYL._AC_SR38,50_.jpg",
    "Plaidblack": "https://m.media-amazon.com/images/I/41WIeZAlBeL._AC_SR38,50_.jpg",
    "Neon": "https://m.media-amazon.com/images/I/410K+o7cJFL._AC_SR38,50_.jpg",
    "Plum": "https://m.media-amazon.com/images/I/311ZfS4ArVL._AC_SR38,50_.jpg",
    "Darkblue": "https://m.media-amazon.com/images/I/41+PAr2NpYL._AC_SR38,50_.jpg",
    "Leopard": "https://m.media-amazon.com/images/I/41dlWUB-fRL._AC_SR38,50_.jpg",
    "Brownblue": "https://m.media-amazon.com/images/I/41Yf+TS7BBL._AC_SR38,50_.jpg",
    "Teal": "https://m.media-amazon.com/images/I/31ZiG3yEoGL._AC_SR38,50_.jpg",
    "Navypink": "https://m.media-amazon.com/images/I/41LcFbe6yaL._AC_SR38,50_.jpg",
    "White Blue": "https://m.media-amazon.com/images/I/41XAQKvEMsL._AC_SR38,50_.jpg",
    "Green": "https://m.media-amazon.com/images/I/31n8q9dOIlL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Brown": "61E0d4TtmSL",
    "Blue": "61IunHgzxRL",
    "Blackred": "61R+BBJ81SL",
    "Apricot": "61QHmXgNHNL",
    "Black": "61SW0weQmxL",
    "Brownfloral": "61rnaA3cv4L",
    "Blackfloral": "71VoSMgQCgL",
    "Tealfloral": "61srkY1gdhL",
    "Plaidblack": "71rxhcXhNUL",
    "Neon": "613+zJh6zCL",
    "Plum": "61ScKfasYML",
    "Darkblue": "71i8xD0oB1L",
    "Leopard": "61my75+OLWL",
    "Brownblue": "61KIq1QDOeL",
    "Teal": "61ttuNrXsVL",
    "Navypink": "61ypkDQbrZL",
    "White Blue": "71t2QJxD7UL",
    "Green": "61MnvapCR4L"
  },
  "color_images": {
    "Brown": [
      "https://m.media-amazon.com/images/I/61E0d4TtmSL._SL1500_.jpg"
    ],
    "Blue": [
      "https://m.media-amazon.com/images/I/61IunHgzxRL._SL1500_.jpg"
    ],
    "Blackred": [
      "https://m.media-amazon.com/images/I/61R+BBJ81SL._SL1500_.jpg"
    ],
    "Apricot": [
      "https://m.media-amazon.com/images/I/61QHmXgNHNL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/61SW0weQmxL._SL1500_.jpg"
    ],
    "Brownfloral": [
      "https://m.media-amazon.com/images/I/61rnaA3cv4L._SL1500_.jpg"
    ],
    "Blackfloral": [
      "https://m.media-amazon.com/images/I/71VoSMgQCgL._SL1500_.jpg"
    ],
    "Tealfloral": [
      "https://m.media-amazon.com/images/I/61srkY1gdhL._SL1500_.jpg"
    ],
    "Plaidblack": [
      "https://m.media-amazon.com/images/I/71rxhcXhNUL._SL1500_.jpg"
    ],
    "Neon": [
      "https://m.media-amazon.com/images/I/613+zJh6zCL._SL1500_.jpg"
    ],
    "Plum": [
      "https://m.media-amazon.com/images/I/61ScKfasYML._SL1500_.jpg"
    ],
    "Darkblue": [
      "https://m.media-amazon.com/images/I/71i8xD0oB1L._SL1500_.jpg"
    ],
    "Leopard": [
      "https://m.media-amazon.com/images/I/61my75+OLWL._SL1500_.jpg"
    ],
    "Brownblue": [
      "https://m.media-amazon.com/images/I/61KIq1QDOeL._SL1500_.jpg"
    ],
    "Teal": [
      "https://m.media-amazon.com/images/I/61ttuNrXsVL._SL1500_.jpg"
    ],
    "Navypink": [
      "https://m.media-amazon.com/images/I/61ypkDQbrZL._SL1500_.jpg"
    ],
    "White Blue": [
      "https://m.media-amazon.com/images/I/71t2QJxD7UL._SL1500_.jpg"
    ],
    "Green": [
      "https://m.media-amazon.com/images/I/61MnvapCR4L._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/81YEThkfM3L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 300.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61iarf4BQ5L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-short-sleeve",
      "title": "Womens Dress Short Sleeve",
      "price": 54.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61UMw3TncmL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-long-sleeve-boat-neck-ruched-maxi",
      "title": "Womens Maxi Dress Formal Long Sleeve Boat Neck Ruched Maxi",
      "price": 38.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61Nld+cSAeL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 89.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61rRvmJ+FqL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-long-sleeve-bodycon",
      "title": "Womens Maxi Dress Long Sleeve Bodycon",
      "price": 42.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/617bKl41xVL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-v-neck",
      "title": "Womens Maxi Dress Long Sleeve V Neck",
      "price": 29.96,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51RHUQDMnHL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-v-neck",
      "title": "Womens Dress V Neck",
      "price": 74.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61uVzhIStxL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-off-shoulder-evening-high-split-formal-split",
      "title": "Womens Maxi Dress Off Shoulder Evening High Split Formal Split",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/41fCm0LLrUL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 36.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Work",
      "images": [
        "https://m.media-amazon.com/images/I/61VVsqt3RcL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi",
      "title": "Womens Maxi Dress Maxi",
      "price": 62.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71zVhaS89ZL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-sleeveless-cocktail-maxi",
      "title": "Womens Maxi Dress Sleeveless Cocktail Maxi",
      "price": 57.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51KBy6HsbSL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-long-sleeve",
      "title": "Womens Maxi Dress Bodycon Long Sleeve",
      "price": 47.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61Y76uBhueL._SL1500_.jpg"
      ]
    }
  ]
}