{
  "id": "womens-maxi-dress-long-sleeve-bodycon-formal-ruched-cocktail-maxi",
  "handle": "womens-maxi-dress-long-sleeve-bodycon-formal-ruched-cocktail-maxi",
  "sku": "JC2032",
  "asin": "B0DF7X6P4C",
  "title": "Womens Maxi Dress Long Sleeve Bodycon Formal Ruched Cocktail Maxi",
  "title_original": "MITILLY Fall Dress for Women 2025 Long Sleeve Maxi Dress Formal Crew Neck Bodycon Ruched Cocktail Party Dresses",
  "brand": "Visit the MITILLY Store",
  "price": 43.99,
  "social_proof": {
    "bought_past_month": 611,
    "text": "611+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/61nvzCG8ICL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/712Lvs4AUSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71r7x4Cc5NL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Ss8jYXu4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/713zK0F+xhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61pV1J+WOYL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Ziuz2z7tL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61l4IRqkWwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/618Dk9PWUzL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/615wcc4Ss7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61JBipH0zML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61eETIilFxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61AhkPd+8VL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/6154kB8I8wL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71RGdPVA5WL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61hHSJuJ1xL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61qfce+74OL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/61nvzCG8ICL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/712Lvs4AUSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71r7x4Cc5NL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Ss8jYXu4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/713zK0F+xhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61pV1J+WOYL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Ziuz2z7tL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61l4IRqkWwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/618Dk9PWUzL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/615wcc4Ss7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61JBipH0zML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61eETIilFxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61AhkPd+8VL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/6154kB8I8wL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71RGdPVA5WL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61hHSJuJ1xL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61qfce+74OL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ September 18, 2024",
    "ASIN ‏": "‎ B0DF7VMKZL",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#26,521 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #46 in Women's Formal Dresses",
    "Customer Reviews": "4.2 4.2 out of 5 stars (255)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Brown",
      "Apricot",
      "Light Green",
      "Black",
      "Dark Green",
      "Wine Red",
      "Khaki",
      "Champagne Pink",
      "Dark Blue",
      "Light Purple",
      "Rose Pink",
      "Teal",
      "Green"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.2,
    "count": 255,
    "customers_say": "Customers find the dress gorgeous and comfortable, with great quality for the price. The material is thick and stretchy, and one customer mentions it works well with a pregnant belly. While some the size is spot on, others find it too small. Select to learn more Fit Looks Quality Comfort Flattering Material thickness Stretchiness Size 31 customers mention \"Fit\" 26 positive 5 negative Customers like how the dress fits. \" Great fit and great quality.\" Read more \" Nice fit love it\" Read more \" very form fitting even if you get your size right\" Read more \" Beautiful fit , perfect stretchiness, amazing color and flattered all the right places\" Read more 31 customers mention \"Looks\" 29 positive 2 negative Customers find the dress gorgeous, with one customer specifically mentioning its beautiful dark red color. \" Very nice dress , has some stretch!\" Read more \"Comfortable and cute ! It's so nice I wore it twice. Worked well as a long dress for a shorter person (5'2\")....\" Read more \"Needed something sexy , classic, conservative for filming for a national Reality show. So glad I chose this little number....\" Read more \"...My daughter wore it to her engagement party! Beautiful !\" Read more 22 customers mention \"Quality\" 20 positive 2 negative Customers find the dress to be of great quality, with one mentioning it offers good value for the price. \"I didn’t care for the material but it is a nice dress \" Read more \"Great fit and great quality .\" Read more \" Loved this dress . It was so comfortable and the color was so flattering. I wore this for my beach engagement photos\" Read more \"The dress is amazing and I will be buying it aging . The fabric is amazing and I love the dress and fit is perfect I love it ....\" Read more 20 customers mention \"Comfort\" 19 positive 1 negative Customers find the dress comfortable, with one mentioning it is very forgiving. \"Loved this dress. It was so comfortable and the color was so flattering. I wore this for my beach engagement photos\" Read more \"...I'm so glad I bought this. I got it in a size Medium. It was very comfortable , not too tight, stopped right at my ankles, and had some stretch....\" Read more \"...Fits perfect to size and love the length for fall. Super comfy !\" Read more \" Comfy . Can be worn casual or dressed up. A staple in my closet.\" Read more 19 customers mention \"Flattering\" 14 positive 5 negative Customers find the dress flattering, with one mentioning it works well with a pregnant belly and another noting it stops at the ankles. \"Comfy and flattering \" Read more \"This dress hugs your curves but still gives a loose, comfortable feel. The texture to the dress makes it more elegant for sure....\" Read more \"...It runs big and is not flattering but most of all, it had a big hole in the sleeve and rips along the bottom\" Read more \"Very comfortable dress, incredibly flattering , beautiful color. Wore it to a wedding and got lots of compliments!! :)...\" Read more 15 customers mention \"Material thickness\" 11 positive 4 negative Customers love the material of the dress, describing it as thick and amazing. \"It fits well, I like the style and the material .\" Read more \"The dress is amazing and I will be buying it aging . The fabric is amazing and I love the dress and fit is perfect I love it ....\" Read more \" Horrible fabric . Snags easily\" Read more \"I love the fabric \" Read more 9 customers mention \"Stretchiness\" 9 positive 0 negative Customers appreciate the dress's stretchiness. \"True to size; size down if between sizes as it is stretchy and very forgiving. Looks good. I recommemd.\" Read more \"Very nice dress, has some stretch !\" Read more \"...very comfortable, not too tight, stopped right at my ankles, and had some stretch . I might consider getting this in additional colors\" Read more \"LOVE LOVE LOVE IT. Fit accurate with good stretch and comfortable. Loved the color and length.\" Read more 11 customers mention \"Size\" 6 positive 5 negative Customers have mixed opinions about the dress size, with some finding it spot on while others say it runs too small. \"This dress is true to size & the material is great quality. It's similar to a dress that I bought from Macy's 2yrs ago....\" Read more \"...I checked the comments and thought this was good but I was wrong! It runs big and is not flattering but most of all, it had a big hole in the sleeve...\" Read more \"...The fabric is soft and smooth . It’s plus size friendly ‼️‼️‼️\" Read more \"Dress is as described but runs small \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Gorgeous Long Dark Red Dress!",
        "body": "Gorgeous, stretchy, comfortable, not see through, sexy, yet conservative, long sleeve ankle length dress. I love this dress so much I bought it in 4 colors! Seriously I will buy this in any color that I think I can wear. I’m hoping for an emerald green and chocolate brown, hopefully those colors will be offered at some point. I’m 5’5”, 128, 34D, and it fits like a glove, I bought the medium, because I’m kind of curvy, with thicker thighs, and a booty, so the medium seemed the best choice. This dress looks like was made for me, you will be covered up, but your curves will definitely be highlighted. I’m very happy with the fit of this dress, I’ve worn it with and without shape wear, and, I preferred shape wear, as I’m not a huge fan of VPL. I wore the dark red color to a Christmas Party and the black one on NYE. So much love for this dress, I can’t possibly say enough, just buy this dress. Oh, and I must add that I washed it in the washing machine, in cold water, inside out, and hung it up to dry, and it still looks brand new! Just be careful when putting on jewelry, like a necklace, bracelets, or a watch. I wore the navy color to a wedding, and I was comfortable, stylish, warm at night, but not too hot, it still looked dressy enough for the wedding & reception, and seriously the price is absolutely insane compared to many dresses I had tried on in stores. Curvy Girls: Buy this dress! You will not be disappointed! Your curves will be on display, but in a tasteful way. Read more",
        "author": "Alyssa Hourglass",
        "rating": 5.0,
        "date": "August 12, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Very elegant!",
        "body": "I ordered this dress for a maternity photo shoot in the same size I would’ve worn if I wasn’t pregnant and was pleasantly surprised how well it worked with my pregnant belly! The ruching makes it so it can stretch with the belly but I imagine it will also give a slimming look when I no longer have my pregnant belly. I’m excited to see what it will look like when I’m not pregnant. The material has good stretch and is not see through at all. My only complaint is you can very easily see sweat if you’re someone who sweats, but that could potentially just be due to the color I chose. Read more",
        "author": "Madison C.",
        "rating": 5.0,
        "date": "November 25, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71E5FSTQ-sL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Love this dress!",
        "body": "This dress is well made and very comfortable. It fits so well and I love the way that I look in it. Read more",
        "author": "Karen T. Duncan",
        "rating": 5.0,
        "date": "December 19, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71Q8m1A9ICL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "4.0 out of 5 stars Easy to wear.",
        "body": "True to size; size down if between sizes as it is stretchy and very forgiving. Looks good. I recommemd. Read more",
        "author": "Customer",
        "rating": 4.0,
        "date": "October 9, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "1.0 out of 5 stars Received used dress",
        "body": "Just received this dress and wish it had worked out as it was cute. However, there were not tags on the dress and had multiple stains on the front of the dress. Almost like a return was just repackaged and sold again. Probably worn before. Getting a refund. Read more",
        "author": "D.R",
        "rating": 1.0,
        "date": "September 21, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Perfect",
        "body": "LOVE LOVE LOVE IT. Fit accurate with good stretch and comfortable. Loved the color and length. Read more",
        "author": "Shannon",
        "rating": 5.0,
        "date": "December 16, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61OxyqcqrxL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars True to size & great quality!",
        "body": "This dress is true to size & the material is great quality. It's similar to a dress that I bought from Macy's 2yrs ago. I received so many compliments on this dress! Read more",
        "author": "Charisse",
        "rating": 5.0,
        "date": "November 25, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/81x4nVf2peL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Comfortable and makes you look beautiful",
        "body": "Beautiful fit and so soft and comfortable Read more",
        "author": "Terra",
        "rating": 5.0,
        "date": "November 22, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Long Sleeve Bodycon Formal Ruched Cocktail Maxi is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.",
  "about_this_item": "Womens Maxi Dress Long Sleeve Bodycon Formal Ruched Cocktail Maxi is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.",
  "long_description": "Womens Maxi Dress Long Sleeve Bodycon Formal Ruched Cocktail Maxi is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Brown, Apricot, Light Green, Black, Dark Green, Wine Red, Khaki, Champagne Pink, Dark Blue, Light Purple, Rose Pink, Teal, Green. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Long Sleeve Bodycon Formal Ruched Cocktail Maxi is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Brown, Apricot, Light Green, Black, Dark Green, Wine Red, Khaki, Champagne Pink, Dark Blue, Light Purple, Rose Pink, Teal, Green. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "c60b8f2a-b31f-432d-9e86-4e46662d3a73",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c60b8f2a-b31f-432d-9e86-4e46662d3a73/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c60b8f2a-b31f-432d-9e86-4e46662d3a73/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "a420be1b-c274-4a42-bae5-5371cd1a20cf",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a420be1b-c274-4a42-bae5-5371cd1a20cf/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a420be1b-c274-4a42-bae5-5371cd1a20cf/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "2b2631dd-5d91-4c71-9e9f-29bd5e95173b",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2b2631dd-5d91-4c71-9e9f-29bd5e95173b/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2b2631dd-5d91-4c71-9e9f-29bd5e95173b/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "bfee363a-baf1-4823-b070-15a0284ce9e9",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bfee363a-baf1-4823-b070-15a0284ce9e9/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bfee363a-baf1-4823-b070-15a0284ce9e9/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "f2755187-034a-442c-acf7-dc6e31fef66d",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f2755187-034a-442c-acf7-dc6e31fef66d/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f2755187-034a-442c-acf7-dc6e31fef66d/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "baa9fd93-657d-4552-a6d8-ceb53c11891d",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/baa9fd93-657d-4552-a6d8-ceb53c11891d/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/baa9fd93-657d-4552-a6d8-ceb53c11891d/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "12e0f637-e85b-4326-b30d-9876550a7b29",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/12e0f637-e85b-4326-b30d-9876550a7b29/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/12e0f637-e85b-4326-b30d-9876550a7b29/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "1fc16600-6664-4287-9640-d27fdc67d5ec",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1fc16600-6664-4287-9640-d27fdc67d5ec/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1fc16600-6664-4287-9640-d27fdc67d5ec/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Brown": "https://m.media-amazon.com/images/I/31KMfvD4+9L._AC_SR38,50_.jpg",
    "Apricot": "https://m.media-amazon.com/images/I/31Rn8Oxz4iL._AC_SR38,50_.jpg",
    "Light Green": "https://m.media-amazon.com/images/I/41PNRGXvLlL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31Dtk8VS8uL._AC_SR38,50_.jpg",
    "Dark Green": "https://m.media-amazon.com/images/I/31VMiNHKquL._AC_SR38,50_.jpg",
    "Wine Red": "https://m.media-amazon.com/images/I/311GiSQ5LYL._AC_SR38,50_.jpg",
    "Khaki": "https://m.media-amazon.com/images/I/31vToPoSV4L._AC_SR38,50_.jpg",
    "Champagne Pink": "https://m.media-amazon.com/images/I/31bG6W7w+qL._AC_SR38,50_.jpg",
    "Dark Blue": "https://m.media-amazon.com/images/I/31F6sNDWp4L._AC_SR38,50_.jpg",
    "Light Purple": "https://m.media-amazon.com/images/I/315YU-7+sfL._AC_SR38,50_.jpg",
    "Rose Pink": "https://m.media-amazon.com/images/I/41SfwV-08UL._AC_SR38,50_.jpg",
    "Teal": "https://m.media-amazon.com/images/I/41VyJd5hnpL._AC_SR38,50_.jpg",
    "Green": "https://m.media-amazon.com/images/I/31CQCgwxvTL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Brown": "61pV1J+WOYL",
    "Apricot": "61Ziuz2z7tL",
    "Light Green": "61l4IRqkWwL",
    "Black": "618Dk9PWUzL",
    "Dark Green": "615wcc4Ss7L",
    "Wine Red": "61nvzCG8ICL",
    "Khaki": "61JBipH0zML",
    "Champagne Pink": "61eETIilFxL",
    "Dark Blue": "61AhkPd+8VL",
    "Light Purple": "6154kB8I8wL",
    "Rose Pink": "71RGdPVA5WL",
    "Teal": "61hHSJuJ1xL",
    "Green": "61qfce+74OL"
  },
  "color_images": {
    "Brown": [
      "https://m.media-amazon.com/images/I/61pV1J+WOYL._SL1500_.jpg"
    ],
    "Apricot": [
      "https://m.media-amazon.com/images/I/61Ziuz2z7tL._SL1500_.jpg"
    ],
    "Light Green": [
      "https://m.media-amazon.com/images/I/61l4IRqkWwL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/618Dk9PWUzL._SL1500_.jpg"
    ],
    "Dark Green": [
      "https://m.media-amazon.com/images/I/615wcc4Ss7L._SL1500_.jpg"
    ],
    "Wine Red": [
      "https://m.media-amazon.com/images/I/61nvzCG8ICL._SL1500_.jpg"
    ],
    "Khaki": [
      "https://m.media-amazon.com/images/I/61JBipH0zML._SL1500_.jpg"
    ],
    "Champagne Pink": [
      "https://m.media-amazon.com/images/I/61eETIilFxL._SL1500_.jpg"
    ],
    "Dark Blue": [
      "https://m.media-amazon.com/images/I/61AhkPd+8VL._SL1500_.jpg"
    ],
    "Light Purple": [
      "https://m.media-amazon.com/images/I/6154kB8I8wL._SL1500_.jpg"
    ],
    "Rose Pink": [
      "https://m.media-amazon.com/images/I/71RGdPVA5WL._SL1500_.jpg"
    ],
    "Teal": [
      "https://m.media-amazon.com/images/I/61hHSJuJ1xL._SL1500_.jpg"
    ],
    "Green": [
      "https://m.media-amazon.com/images/I/61qfce+74OL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 117.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/81CtK1yhbfL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-bodycon-maxi",
      "title": "Womens Maxi Dress Long Sleeve Bodycon Maxi",
      "price": 28.49,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/51eR-f9GklL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-ruched-bodycon-sleeveless",
      "title": "Womens Dress Ruched Bodycon Sleeveless",
      "price": 33.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61viMtDU1pL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-maxi-bodycon-long-sleeve-formal-ruched",
      "title": "Womens Maxi Dress Cocktail Maxi Bodycon Long Sleeve Formal Ruched",
      "price": 64.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51rp1FtyHmL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-v-neck",
      "title": "Womens Dress V Neck",
      "price": 35.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71tJExkNLKL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress-formal-evening",
      "title": "Womens Dress Formal Evening",
      "price": 85.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51DBpbbgqCL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 74.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/518KK0bMMZL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 88.49,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61imYyqh0TL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-short-sleeve-bodycon-maxi",
      "title": "Womens Maxi Dress Short Sleeve Bodycon Maxi",
      "price": 19.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/31RG-6bRDnL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-sleeveless-v-neck",
      "title": "Womens Dress Sleeveless V Neck",
      "price": 42.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/81TTbT66ylL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-evening-formal-cocktail",
      "title": "Womens Maxi Dress Maxi Evening Formal Cocktail",
      "price": 43.31,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61xHz823hmL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-long-sleeve",
      "title": "Womens Maxi Dress Maxi Long Sleeve",
      "price": 44.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61bWsxlCkLL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal",
      "title": "Womens Maxi Dress Formal",
      "price": 129.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/81FHR80ISVL._SL1500_.jpg"
      ]
    }
  ]
}