{
  "id": "womens-maxi-dress-maxi-bodycon-long-sleeve-cocktail",
  "handle": "womens-maxi-dress-maxi-bodycon-long-sleeve-cocktail",
  "sku": "JC3212",
  "asin": "B0FGPX2QHK",
  "title": "Womens Maxi Dress Maxi Bodycon Long Sleeve Cocktail",
  "title_original": "ZESICA Women's 2026 Bell Long Sleeve Floral Maxi Dress Fall Fashion Bodycon Mesh Wedding Guest Cocktail Party Dresses",
  "brand": "Visit the ZESICA Store",
  "price": 49.99,
  "social_proof": {
    "bought_past_month": 82,
    "text": "82+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/61tEDUUqynL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61zL5mG2y8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/619h+7n2XRL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61+VVu1LUTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61n5Ucw-KJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81XtKfhWY9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81iSlEtRAlL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71CmmKorHnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61xUBoLGmiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71l4MK30w7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61pdogOr3jL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61wJk4QBdnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71CIREg69hL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71QGNoq9v0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/611TdynADqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61a5BfEfOyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71j6EslQi+L._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/61tEDUUqynL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61zL5mG2y8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/619h+7n2XRL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61+VVu1LUTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61n5Ucw-KJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81XtKfhWY9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81iSlEtRAlL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71CmmKorHnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61xUBoLGmiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71l4MK30w7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61pdogOr3jL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61wJk4QBdnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71CIREg69hL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71QGNoq9v0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/611TdynADqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61a5BfEfOyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71j6EslQi+L._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Product Dimensions ‏": "‎ 1.97 x 0.79 x 0.39 inches; 3.53 ounces",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ July 4, 2025",
    "ASIN ‏": "‎ B0FGQ137BY",
    "Best Sellers Rank": "#20,751 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #85 in Women's Formal Dresses #88 in Women's Club & Night Out Dresses",
    "Customer Reviews": "4.5 4.5 out of 5 stars (129)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Darkgreen",
      "Wine",
      "Brown",
      "Pink",
      "White",
      "Greypink",
      "Darkblue",
      "Rose",
      "Black",
      "Coffee",
      "Redapricot"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.5,
    "count": 129,
    "customers_say": "Customers find the dress fits perfectly and is very comfortable, with one noting it can be worn with both dressy shoes or boots. The fabric quality receives positive feedback, with one customer highlighting the gold velvet leaves on the sheer fabric, and they appreciate its stretchiness and suitability for fall weddings. Customers disagree on the length of the dress. Generated from the text of customer reviews Select to learn more Fit (31) Beauty (21) Quality (18) Comfort (17) Stretchiness (11) Dress fit (7) Fabric quality (7) Length (5) 31 customers mention fit, 29 positive, 2 negative 31 customers mention \"Fit\" 29 positive 2 negative Customers are satisfied with how the dress fits. \" Perfect fit \" Read more \" ...it’s nice and stretchy and very comfortable and fitting ! it just didn’t do it for me \" Read more \" Fits well ... \" Read more \" Fabric is comfortable and stretchy. Love the fit of this dress \" Read more 21 customers mention beauty, 21 positive, 0 negative 21 customers mention \"Beauty\" 21 positive 0 negative Customers find the dress very pretty and love its color. \" Beautiful and elegant. Dress is more beautiful than pictured. Good quality. \" Read more \" This is a beautiful dress . I am 5’2, 130lbs and I ordered a medium. It’s the perfect length. Mine was the brown color. So elegant.... \" Read more \" Beautiful dress for fall . Well made beautiful colors. Fits very well as must have for your fall attire. Very stretchy and comfortable \" Read more \" ...Fitting and sexy . \" Read more 18 customers mention quality, 18 positive, 0 negative 18 customers mention \"Quality\" 18 positive 0 negative Customers find the dress well-made and flawless. \" Nice dress , loved the fabric. A little too form fitting. If I was a tad bit smaller 5’3””, 135 lbs, it would be perfect.... \" Read more \" ...Stretchy and comfortable and good quality . I am 5’4”, 34DD 150 lbs and got a large. So flattering!! Cant believe its from amazon. \" Read more \" Great dress !... \" Read more \" Had a fun RIP to her last name bachelorette party and this dress was PERFECT . Fitting and sexy. \" Read more 17 customers mention comfort, 17 positive, 0 negative 17 customers mention \"Comfort\" 17 positive 0 negative Customers find the dress comfortable. \" I wasn't too crazy about it but everyone lived it, it was comfortable and true to size, I just didn't like the length, it fell right at my ankles, I... \" Read more \" ...it’s nice and stretchy and very comfortable and fitting! it just didn’t do it for me \" Read more \" I never be reviewed for something, but this dress is so comfortable so flattering and the color was more of like a burgundy brown. \" Read more \" Such a comfortable dress . Lots of stretch to it. Very thin mesh fabric. \" Read more 11 customers mention stretchiness, 10 positive, 1 negative 11 customers mention \"Stretchiness\" 10 positive 1 negative Customers appreciate the dress's stretchiness. \" ...Fit perfect. One of my absolute favorite dresses I wore to a wedding. Stretchy and comfortable and good quality.... \" Read more \" ...It was also comfortable and the material was stretchy . \" Read more \" Fits true to size. The dress is tight, but the fabric is stretchy . Ordered this for a fall wedding and it will be the perfect dress! \" Read more \" Such a comfortable dress. Lots of stretch to it . Very thin mesh fabric. \" Read more 7 customers mention dress fit, 7 positive, 0 negative 7 customers mention \"Dress fit\" 7 positive 0 negative Customers find the dress fits well for fall events, with one mentioning it can be dressed up with either dressy shoes or boots. \" This dress was soft and comfortable. It was perfect for a fall wedding which kept me warm. I am 5ft 2in and it fit me just right in length.... \" Read more \" ...Has a great stretch and fit tts! Perfect for a fall or winter wedding . I do wish it was a smidge longer but love it still.... \" Read more \" ...Mine was the brown color. So elegant. You can wear dressy shoes or boots . And let me just say western cowboy boots go with this dress to. \" Read more \" ...Well made beautiful colors. Fits very well as must have for your fall attire . Very stretchy and comfortable \" Read more 7 customers mention fabric quality, 6 positive, 1 negative 7 customers mention \"Fabric quality\" 6 positive 1 negative Customers like the fabric of the dress, with one mentioning the gold velvet leaves on the sheer material and another noting the metallic gold heels. \" Nice dress, loved the fabric . A little too form fitting. If I was a tad bit smaller 5’3””, 135 lbs, it would be perfect.... \" Read more \" ...This fabric is stunning - high quality, stretchy, the bell sleeves are SO pretty!... \" Read more \" Love the dress and the material . True to size. Lenth was great. I'm 5'1 and it fits perfect \" Read more \" ...I love the gold velvet leaves on the sheer fabric . Impaired with metallic gold heels, and a gold clutch purse.... \" Read more 5 customers mention length, 3 positive, 2 negative 5 customers mention \"Length\" 3 positive 2 negative Customers have mixed opinions about the dress's length, with some finding it perfect while others report issues with the sleeves being too short. \" ...I am 5’2, 130lbs and I ordered a medium. It’s the perfect length . Mine was the brown color. So elegant. You can wear dressy shoes or boots.... \" Read more \" ...If you’re shorter this could be cute. The sleeves were also short , but the bell sleeve made it less noticeable. \" Read more \" ...The length is perfect (it hovers right around the ankles) and the bell sleeves are a really pretty additional touch.... \" Read more \" Lining is short ... \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars A favorite in my wardrobe",
        "body": "The color is gorgeous, the quality of the dress is very nice. This dress is flattering and comfortable. The fabric is light weight, a little sheer. I wore a half spanx from waist to knee so it was no problem and smooth. This dress is a good value for the money. I am 5’6” 135 lbs and I ordered a M. The fit was a perfect 6. I love the gold velvet leaves on the sheer fabric. Impaired with metallic gold heels, and a gold clutch purse. Dangle earrings and a large gold bangle bracelet. I’ll love wearing this dress again. Read more",
        "author": "Diane",
        "rating": 5.0,
        "date": "October 22, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71UgZxW4GRL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Perfect Fit and Very Comfortable",
        "body": "This dress is GORGEOUS and fit me LIKE A GLOVE. Actually, I couldn't believe how perfectly it fit me (I typically wear a medium which is what I ordered here- and it is definitely true to size). It is just stretchy enough to give that perfectly tailored-to-your-body appearance without being overly constrictive. The length is perfect (it hovers right around the ankles) and the bell sleeves are a really pretty additional touch. I found the dress to be a bit brighter red in person whereas the photos make it appear more burgundy, but it was still very beautiful and I got several compliments. I wore it to my cousin's wedding and was comfortable all night. Read more",
        "author": "Customer",
        "rating": 5.0,
        "date": "October 17, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Perfect",
        "body": "Had a fun RIP to her last name bachelorette party and this dress was PERFECT. Fitting and sexy. Read more",
        "author": "Jessica",
        "rating": 5.0,
        "date": "December 4, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71He+mTpUaL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars 10/10",
        "body": "This dress is so comfortable. Has a great stretch and fit tts! Perfect for a fall or winter wedding. I do wish it was a smidge longer but love it still. Would purchase again in other colors if needed for an event! Read more",
        "author": "Lauren",
        "rating": 5.0,
        "date": "December 7, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71KY00o+8XL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/81fmYH6lW4L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "4.0 out of 5 stars cute",
        "body": "this was cute, i just didn’t keep it cause i wasn’t huge on the sleeves. it’s nice and stretchy and very comfortable and fitting! it just didn’t do it for me Read more",
        "author": "Meag",
        "rating": 4.0,
        "date": "November 13, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61g5MkOob7L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Amazing",
        "body": "Love the dress and the material. True to size. Lenth was great. I'm 5'1 and it fits perfect Read more",
        "author": "Rebecca Salinas",
        "rating": 5.0,
        "date": "December 9, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Highly recommend this dress!! Perfect for my baby shower, will be perfect for any event!",
        "body": "I could not love this dress more!! I wore this for my baby shower. I really only gained weight in my chest/belly, and am normally a Small so I ordered a Medium and it was perfect for this. This fabric is stunning - high quality, stretchy, the bell sleeves are SO pretty! The color isn't quite as magenta perhaps as in the listing photos, a bit more muted but still a very pretty color. It came super wrinkly from being in the packaging and my steamer doesn't work so I sprayed it heavily with water and threw it in the dryer and that worked pretty well to release a lot of the creases/wrinkles. If I had another formal event in the future where I want a dress with sleeves, I would definitely buy this dress in another color and wear this again! Read more",
        "author": "UAstudentn",
        "rating": 5.0,
        "date": "November 24, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Great dress!",
        "body": "Love this dress so comfortable and fit great Read more",
        "author": "Ann A.",
        "rating": 5.0,
        "date": "December 18, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Maxi Bodycon Long Sleeve Cocktail is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.",
  "about_this_item": "Womens Maxi Dress Maxi Bodycon Long Sleeve Cocktail is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.",
  "long_description": "Womens Maxi Dress Maxi Bodycon Long Sleeve Cocktail is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Darkgreen, Wine, Brown, Pink, White, Greypink, Darkblue, Rose, Black, Coffee, Redapricot. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Maxi Bodycon Long Sleeve Cocktail is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Darkgreen, Wine, Brown, Pink, White, Greypink, Darkblue, Rose, Black, Coffee, Redapricot. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "ca7c3dbf-82d2-4e8c-8c4a-a049200e14eb",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ca7c3dbf-82d2-4e8c-8c4a-a049200e14eb/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ca7c3dbf-82d2-4e8c-8c4a-a049200e14eb/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/67939cc1-7eeb-4564-82f7-b7d34b69e9fd.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "1241d4ea-b195-4ad4-82e5-5b5818963489",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1241d4ea-b195-4ad4-82e5-5b5818963489/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1241d4ea-b195-4ad4-82e5-5b5818963489/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/67939cc1-7eeb-4564-82f7-b7d34b69e9fd.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "1670a0a0-6f6d-4f03-b0ef-95ef64da3cfd",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1670a0a0-6f6d-4f03-b0ef-95ef64da3cfd/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1670a0a0-6f6d-4f03-b0ef-95ef64da3cfd/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/67939cc1-7eeb-4564-82f7-b7d34b69e9fd.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "1a2b8e76-4c99-4e26-8a6c-4d5caad9491c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1a2b8e76-4c99-4e26-8a6c-4d5caad9491c/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1a2b8e76-4c99-4e26-8a6c-4d5caad9491c/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/67939cc1-7eeb-4564-82f7-b7d34b69e9fd.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "e87226ae-4e08-4630-b7b3-75a7c2b1b7be",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e87226ae-4e08-4630-b7b3-75a7c2b1b7be/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e87226ae-4e08-4630-b7b3-75a7c2b1b7be/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/67939cc1-7eeb-4564-82f7-b7d34b69e9fd.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "7ee9b91f-1807-408c-9c78-826b3dcc198c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7ee9b91f-1807-408c-9c78-826b3dcc198c/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7ee9b91f-1807-408c-9c78-826b3dcc198c/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/67939cc1-7eeb-4564-82f7-b7d34b69e9fd.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "a1ba9c60-4d8e-4bc6-9901-e60b6ca65ba0",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a1ba9c60-4d8e-4bc6-9901-e60b6ca65ba0/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a1ba9c60-4d8e-4bc6-9901-e60b6ca65ba0/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/67939cc1-7eeb-4564-82f7-b7d34b69e9fd.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "73a2b7ff-239d-492e-982d-c7f4933c1d3f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/73a2b7ff-239d-492e-982d-c7f4933c1d3f/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/73a2b7ff-239d-492e-982d-c7f4933c1d3f/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/67939cc1-7eeb-4564-82f7-b7d34b69e9fd.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "f872e07c-4033-4512-b22d-4c1e2d86d69c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f872e07c-4033-4512-b22d-4c1e2d86d69c/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f872e07c-4033-4512-b22d-4c1e2d86d69c/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/67939cc1-7eeb-4564-82f7-b7d34b69e9fd.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "ed5267bf-3dec-4155-b93c-99cdbb117183",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ed5267bf-3dec-4155-b93c-99cdbb117183/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ed5267bf-3dec-4155-b93c-99cdbb117183/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/67939cc1-7eeb-4564-82f7-b7d34b69e9fd.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "759e5c96-6ad1-466b-8a78-9d908ae8e20c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/759e5c96-6ad1-466b-8a78-9d908ae8e20c/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/759e5c96-6ad1-466b-8a78-9d908ae8e20c/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/67939cc1-7eeb-4564-82f7-b7d34b69e9fd.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "63f9d99f-d51e-49f2-b656-0cc9b97163fe",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/63f9d99f-d51e-49f2-b656-0cc9b97163fe/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/63f9d99f-d51e-49f2-b656-0cc9b97163fe/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/67939cc1-7eeb-4564-82f7-b7d34b69e9fd.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Darkgreen": "https://m.media-amazon.com/images/I/410BKUSHtRL._AC_SR38,50_.jpg",
    "Wine": "https://m.media-amazon.com/images/I/31fKf3xruFL._AC_SR38,50_.jpg",
    "Brown": "https://m.media-amazon.com/images/I/31GIYzCfPnL._AC_SR38,50_.jpg",
    "Pink": "https://m.media-amazon.com/images/I/31Xr7xaM7bL._AC_SR38,50_.jpg",
    "White": "https://m.media-amazon.com/images/I/31ykepUgDkL._AC_SR38,50_.jpg",
    "Greypink": "https://m.media-amazon.com/images/I/31Jk3W0d-ML._AC_SR38,50_.jpg",
    "Darkblue": "https://m.media-amazon.com/images/I/31pPSFshu6L._AC_SR38,50_.jpg",
    "Rose": "https://m.media-amazon.com/images/I/31qfVNYIlSL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31s7SadoHbL._AC_SR38,50_.jpg",
    "Coffee": "https://m.media-amazon.com/images/I/31rhZFyAcCL._AC_SR38,50_.jpg",
    "Redapricot": "https://m.media-amazon.com/images/I/319kSehiLbL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Darkgreen": "71CmmKorHnL",
    "Wine": "61xUBoLGmiL",
    "Brown": "71l4MK30w7L",
    "Pink": "61pdogOr3jL",
    "White": "61wJk4QBdnL",
    "Greypink": "71CIREg69hL",
    "Darkblue": "71QGNoq9v0L",
    "Rose": "611TdynADqL",
    "Black": "61a5BfEfOyL",
    "Coffee": "61tEDUUqynL",
    "Redapricot": "71j6EslQi+L"
  },
  "color_images": {
    "Darkgreen": [
      "https://m.media-amazon.com/images/I/71CmmKorHnL._SL1500_.jpg"
    ],
    "Wine": [
      "https://m.media-amazon.com/images/I/61xUBoLGmiL._SL1500_.jpg"
    ],
    "Brown": [
      "https://m.media-amazon.com/images/I/71l4MK30w7L._SL1500_.jpg"
    ],
    "Pink": [
      "https://m.media-amazon.com/images/I/61pdogOr3jL._SL1500_.jpg"
    ],
    "White": [
      "https://m.media-amazon.com/images/I/61wJk4QBdnL._SL1500_.jpg"
    ],
    "Greypink": [
      "https://m.media-amazon.com/images/I/71CIREg69hL._SL1500_.jpg"
    ],
    "Darkblue": [
      "https://m.media-amazon.com/images/I/71QGNoq9v0L._SL1500_.jpg"
    ],
    "Rose": [
      "https://m.media-amazon.com/images/I/611TdynADqL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/61a5BfEfOyL._SL1500_.jpg"
    ],
    "Coffee": [
      "https://m.media-amazon.com/images/I/61tEDUUqynL._SL1500_.jpg"
    ],
    "Redapricot": [
      "https://m.media-amazon.com/images/I/71j6EslQi+L._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-formal-maxi",
      "title": "Womens Maxi Dress Formal Maxi",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/7168W1Iu7tL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 35.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/5101Bh4aTFL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-formal-long-sleeve-v-neck",
      "title": "Womens Maxi Dress Cocktail Formal Long Sleeve V Neck",
      "price": 58.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71uH8PBprDL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 45.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/714QFG9ImaL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/61S2PVEELgL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-long-sleeve-bodycon",
      "title": "Womens Maxi Dress Long Sleeve Bodycon",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71vLdkRmE5L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-mermaid",
      "title": "Womens Dress Mermaid",
      "price": 75.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51r-80qaRIL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-off-shoulder",
      "title": "Womens Maxi Dress Off Shoulder",
      "price": 104.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51xZ1r+ZLAL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal",
      "title": "Womens Maxi Dress Formal",
      "price": 101.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/51OHMl5-iZL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-boat-neck",
      "title": "Womens Maxi Dress Boat Neck",
      "price": 39.9,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/61fO6NT+nRS._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-bodycon-short-sleeve",
      "title": "Womens Dress Bodycon Short Sleeve",
      "price": 32.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61gtIg01VrL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-short-sleeve-v-neck",
      "title": "Womens Maxi Dress Short Sleeve V Neck",
      "price": 189.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Wedding Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/713CVG8snAL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 890.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/71WUb74epvL._SL1500_.jpg"
      ]
    }
  ]
}