{
  "id": "womens-dress-one-shoulder-cocktail",
  "handle": "womens-dress-one-shoulder-cocktail",
  "sku": "JC1691",
  "asin": "B09M2YWKG6",
  "title": "Womens Dress One Shoulder Cocktail",
  "title_original": "Jhsnjnr Women's Casual Batwing Sleeve One Shoulder Dresses Summer Club Party Cocktail Dresses",
  "brand": "Visit the Jhsnjnr Store",
  "price": 42.99,
  "social_proof": {
    "bought_past_month": 616,
    "text": "616+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/61wOHRqmGHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Qr519uX7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/616jqlbRLtL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61PYvGEKS7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61DiyhkLj6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61PQyy0-X0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ATx+FAKYL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61YvkekFQWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61iMYxOjaIL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61RwbNK54LL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/714V+1qe9yL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61dfZVyPztL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61x5vwMa7pL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61HN5DDzqQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61+c7tokGSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71wJ0Y61gbL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/61wOHRqmGHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Qr519uX7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/616jqlbRLtL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61PYvGEKS7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61DiyhkLj6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61PQyy0-X0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ATx+FAKYL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61YvkekFQWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61iMYxOjaIL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61RwbNK54LL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/714V+1qe9yL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61dfZVyPztL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61x5vwMa7pL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61HN5DDzqQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61+c7tokGSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71wJ0Y61gbL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ November 17, 2021",
    "ASIN ‏": "‎ B0B6HXXXX1",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#17,025 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #69 in Women's Club & Night Out Dresses",
    "Customer Reviews": "4.1 4.1 out of 5 stars (2,905)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Red",
      "Rose Red",
      "Wine Red",
      "Blue",
      "Purple",
      "Purple Red",
      "Army Green",
      "Hot Pink",
      "Mauve",
      "Black",
      "Navy Blue",
      "Green"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.1,
    "count": 2905,
    "customers_say": "Customers find the dress gorgeous and comfortable, with a perfect fit that's not too tight around the stomach, and one customer notes it falls right above the knee. Moreover, the dress is flattering on multiple body types, effectively hiding extra love around the waist and hips, and one customer mentions it works well with black wedge heels. However, the material quality receives mixed feedback, with some praising its lovely feel while others find it cheap, and opinions about sizing are divided between those who say it's true to size and those who find it runs gigantic. Select to learn more Style Fit Comfort Color Flattering Quality Material quality Size 271 customers mention \"Style\" 259 positive 12 negative Customers love the style of this dress, describing it as gorgeous and a perfect little black dress that makes them feel sexy. \"...It is super comfortable and cute . It does pick easily so be careful with your jewelry. Totally worth the price and I will be wearing it again.\" Read more \"This dress is exactly as promised! It's beautiful and fits great and hangs exactly right! Will purchase a green one for next years party!\" Read more \"Love this dress! It’s simple yet elegant . Perfect material and flows nicely. Love that’s it’s tapered in, so it doesn’t look like a big potato sack!...\" Read more \" Love this dress ! Wore it the night I got engaged and also as a wedding guest for an outdoor wedding. It fits really well. I’m 5’6” about 170 lbs....\" Read more 201 customers mention \"Fit\" 160 positive 41 negative Customers like how the dress fits, particularly noting that it's not too tight around the stomach, and one customer mentions it falls right above the knee. \"...Love the sleek design and one shoulder sleeve. Beautiful color! Great fit with good length. Comfortable fabric to wear. Easy to press out wrinkles.\" Read more \"...But it fit perfectly . I ordered the bright pink. I had to wear a nude color tummy sharper so you could not see through. Color was spot on.\" Read more \"This dress is exactly as promised! It's beautiful and fits great and hangs exactly right! Will purchase a green one for next years party!\" Read more \"...It is form fitting .\" Read more 127 customers mention \"Comfort\" 114 positive 13 negative Customers find the dress comfortable, with one mentioning it is very forgiving. \"This dress is gorgeous and the quality is amazing also comfortable I am 5foot2 and the dress comes to my knees too of my knees that is and I am very...\" Read more \"Loved this dress- great wedding guest outfit, very comfortable and flattering, lots of compliments. The material is stretchy but not clingy....\" Read more \"...I'm 5'1 and 180-190 lb and the extra large was a little big, but comfy . The perfect bra was the one shoulder Athleta sport bra.\" Read more \"The fit of this dress was great. So flattering. So comfortable . I wore this dress to a banquet for business. I got sooooo many compliments....\" Read more 103 customers mention \"Color\" 84 positive 19 negative Customers like the dress's color, particularly the vivid red and dark green shades, with one customer noting that the material is dark enough. \"I got so many compliments on this dress! The color is beautiful . I sized up but it was too big, so I had to use pins to help it fit....\" Read more \"...Love the sleek design and one shoulder sleeve. Beautiful color ! Great fit with good length. Comfortable fabric to wear. Easy to press out wrinkles.\" Read more \"I loved the color . I was expecting a brown instead it was a burnt orange shade. So I change my accent colors to have fun with it....\" Read more \" Great color , fabric and style. I loved it! I bought the M and L, went with the M.\" Read more 99 customers mention \"Flattering\" 81 positive 18 negative Customers find the dress flattering, particularly noting that it works well on curvy bodies and hides extra weight around the waist and hips. \"Loved this dress- great wedding guest outfit, very comfortable and flattering , lots of compliments. The material is stretchy but not clingy....\" Read more \"...I’m a medium, 5’4” and sometimes a large. It is very flattering and comfortable. Could pair with boots and dress it down a bit for a date night....\" Read more \"This dress is sooo cute and fun for a wedding. Its so flattering and i love the one arm. The colors and quality are really nice....\" Read more \"...to wear any kind of Spanx underneath the dress and it still was super flattering on me got a lot of compliments on it definitely would recommend it...\" Read more 94 customers mention \"Quality\" 72 positive 22 negative Customers find the dress to be of great quality, with one customer noting that the seams are sewn very well. \"...I will be ordering at least two more.... this is a great dress , wonderful fabric and exactly as it looks in the picture!!!\" Read more \"...If you have an upcoming wedding or a cruise this is a perfect dress .\" Read more \"This looked like a designer dress! Great quality and well made! So reasonable! -Challice\" Read more \"...of the sleeve is unfinished and you can see a different color and poor quality . DO NOT RECOMMEND would have given a no star if could.\" Read more 94 customers mention \"Material quality\" 62 positive 32 negative Customers have mixed opinions about the dress's material, with some finding it lovely and appreciating its feel, while others describe it as very cheap and note that it's a heavy polyester. \" Nice material - not too thin and irons well. The dress was very comfortable, great for masking rolls.\" Read more \"...style it is completely , 100% sheer Absolutely see through and cheap material . It is best used as a beach cover up. It would work for that....\" Read more \"I am a plus size girl and this dress was a definite score. Great material , true to size and extremely flattering....\" Read more \"I felt comfortable and sexy! This dress was perfect! The material , the way it fit, and the way it made me feel! I love this dress\" Read more 86 customers mention \"Size\" 45 positive 41 negative Customers have mixed experiences with the dress's fit, with some finding it true to size while others report it runs gigantic. \"5'7\" 200# bought XL, true to size , rather flattering actually. Does wrinkle so not exactly packable friendly but will work with it....\" Read more \"...and in some reviews, The dress is a beautiful color, however, runs large ....\" Read more \"This dress is perfect! Runs true to size . Doesn’t wrinkle and is very flattering on.\" Read more \"I wanted to love this dress so much. I bought my size but it runs extremely small . If you have any curves this is not the dress for you.\" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars BUY> THE> DRESS!!!",
        "body": "Absolutely adorable!!! So happy I bought this dress! I'm 5'2\" 109 lbs and the small fit me PERFECT!!! It's a little longer than I would like so I may have it hemmed 2-3\". I'm shorter, so this was to be expected. I could also wear taller heels an the length would be fine... The fabric is soft, light-weight and not see-through. There was no weird smell. The pink is very vibrant and the fit under my right arm is great and not tight at all. I will use a strapless bra or one with one strap. Although this dress is \"roomy & flowy\", it is still very elegant & sexy. Super happy with my purchase and I can't wait to wear it to my Bougie Christmas party where we are all wearing bright pink, orange or red! Read more",
        "author": "Paris Shop Girl",
        "rating": 5.0,
        "date": "November 6, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Christmas Party Dress!",
        "body": "I wore this one-shoulder green dress to a Christmas party, and it was absolutely flattering in every way! The green color is rich and festive, perfect for the holiday season. It stands out without being over-the-top, and I felt so confident in it all night long. The one-shoulder design is sleek and modern, adding just the right amount of elegance. It hugs in all the right places and gives a great shape, while still allowing for comfortable movement. The fabric feels luxurious and has just the right amount of stretch to make it both flattering and comfortable. I received tons of compliments at the party, and I felt like a million bucks. If you’re looking for a chic, flattering dress for any special occasion, especially for a festive event like Christmas, this is definitely the one to go for! Highly recommend! Read more",
        "author": "C. McCay",
        "rating": 5.0,
        "date": "July 14, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Overly large, but cute.",
        "body": "Ordered an XL, typically I’m a solid XL. It’s loose enough, I believe I could have used a large. I don’t have time to try a smaller size. If the other dress coming in doesn’t work, I will likely keep. I would say it runs a little big. I did want something loose, but this is so loose it’s not really flattering. Kinda like a sack, but a pretty sack. The pink is very pretty and bright. It was not wrinkled. The way most dresses are would definitely be comfortable for several hours both dancing and sitting. i’m not wearing an appropriate bra in the picture. It’s a sports bra. I was just trying to see if it fit. I carry all of my weight around my waist, which you can see is completely unnoticeable due to the overly large fit. My event is semi formal. Maybe in black it would look more formal, but we were asked to wear pink. I feel the color makes it look more casual. Read more",
        "author": "DJ",
        "rating": 4.0,
        "date": "May 8, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71KahkH+ITL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/61u7OgUnwvL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Helps me not look fat",
        "body": "I’m at that awkward stage of pregnancy where I’m just fat and wide now with no bump and this falls so perfectly I don’t look fat or pregnant! Lifesaver for the gender reveal and my ego which is used to being skinny. Adorable and can dress up with heels or dress down with sandals or wedges. Not the softest fabric but it’s not see-through, however you can’t wear a bra with it cause of the one sleeve and you’d be able to see the lines in the back Read more",
        "author": "Sarah Abanathie",
        "rating": 5.0,
        "date": "December 15, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Would buy again!!!",
        "body": "Loved this dress and I’m not the dress up girl. It fit amazing and was comfortable! Read more",
        "author": "Lindsey Dover",
        "rating": 5.0,
        "date": "November 28, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Pretty and elegant",
        "body": "Love this dress and the color! I wore this to my friend’s summer wedding. I wasn’t too short or too tight. I bought a Large but usually wear an XL and it fit great. It wasn’t too thin or too thick. It was perfect Read more",
        "author": "Amy",
        "rating": 5.0,
        "date": "November 14, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Colors are not, as shown",
        "body": "My favorite color is pink. But beware. I ordered this purple and got more of a PINK. I LOVE PINK, but I was looking for a purplish this time. It was comfy , and nice. Read more",
        "author": "Steph Long",
        "rating": 3.0,
        "date": "July 7, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71aVQAXex7L._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71TW+6UExhL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "4.0 out of 5 stars Great Dress!",
        "body": "Looks really good! Fabric was better than i had thought it would be, just needs a good pressing and it should be perfect. not too short, not too long. Read more",
        "author": "Katherine Cleaver",
        "rating": 4.0,
        "date": "October 14, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Dress One Shoulder Cocktail is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.",
  "about_this_item": "Womens Dress One Shoulder Cocktail is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.",
  "long_description": "Womens Dress One Shoulder Cocktail is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Red, Rose Red, Wine Red, Blue, Purple, Purple Red, Army Green, Hot Pink, Mauve, Black, Navy Blue, Green. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Dress One Shoulder Cocktail is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Red, Rose Red, Wine Red, Blue, Purple, Purple Red, Army Green, Hot Pink, Mauve, Black, Navy Blue, Green. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "b48fe96a-a05b-4c56-bd72-0157a66d4238",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b48fe96a-a05b-4c56-bd72-0157a66d4238/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b48fe96a-a05b-4c56-bd72-0157a66d4238/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "f421773b-14fa-4019-839f-e3654a142811",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f421773b-14fa-4019-839f-e3654a142811/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f421773b-14fa-4019-839f-e3654a142811/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "8808d996-7a12-4345-9a44-053902f93d77",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8808d996-7a12-4345-9a44-053902f93d77/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8808d996-7a12-4345-9a44-053902f93d77/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "2900aec1-ee95-47a1-981b-08c78a3b9e85",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2900aec1-ee95-47a1-981b-08c78a3b9e85/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2900aec1-ee95-47a1-981b-08c78a3b9e85/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "f7f9ea45-96d6-4df2-9a91-417e7ff43f55",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f7f9ea45-96d6-4df2-9a91-417e7ff43f55/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f7f9ea45-96d6-4df2-9a91-417e7ff43f55/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "b2f4c202-7497-4d75-a1db-d9abaa53c582",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b2f4c202-7497-4d75-a1db-d9abaa53c582/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b2f4c202-7497-4d75-a1db-d9abaa53c582/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "b9a6dec8-48d1-4a1a-ab03-dac8d77e0258",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b9a6dec8-48d1-4a1a-ab03-dac8d77e0258/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b9a6dec8-48d1-4a1a-ab03-dac8d77e0258/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "37836882-f5cf-4cd2-9b9c-9883277907da",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/37836882-f5cf-4cd2-9b9c-9883277907da/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/37836882-f5cf-4cd2-9b9c-9883277907da/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "cf1fc275-f03d-4ce0-8998-db87fdb501a8",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/cf1fc275-f03d-4ce0-8998-db87fdb501a8/embedded.cc.default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/cf1fc275-f03d-4ce0-8998-db87fdb501a8/embedded.cc.default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "696e1565-877b-4523-bb55-3eba2ac84977",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/696e1565-877b-4523-bb55-3eba2ac84977/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/696e1565-877b-4523-bb55-3eba2ac84977/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "62a38e69-182b-406e-b265-9a429d0ff8d4",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/62a38e69-182b-406e-b265-9a429d0ff8d4/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/62a38e69-182b-406e-b265-9a429d0ff8d4/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "a6b1fcd2-e493-4cc9-9cdc-4cea2abcb165",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a6b1fcd2-e493-4cc9-9cdc-4cea2abcb165/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a6b1fcd2-e493-4cc9-9cdc-4cea2abcb165/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Red": "https://m.media-amazon.com/images/I/31dGW9zoEnL._AC_SR38,50_.jpg",
    "Rose Red": "https://m.media-amazon.com/images/I/316AWot+NmL._AC_SR38,50_.jpg",
    "Wine Red": "https://m.media-amazon.com/images/I/31hOTzqmf9L._AC_SR38,50_.jpg",
    "Blue": "https://m.media-amazon.com/images/I/31L1pnyeBcL._AC_SR38,50_.jpg",
    "Purple": "https://m.media-amazon.com/images/I/31UGKLohTwL._AC_SR38,50_.jpg",
    "Purple Red": "https://m.media-amazon.com/images/I/31G0DoDWEXL._AC_SR38,50_.jpg",
    "Army Green": "https://m.media-amazon.com/images/I/31K-HHiOxBL._AC_SR38,50_.jpg",
    "Hot Pink": "https://m.media-amazon.com/images/I/413YzFZz0kL._AC_SR38,50_.jpg",
    "Mauve": "https://m.media-amazon.com/images/I/31r2qoZynXL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31ADIEdjUML._AC_SR38,50_.jpg",
    "Navy Blue": "https://m.media-amazon.com/images/I/31T+SG2MkfL._AC_SR38,50_.jpg",
    "Green": "https://m.media-amazon.com/images/I/31FpR7GhNkL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Red": "61PQyy0-X0L",
    "Rose Red": "61ATx+FAKYL",
    "Wine Red": "61YvkekFQWL",
    "Blue": "61iMYxOjaIL",
    "Purple": "61RwbNK54LL",
    "Purple Red": "714V+1qe9yL",
    "Army Green": "61dfZVyPztL",
    "Hot Pink": "61x5vwMa7pL",
    "Mauve": "61HN5DDzqQL",
    "Black": "61wOHRqmGHL",
    "Navy Blue": "61+c7tokGSL",
    "Green": "71wJ0Y61gbL"
  },
  "color_images": {
    "Red": [
      "https://m.media-amazon.com/images/I/61PQyy0-X0L._SL1500_.jpg"
    ],
    "Rose Red": [
      "https://m.media-amazon.com/images/I/61ATx+FAKYL._SL1500_.jpg"
    ],
    "Wine Red": [
      "https://m.media-amazon.com/images/I/61YvkekFQWL._SL1500_.jpg"
    ],
    "Blue": [
      "https://m.media-amazon.com/images/I/61iMYxOjaIL._SL1500_.jpg"
    ],
    "Purple": [
      "https://m.media-amazon.com/images/I/61RwbNK54LL._SL1500_.jpg"
    ],
    "Purple Red": [
      "https://m.media-amazon.com/images/I/714V+1qe9yL._SL1500_.jpg"
    ],
    "Army Green": [
      "https://m.media-amazon.com/images/I/61dfZVyPztL._SL1500_.jpg"
    ],
    "Hot Pink": [
      "https://m.media-amazon.com/images/I/61x5vwMa7pL._SL1500_.jpg"
    ],
    "Mauve": [
      "https://m.media-amazon.com/images/I/61HN5DDzqQL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/61wOHRqmGHL._SL1500_.jpg"
    ],
    "Navy Blue": [
      "https://m.media-amazon.com/images/I/61+c7tokGSL._SL1500_.jpg"
    ],
    "Green": [
      "https://m.media-amazon.com/images/I/71wJ0Y61gbL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress-evening-cocktail",
      "title": "Womens Dress Evening Cocktail",
      "price": 29.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/71LVQRkZKwL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-v-neck-cocktail-long-sleeve",
      "title": "Womens Maxi Dress V Neck Cocktail Long Sleeve",
      "price": 42.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71rt9J0Y2tL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 389.55,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/717dKlwUK-L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-v-neck",
      "title": "Womens Dress V Neck",
      "price": 27.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/61wFmGU6SWL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-long-sleeve-maxi",
      "title": "Womens Maxi Dress Cocktail Long Sleeve Maxi",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/615VfveT48L._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 94.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61sV5HSZGdL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-bodycon-cocktail-formal",
      "title": "Womens Maxi Dress Long Sleeve Bodycon Cocktail Formal",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Work",
      "images": [
        "https://m.media-amazon.com/images/I/51ns452SdoL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-formal-one-shoulder",
      "title": "Womens Maxi Dress Evening Formal One Shoulder",
      "price": 69.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/619Po5TvLvL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 54.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71ES22A0NiL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-bodycon",
      "title": "Womens Dress Bodycon",
      "price": 31.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61-R+VVwxQL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-evening-formal",
      "title": "Womens Maxi Dress Long Sleeve Evening Formal",
      "price": 68.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51K3TFqJnBL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-long-sleeve",
      "title": "Womens Maxi Dress Bodycon Long Sleeve",
      "price": 45.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61me9w-IkoL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 43.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/6135E3haINL._SL1500_.jpg"
      ]
    }
  ]
}