{
  "id": "womens-maxi-dress-formal-evening-bodycon-short-sleeve",
  "handle": "womens-maxi-dress-formal-evening-bodycon-short-sleeve",
  "sku": "JC1346",
  "asin": "B0BB38PBH2",
  "title": "Womens Maxi Dress Formal Evening Bodycon Short Sleeve",
  "title_original": "Cololura Elegant Women Sequin Short Sleeve Tassel Bodycon Midi Dress Party Evening Gown Formal Dress",
  "brand": "Visit the Cololura Store",
  "price": 63.99,
  "social_proof": {
    "bought_past_month": 515,
    "text": "515+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/61whKp-35lL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/613NDpTs8zL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61bWxwwvvoL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51nGas4ElOL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/A15GYyeVHzL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/A1hG9pD-ruL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/A16LJzY013L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61asveoakDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71LvBO4tcnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61OWTTGHl-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71c91lhU-9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71YtJtumJ1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61cgJJOPOTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61KidYYsgjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61uS0iLtJhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61DuYgN-XYL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61rFdTK5upL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51UGF7N2mSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61MWFFPn6QL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71H2PlFQU7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/712MuA0MKOL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/618jqD0-C0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/612Ish5aYCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61aNmlpXldL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61FMJh-XEfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71qzDmI+l8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/616w2BAhSrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71i+HFAGqlL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/710MdnuKrrL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/61whKp-35lL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/613NDpTs8zL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61bWxwwvvoL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51nGas4ElOL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/A15GYyeVHzL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/A1hG9pD-ruL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/A16LJzY013L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61asveoakDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71LvBO4tcnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61OWTTGHl-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71c91lhU-9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71YtJtumJ1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61cgJJOPOTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61KidYYsgjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61uS0iLtJhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61DuYgN-XYL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61rFdTK5upL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51UGF7N2mSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61MWFFPn6QL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71H2PlFQU7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/712MuA0MKOL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/618jqD0-C0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/612Ish5aYCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61aNmlpXldL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61FMJh-XEfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71qzDmI+l8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/616w2BAhSrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71i+HFAGqlL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/710MdnuKrrL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Item model number ‏": "‎ 20057",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ August 18, 2022",
    "Manufacturer ‏": "‎ Cololura",
    "ASIN ‏": "‎ B0BB3CFLQ9",
    "Best Sellers Rank": "#15,731 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #146 in Women's Club & Night Out Dresses",
    "Customer Reviews": "4.3 4.3 out of 5 stars (1,556)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Purple-ss",
      "Blackgold-3",
      "Blue",
      "Black-2",
      "Black-silver Cold Shoulder",
      "Red Short Sleeve",
      "Purple Short Sleeve",
      "Black",
      "Red",
      "White Short Sleeve-2",
      "Blue Short Sleeve",
      "Black Short Sleeve",
      "White",
      "Green Cold Shoulder",
      "Black Cold Shoulder",
      "Blue-ss",
      "Purple",
      "Red-ss",
      "Black-ss",
      "White-2",
      "Black-gold Cold Shoulder",
      "Black-sj",
      "Black Short Sleeve-2"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.3,
    "count": 1556,
    "customers_say": "Customers find the dress fits true to size and appreciate its elegant design with shiny sequins. The dress receives positive feedback for its quality, color accuracy, comfort, and stretchability, making it suitable for formal events including Mardi Gras-themed parties and milestone birthday celebrations. However, several customers report issues with sequins falling off the dress. Generated from the text of customer reviews Select to learn more Fit (201) Elegance (180) Quality (130) Color accuracy (40) Comfort (33) Dress fit (29) Stretchability (25) Sequins fall off (38) 201 customers mention fit, 151 positive, 50 negative 201 customers mention \"Fit\" 151 positive 50 negative Customers are satisfied with how the dress fits, noting that the size is perfect and one customer mentions it accommodates all body curves. \" ...It does have some stretch to it but mostly True to Size ! Do not walk….Runnnnn and get this dress!! Will be ordering the other colors! \" Read more \" Party dress of Black Tie themed event. Great fit and Received lots compliments, Honestly 1 time use dress and donated the dress but for the price,... \" Read more \" The dress is beautiful and fits well ! It was a little tight around my legs when sitting down but it was comfortable and gorgeous!!!!... \" Read more \" Very nice dress, rich color. wonderful for evening wear but not true to size . I'm a size 16 I ordered an XL and XXL and both was too small.... \" Read more 180 customers mention elegance, 175 positive, 5 negative 180 customers mention \"Elegance\" 175 positive 5 negative Customers find the dress elegant, praising its shiny sparkle and design, with one customer noting it looks youthful and another mentioning it's not frumpy. \" Beautiful dress , well made, quality material. It fits to size well. Just as beautiful on me as it shows on the model. It’s flows well when you walk.... \" Read more \" The dress is beautiful and fits well! It was a little tight around my legs when sitting down but it was comfortable and gorgeous!!!!... \" Read more \" The dress is beautiful !! I ordered it in black to wear to a gala. I received several compliments and I was even asked where I purchased it from.... \" Read more \" ...It was absolutely perfect— elegant and glitzy but comfortable and warm.... \" Read more 130 customers mention quality, 116 positive, 14 negative 130 customers mention \"Quality\" 116 positive 14 negative Customers find the dress beautiful and of good quality. \" Great dress . Will buy the black one too. Runs true to size. \" Read more \" Beautiful dress, well made , quality material. It fits to size well. Just as beautiful on me as it shows on the model. It’s flows well when you walk.... \" Read more \" ...The material used to make the dress is good quality , the length was perfect medium length, the fringes were fringing!... \" Read more \" Nice dress , but after I tried it out n my neck broke out in a rash \" Read more 40 customers mention color accuracy, 28 positive, 12 negative 40 customers mention \"Color accuracy\" 28 positive 12 negative Customers are satisfied with the dress's color accuracy. \" Pretty Royal blue dress . Returning due to sequins unraveling out the bag.... \" Read more \" Beautiful color , very nice on body. Teturned because bought XL which is big for 5’7 and 168 lb \" Read more \" ...Love it. Not true to color . I ordered red but the red was more burgundy in person so I wore burgundy shoes. \" Read more \" Show stopper!! Comfortable fit and rich color . Sophisticated and sexy rolled in one. I may have lost a couple strings however, nothing noticeable.... \" Read more 33 customers mention comfort, 32 positive, 1 negative 33 customers mention \"Comfort\" 32 positive 1 negative Customers find the dress comfortable. \" Wore for a foxtrot dance showcase to 40s-style big band music, comfortable , covers well for full figure but not frumpy and no special bra drama.... \" Read more \" ...It’s true to size, color accuracy is on point. It’s very comfortable and has some starchiness to it. I love the style and got compliments all night. \" Read more \" ...I just have to take the arms in. The material is very comfortable , not itchy at all.... \" Read more \" ...The dress fitted just as I expected (perfect fit) and I felt comfortable wearing it . It made me look youthful, trendy and attractive. \" Read more 29 customers mention dress fit, 29 positive, 0 negative 29 customers mention \"Dress fit\" 29 positive 0 negative Customers find the dress suitable for formal events and Mardi Gras-themed parties, with one mentioning it's great for cocktail parties. \" Loved this dress I wore to a Mardi Gras ball! It was super fun and sexy while covering my arms and hitting below the knee! \" Read more \" ...The sequins and tassels were eye catchers and made this the perfect special occasion dress .... \" Read more \" Perfect dress for special occasions !! \" Read more \" ...For that very special occasion , this is the dress you want to step in the room wearing. \" Read more 25 customers mention stretchability, 22 positive, 3 negative 25 customers mention \"Stretchability\" 22 positive 3 negative Customers appreciate the dress's stretchy fabric, with one mentioning it allows for free movement. \" This dress, is classy and sexy. It's stretchy , with room for those on the top end of their size chart. \" Read more \" ... Dress stretches but holds the body nicely, the sequins and tassel gave it the extra flair I was looking for.... \" Read more \" ...The large fits perfectly! The dress has a little stretch . The only things I don't like is the sequin fall off easily.... \" Read more \" I needed a last-minute dress for an event, and this was perfect. It has stretch , I probably could've gotten a large, but since I'm heavier in my... \" Read more 38 customers mention sequins fall off, 3 positive, 35 negative 38 customers mention \"Sequins fall off\" 3 positive 35 negative Customers report issues with the dress's sequins falling off and the dress falling apart. \" ...A few sequins fell off before the end of the night but it wasn't noticable. No need for a slip as it provided good coverage.... \" Read more \" Wore dress to gala. Lots of compliments! Some of the sequins did fall off the reason I gave four stars. \" Read more \" Beautiful dress but falling apart before I can even try it on \" Read more \" ...I’d give it 5 stars, but the sequins started falling off . \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Gorgeous dress",
        "body": "Beautiful dress and excellent quality. The fabric is a bit stretchy, and very comfortable. The fit was perfect. I love the midi length below my knees. It’s a stunning dress. Read more",
        "author": "Susan Grube",
        "rating": 5.0,
        "date": "November 1, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Great Quality and Fit",
        "body": "Definitely Elegant and Sassy Read more",
        "author": "Dr. Sherry",
        "rating": 5.0,
        "date": "December 10, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Beautiful, Colorful and Sexy at a great Price!",
        "body": "I love, love, love my dress. I will be wearing it at my next royal blue event. It fits perfectly. The dress was true to size. I received many compliments walking to the event from individuals. Even while standing at a crosswalk from people in their cars. The quality and price of the dress is of great value. The dress was as pictured on the site. I only lost one fringe off of the dress. Read more",
        "author": "Sharon",
        "rating": 5.0,
        "date": "September 30, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Gorgeous Dress",
        "body": "This Dress looks expensive! Hugs in all the right places. I am 5’10 and weigh 164 fits perfect. I wore it for the first time last night, and what I don’t like about it is the long sleeves snag the sequins on the dress. My arm would get attached to the sequins and pull on both pieces, i’m gonna go ahead and return it and probably go with a short sleeve version of this because the dress is super flattering Read more",
        "author": "Jody",
        "rating": 4.0,
        "date": "December 3, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/51YgpNd1PRL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Christmas party hit!!",
        "body": "Absolutely love this dress! I sized down and it was the perfect choice. I normally wear a large, but the medium fit beautifully thanks to the stretch. Super flattering and comfortable. For reference, I’m 5'7\" and 162 lbs. Read more",
        "author": "Narrie",
        "rating": 5.0,
        "date": "December 13, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71bt4UgvRNL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars HEAVY!",
        "body": "This is a beautiful dress, it runs a little large, it's heavy and appears darker than the photo! Read more",
        "author": "BamaBling",
        "rating": 5.0,
        "date": "December 5, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Not the color of the picture",
        "body": "Dress is beautiful and well made. I would give it five stars but for the color. The dress was supposed to be red. The picture shows it as a vibrant red color but it is not. The color I received was actually a reddish brown. Other than that it is a wonderful dress for the price just dissatisfied with the color difference from the picture. Read more",
        "author": "Kindle Customer",
        "rating": 3.0,
        "date": "November 25, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Lovely Dress",
        "body": "This dress was true to size. I received so many compliments on it. I will definitely be ordering in other colors Read more",
        "author": "Ebony Reid",
        "rating": 5.0,
        "date": "December 23, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Formal Evening Bodycon Short Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.",
  "about_this_item": "Womens Maxi Dress Formal Evening Bodycon Short Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.",
  "long_description": "Womens Maxi Dress Formal Evening Bodycon Short Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Purple-ss, Blackgold-3, Blue, Black-2, Black-silver Cold Shoulder, Red Short Sleeve, Purple Short Sleeve, Black, Red, White Short Sleeve-2, Blue Short Sleeve, Black Short Sleeve, White, Green Cold Shoulder. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Formal Evening Bodycon Short Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Purple-ss, Blackgold-3, Blue, Black-2, Black-silver Cold Shoulder, Red Short Sleeve, Purple Short Sleeve, Black, Red, White Short Sleeve-2, Blue Short Sleeve, Black Short Sleeve, White, Green Cold Shoulder. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "3fd87968-2f7d-4766-86e1-96fac4ba7801",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3fd87968-2f7d-4766-86e1-96fac4ba7801/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3fd87968-2f7d-4766-86e1-96fac4ba7801/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/ac0cb415-2962-488c-84a5-014808b7d683.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "e6546038-a72b-4d7b-8b51-c97bac6486a3",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e6546038-a72b-4d7b-8b51-c97bac6486a3/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e6546038-a72b-4d7b-8b51-c97bac6486a3/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/ac0cb415-2962-488c-84a5-014808b7d683.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "556e851c-52c8-4bd7-848d-2899d93adfe7",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/556e851c-52c8-4bd7-848d-2899d93adfe7/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/556e851c-52c8-4bd7-848d-2899d93adfe7/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/ac0cb415-2962-488c-84a5-014808b7d683.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "48037a4a-2167-4a68-8c16-cfadb7918b79",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/48037a4a-2167-4a68-8c16-cfadb7918b79/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/48037a4a-2167-4a68-8c16-cfadb7918b79/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/ac0cb415-2962-488c-84a5-014808b7d683.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "3968171c-5684-41f0-bebf-493bb0bd8a38",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3968171c-5684-41f0-bebf-493bb0bd8a38/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3968171c-5684-41f0-bebf-493bb0bd8a38/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/ac0cb415-2962-488c-84a5-014808b7d683.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "9dd13a10-d87d-4e5a-bd9c-10eb5814c726",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9dd13a10-d87d-4e5a-bd9c-10eb5814c726/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9dd13a10-d87d-4e5a-bd9c-10eb5814c726/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/ac0cb415-2962-488c-84a5-014808b7d683.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "6f7ed9d3-37f2-4445-8d4c-339d9b3114cc",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6f7ed9d3-37f2-4445-8d4c-339d9b3114cc/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6f7ed9d3-37f2-4445-8d4c-339d9b3114cc/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/ac0cb415-2962-488c-84a5-014808b7d683.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "d3e35234-5cc5-4be5-bc8d-624bd1df6eb2",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d3e35234-5cc5-4be5-bc8d-624bd1df6eb2/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d3e35234-5cc5-4be5-bc8d-624bd1df6eb2/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/ac0cb415-2962-488c-84a5-014808b7d683.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Purple-ss": "https://m.media-amazon.com/images/I/41dvj2f85SL._AC_SR38,50_.jpg",
    "Blackgold-3": "https://m.media-amazon.com/images/I/41oPle3aDnL._AC_SR38,50_.jpg",
    "Blue": "https://m.media-amazon.com/images/I/41UfGD2pCdL._AC_SR38,50_.jpg",
    "Black-2": "https://m.media-amazon.com/images/I/41tgLnOVDgL._AC_SR38,50_.jpg",
    "Black-silver Cold Shoulder": "https://m.media-amazon.com/images/I/41ckG1yIOaL._AC_SR38,50_.jpg",
    "Red Short Sleeve": "https://m.media-amazon.com/images/I/41pKUBMyvML._AC_SR38,50_.jpg",
    "Purple Short Sleeve": "https://m.media-amazon.com/images/I/41VkW0IzRBL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/41Ef3Os03SL._AC_SR38,50_.jpg",
    "Red": "https://m.media-amazon.com/images/I/41xhGTiCHvL._AC_SR38,50_.jpg",
    "White Short Sleeve-2": "https://m.media-amazon.com/images/I/31Ybgox4CqL._AC_SR38,50_.jpg",
    "Blue Short Sleeve": "https://m.media-amazon.com/images/I/41ftJpje26L._AC_SR38,50_.jpg",
    "Black Short Sleeve": "https://m.media-amazon.com/images/I/51UGF7N2mSL._AC_SR38,50_.jpg",
    "White": "https://m.media-amazon.com/images/I/31LlT0TzikL._AC_SR38,50_.jpg",
    "Green Cold Shoulder": "https://m.media-amazon.com/images/I/416fcc4yJhL._AC_SR38,50_.jpg",
    "Black Cold Shoulder": "https://m.media-amazon.com/images/I/41SV7jnkLaL._AC_SR38,50_.jpg",
    "Blue-ss": "https://m.media-amazon.com/images/I/41QrC7vgxkL._AC_SR38,50_.jpg",
    "Purple": "https://m.media-amazon.com/images/I/41LSDgMYHCL._AC_SR38,50_.jpg",
    "Red-ss": "https://m.media-amazon.com/images/I/41fzxycAbHL._AC_SR38,50_.jpg",
    "Black-ss": "https://m.media-amazon.com/images/I/41b4-3YbPbL._AC_SR38,50_.jpg",
    "White-2": "https://m.media-amazon.com/images/I/31sxfREJwrL._AC_SR38,50_.jpg",
    "Black-gold Cold Shoulder": "https://m.media-amazon.com/images/I/41Gu5+cT-kL._AC_SR38,50_.jpg",
    "Black-sj": "https://m.media-amazon.com/images/I/31sJ4X-5RiL._AC_SR38,50_.jpg",
    "Black Short Sleeve-2": "https://m.media-amazon.com/images/I/31kxUR4TbXL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Purple-ss": "61asveoakDL",
    "Blackgold-3": "71LvBO4tcnL",
    "Blue": "61OWTTGHl-L",
    "Black-2": "71c91lhU-9L",
    "Black-silver Cold Shoulder": "71YtJtumJ1L",
    "Red Short Sleeve": "61cgJJOPOTL",
    "Purple Short Sleeve": "61KidYYsgjL",
    "Black": "61whKp-35lL",
    "Red": "61uS0iLtJhL",
    "White Short Sleeve-2": "61DuYgN-XYL",
    "Blue Short Sleeve": "61rFdTK5upL",
    "Black Short Sleeve": "51UGF7N2mSL",
    "White": "61MWFFPn6QL",
    "Green Cold Shoulder": "71H2PlFQU7L",
    "Black Cold Shoulder": "712MuA0MKOL",
    "Blue-ss": "618jqD0-C0L",
    "Purple": "612Ish5aYCL",
    "Red-ss": "61aNmlpXldL",
    "Black-ss": "61FMJh-XEfL",
    "White-2": "71qzDmI+l8L",
    "Black-gold Cold Shoulder": "616w2BAhSrL",
    "Black-sj": "71i+HFAGqlL",
    "Black Short Sleeve-2": "710MdnuKrrL"
  },
  "color_images": {
    "Purple-ss": [
      "https://m.media-amazon.com/images/I/61asveoakDL._SL1500_.jpg"
    ],
    "Blackgold-3": [
      "https://m.media-amazon.com/images/I/71LvBO4tcnL._SL1500_.jpg"
    ],
    "Blue": [
      "https://m.media-amazon.com/images/I/61OWTTGHl-L._SL1500_.jpg"
    ],
    "Black-2": [
      "https://m.media-amazon.com/images/I/71c91lhU-9L._SL1500_.jpg"
    ],
    "Black-silver Cold Shoulder": [
      "https://m.media-amazon.com/images/I/71YtJtumJ1L._SL1500_.jpg"
    ],
    "Red Short Sleeve": [
      "https://m.media-amazon.com/images/I/61cgJJOPOTL._SL1500_.jpg"
    ],
    "Purple Short Sleeve": [
      "https://m.media-amazon.com/images/I/61KidYYsgjL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/61whKp-35lL._SL1500_.jpg"
    ],
    "Red": [
      "https://m.media-amazon.com/images/I/61uS0iLtJhL._SL1500_.jpg"
    ],
    "White Short Sleeve-2": [
      "https://m.media-amazon.com/images/I/61DuYgN-XYL._SL1500_.jpg"
    ],
    "Blue Short Sleeve": [
      "https://m.media-amazon.com/images/I/61rFdTK5upL._SL1500_.jpg"
    ],
    "Black Short Sleeve": [
      "https://m.media-amazon.com/images/I/51UGF7N2mSL._SL1500_.jpg"
    ],
    "White": [
      "https://m.media-amazon.com/images/I/61MWFFPn6QL._SL1500_.jpg"
    ],
    "Green Cold Shoulder": [
      "https://m.media-amazon.com/images/I/71H2PlFQU7L._SL1500_.jpg"
    ],
    "Black Cold Shoulder": [
      "https://m.media-amazon.com/images/I/712MuA0MKOL._SL1500_.jpg"
    ],
    "Blue-ss": [
      "https://m.media-amazon.com/images/I/618jqD0-C0L._SL1500_.jpg"
    ],
    "Purple": [
      "https://m.media-amazon.com/images/I/612Ish5aYCL._SL1500_.jpg"
    ],
    "Red-ss": [
      "https://m.media-amazon.com/images/I/61aNmlpXldL._SL1500_.jpg"
    ],
    "Black-ss": [
      "https://m.media-amazon.com/images/I/61FMJh-XEfL._SL1500_.jpg"
    ],
    "White-2": [
      "https://m.media-amazon.com/images/I/71qzDmI+l8L._SL1500_.jpg"
    ],
    "Black-gold Cold Shoulder": [
      "https://m.media-amazon.com/images/I/616w2BAhSrL._SL1500_.jpg"
    ],
    "Black-sj": [
      "https://m.media-amazon.com/images/I/71i+HFAGqlL._SL1500_.jpg"
    ],
    "Black Short Sleeve-2": [
      "https://m.media-amazon.com/images/I/710MdnuKrrL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 55.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71wo03JYuhL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-ruched-maxi",
      "title": "Womens Maxi Dress Ruched Maxi",
      "price": 74.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51eyqjEoqOL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-v-neck",
      "title": "Womens Maxi Dress Long Sleeve V Neck",
      "price": 39.89,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71uQhlXCKlL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-sleeveless-bodycon-cocktail-ruched",
      "title": "Womens Maxi Dress Formal Sleeveless Bodycon Cocktail Ruched",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61QKbSfRhtL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 27.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71QbTdkdU3L._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress-short-sleeve",
      "title": "Womens Dress Short Sleeve",
      "price": 76.3,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71iq5FZR-4L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-formal",
      "title": "Womens Dress Formal",
      "price": 69.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51vneqmjy1L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-sleeveless",
      "title": "Womens Dress Sleeveless",
      "price": 129.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71xFoTa7vML._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-off-shoulder",
      "title": "Womens Maxi Dress Bodycon Off Shoulder",
      "price": 36.58,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61i+LxuHS4L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-v-neck",
      "title": "Womens Dress V Neck",
      "price": 74.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/71sjrnvSPbL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 495.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/71OpIsEnxNL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-v-neck",
      "title": "Womens Maxi Dress Formal V Neck",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51cMfA7Z9XL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 36.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71We0qM+KKL._SL1500_.jpg"
      ]
    }
  ]
}