{
  "id": "womens-maxi-dress-off-shoulder-long-sleeve-ruched-cocktail-bodycon",
  "handle": "womens-maxi-dress-off-shoulder-long-sleeve-ruched-cocktail-bodycon",
  "sku": "JC1790",
  "asin": "B0CF8CLJ2C",
  "title": "Womens Maxi Dress Off Shoulder Long Sleeve Ruched Cocktail Bodycon",
  "title_original": "LAGSHIAN Women Sexy Off Shoulder Long Sleeve Bodycon Ruched Midi Elegant Cocktail Party Dress",
  "brand": "Visit the LAGSHIAN Store",
  "price": 41.99,
  "social_proof": {
    "bought_past_month": 1847,
    "text": "1847+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/51GYCMCG9oL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61qSJbVZTuL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61KQ11JKrNL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61LbhXgXKsL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61VwkT7D70L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/614j3LTYiSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41oO9HR1CwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61bZSaNgTgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61IxqS8WrZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61n7PayWj+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61McAaVUpvL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61MOc0sfvBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/619X2ro8F-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51hxCUklwlL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61fWtoBE0kL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61dhlGzlezL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61WqrITkQhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61iWMQT5kfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Y7RpYPDkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41jWflq0mfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61To8KtVPrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61mHhUvoL1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61cZS1GRyBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/619iW4sES+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51buYFPSLNL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/51GYCMCG9oL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61qSJbVZTuL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61KQ11JKrNL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61LbhXgXKsL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61VwkT7D70L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/614j3LTYiSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41oO9HR1CwL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61bZSaNgTgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61IxqS8WrZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61n7PayWj+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61McAaVUpvL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61MOc0sfvBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/619X2ro8F-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51hxCUklwlL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61fWtoBE0kL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61dhlGzlezL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61WqrITkQhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61iWMQT5kfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Y7RpYPDkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41jWflq0mfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61To8KtVPrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61mHhUvoL1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61cZS1GRyBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/619iW4sES+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51buYFPSLNL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Item model number ‏": "‎ LA256",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ August 10, 2023",
    "ASIN ‏": "‎ B0CF8GVYY7",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#58,947 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #313 in Women's Club & Night Out Dresses",
    "Customer Reviews": "4.5 4.5 out of 5 stars (423)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Red",
      "White",
      "Royalblue",
      "Black"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.5,
    "count": 423,
    "customers_say": "Customers find the dress fits nicely and is comfortable, with one noting it doesn't irritate the skin. The material is stretchy and flattering, hugging curves in all the right places, and one customer mentions it helps hold everything in. They appreciate its appearance, with one noting it looks more expensive than its price, and one mentioning it's perfect for semi-formal or formal events. Select to learn more Fit Looks Quality Material quality Comfort Flattering Stretchiness Color 64 customers mention \"Fit\" 57 positive 7 negative Customers like how the dress fits, with one mentioning it's not restrictive. \"Great dress. Great fit . Spandex where you need it.\" Read more \"...It fits like a glove and I received many compliments! I loved it so much I ordered it in black too!\" Read more \"I loved the fit and it was so comfortable! I’m buying it in red for Valentines!\" Read more \"Amazing fit and material! Highly recommend this. It fits great and looks incredible on!\" Read more 46 customers mention \"Looks\" 45 positive 1 negative Customers find the dress gorgeous and sexy, with one mentioning it looks more expensive than its price. \"This item is cute but smelled despicable. It smelled of rotten eggs and musty. You should vet your products before sending them out to customers.\" Read more \" Beautiful dress , fold down part over shoulder kept rolling up, but over all it’s a nice dress....\" Read more \"This dress is very sexy . I got so many compliments\" Read more \" Gorgeous dress !! I received so many compliments! Very good quality! Worth the money! I will be purchasing in a different color....\" Read more 34 customers mention \"Quality\" 33 positive 1 negative Customers find the dress to be of great quality, with one mentioning it's perfect for semi formal or formal events. \"...If you are looking for an elegant, affordable and great quality this is the dress to buy. Received several compliments at the wedding too....\" Read more \" Great dress and loved the fit. I’m 5’8 and the length was nice. True to size.\" Read more \" Love this dress . Wore it for a wedding in the winter and it was perfect. Fit great. I’m 5’7” and 150lbs.\" Read more \"Yes to this dress! It is fabulous ! I can wear it for a variety of occasions.\" Read more 25 customers mention \"Material quality\" 22 positive 3 negative Customers like the material of the dress, though some note it is thin. One customer mentions it helps to hold everything in, while another says it hides their Fupa. \"...She loved the dress, the material , the way she felt in the dress! She receives so many compliments when she wears it.\" Read more \"Beautiful slimming dress. Is material is flattering \" Read more \"...The color is very vivid and the material of the dress is high quality . I am so happy with the dress I have ordered me the red one too.\" Read more \" Fabric quality , color, and fit are fantastic! You cannot go wrong with this dress. If you have curves this dress will accentuate the positive!...\" Read more 23 customers mention \"Comfort\" 23 positive 0 negative Customers find the dress comfortable, with one mentioning it doesn't irritate the skin and another noting it's not scratchy. \"The dress fits great and was comfortable . My only issue was the fold over part (shoulder) wouldn’t stay in place. I’m 189lbs and I purchased a lrg.\" Read more \"...Perfect mix between stretch, and body con fit dress. It’s also very comfortable and soft\" Read more \"...The ruching is very forgiving and hides any lumps or bumps.\" Read more \"Stretchiness - comfortable fabric - made me feel sexy - good dress for a date night - after 5pm dinner party - the material isn’t see through\" Read more 18 customers mention \"Flattering\" 16 positive 2 negative Customers find the dress flattering, particularly noting how it hugs curves in all the right places. \"Cute! Very flattering . I looked at so many dresses and I’m happy with this choice. I wore this to a wedding then again to a speakeasy....\" Read more \"Fitted & flattering ...\" Read more \"I simply love this dress. It hugs your curves and the material helps to hold everything in. Plus the color is exactly as the picture....\" Read more \"...Fun & great for any semi formal or formal event. Hugs curves in all the right places , highly recommend\" Read more 17 customers mention \"Stretchiness\" 17 positive 0 negative Customers like the dress's stretchiness, with one mentioning that the fabric and stretch are amazing. \"...The material is thick and very stretchy . It just hugs you right. Will definitely buy more colors.\" Read more \"...a tighter look and are in between sizes go ahead and go down, it’s stretchy (but know you may need to fight a bit to get it on and off).\" Read more \"PERFECT! Highly recommend, material is amazing, stretch is great , length is perfect. Thick material and fits great.\" Read more \"...The dress feels great, very comfortable fabric. The fabric is stretchy and it’s got and inner fabric so that it’s not completely mesh and see through...\" Read more 12 customers mention \"Color\" 12 positive 0 negative Customers like the color of the dress, with one specifically mentioning the black shade. \"5’3’’ 132 pounds the dress is well made for the price, great color and comfortable, no riding up or fidgeting to pull down and adjust....\" Read more \"I loved the fit and color of this dress ! You won't be disappointed.\" Read more \"...I must to say it’s a beautiful dress. The color is stunning and the fit is perfect....\" Read more \"...Plus the color is exactly as the picture . Happy with my purchase\" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Pretty dress, great fit and not see through",
        "body": "I felt like a million bucks in this dress! It fit just right, and wasn’t see through, the material was a good thickness. I wore it to a gala where cocktail dresses were accepted and felt perfectly dressed for the occasion. I definitely would recommend! Read more",
        "author": "Janae",
        "rating": 5.0,
        "date": "December 10, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71tCZJtOwKL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71dTeRiR1gL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Beautiful fit!",
        "body": "Amazing fit and material! Highly recommend this. It fits great and looks incredible on! Read more",
        "author": "Maylee",
        "rating": 5.0,
        "date": "December 21, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Awesome maternity dress",
        "body": "Awesome dress, fits great, not a see through, very soft and gentle to the skin. It stretches good, I bought it for gender reveal party and it fitted like a glow, got tons of compliments. The shoulder line sits well, I thought I would be constantly fixing it, but it didn’t shrink down or up. The style is perfect for pregnancy, didn’t have to use any shape wear, as it’s mesh compliment the body well. Read more",
        "author": "Anastasiia",
        "rating": 5.0,
        "date": "October 18, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars One Hell Of A Dress",
        "body": "Buy it. Just get it now. It’s fabulous, insanely flattering. The material is expensive and almost feels like it has shapewear built in, but it’s comfortable and not restrictive. I’m curvy with a little Mom belly, and I feel so sexy and confident in this dress. Fantastic find. I’m absolutely obsessed. 5’7 165 36D and I got a large. Fits like it was made for me. Also I don’t typically like this length, but with the shape of the dress it just makes it even sexier. 10/10 Read more",
        "author": "Carrie <3",
        "rating": 5.0,
        "date": "February 14, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Perfect",
        "body": "PERFECT! Highly recommend, material is amazing, stretch is great, length is perfect. Thick material and fits great. Read more",
        "author": "pauline",
        "rating": 5.0,
        "date": "December 12, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/81-MQ6fUeML._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "4.0 out of 5 stars Very flattering",
        "body": "Very nice material. Very flattering even though I am in my 60s. I do think I will wear a spanx with it because it is very clingy. Even with out one it looks really good. Not disappointed at all with the material. Does not look cheap. Does help hide some imperfections. Comfortable and easy to get on and off. I ordered up so it would have some breathing room. Still molds to your body shape. Good purchase. Read more",
        "author": "m.c.",
        "rating": 4.0,
        "date": "July 10, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Elegant",
        "body": "Love this dress. Got many compliments on it. Read more",
        "author": "Eveelynn",
        "rating": 5.0,
        "date": "December 22, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Great fit",
        "body": "I love the fit and look of this dress. Read more",
        "author": "Loretta Clark",
        "rating": 5.0,
        "date": "December 8, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Off Shoulder Long Sleeve Ruched Cocktail Bodycon is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.",
  "about_this_item": "Womens Maxi Dress Off Shoulder Long Sleeve Ruched Cocktail Bodycon is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.",
  "long_description": "Womens Maxi Dress Off Shoulder Long Sleeve Ruched Cocktail Bodycon is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Red, White, Royalblue, Black. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Off Shoulder Long Sleeve Ruched Cocktail Bodycon is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Red, White, Royalblue, Black. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "82163794-9920-4fee-bcf4-c53c8a0394f3",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/82163794-9920-4fee-bcf4-c53c8a0394f3/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/82163794-9920-4fee-bcf4-c53c8a0394f3/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "8288edf3-d7b6-40bf-8ed0-02bc35585036",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8288edf3-d7b6-40bf-8ed0-02bc35585036/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8288edf3-d7b6-40bf-8ed0-02bc35585036/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Red": "https://m.media-amazon.com/images/I/419aE6C0A-L._AC_SR38,50_.jpg",
    "White": "https://m.media-amazon.com/images/I/31VPcQALWLL._AC_SR38,50_.jpg",
    "Royalblue": "https://m.media-amazon.com/images/I/41NxfH+2WlL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/319a9xJgYgL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Red": "51GYCMCG9oL",
    "White": "41oO9HR1CwL",
    "Royalblue": "51hxCUklwlL",
    "Black": "41jWflq0mfL"
  },
  "color_images": {
    "Red": [
      "https://m.media-amazon.com/images/I/51GYCMCG9oL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61qSJbVZTuL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61KQ11JKrNL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61LbhXgXKsL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61VwkT7D70L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/614j3LTYiSL._SL1500_.jpg"
    ],
    "White": [
      "https://m.media-amazon.com/images/I/41oO9HR1CwL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61bZSaNgTgL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61IxqS8WrZL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61n7PayWj+L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61McAaVUpvL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61MOc0sfvBL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/619X2ro8F-L._SL1500_.jpg"
    ],
    "Royalblue": [
      "https://m.media-amazon.com/images/I/51hxCUklwlL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61fWtoBE0kL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61dhlGzlezL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61WqrITkQhL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61iWMQT5kfL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61Y7RpYPDkL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/41jWflq0mfL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61To8KtVPrL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61mHhUvoL1L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61cZS1GRyBL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/619iW4sES+L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/51buYFPSLNL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 95.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/41vU0V-3D0L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi",
      "title": "Womens Maxi Dress Maxi",
      "price": 51.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71J+5iZv2bL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 45.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61LabDaKTsL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-sleeveless-formal-bodycon-maxi-ruched",
      "title": "Womens Maxi Dress Evening Sleeveless Formal Bodycon Maxi Ruched",
      "price": 67.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51Vp2qCb8VL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-cocktail",
      "title": "Womens Maxi Dress Long Sleeve Cocktail",
      "price": 45.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61EQ5jq9BzL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-maxi-bodycon-long-sleeve-cocktail",
      "title": "Womens Maxi Dress Maxi Bodycon Long Sleeve Cocktail",
      "price": 19.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61qhHqIr1sL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 119.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71njImAOF6L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-maxi",
      "title": "Womens Maxi Dress Long Sleeve Maxi",
      "price": 48.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71bcjiHtNrL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-v-neck-maxi-bodycon",
      "title": "Womens Maxi Dress V Neck Maxi Bodycon",
      "price": 54.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/515XlZkW2UL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-formal-one-shoulder",
      "title": "Womens Maxi Dress Evening Formal One Shoulder",
      "price": 84.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51UwIFZ13TL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail",
      "title": "Womens Dress Cocktail",
      "price": 35.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71mMVuYtmlL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-cocktail-maxi",
      "title": "Womens Maxi Dress Evening Cocktail Maxi",
      "price": 53.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/7159yS7bA1L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-maxi-cocktail",
      "title": "Womens Maxi Dress Formal Maxi Cocktail",
      "price": 76.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/716r2KGQCUL._SL1500_.jpg"
      ]
    }
  ]
}