{
  "id": "womens-maxi-dress-sleeveless-v-neck-mermaid",
  "handle": "womens-maxi-dress-sleeveless-v-neck-mermaid",
  "sku": "JC1464",
  "asin": "B09X9RGKZ7",
  "title": "Womens Maxi Dress Sleeveless V Neck Mermaid",
  "title_original": "Ever-Pretty Women’s V Neck Sleeveless Bridal Wedding Dress with Slit Floor Length Mermaid Gown for Bride White 0121B",
  "brand": "Visit the Ever-Pretty Store",
  "price": 98.99,
  "social_proof": {
    "bought_past_month": 62,
    "text": "62+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/619RXI5CEML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61X8gNbSkoL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61r501c-wUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91XNMXax+UL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ijy2p+VZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/613qetIJqdL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/619RXI5CEML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61X8gNbSkoL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61r501c-wUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/91XNMXax+UL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71ijy2p+VZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/613qetIJqdL._SL1500_.jpg"
  ],
  "aplus_images": [
    "https://m.media-amazon.com/images/I/31qekmLt3hL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41uh772HdaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41uGtgt2fWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31KfPOKSEzL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31SMlvHVquL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31qqqJ5IHvL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31FIdb533EL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31J6d%2BDkxRL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31R-fpFVLzL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31TfodcGKGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31Pt9cC-r1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31YX7vLNy4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41BYxlK76TL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31BosSNPUFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31zVFwKH-KL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/4183oQF%2Bi-L._SL1500_.jpg"
  ],
  "description_images": [
    "https://m.media-amazon.com/images/I/31qekmLt3hL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41uh772HdaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41uGtgt2fWL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31KfPOKSEzL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31SMlvHVquL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31qqqJ5IHvL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31FIdb533EL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31J6d%2BDkxRL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31R-fpFVLzL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31TfodcGKGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31Pt9cC-r1L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31YX7vLNy4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41BYxlK76TL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31BosSNPUFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31zVFwKH-KL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/4183oQF%2Bi-L._SL1500_.jpg"
  ],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ April 2, 2022",
    "ASIN ‏": "‎ B09X33BLXC",
    "Best Sellers Rank": "#170,717 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #863 in Women's Formal Dresses",
    "Customer Reviews": "4.3 4.3 out of 5 stars (329)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "White"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.3,
    "count": 329,
    "customers_say": "Customers find the wedding dress well-made and elegant, with flattering belly area and figure-hugging design. The dress is comfortable and offers good value for money, with one customer noting it's sophisticated enough for a cute elopement wedding. The size receives mixed feedback, with some finding it spot on while others say it's too small. Generated from the text of customer reviews Select to learn more Quality (49) Fit (45) Elegance (43) Figure flattering (18) Value for money (15) Comfort (13) Fabric quality (12) Size (15) 49 customers mention quality, 46 positive, 3 negative 49 customers mention \"Quality\" 46 positive 3 negative Customers find the dress well-made and elegant, with one customer noting it feels like a designer piece. \" Arrived on time ✅ Great Quality ✅ Beautiful ✅ I recommend this dress. It was perfect for my beach wedding! \" Read more \" ...This pure white washed out my complexion. Other than that it was well made , nice fabric and very flattering on especially if you have a little bit... \" Read more \" Loved the dress , it’s True to size. Fits comfortably. Great material stretches over curvy areas and no problems zipping.... \" Read more \" Love the dress , fits perfectly! Very good quality fabric. \" Read more 45 customers mention fit, 37 positive, 8 negative 45 customers mention \"Fit\" 37 positive 8 negative Customers are satisfied with how the dress fits, with one mentioning it sits in all the right places. \" The dress was perfect and fit like a glove ! It hugged my figure in all the right places and was light and airy for the beach. Perfect! \" Read more \" ...Once it arrived and I tried it on, I was amazed at the high quality, perfect fit , and elegant drape of the fabric.... \" Read more \" This dress was perfection. The fit was perfect and no tailoring needed. It was sexy and beautiful all in the same.... \" Read more \" Fits like a glove ..loved it. \" Read more 43 customers mention elegance, 43 positive, 0 negative 43 customers mention \"Elegance\" 43 positive 0 negative Customers find the dress elegant, describing it as pretty and classic, with one customer noting it's sophisticated enough for a cute elopement wedding and another mentioning it's suitable for other formal events. \" $70 has never been so worth it. The dress is beautiful and comfortable. My new wife loved it as do I. I only needed to adjust the straps a little.... \" Read more \" Beautiful dress and very flattering. I rolled this dress up and carried it in my backpack as we hiked up a mountain for our elopement at the top.... \" Read more \" This dress was super comfortable! It’s sexy and flattering, but if like me you just recently put on an extra 10-15 lbs and are in denial about it,... \" Read more \" ...Highly recommend for a classy and memorable wedding look \" Read more 18 customers mention figure flattering, 17 positive, 1 negative 18 customers mention \"Figure flattering\" 17 positive 1 negative Customers find the dress flattering, particularly around the belly area, and say it hugs their figure in all the right places. One customer mentions that the rouching is perfect for hiding tummy imperfections. \" Beautiful dress and very flattering . I rolled this dress up and carried it in my backpack as we hiked up a mountain for our elopement at the top.... \" Read more \" This dress was super comfortable! It’s sexy and flattering , but if like me you just recently put on an extra 10-15 lbs and are in denial about it,... \" Read more \" I love the dress it was very figure flattering . The slit does come pretty high, so whatever you wear underneath keep that in mind.... \" Read more \" ...more on the side than in the front, but other than that i was perfect for my elopement . Hugged all the right places! \" Read more 15 customers mention value for money, 14 positive, 1 negative 15 customers mention \"Value for money\" 14 positive 1 negative Customers find the dress great value for money, with one mentioning it offers good quality for the price. \" Classy, comfortable, affordable ... \" Read more \" ...I got a lot of complements. Good quality for the price . \" Read more \" ...I ordered several dresses and this was always the front runner. Great value ! Soooo many compliments!!! You won’t be disappointed!!! \" Read more \" This dress is great for the price ! I measured myself and purchased accordingly and it fits great. Quality is better than I expected.... \" Read more 13 customers mention comfort, 12 positive, 1 negative 13 customers mention \"Comfort\" 12 positive 1 negative Customers find the dress comfortable. \" Dress was made very well with professional stitching. Comfortable and breathable. Was one of the first wedding dresses that looked like the picture! \" Read more \" The pleats laid very nicely, comfy and stretchy. The only drawback is that you can see underware through this dress since it is slightly see through. \" Read more \" Beautiful dress! True to size. VERY comfortable . Yes not completely zipped upper back in photo.... \" Read more \" ...But I kept coming back to this beauty. It was so incredibly comfortable and had built in cups, I didn't need to wear anything under it!... \" Read more 12 customers mention fabric quality, 10 positive, 2 negative 12 customers mention \"Fabric quality\" 10 positive 2 negative Customers like the fabric of the dress, with one mentioning it feels soft. \" I bought this for my wedding dress and couldn’t have been happier! Great fabric and worth the purchase! I’m 5’9 and 185 lbs and fit well in the 12! \" Read more \" ...This is a very pretty dress with great material . It’s a good thick quality and has some stretch to it. It’s very flattering and has a small train.... \" Read more \" ...Other than that it was well made, nice fabric and very flattering on especially if you have a little bit of a belly. I’m 5’2” and 129lbs.... \" Read more \" This was my wedding dress and I definitely don’t regret it. The material was great , I got compliments (beach wedding). Awesome buy. \" Read more 15 customers mention size, 10 positive, 5 negative 15 customers mention \"Size\" 10 positive 5 negative Customers have mixed opinions about the dress size, with some finding it spot on and appreciating the small train, while others report it being too small. \" ...It fit beautifully and true to size . I felt so pretty. Was it my dream dress, no. Would I have happily eloped in it? Absolutely!... \" Read more \" Very cheap looking . Also ran small . \" Read more \" ...It’s very flattering and has a small train . You can’t beat it for the price.... \" Read more \" ... Size was on point and it's really perfect .I really love love this dress and I am 100% satisfied with the quality and the dress itself.... \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Beautifully styled, great price point!",
        "body": "We’ve been married almost 20 years, but just this past August 2025, we took the step to take vows and become crowned in the Holy Orthodox Church. Though I could have bought a dress from one of the many boutiques in the area, this one caught my eye one day when just skimming over dresses here. I decided to order it as a “just in case” dress. My sweet husband was prepared to spend hundreds, if not more on my dress. But the price on this lovely gown was so reasonable, it made sense to buy it as a back up. Once it arrived and I tried it on, I was amazed at the high quality, perfect fit, and elegant drape of the fabric. After looking around at a couple of boutiques, I decided I would go with this wonderful “back up” dress. Boy was my husband surprised! He said some funny things about how he thought I might be a bit more difficult to please, etc. Anyway, it looked WONDERFUL — making our Crowning Ceremony and reception more beautiful than we ever imagined. High quality for the very low price. I’m not sure if it comes in other colors, but it would be lovely for other formal events as well. Read more",
        "author": "Texasdragonslayer",
        "rating": 5.0,
        "date": "September 10, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/51cI1WK-kqL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Fits -stretches-sexy",
        "body": "Loved the dress, it’s True to size. Fits comfortably. Great material stretches over curvy areas and no problems zipping. I am larger bust however and would have loved ability to take pads out at bust for more room to manipulate breasts higher with inserts or bra-but it’s okay. My NEW husband was shocked and cried when he saw me! It was perfect for our impromptu beach wedding of our dreams-believe that! We would choose it again!! Great value for the money. Enjoy the pictures. Taken with our few guests iPhone/androids. Read more",
        "author": "K Perkins",
        "rating": 5.0,
        "date": "September 29, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71NG1hM7T0L._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/61VI2UMUGZL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71h8+8dYMdL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/61kkRBAqh8L._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71JgKpKTdVL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71ywmn2daBL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/81RzT94svrL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Almost my wedding dress",
        "body": "I was scared about not being able to get a wedding dress in time for my wedding so I ordered this one. It fit beautifully and true to size. I felt so pretty. Was it my dream dress, no. Would I have happily eloped in it? Absolutely! Luckily though I ended up finding a different stunning dress for my big day. But I highly recommend this to any brides on a budget! Read more",
        "author": "Melanie Evans",
        "rating": 5.0,
        "date": "November 16, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Beautiful",
        "body": "This dress is so pretty! I used it as a base and modified it to add extra flowers and lace, it's so pretty and flowy, it does run a little big, I liked the bigger size because it made it more flowy, but it definitely was loose around my waist. Highly recommend, it's great quality. Read more",
        "author": "bl8ck1c3",
        "rating": 5.0,
        "date": "August 30, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61kqfbu0jnL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "1.0 out of 5 stars Poor quality",
        "body": "Very cheap looking . Also ran small . Read more",
        "author": "Saundra Seidel",
        "rating": 1.0,
        "date": "August 1, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Beautiful, Runs Small",
        "body": "Nice dress just make sure you go up 2 sizes Read more",
        "author": "Bea",
        "rating": 4.0,
        "date": "July 30, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Beautiful, simple and flattering dress",
        "body": "I bought this for my small intimate wedding and couldn't be happier. As a curvy woman, it was flattering and comfortable and felt amazing on my special day. I could have sized up. It has a nice stretch to it, but it was still a bit snug on my hips. I did have to alter the straps because I'm smaller on top, the straps would fall off my shoulders. Quality was way thicker and better than I expected. Having a small train was a nice touch on this simple dress. Read more",
        "author": "Vb227",
        "rating": 5.0,
        "date": "April 4, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71Y2a+kDJnL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/81YgTgEpqpL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71sEbJMUp8L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Dress does not disappoint. It looks and feels great!",
        "body": "I used this dress for my 30 yr. Vow renewal. I used the info from the previous posts and photos to help me make my decision. I am 5ft. 1 inch tall and 120 lbs. I purchased size 4. It was true to my size. The dress fit perfectly. The material felt very smooth on my skin. The small train was perfect. Dress is simple, but very elegant. I wore a strapless bra and thong so everything was smooth. The belly area has some give but not a lot so consider this. I did ab work to make sure I had no problem. The only issue I had was getting the zipper up my back side due to how the zipper and stitch were sewn but with care it zipped. I love this dress. Priced reasonable and very elegant! Read more",
        "author": "Customer",
        "rating": 5.0,
        "date": "May 26, 2023",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/711wrv6awXL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71JPVIrjoAL._SY88._SL1500_.jpg"
        ]
      }
    ]
  },
  "short_description": "Womens Maxi Dress Sleeveless V Neck Mermaid is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.",
  "about_this_item": "Womens Maxi Dress Sleeveless V Neck Mermaid is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.",
  "long_description": "Womens Maxi Dress Sleeveless V Neck Mermaid is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: White. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Sleeveless V Neck Mermaid is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/31qekmLt3hL._SL1500_.jpg",
      "alt": "Womens Maxi Dress Sleeveless V Neck Mermaid details image 1"
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/41uh772HdaL._SL1500_.jpg",
      "alt": "Womens Maxi Dress Sleeveless V Neck Mermaid details image 2"
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/41uGtgt2fWL._SL1500_.jpg",
      "alt": "Womens Maxi Dress Sleeveless V Neck Mermaid details image 3"
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/31KfPOKSEzL._SL1500_.jpg",
      "alt": "Womens Maxi Dress Sleeveless V Neck Mermaid details image 4"
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: White. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/31SMlvHVquL._SL1500_.jpg",
      "alt": "Womens Maxi Dress Sleeveless V Neck Mermaid details image 5"
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "ea0f5f7a-a9c6-43dc-9701-36ff413448cf",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ea0f5f7a-a9c6-43dc-9701-36ff413448cf/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ea0f5f7a-a9c6-43dc-9701-36ff413448cf/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/925970e5-2bd8-4de0-9304-a5f94f975d76.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "0e953bf1-d6de-444a-a611-89939ab9155a",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0e953bf1-d6de-444a-a611-89939ab9155a/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0e953bf1-d6de-444a-a611-89939ab9155a/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/925970e5-2bd8-4de0-9304-a5f94f975d76.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "26315db4-3fb2-4ea5-b9c2-e395411f7ca4",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/26315db4-3fb2-4ea5-b9c2-e395411f7ca4/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/26315db4-3fb2-4ea5-b9c2-e395411f7ca4/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/925970e5-2bd8-4de0-9304-a5f94f975d76.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "b9955cee-3c47-4962-b561-4cb1bb210cd1",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b9955cee-3c47-4962-b561-4cb1bb210cd1/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b9955cee-3c47-4962-b561-4cb1bb210cd1/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/925970e5-2bd8-4de0-9304-a5f94f975d76.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "White": "https://m.media-amazon.com/images/I/31UH2PuVybL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "White": "619RXI5CEML"
  },
  "color_images": {
    "White": [
      "https://m.media-amazon.com/images/I/619RXI5CEML._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61X8gNbSkoL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61r501c-wUL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/91XNMXax+UL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71ijy2p+VZL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/613qetIJqdL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 25.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51xw+7GL4SL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-cocktail-evening-maxi",
      "title": "Womens Maxi Dress Formal Cocktail Evening Maxi",
      "price": 46.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61f51ieSILL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-sleeveless",
      "title": "Womens Dress Sleeveless",
      "price": 19.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71nuuzdxpsL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-off-shoulder-formal-evening",
      "title": "Womens Maxi Dress Off Shoulder Formal Evening",
      "price": 76.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71SR6dZ5WKL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-maxi",
      "title": "Womens Maxi Dress Evening Maxi",
      "price": 14.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/81CIc2WXCaL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-cocktail-long-sleeve-bodycon-maxi",
      "title": "Womens Maxi Dress Cocktail Long Sleeve Bodycon Maxi",
      "price": 50.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/51aURhIoLlL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-ruched-bodycon-long-sleeve",
      "title": "Womens Maxi Dress Ruched Bodycon Long Sleeve",
      "price": 35.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51yCU5yTyUL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-ruched-formal-maxi",
      "title": "Womens Maxi Dress Ruched Formal Maxi",
      "price": 56.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/41Ld9uQ6qUL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-ruched-long-sleeve-bodycon-cocktail-off-shoulder-maxi",
      "title": "Womens Maxi Dress Ruched Long Sleeve Bodycon Cocktail Off Shoulder Maxi",
      "price": 52.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61Idn8rOrRL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-sleeveless",
      "title": "Womens Maxi Dress Maxi Sleeveless",
      "price": 42.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/814ZyJJ1oAL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening",
      "title": "Womens Maxi Dress Formal Evening",
      "price": 77.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61Hj4-S+4eL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-short-sleeve",
      "title": "Womens Dress Short Sleeve",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61Gm5oBtjDL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-formal",
      "title": "Womens Maxi Dress Evening Formal",
      "price": 81.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51hiWK+lNdL._SL1500_.jpg"
      ]
    }
  ]
}