{
  "id": "womens-maxi-dress-maxi-bodycon-formal-long-sleeve-cocktail",
  "handle": "womens-maxi-dress-maxi-bodycon-formal-long-sleeve-cocktail",
  "sku": "JC2251",
  "asin": "B0BHQ92CJN",
  "title": "Womens Maxi Dress Maxi Bodycon Formal Long Sleeve Cocktail",
  "title_original": "Popilush Women's Long Sleeve Maxi Dress Built-in Shapewear Bra Square Neck Fall Formal Wedding Guest Cocktail Bodycon Dresses",
  "brand": "Visit the Popilush Store",
  "price": 89.99,
  "social_proof": {
    "bought_past_month": 410,
    "text": "410+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/61Obg23nrhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71qhU59LCML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61WWHxfR1mL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71wl7CNA+AL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71KQ7RH0fKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61sp9JvuZHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71y-8wyHUqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71HTuP8+lmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71WTEII4jML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71NLDZs7H6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71CdOlqRWHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71shafRzmXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71RplnhZKQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61pwI6jGIpL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/61Obg23nrhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71qhU59LCML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61WWHxfR1mL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71wl7CNA+AL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71KQ7RH0fKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61sp9JvuZHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71y-8wyHUqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71HTuP8+lmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71WTEII4jML._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71NLDZs7H6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71CdOlqRWHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71shafRzmXL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71RplnhZKQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61pwI6jGIpL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ July 30, 2024",
    "ASIN ‏": "‎ B0DBLSHB9N",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#33,436 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #1,154 in Women's Club & Night Out Dresses",
    "Customer Reviews": "4.4 4.4 out of 5 stars (1,603)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Red",
      "Brown",
      "Pink",
      "Blue",
      "Purple",
      "Black",
      "Green",
      "Grey",
      "Dark Red"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.4,
    "count": 1603,
    "customers_say": "Customers find the dress comfortable and flattering, particularly noting how it hugs the body beautifully without feeling tight. The built-in shapewear is praised as a game changer, and they appreciate how it snatches them in all the right places. The dress receives positive feedback for its fit, with one customer mentioning it hits the top of the feet perfectly. While some the length is perfect, others find it too long. Generated from the text of customer reviews Select to learn more Fit (128) Quality (120) Comfort (97) Beauty (95) Flattering (87) Snatchability (67) Shape wear (66) Length (64) 128 customers mention fit, 104 positive, 24 negative 128 customers mention \"Fit\" 104 positive 24 negative Customers like how the dress fits, noting it keeps them tight in all the right places, with one customer mentioning it hugs the body beautifully without being constricting. \" Fits like a glove . Can be a challenge to get into, but once over the hips no problem. Nice and tight body contouring.... \" Read more \" Fits great . Just wish the built in bra gave a little lift. But you can definitely get away without a bra if your chest isn't too big. \" Read more \" Absolutely love this dress! It fits perfectly , so flattering. I bought more of there products after buying this dress. Its a must have in your closet. \" Read more \" I purchased this in red and it fit perfectly ! The shareware can be a little tricky to wiggle into if you’re curvy, but the final result is amazing.... \" Read more 120 customers mention quality, 102 positive, 18 negative 120 customers mention \"Quality\" 102 positive 18 negative Customers find the dress to be of good quality, describing it as the best they've ever worn. \" This is a great dress , the fabric is soft and stretchy. The shape wear is actually really good. I am 5’7 and it hits right at the top of my ankle.... \" Read more \" Love this dress ! I feel like Barbie- I am 5’11 180 pounds, I typically wear a M but I ordered a size down and. Squeeze into it and it’s comfy \" Read more \" ...But over all it's a nice dress , nice quality & nice fit. \" Read more \" This dress is good quality the shaper works miracles. Would recommend to every lady, you can dress this up or down. It was a little long for me.... \" Read more 97 customers mention comfort, 84 positive, 13 negative 97 customers mention \"Comfort\" 84 positive 13 negative Customers find the dress comfortable, with one mentioning it's not suffocating. \" ...Size is good, color was as expected, and overall comfortable . Only gave 3 stars because fabric was not as expected, it's just a ribbed jersey knit.... \" Read more \" Love the fit. Very comfortable and flattering. Only problem was the interior shape wear is very loud. As I walk it was a swish-swish sound lol \" Read more \" LOVE this dress! I got so many compliments on it. It’s super comfortable and the shapewear is such a bonus! Saved my thighs by the end of the night.... \" Read more \" So flattering, so so comfortable ! The color is a vibrant red and hugs your shape beautifully. Has the opening in the crotch making it easy to pee.... \" Read more 95 customers mention beauty, 92 positive, 3 negative 95 customers mention \"Beauty\" 92 positive 3 negative Customers find the dress gorgeous and say it makes them feel beautiful, with one customer noting it gives them a little oomph. \" Super comfy and sexy !!! Can’t recommend this enough. Is a little tough getting over the hips but once shes up…she does her job!!... \" Read more \" I didn’t realize it was a ribbed dress it’s still cute !! The fabric is a little itchy around my arms though. \" Read more \" ...Overall I think this is a beautiful dress but, the design on shape wear needs work, in particular upgrading the material making it thicker and... \" Read more \" The dresses is beautiful and holds the tummy well but it is SHORT FOR TALL WOMEN. It will be at an awkward length and it looks funny.... \" Read more 87 customers mention flattering, 77 positive, 10 negative 87 customers mention \"Flattering\" 77 positive 10 negative Customers find the dress flattering, noting that it hugs their shape beautifully and enhances curves, with one customer specifically mentioning how it accentuates their hourglass figure. \" Super cute dress and very flattering , I just think I got unlucky and received someone's return because my shapewear had a huge rip all along the... \" Read more \" Love the fit. Very comfortable and flattering . Only problem was the interior shape wear is very loud. As I walk it was a swish-swish sound lol \" Read more \" Absolutely love this dress! It fits perfectly, so flattering . I bought more of there products after buying this dress. Its a must have in your closet. \" Read more \" ... Super flattering and has major stretch. I found a way to take the pads out the built in bra but the girls are sitting up nice.... \" Read more 67 customers mention snatchability, 52 positive, 15 negative 67 customers mention \"Snatchability\" 52 positive 15 negative Customers appreciate how the dress snatches them in the right places. \" This dress is worth every penny. It snatched my body and still gave me the comfort to be able to breath in. Such a beautiful simple dress.... \" Read more \" The best dress. Fabric is thick and it has a built in faja that snatches you in . The dress is lined so it’s not see thru.... \" Read more \" I loved this dress when I first put it on it snatches you in all the right places .... \" Read more \" Was not flattering for my shape. Did not nip/tuck me like I expected. I bought 3 different styles and sent all of them back. \" Read more 66 customers mention shape wear, 48 positive, 18 negative 66 customers mention \"Shape wear\" 48 positive 18 negative Customers love the built-in shapewear in this dress, describing it as a game changer that enhances curves and edges without being constricting. \" ...Great for a winter formal. Love the fit and built in shape wear . I bought large. I’m 5’7 and about 145-148 depending on the day. \" Read more \" No shape wear not popilush , scam \" Read more \" ...IT HAS NO SHAPEWEAR INSIDE ANS THE MATERIAL IS SO CHEAP AND THIN.... \" Read more \" This dress does not disappoint. It has built in shapewear so you do need to put it on through the top.... \" Read more 64 customers mention length, 35 positive, 29 negative 64 customers mention \"Length\" 35 positive 29 negative Customers have mixed opinions about the dress length, with some finding it perfect and true to size, while others report it being too long. \" ...It has a built-in Body shape wear, did not even have to wear a bra. True to size gives you an hourglass shape figure, just purchased the sleeveless... \" Read more \" It’s ok. Does hold you in. Not tight at all. Way too long .Im 5’5 ,160, large chest. I might try one of the shorter dresses and see how it is.... \" Read more \" ...The material is flowing with great texture and the length was perfect . I'm 5ft 8 and 215lbs, this is a size XL. \" Read more \" ...It was a little long for me . I’m 4 10’ 145 pounds bought a large. I took it to the cleaners pick it up tomorrow.... \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Amazing Fit & Super Flattering!",
        "body": "The media could not be loaded. This dress surprised me in the best way! The material is soft, stretchy, and hugs the body beautifully without feeling tight. The built-in shapewear is a game changer—super comfortable and gives a smooth, snatched look without any squeezing. It’s perfect for date nights, events, or even content creation because it photographs so well. I felt confident, supported, and stylish the entire time I wore it. Definitely worth it! If you’re looking for a flattering maxi dress that shapes you naturally and feels good on the skin, this one is a must-buy. Read more",
        "author": "Lakshmy",
        "rating": 5.0,
        "date": "November 13, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars My new favorite dress",
        "body": "Loved this dress, I felt amazing all night. It was comfortable, did a fantastic job shaping, was stretchy, and looks expensive. 10/10 Read more",
        "author": "Jacob & Lyndsey Bowers",
        "rating": 5.0,
        "date": "December 13, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Love it",
        "body": "I ordered a medium. 5’7 , athletic, large breasts. It was extremely flattering. I have a wider rib cage and back so the top part felt a little tight for comfort for me. I don’t like anything digging into my back at all. Next time I think I’ll try the large esp as I’ve built more muscle since the time these pictures were taken. Regardless, the color and fit was beautiful. I looked snatched for my elopement photos, which is what I wanted. And it was mostly comfortable. 10/10. I will say the leg part is noticeable through the fabric, as well as some other parts, but it didn’t detract from the beauty of the dress and it could be because I needed a size larger. Read more",
        "author": "Krishna Brownlee",
        "rating": 5.0,
        "date": "October 24, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71XwL3J9RBL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/617rZ4u5jEL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "4.0 out of 5 stars Nice dress, overpriced",
        "body": "I generally like the dress! It definitely smooths things out, and I didn't notice the sound issue everyone was having with it. The only thing I'll say is, the price is a little insane. I expected a bit more for it. It's a great \"black dress\" for any occasion, so it'll get use. Read more",
        "author": "Angela",
        "rating": 4.0,
        "date": "September 11, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Great dress!",
        "body": "This is a great dress, the fabric is soft and stretchy. The shape wear is actually really good. I am 5’7 and it hits right at the top of my ankle. I wear a 38 DDD and I am decently held up. Enough that I feel comfortable wearing it with no bra, but if you want more lift you could easily put a bra on under the shape wear. I feel it is true to size. I wear a size 16 pants and am very hourglass shaped, I got the XL and it fits perfectly. The shape wear takes some patience getting into but once I worked it up and got it in place it was extremely comfortable, smoothing and slimming. I would have someone help you if you have long nails to get it over hips. Read more",
        "author": "Corrin",
        "rating": 5.0,
        "date": "January 25, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Love this dress",
        "body": "Updated Review: I gave a 3 star from a 4 just because of the shape wear material. I did re-buy the dress and an XL was perfect but, you guessed it, the butt ripped on me again. I still stand by the shape wear material needing an overhaul as it is really uncomfortable on the bottom part. The boob pads need to go. Still a super flattering dress. Initial review: So, I have to say I love this dress but… literally butt, the shape wear ripped in the butt. That should not happen as that material needs to be durable, especially if you have a large bum! The shape wear is very thin and scratchy and rubs on the thighs. I think the mesh needs to be thicker. I’m around 200 5’6 and I tried the large, it fit decent except for the butt rip, so I am going to try sizing up and see if that helps as I may have just bought it too small. Can’t wait to get another one. I do suggest wearing some type of protective thigh cream, or a deodorant on the thighs as it does cause some discomfort from the type of thin pantyhose type material. Overall I think this is a beautiful dress but, the design on shape wear needs work, in particular upgrading the material making it thicker and smoother. Read more",
        "author": "Mia Fraser",
        "rating": 3.0,
        "date": "September 23, 2023",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Full BODY yum.",
        "body": "Okay, too to bottom absolutely more than what I was expecting. The inner shape wear, bra top with padding. Gives enough support in my opinion, I have a d chest so I think for what the dress is it gave me enough lift and hold. The shape wear holds enough, gives that seamless look however this is not what you lean on for that snatched support but in my opinion it’s fine, if I want more support I add whatever shape wear I already own either under or over and it works out just fine it has the gusset to make ease of restroom use. Now the dress itself, sleeves are long enough, and when I say enough I mean enough for me it stops about wrist bone but the stretch give me at least an extra inch and it doesn’t exhaust the fabric it is a stretch and bounce back material. And when I pull the sleeves it has enough give where it doesn’t pull the body of the dress and make it obvious you are stretching it. The length of the dress is great and it fits just so that you can manipulate and scrunch the dress to cover your pooch or even to ‘shorten’ it. It’s extremely stretchy dress and is great for lounging or out. The shape wear inside is comfortable to wear as an at home lazy dress and still feel cute. Love love love this dress, going to purchase this in all styles and colors. Read more",
        "author": "Luv Powell",
        "rating": 5.0,
        "date": "December 16, 2022",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Wonderful dress",
        "body": "Very comfy. I'm 5'5 and its long but I like the length. The built-in shapewear will smooth you out but won't make your tummy disappear you will need additional corest for that but I don't care that much for a little belly it looks more natural. With that said peeing in it was easy maybe more hygienic cause your butt doesn't touch the toilet seat but the pee hole opens up huge so no accidental peeing on your clothes. I got lots of compliments on the color. I wore the color green. To be honest I own the black too for some odd reason I think these dresses really make a statement as color that's nit black. But I'm black so maybe it's a me problem. Lol. I will buy this again in other colors so I switch it up and have fun. Test your bra first. I wore a full coverage bra by mistake and it kept shoeing through the square neck. I had to keep adjusting. Please test the perfect bra before you go out cause all the adjust in the world if you got big boobs like me... listen your bra will show. But I have better bras for this dress and now I know. Read more",
        "author": "Tamika M Reynolds",
        "rating": 5.0,
        "date": "December 22, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Maxi Bodycon Formal Long Sleeve Cocktail is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.",
  "about_this_item": "Womens Maxi Dress Maxi Bodycon Formal Long Sleeve Cocktail is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.",
  "long_description": "Womens Maxi Dress Maxi Bodycon Formal Long Sleeve Cocktail is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Red, Brown, Pink, Blue, Purple, Black, Green, Grey, Dark Red. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Maxi Bodycon Formal Long Sleeve Cocktail is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Red, Brown, Pink, Blue, Purple, Black, Green, Grey, Dark Red. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "813c778f-b869-4c2d-929d-0ee53cef7aee",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/813c778f-b869-4c2d-929d-0ee53cef7aee/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/813c778f-b869-4c2d-929d-0ee53cef7aee/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "4eaa0e36-3f02-44e6-bb5f-e730119d45df",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4eaa0e36-3f02-44e6-bb5f-e730119d45df/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4eaa0e36-3f02-44e6-bb5f-e730119d45df/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "e40a8771-f8c0-487f-ad52-612aea27392d",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e40a8771-f8c0-487f-ad52-612aea27392d/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e40a8771-f8c0-487f-ad52-612aea27392d/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "387354f2-9082-472c-adfd-0c88b7200fc9",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/387354f2-9082-472c-adfd-0c88b7200fc9/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/387354f2-9082-472c-adfd-0c88b7200fc9/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "38a250a3-8a6f-4a27-a11b-956a1259c977",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/38a250a3-8a6f-4a27-a11b-956a1259c977/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/38a250a3-8a6f-4a27-a11b-956a1259c977/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "54fad0cf-8231-4318-8151-8f7afb3cb3d0",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/54fad0cf-8231-4318-8151-8f7afb3cb3d0/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/54fad0cf-8231-4318-8151-8f7afb3cb3d0/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "77f73573-798e-4c4b-ab37-4d9332128863",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/77f73573-798e-4c4b-ab37-4d9332128863/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/77f73573-798e-4c4b-ab37-4d9332128863/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "6141d2fe-96e1-4d7c-a69e-56fe289619cf",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6141d2fe-96e1-4d7c-a69e-56fe289619cf/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6141d2fe-96e1-4d7c-a69e-56fe289619cf/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "cf40daee-4121-4ef0-b519-dcdc3556a3bf",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/cf40daee-4121-4ef0-b519-dcdc3556a3bf/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/cf40daee-4121-4ef0-b519-dcdc3556a3bf/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "bb38ff96-652d-4cab-aa07-6cf354eb16c1",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bb38ff96-652d-4cab-aa07-6cf354eb16c1/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bb38ff96-652d-4cab-aa07-6cf354eb16c1/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "53f431bb-655d-4d8a-add8-eb4fe00a06c6",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/53f431bb-655d-4d8a-add8-eb4fe00a06c6/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/53f431bb-655d-4d8a-add8-eb4fe00a06c6/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "733aab92-4213-4e25-8fd7-b82b6f6d38b2",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/733aab92-4213-4e25-8fd7-b82b6f6d38b2/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/733aab92-4213-4e25-8fd7-b82b6f6d38b2/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Red": "https://m.media-amazon.com/images/I/41n8Ux2sWiL._AC_SR38,50_.jpg",
    "Brown": "https://m.media-amazon.com/images/I/41lIZIqPy5L._AC_SR38,50_.jpg",
    "Pink": "https://m.media-amazon.com/images/I/41FEFCDIPKL._AC_SR38,50_.jpg",
    "Blue": "https://m.media-amazon.com/images/I/41O0JZyRrFL._AC_SR38,50_.jpg",
    "Purple": "https://m.media-amazon.com/images/I/41e7eGpfhPL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/310oc0UxD2L._AC_SR38,50_.jpg",
    "Green": "https://m.media-amazon.com/images/I/41hfUttkP8L._AC_SR38,50_.jpg",
    "Grey": "https://m.media-amazon.com/images/I/31AHquXKjKL._AC_SR38,50_.jpg",
    "Dark Red": "https://m.media-amazon.com/images/I/41bzTrcIL7L._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Red": "71y-8wyHUqL",
    "Brown": "71HTuP8+lmL",
    "Pink": "71WTEII4jML",
    "Blue": "71NLDZs7H6L",
    "Purple": "71CdOlqRWHL",
    "Black": "61Obg23nrhL",
    "Green": "71shafRzmXL",
    "Grey": "71RplnhZKQL",
    "Dark Red": "61pwI6jGIpL"
  },
  "color_images": {
    "Red": [
      "https://m.media-amazon.com/images/I/71y-8wyHUqL._SL1500_.jpg"
    ],
    "Brown": [
      "https://m.media-amazon.com/images/I/71HTuP8+lmL._SL1500_.jpg"
    ],
    "Pink": [
      "https://m.media-amazon.com/images/I/71WTEII4jML._SL1500_.jpg"
    ],
    "Blue": [
      "https://m.media-amazon.com/images/I/71NLDZs7H6L._SL1500_.jpg"
    ],
    "Purple": [
      "https://m.media-amazon.com/images/I/71CdOlqRWHL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/61Obg23nrhL._SL1500_.jpg"
    ],
    "Green": [
      "https://m.media-amazon.com/images/I/71shafRzmXL._SL1500_.jpg"
    ],
    "Grey": [
      "https://m.media-amazon.com/images/I/71RplnhZKQL._SL1500_.jpg"
    ],
    "Dark Red": [
      "https://m.media-amazon.com/images/I/61pwI6jGIpL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-formal-evening-maxi-mermaid-v-neck",
      "title": "Womens Maxi Dress Formal Evening Maxi Mermaid V Neck",
      "price": 80.48,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71s6LmTnh4L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail",
      "title": "Womens Maxi Dress Cocktail",
      "price": 49.89,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71SboZoWZzL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-long-sleeve-v-neck",
      "title": "Womens Maxi Dress Bodycon Long Sleeve V Neck",
      "price": 57.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61tCS-pOsgL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-formal-bodycon",
      "title": "Womens Maxi Dress Long Sleeve Formal Bodycon",
      "price": 36.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61GBgs5yftL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-v-neck-long-sleeve-formal",
      "title": "Womens Maxi Dress Evening V Neck Long Sleeve Formal",
      "price": 69.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51lzdCOoqtL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress-evening",
      "title": "Womens Dress Evening",
      "price": 43.54,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61Br2lIK6tL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-v-neck-formal-long-sleeve",
      "title": "Womens Maxi Dress V Neck Formal Long Sleeve",
      "price": 84.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51LKzkO+MDL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-mermaid-formal",
      "title": "Womens Maxi Dress Long Sleeve Mermaid Formal",
      "price": 80.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/4144TFf2-NL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-short-sleeve",
      "title": "Womens Dress Short Sleeve",
      "price": 139.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61DGsPsr6EL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-bodycon-ruched",
      "title": "Womens Maxi Dress Long Sleeve Bodycon Ruched",
      "price": 37.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51Jfo4Yc9xL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-mermaid-evening-ruched",
      "title": "Womens Maxi Dress Formal Mermaid Evening Ruched",
      "price": 74.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61qHc0kmHEL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 78.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61CJM1L5ixL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-off-shoulder-formal",
      "title": "Womens Maxi Dress Long Sleeve Off Shoulder Formal",
      "price": 47.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/71NahNens6L._SL1500_.jpg"
      ]
    }
  ]
}