{
  "id": "womens-maxi-dress-ruched-bodycon-cocktail",
  "handle": "womens-maxi-dress-ruched-bodycon-cocktail",
  "sku": "JC3252",
  "asin": "B0C6TXLD26",
  "title": "Womens Maxi Dress Ruched Bodycon Cocktail",
  "title_original": "ZESICA Women's Sexy Ruched Bodycon Midi Dress Long Puff Sleeve Square Neck Backless Cocktail Party Wedding Dresses",
  "brand": "Visit the ZESICA Store",
  "price": 44.99,
  "social_proof": {
    "bought_past_month": 51,
    "text": "51+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/61n1ZdxRnUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61jVlUMXRjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71s-H0Pmw6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ffWmQCpvL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61iIiBPY7TL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81+WV3QNA6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61HeZLETb-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51-Y8b0lYQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61FV6Cq9ebL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71YbgNf89qL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71hmTg+luSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71LI7DoKfCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/716rH8z2wlL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71I2FJwZFoL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71sxeOCngGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/7180ETqzDqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71XYf4ranIL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71lqrgHT+OL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ofjCdZtrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71lhAmkE-vL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/715kDbUIc9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71xCu8inFQL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/61n1ZdxRnUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61jVlUMXRjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71s-H0Pmw6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ffWmQCpvL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61iIiBPY7TL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81+WV3QNA6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61HeZLETb-L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51-Y8b0lYQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61FV6Cq9ebL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71YbgNf89qL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71hmTg+luSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71LI7DoKfCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/716rH8z2wlL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71I2FJwZFoL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71sxeOCngGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/7180ETqzDqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71XYf4ranIL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71lqrgHT+OL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61ofjCdZtrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71lhAmkE-vL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/715kDbUIc9L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71xCu8inFQL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Product Dimensions ‏": "‎ 1.97 x 0.79 x 0.39 inches; 3.53 ounces",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ June 1, 2023",
    "ASIN ‏": "‎ B0D49XWHMN",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#26,528 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #130 in Women's Club & Night Out Dresses",
    "Customer Reviews": "4.3 4.3 out of 5 stars (1,185)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Brown",
      "Lightblue",
      "Apricot",
      "Rose",
      "Black",
      "Orange",
      "Darkgreen",
      "Red",
      "Plum",
      "Pink",
      "White",
      "Purple",
      "Darkblue",
      "Teal"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.3,
    "count": 1185,
    "customers_say": "Customers find the dress fits well, hugging the body without being tight, and appreciate its elegant, body-hugging design that works well for bachelorette parties. The dress is comfortable, flattering, and features a soft red color, with one customer noting it's suitable for various body types. While some customers love the material, others express concerns about the fabric quality. Generated from the text of customer reviews Select to learn more Fit (142) Beauty (135) Quality (99) Comfort (73) Flattering (58) Color (54) Stretchiness (47) Material quality (60) 142 customers mention fit, 130 positive, 12 negative 142 customers mention \"Fit\" 130 positive 12 negative Customers like how the dress fits, noting that it hugs the body without being too tight, particularly around the legs and hips, and can be sized down for a form-fitting look. \" ...long enough knee length dresses or long enough sleeves but it was a perfect fit ! I love everything about it! I highly recommend this dress! \" Read more \" ...It fit perfectly , is very comfortable and true to size. I received many compliments on it from the fit, style and even its color.... \" Read more \" ...It fit great ! It definitely hugs your body in all the right places. I washed it in a normal load of laundry and it did fine.... \" Read more \" Loved everything about this dress. The material, fit and comfort were great. I normally wear a size medium in dresses but sized down to a small. \" Read more 135 customers mention beauty, 132 positive, 3 negative 135 customers mention \"Beauty\" 132 positive 3 negative Customers find the dress beautiful, describing it as an elegant body-hugging dress that looks different for bachelorette parties, and one customer mentions it worked well for a pink-themed mother-daughter event. \" ...I ordered this dress, and it came very quickly, was beautiful , but was a very small size 16. I am not comfortable wearing it that tight.... \" Read more \" Beautiful dress ! Fit perfectly! Threw it into the washer on delicate, then hung it up to dry, no wrinkles!!! \" Read more \" ...It’s form fitting and sexy but not too revealing. The ruching is very flattering. My only complaint is that the material/stitching isn’t the best.... \" Read more \" Cute , stretchy, a nice little cocktail dress- I was impressed by it! The sleeves are cute, adds a nice flair to the dress! \" Read more 99 customers mention quality, 91 positive, 8 negative 99 customers mention \"Quality\" 91 positive 8 negative Customers find the dress to be well-made and of great quality. \" Great dress , just as pictured, it’s stretching and looks great good fabric, ordered black not see through would definitely order different colors.... \" Read more \" This was a nice dress , but as I went about my night, the elastic snapped on the leg part which is important to give the sleek look. I returned it \" Read more \" Good quality and good material. Stretchy. Nice fit as described. Only thing I didn't Luke is the neck line was flattering. \" Read more \" Perfect dress will buy more... \" Read more 73 customers mention comfort, 72 positive, 1 negative 73 customers mention \"Comfort\" 72 positive 1 negative Customers find the dress comfortable, noting that it isn't itchy at all. \" ...color, I got a size large and thrilled with the fit, not to tight, comfortable , good length, no issues with the zipper, perfect winter wedding guest... \" Read more \" ...Comes just past the knees and is very comfortable . I’m normally a Med but returned that and ordered a large so it wouldn’t be too tight or clingy.... \" Read more \" ...The price is right, it’s not see through where it matters and it’s comfy ! I wore it to a baby shower and it was perfect. Very stretchy ! \" Read more \" I love this dress so much !!! So comfortable and got it in different colors. Good for fall. Winter. Summer. Spring. Buy it when it’s on sale !!! \" Read more 58 customers mention flattering, 52 positive, 6 negative 58 customers mention \"Flattering\" 52 positive 6 negative Customers find the dress flattering, particularly noting how the ruching accentuates curves and hugs the body. \" Love this dress I received so many compliments. Stretchy, flattering great fit. This dress was true to size. I’m 183lbs ordered an XL. \" Read more \" ...I wish it had a small slit in the back but this dress was very flattering . The quality was not the best but still great for the price. \" Read more \" Has good stretch so size down for a form fitting look. Super flattering , great length that didn't ride up.... \" Read more \" This is such a sleek and flattering dress . Size small and fits with some stretch. This is the perfect dress for all black event or cocktail party. \" Read more 54 customers mention color, 52 positive, 2 negative 54 customers mention \"Color\" 52 positive 2 negative Customers love the dress's color, particularly noting that the red shade is true and soft, with one customer mentioning it's not orangey. \" I had to send it back. It wasn't the right style for my body. Beautiful color ! \" Read more \" Definitely as pictured. Love the color and it fits so well. Definitely needs spanx but a beautiful color for a fall wedding.... \" Read more \" The Teal is such a gorgeous color , I got a size large and thrilled with the fit, not to tight, comfortable, good length, no issues with the zipper,... \" Read more \" The dress fits perfectly. Very comfortable and sleek live it. The color is beautiful \" Read more 47 customers mention stretchiness, 46 positive, 1 negative 47 customers mention \"Stretchiness\" 46 positive 1 negative Customers appreciate the dress's stretchiness, with one noting its great elasticity. \" ...I loved the ruching and the sheer sleeves. The material is soft and stretchy , the fabric wasn't see-through and it felt like it was good quality.... \" Read more \" It's a great dress for any dressy occasion. It's very stretchy and the elastic around the neckline let's you place it wherever you'd like, off the... \" Read more \" Really stretchy ... \" Read more \" ...The dress is stretchy enough that I could get it on and off easily without unzipping it too much.... \" Read more 60 customers mention material quality, 35 positive, 25 negative 60 customers mention \"Material quality\" 35 positive 25 negative Customers have mixed opinions about the dress's material quality, with some loving it while others are not impressed with the fabric, finding it thin and cheap-looking. \" Loved everything about this dress. The material , fit and comfort were great. I normally wear a size medium in dresses but sized down to a small. \" Read more \" Poor quality fabric and workmanship - I returned it. \" Read more \" true to size, nice material , length great, no fuss wash instruction , can roll up and pack for traveling, No need to iron , and my favorite color,... \" Read more \" This dress is cute, but runs small. I am 5’5” and 113lbs. The fabric is thin so a slip may be needed underneath the dress. I gave it 3... \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Very Much Worth the Money",
        "body": "It fit so well, super comfortable, very classy, easy to move in, very much worth it! Would definitely wear again. Read more",
        "author": "Zoe Martinez",
        "rating": 5.0,
        "date": "November 26, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71C8ZdmAdyL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars I love this dress!!!",
        "body": "I love this dress! I’m 5’3” over 200lbs. This dress has just enough stretch that still hugs your body without being tight. I don’t know how they do it, however, this is the perfect dress for me! I will Buy more to keep for backup! I feel confident and sexy in this. Note: I was so excited to share a review, I didn’t put on a proper bra or do my hair!! Read more",
        "author": "D. Watkins",
        "rating": 5.0,
        "date": "September 7, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61GKFqIlGQL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/61CC+TzLHuL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars An elegant and comfortable bodycon dress",
        "body": "OBSESSED. I have a tummy from three babies and I am always trying to tuck it in or hide it. I needed a formal dress for a fancy dress code at a cousin's wedding and this dress checked all my boxes. It was very flattering in the tummy area and wasn't too tight but yet still form fitting. The material was great quality even after a washing. The sleeves had a thin translucent material but still held up great when chasing three kids at a wedding. I was super comfortable the whole night. The back came with a zipper and usually held everything in but yet I could still dance and bend over to dance with my kids. I LOVE LOVE this dress. Read more",
        "author": "Megan Hampton",
        "rating": 5.0,
        "date": "March 23, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/81WTEO+ql5L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "4.0 out of 5 stars Beautiful color",
        "body": "I loved this dress the color was beautiful. The bad thing was that the sleeves looked too big. I had to return it and it was too late to get a replacement for the wedding. Its a very nice dress. If you don't mind the sleeves looking a little too big then the dress is perfect. The price is great you dont break the bank on something you might not wear again if you dont go out often. The material and the quality of this dress are great. Read more",
        "author": "Bri",
        "rating": 4.0,
        "date": "November 16, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Nice!",
        "body": "Cute! It's a good option for cold months because there's multiple layers of fabric to create the cinch on the sides. Fits nice, great length, love that it has sleeves. 5'7\", 130ish pounds, and went with small. Some versatility in the neckline. Read more",
        "author": "Rachel",
        "rating": 5.0,
        "date": "October 25, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61nwUReESkL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/61eVaN1FIbL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/61gIxVido8L._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/614A9BtTWgL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars great dress",
        "body": "Very happy with this purchase. Super comfortable and looks/feels great. Got a LOT of compliments on it. Haven't cleaned/washed it yet so hope it will perform well. Read more",
        "author": "amy l",
        "rating": 5.0,
        "date": "November 5, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Cute, but material a little thin.",
        "body": "This was cute, it just wasn’t the most flattering on me. The fabric seemed a little bit thin. The length was as pictured, and so was the style and shape. It was comfortable but I found a dress I liked better. Read more",
        "author": "Elizabeth U.",
        "rating": 3.0,
        "date": "December 23, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71BWGp3SUWL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "4.0 out of 5 stars Very flattering, sexy but not revealing",
        "body": "I wore this to a semi formal gala for my husband’s work and received a lot of compliments. It’s form fitting and sexy but not too revealing. The ruching is very flattering. My only complaint is that the material/stitching isn’t the best. It’s really cute but doesn’t look like it will hold up well long term. However, at this price point it’s still a steal. Especially if you are only planning on wearing once for a formal event. Read more",
        "author": "Rhea Griggs",
        "rating": 4.0,
        "date": "December 8, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Ruched Bodycon Cocktail is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.",
  "about_this_item": "Womens Maxi Dress Ruched Bodycon Cocktail is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.",
  "long_description": "Womens Maxi Dress Ruched Bodycon Cocktail is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Brown, Lightblue, Apricot, Rose, Black, Orange, Darkgreen, Red, Plum, Pink, White, Purple, Darkblue, Teal. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Ruched Bodycon Cocktail is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Brown, Lightblue, Apricot, Rose, Black, Orange, Darkgreen, Red, Plum, Pink, White, Purple, Darkblue, Teal. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "9f7372cf-00d1-4173-a505-eae1c4c393bd",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9f7372cf-00d1-4173-a505-eae1c4c393bd/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9f7372cf-00d1-4173-a505-eae1c4c393bd/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "7b5b0f96-52aa-4778-8702-b435a54d0c7d",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7b5b0f96-52aa-4778-8702-b435a54d0c7d/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7b5b0f96-52aa-4778-8702-b435a54d0c7d/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "b4fb8faf-9f96-4382-b962-a22de2a850fe",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b4fb8faf-9f96-4382-b962-a22de2a850fe/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b4fb8faf-9f96-4382-b962-a22de2a850fe/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "7fc667c9-1ca1-48f5-87cc-8a61d76f55ae",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7fc667c9-1ca1-48f5-87cc-8a61d76f55ae/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7fc667c9-1ca1-48f5-87cc-8a61d76f55ae/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "60707abb-8ccb-4d97-83d7-0b157abf7bb5",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/60707abb-8ccb-4d97-83d7-0b157abf7bb5/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/60707abb-8ccb-4d97-83d7-0b157abf7bb5/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "52c56ee0-70e4-4bc5-9234-25ff83370038",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/52c56ee0-70e4-4bc5-9234-25ff83370038/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/52c56ee0-70e4-4bc5-9234-25ff83370038/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "c308f796-05a9-4ce3-b506-c21c1fe25d95",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c308f796-05a9-4ce3-b506-c21c1fe25d95/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c308f796-05a9-4ce3-b506-c21c1fe25d95/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "b8913731-906c-4ae0-a3aa-8bce9ca22498",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b8913731-906c-4ae0-a3aa-8bce9ca22498/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b8913731-906c-4ae0-a3aa-8bce9ca22498/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "f34a704f-c67a-432d-bb98-873bcf519f7d",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f34a704f-c67a-432d-bb98-873bcf519f7d/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f34a704f-c67a-432d-bb98-873bcf519f7d/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "a3b5da78-794b-4162-881e-5932ee816b1a",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a3b5da78-794b-4162-881e-5932ee816b1a/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a3b5da78-794b-4162-881e-5932ee816b1a/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "166b057d-7e42-432e-be9e-2474c9b7f9ae",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/166b057d-7e42-432e-be9e-2474c9b7f9ae/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/166b057d-7e42-432e-be9e-2474c9b7f9ae/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "16e67ef1-77bb-431f-934c-1b78ad2aba77",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/16e67ef1-77bb-431f-934c-1b78ad2aba77/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/16e67ef1-77bb-431f-934c-1b78ad2aba77/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Brown": "https://m.media-amazon.com/images/I/31eG9Qss5zL._AC_SR38,50_.jpg",
    "Lightblue": "https://m.media-amazon.com/images/I/31OQb+BOhbL._AC_SR38,50_.jpg",
    "Apricot": "https://m.media-amazon.com/images/I/31VXirBreGL._AC_SR38,50_.jpg",
    "Rose": "https://m.media-amazon.com/images/I/31FJ7VyHZXL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31Ok4+qYtsL._AC_SR38,50_.jpg",
    "Orange": "https://m.media-amazon.com/images/I/31fImrssIjL._AC_SR38,50_.jpg",
    "Darkgreen": "https://m.media-amazon.com/images/I/31YyzTW7suL._AC_SR38,50_.jpg",
    "Red": "https://m.media-amazon.com/images/I/31T8zaw8A0L._AC_SR38,50_.jpg",
    "Plum": "https://m.media-amazon.com/images/I/317F1kv9pnL._AC_SR38,50_.jpg",
    "Pink": "https://m.media-amazon.com/images/I/31Gd1CJu+FL._AC_SR38,50_.jpg",
    "White": "https://m.media-amazon.com/images/I/31ioS9zD0xL._AC_SR38,50_.jpg",
    "Purple": "https://m.media-amazon.com/images/I/31g0GA7egHL._AC_SR38,50_.jpg",
    "Darkblue": "https://m.media-amazon.com/images/I/31yQOvWY85L._AC_SR38,50_.jpg",
    "Teal": "https://m.media-amazon.com/images/I/31vZoUg2iZL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Brown": "71YbgNf89qL",
    "Lightblue": "71hmTg+luSL",
    "Apricot": "71LI7DoKfCL",
    "Rose": "716rH8z2wlL",
    "Black": "61n1ZdxRnUL",
    "Orange": "71I2FJwZFoL",
    "Darkgreen": "71sxeOCngGL",
    "Red": "7180ETqzDqL",
    "Plum": "71XYf4ranIL",
    "Pink": "71lqrgHT+OL",
    "White": "61ofjCdZtrL",
    "Purple": "71lhAmkE-vL",
    "Darkblue": "715kDbUIc9L",
    "Teal": "71xCu8inFQL"
  },
  "color_images": {
    "Brown": [
      "https://m.media-amazon.com/images/I/71YbgNf89qL._SL1500_.jpg"
    ],
    "Lightblue": [
      "https://m.media-amazon.com/images/I/71hmTg+luSL._SL1500_.jpg"
    ],
    "Apricot": [
      "https://m.media-amazon.com/images/I/71LI7DoKfCL._SL1500_.jpg"
    ],
    "Rose": [
      "https://m.media-amazon.com/images/I/716rH8z2wlL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/61n1ZdxRnUL._SL1500_.jpg"
    ],
    "Orange": [
      "https://m.media-amazon.com/images/I/71I2FJwZFoL._SL1500_.jpg"
    ],
    "Darkgreen": [
      "https://m.media-amazon.com/images/I/71sxeOCngGL._SL1500_.jpg"
    ],
    "Red": [
      "https://m.media-amazon.com/images/I/7180ETqzDqL._SL1500_.jpg"
    ],
    "Plum": [
      "https://m.media-amazon.com/images/I/71XYf4ranIL._SL1500_.jpg"
    ],
    "Pink": [
      "https://m.media-amazon.com/images/I/71lqrgHT+OL._SL1500_.jpg"
    ],
    "White": [
      "https://m.media-amazon.com/images/I/61ofjCdZtrL._SL1500_.jpg"
    ],
    "Purple": [
      "https://m.media-amazon.com/images/I/71lhAmkE-vL._SL1500_.jpg"
    ],
    "Darkblue": [
      "https://m.media-amazon.com/images/I/715kDbUIc9L._SL1500_.jpg"
    ],
    "Teal": [
      "https://m.media-amazon.com/images/I/71xCu8inFQL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-long-sleeve-bodycon-ruched-maxi-cocktail",
      "title": "Womens Maxi Dress Long Sleeve Bodycon Ruched Maxi Cocktail",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/51YdcAHT9EL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 42.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71uOGI9UqTL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-long-sleeve-formal",
      "title": "Womens Maxi Dress Evening Long Sleeve Formal",
      "price": 84.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61Jb5jEHEaL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-long-sleeve-bodycon",
      "title": "Womens Maxi Dress Cocktail Long Sleeve Bodycon",
      "price": 29.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/714yg-qAdoL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 159.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61jikXfPw8L._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress-ruched",
      "title": "Womens Dress Ruched",
      "price": 35.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61YDTNHdFaL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-ruched-cocktail",
      "title": "Womens Maxi Dress Long Sleeve Ruched Cocktail",
      "price": 37.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61++AVDEcML._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-short-sleeve-mermaid",
      "title": "Womens Dress Short Sleeve Mermaid",
      "price": 84.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/610a63m8wXL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 28.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/617xe6+OdfL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-ruched",
      "title": "Womens Maxi Dress Ruched",
      "price": 74.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61cqo1MVn+L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-ruched-bodycon-v-neck",
      "title": "Womens Maxi Dress Long Sleeve Ruched Bodycon V Neck",
      "price": 33.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51AvldIvTmL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 35.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/616QlL-XUWL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 37.79,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51WFZKRzSdL._SL1500_.jpg"
      ]
    }
  ]
}