{
  "id": "womens-maxi-dress-cocktail-bodycon-ruched-long-sleeve",
  "handle": "womens-maxi-dress-cocktail-bodycon-ruched-long-sleeve",
  "sku": "JC1768",
  "asin": "B0CGWRCWX7",
  "title": "Womens Maxi Dress Cocktail Bodycon Ruched Long Sleeve",
  "title_original": "LAGSHIAN Women's Cocktail Bodycon Long Sleeve Mock Neck Mesh Ruched Midi Party Dress",
  "brand": "Visit the LAGSHIAN Store",
  "price": 41.99,
  "social_proof": {
    "bought_past_month": 68,
    "text": "68+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/41Szm0KzP5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61o41urgfBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/7129lWPGEiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61HWsfsnIJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61jXmAQFjfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/6190fwCjmxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/613ENwO3XhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/515esxQr24L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51iAkEK+wJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41WieB6KNqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51UfGd0+EVL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/515KwjjTNkL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/41Szm0KzP5L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61o41urgfBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/7129lWPGEiL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61HWsfsnIJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61jXmAQFjfL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/6190fwCjmxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/613ENwO3XhL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/515esxQr24L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51iAkEK+wJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41WieB6KNqL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51UfGd0+EVL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/515KwjjTNkL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Item model number ‏": "‎ LA260",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ August 30, 2023",
    "ASIN ‏": "‎ B0CGWPWJTJ",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#40,930 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #200 in Women's Club & Night Out Dresses",
    "Customer Reviews": "4.6 4.6 out of 5 stars (756)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Red",
      "White",
      "Royalblue",
      "Black",
      "Green"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.6,
    "count": 756,
    "customers_say": "Customers find the dress fits well, with one noting it comes down to the calves, and appreciate its flattering design that hugs curves. The material receives positive feedback for being nice, not too thick, and comfortable, with one customer mentioning it allows skin to breathe. They like its stretchiness and color, with one noting how the rouge-nature helps hide underwear lines and imperfections. Select to learn more Fit Style Quality Flattering Material quality Comfort Stretchiness Color 105 customers mention \"Fit\" 95 positive 10 negative Customers find the dress fits well, with one mentioning it tucks and holds all the curves appropriately, while another notes it comes down to the calves. \" Great fit . Very comfortable. I could go out looking amazing and not freeze without a coat. Perfect for fall or winter.\" Read more \" Fits perfectly ! I enjoyed wearing this cocktail dress to a Birthday Party!\" Read more \"This dress is soo soft and fit and flatters my curves. This is a dress for the fall/winter time. Love how it feel on my body....\" Read more \"230lbs 6’2 I ordered an XL in black and red. Perfect fit . Just placed an order for the blue and white one.\" Read more 83 customers mention \"Style\" 78 positive 5 negative Customers find the dress gorgeous and sexy, with one mentioning it looks like an expensive dress. \"I did not like that my size was too fat for this beautiful dress . I loved the dress, but not on mel\" Read more \"This was a nice fitting dress. Beautiful I am going to order another color. It's a must have in the closet....\" Read more \"This dress is sexy and classy . Sophisticated ladies it is a must that you purchase this dress. The material is of quality and it's true to size.\" Read more \"This dress is sexy and hides all of your imperfections.\" Read more 70 customers mention \"Quality\" 68 positive 2 negative Customers find the dress to be of high quality. \"... Great quality , it wasn't see through or thin. I give it a 10/10 honestly. I'd purchase again in different colors if need be. Definitely recommend!\" Read more \"I absolutely love this dress . You only need help closing it .\" Read more \"I got this dress for my birthday this was a nice dress I got a xl that a good size for me if you weight around 160-200 or may be a little more...\" Read more \"This dress was great! Very classy but still a little sexy. Good quality \" Read more 52 customers mention \"Flattering\" 47 positive 5 negative Customers find the dress flattering, particularly noting how it hugs and accentuates their curves. \"...I am 5’7 and 120 lbs and the small is form fitting but flattering . This dress doesn’t wrinkle at all, throw it in a bag and go. So easy....\" Read more \"This dress is very flattering . The style hides some flaws if the dress isn't too tight. I ordered a size up so that it wont be super clingy....\" Read more \"I like the dress. It is very figure flattering . However it is heavier than expected. I ordered it for an all white event but it’s an outdoor venue.\" Read more \"...This dress is so flattering , stretchy and comfortable. And it looks EXPENSIVE....\" Read more 47 customers mention \"Material quality\" 42 positive 5 negative Customers like the material of the dress, finding it beautiful and not too thick, with one customer noting that it allows skin to breathe. \"...It is lined, it is great material and looks so good on. I ordered a small and it fit perfect. 5'6 and 115 lbs....\" Read more \"This dress looks amazing on curvy bodies, and the material is great !\" Read more \" Love the dress and material .\" Read more \"Fit was perfect, fabric was soft , good value for money spent\" Read more 45 customers mention \"Comfort\" 45 positive 0 negative Customers find the dress comfortable. \"This dress was so comfortable and sheek! Overall, so happy with my purchase. It was very stretchy, thick and cut so well for my curvy body type!...\" Read more \"... Very comfortable and very flattering in curves. I’m 5”2 and 215 lbs in a 38dd . I wanna get it in a diff color as well. Maybe soon.\" Read more \"...This dress hid all the problems areas and was super comfortable . I’ll be buying in other colors!\" Read more \"...It makes you feel beautiful and confident. The material is stretchy and comfy but hides all the bumps you don’t want showing....\" Read more 33 customers mention \"Stretchiness\" 32 positive 1 negative Customers appreciate the dress's stretchiness, with one mentioning it has lots of elasticity. \"This dress is perfect! The material is soft and stretchy and it fits my curves without looking or feeling tight. It’s lined and so comfortable.\" Read more \"...it early just incase I did not like it but I love it the material is stretchy so it doesn't fit tight and I can move around in it I purchased a XXL...\" Read more \"...Overall, so happy with my purchase. It was very stretchy , thick and cut so well for my curvy body type! Highly recommend this dress!...\" Read more \"Good quality and stretch . Vibrant color fits like a glove. Love it\" Read more 29 customers mention \"Color\" 28 positive 1 negative Customers love the color of the dress, with one mentioning that the rouge-nature helps hide underwear lines and imperfections. \" Beautiful color , fit very well and got so many compliments!\" Read more \"...I love this dress for it stretchy comfort, color & affordability. I had headshots done in this dress & the color just pops!...\" Read more \" Color was beautiful but the quality of material and the overall shape of the dress was not what I expected or wanted....\" Read more \"Medium, Green. This dress is amazing! The color was so beautiful . It hugs the body but is not tight or restricting at all....\" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Purchased as a Christmas dress for my wife - she loved it",
        "body": "Very nice dress. True to size and looks like the pictures. The fabric is good quality and is not see-thru at all. Material looks thick when worn, probably because of the ruching. The dress fits well and is flattering. Snugs every curve but is not restrictive like some other dresses. Doesn't ride up either A nice choice for a formal occasion but might be too warm for summer wear despite being breathable. Care instructions advise to hand wash which is not as convenient as something that can be machine washed. No negatives about this dress. It's a great value. Read more",
        "author": "BP",
        "rating": 5.0,
        "date": "December 27, 2024",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Perfect Fit for a Classy Night Out!",
        "body": "I recently purchased the LAGSHIAN Women's Cocktail Bodycon Long Sleeve Mock Neck Mesh Ruched Midi Party Dress, and I couldn't be happier with my choice! As someone who's 5'2\" and 139 pounds, I was a bit skeptical about ordering a dress online, but this one fit like a dream. The sizing was true to size, and it accentuated my curves beautifully. The quality of this dress is top-notch. It feels well-made and comfortable to wear, which is crucial for a long evening out. The mesh and ruched design give it a classy and sophisticated look, making it perfect for any special occasion or cocktail event. I received numerous compliments on the dress, and I felt confident and elegant throughout the night. If you're looking for a stylish and well-fitting dress that's true to size, I highly recommend the LAGSHIAN Bodycon Midi Party Dress. It's a fantastic addition to any wardrobe, and I'm extremely pleased with my purchase! Read more",
        "author": "kyteecher",
        "rating": 5.0,
        "date": "November 5, 2023",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Fits and looks exactly as expected- comfy and flattering!",
        "body": "Absolutely LOVE this dress! Color is exactly as pictured, vibrant and beautiful. Fits great- I am 5'3\", about 180lb, G cup bra and 3 months pregnant (with a larger than average belly). Plenty of stretch and still flattering! I'm definitely getting this in more colors. Read more",
        "author": "Samantha Vance",
        "rating": 5.0,
        "date": "March 17, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Purchase in any color other than green",
        "body": "This dress was a much brighter green than i needed and I think that the color made it look cheap. I'm giving it four starts because there is a customer review where the dress looks the green I expected it to be so maybe I just got a bad color batch. It fits nice. The material is not see through. The Fabric is polyester and something so it is just awful. I can't see even wearing it to a holiday party. It's just such a bad green for the cheap material. I have a number of dresses from this company and love them not sure what happened with this green dress. Read more",
        "author": "tls78754",
        "rating": 4.0,
        "date": "September 16, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Curve-Hugging, Show-Stopper! BUY IT!",
        "body": "This dress is everything I hoped for and more! It hugs my curves in all the right places, creating a sleek and stunning silhouette that turned heads. The material is soft, stretchy, and comfortable while still feeling high-quality. The fabric is thick enough to give a good snatch to problem areas while also being warm. The zipper was perfectly functional and feels sturdy. The red is a rich, vibrant color, and you are going to stand out at any event. It’s a true confidence booster—I felt like a total show-stopper wearing it! The ruched details add a flattering touch, and the long sleeves and mock neck make it classy and chic. Highly recommend for anyone looking for a dress that combines style, sophistication, and a dash of daring! I have bought two other colors at this great value. Read more",
        "author": "Sed",
        "rating": 5.0,
        "date": "December 29, 2024",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71v1QLCZ-AL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars True to Size",
        "body": "Very elegant and fits perfect. Ty Read more",
        "author": "Jen",
        "rating": 5.0,
        "date": "December 8, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Get The Dress!!",
        "body": "This dress was perfect! It's true to size, I ordered a large, I'm 5'3, 5'4 ish & about 185. This dress snatches you up in all the right places, it's like you have a built in entire body trainer:) Jazz it up with a statement neck piece & bracelet & good to go. Great quality, it wasn't see through or thin. I give it a 10/10 honestly. I'd purchase again in different colors if need be. Definitely recommend! Read more",
        "author": "Nikki Laniece",
        "rating": 5.0,
        "date": "November 18, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/41yTe6b8AdL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Great for curves!",
        "body": "This dress looks amazing on curvy bodies, and the material is great! Read more",
        "author": "Leah",
        "rating": 5.0,
        "date": "November 25, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Cocktail Bodycon Ruched Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.",
  "about_this_item": "Womens Maxi Dress Cocktail Bodycon Ruched Long Sleeve is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.",
  "long_description": "Womens Maxi Dress Cocktail Bodycon Ruched Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Red, White, Royalblue, Black, Green. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Cocktail Bodycon Ruched Long Sleeve is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Red, White, Royalblue, Black, Green. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "f32ca03d-f79d-430f-842f-3b576aaf0386",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f32ca03d-f79d-430f-842f-3b576aaf0386/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f32ca03d-f79d-430f-842f-3b576aaf0386/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "4e67430c-1c69-4623-a4a0-6adcc4e03948",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4e67430c-1c69-4623-a4a0-6adcc4e03948/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4e67430c-1c69-4623-a4a0-6adcc4e03948/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "6ab63f9d-9ada-483c-817f-d3c3a3c59dee",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6ab63f9d-9ada-483c-817f-d3c3a3c59dee/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6ab63f9d-9ada-483c-817f-d3c3a3c59dee/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "8746be6a-3e5e-4581-bf9c-9218e8bdc269",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8746be6a-3e5e-4581-bf9c-9218e8bdc269/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8746be6a-3e5e-4581-bf9c-9218e8bdc269/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "e1a6142d-c542-4e44-aa49-5ad2f495cb5a",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e1a6142d-c542-4e44-aa49-5ad2f495cb5a/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e1a6142d-c542-4e44-aa49-5ad2f495cb5a/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "cac7a45e-6b00-4175-bb04-5ae93aacdfe4",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/cac7a45e-6b00-4175-bb04-5ae93aacdfe4/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/cac7a45e-6b00-4175-bb04-5ae93aacdfe4/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "fa17ff36-1fa0-4180-a2fc-80f9488ee32a",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/fa17ff36-1fa0-4180-a2fc-80f9488ee32a/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/fa17ff36-1fa0-4180-a2fc-80f9488ee32a/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "2493e525-dcd2-4dbc-b0be-0b55b5850f0a",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2493e525-dcd2-4dbc-b0be-0b55b5850f0a/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2493e525-dcd2-4dbc-b0be-0b55b5850f0a/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "9f3df6be-17e1-46e1-8ed8-9c44f9eb0c77",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9f3df6be-17e1-46e1-8ed8-9c44f9eb0c77/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9f3df6be-17e1-46e1-8ed8-9c44f9eb0c77/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "c0db65ee-01ec-4230-83e3-96b6472560e6",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c0db65ee-01ec-4230-83e3-96b6472560e6/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c0db65ee-01ec-4230-83e3-96b6472560e6/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "53a50f75-1b64-419c-8e50-ae10c5c9600c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/53a50f75-1b64-419c-8e50-ae10c5c9600c/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/53a50f75-1b64-419c-8e50-ae10c5c9600c/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "afe29b56-4e6a-4c7c-8f03-be3bed1ebd65",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/afe29b56-4e6a-4c7c-8f03-be3bed1ebd65/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/afe29b56-4e6a-4c7c-8f03-be3bed1ebd65/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Red": "https://m.media-amazon.com/images/I/317EDV5wBlL._AC_SR38,50_.jpg",
    "White": "https://m.media-amazon.com/images/I/31yvuTzsb6L._AC_SR38,50_.jpg",
    "Royalblue": "https://m.media-amazon.com/images/I/31X7wDZJxIL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31PYEESq8ZL._AC_SR38,50_.jpg",
    "Green": "https://m.media-amazon.com/images/I/31QWqRq+rKL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Red": "51iAkEK+wJL",
    "White": "41WieB6KNqL",
    "Royalblue": "51UfGd0+EVL",
    "Black": "41Szm0KzP5L",
    "Green": "515KwjjTNkL"
  },
  "color_images": {
    "Red": [
      "https://m.media-amazon.com/images/I/51iAkEK+wJL._SL1500_.jpg"
    ],
    "White": [
      "https://m.media-amazon.com/images/I/41WieB6KNqL._SL1500_.jpg"
    ],
    "Royalblue": [
      "https://m.media-amazon.com/images/I/51UfGd0+EVL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/41Szm0KzP5L._SL1500_.jpg"
    ],
    "Green": [
      "https://m.media-amazon.com/images/I/515KwjjTNkL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 33.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61u9MU0UihL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-formal-one-shoulder",
      "title": "Womens Maxi Dress Maxi Formal One Shoulder",
      "price": 54.95,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51F48iZSHML._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi",
      "title": "Womens Maxi Dress Maxi",
      "price": 139.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71bWQZrKZnL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-mermaid-long-sleeve-off-shoulder",
      "title": "Womens Maxi Dress Formal Mermaid Long Sleeve Off Shoulder",
      "price": 72.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51XjeQ1BlFL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-cocktail-mermaid-evening-split-maxi",
      "title": "Womens Maxi Dress Formal Cocktail Mermaid Evening Split Maxi",
      "price": 72.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71CJS69x3xL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 39.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71vtAwYcALL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-cocktail-v-neck-bodycon-ruched",
      "title": "Womens Maxi Dress Long Sleeve Cocktail V Neck Bodycon Ruched",
      "price": 50.89,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61XIqlacJXL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi",
      "title": "Womens Maxi Dress Maxi",
      "price": 28.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61mK4Ledu8L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-sleeveless",
      "title": "Womens Dress Sleeveless",
      "price": 54.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51PjUeKGq8L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-off-shoulder-bodycon-short-sleeve",
      "title": "Womens Dress Off Shoulder Bodycon Short Sleeve",
      "price": 36.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61xnaiSYhML._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening-cocktail",
      "title": "Womens Maxi Dress Formal Evening Cocktail",
      "price": 46.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/51+uOaKMpBL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 28.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51KJxZ6xlhL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail-v-neck",
      "title": "Womens Dress Cocktail V Neck",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/712spNNP9kL._SL1500_.jpg"
      ]
    }
  ]
}