{
  "id": "womens-maxi-dress-v-neck-long-sleeve-bodycon",
  "handle": "womens-maxi-dress-v-neck-long-sleeve-bodycon",
  "sku": "JC2546",
  "asin": "B0CDBRFTM4",
  "title": "Womens Maxi Dress V Neck Long Sleeve Bodycon",
  "title_original": "Sidefeel Womens 2025 Fall Winter Ribbed Knit Sweater Dress Casual Long Sleeve Sexy V Neck Bodycon Mini Dress",
  "brand": "Visit the Sidefeel Store",
  "price": 30.59,
  "social_proof": {
    "bought_past_month": 572,
    "text": "572+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/71a0x4LTzmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71RdArjMsrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81vrNHByqSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81gHOOTzRVL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81WBe4ng6aL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81hOgzDG-BL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81XVpIcYh6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/713RRWZrGQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81rKQ136-mL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81-AKbao95L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81x5q1tV4iL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81V9tV9L8SL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/810iP8A86FL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81l6BWFZDZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81mX9yruE+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81wWFXDopFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81ilWDvXV3L._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/71a0x4LTzmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71RdArjMsrL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81vrNHByqSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81gHOOTzRVL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81WBe4ng6aL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81hOgzDG-BL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81XVpIcYh6L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/713RRWZrGQL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81rKQ136-mL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81-AKbao95L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81x5q1tV4iL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81V9tV9L8SL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/810iP8A86FL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81l6BWFZDZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81mX9yruE+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81wWFXDopFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81ilWDvXV3L._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ August 1, 2023",
    "Manufacturer ‏": "‎ Sidefeel",
    "ASIN ‏": "‎ B0CDBTFGCK",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#6,813 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #145 in Women's Pullover Sweaters #200 in Women's Dresses",
    "Customer Reviews": "4.3 4.3 out of 5 stars (483)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Sweaters > Pullovers",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Brown",
      "Gray",
      "Burgundy",
      "Apricot",
      "Army Green",
      "Hot Pink",
      "Black",
      "Orange",
      "Khaki",
      "Pink",
      "White",
      "Dark Blue",
      "Green"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.3,
    "count": 483,
    "customers_say": "Customers love this sweater's style, particularly the V-neck that adds a touch of sexy, and appreciate its fantastic fit that hugs curves without being tight. The dress is well-made, comfortable, and flattering, with one customer noting it shows off the figure without clinging. Customers praise its color, with one highlighting the crisp white version, and its soft, ribbed knit texture. They find it perfect for fall and winter wear, making it a versatile wardrobe staple for both casual outings and formal occasions. Select to learn more Style Fit Quality Comfort Flattering Color Softness Fall/winter dress 80 customers mention \"Style\" 79 positive 1 negative Customers find the sweater gorgeous, particularly appreciating the V-neck design that adds a touch of sexy, with one customer noting the attractive detail on the sleeve. \" Super cute , flattering around the waist, shows off your figure without clinging, I would say true to size but maybe slightly on the larger side, I...\" Read more \"This dress is so cute !! I got the pink dress and I am pairing it with white cowgirl boots. SO CUTE!! I might have to buy it in another color....\" Read more \"...It's the perfect combination of cozy and stylish , making it ideal for the cooler months. Here are my thoughts: Fit: The fit is fantastic!...\" Read more \"This bodycon sweater dress is actually so cute and hugs your curves in all the right places....\" Read more 78 customers mention \"Fit\" 69 positive 9 negative Customers are satisfied with how the sweater fits, describing it as soft and sexy, with one customer noting that it hugs the curves without being tight. \"...I actually purchased this for a maternity dress and it fits perfectly how I wanted it to. I will also wear a slip under it.\" Read more \"Adorable and fits well . Some of the stitching makes it look cheap, like the neckline. It is extremely SEE-THROUGH. You must wear something under it....\" Read more \" Great fit , very flaterring. Im 5'6\" and lenght is above the knee but still comfortable....\" Read more \"It fits true to size . Great thick fabric. Flattering silhouette. Has stretch And still the fabric is soft to touch. Steal for the price.\" Read more 54 customers mention \"Quality\" 45 positive 9 negative Customers find the sweater well-made, with one customer specifically noting the well-done stitching. \"...sleeve is an extra touch that I love, it is super comfortable, of good quality and the ribbed knit texture is a very cool touch for fall.\" Read more \" Love this dress ! I’m 5’11 200 lbs. Bought a Large. Fits me perfectly and I feel confident in it!\" Read more \"This is a great dress .\" Read more \"My perfect dress . Loved the way it fits and very comfortable. No issues. Need more colors now.\" Read more 51 customers mention \"Comfort\" 51 positive 0 negative Customers find the sweater comfortable and cozy, with one mentioning it highlights their figure without causing discomfort. \"...It doesn't Cling to you like a \"Body-Con\" fit, it is comfortable and the sleeves are full and gathered at the wrists making it look and feel dressy....\" Read more \"It was very comfortable and warm, true to size ( I'm 5'4\" 118lbs ordered a Small), the quality of the material exceeded my expectations, it was a...\" Read more \"...the Vneck and ribbed waistline are flattering and the dress warm and cozy ! I’m very happy with this purchase!\" Read more \"...the detail on the sleeve is an extra touch that I love, it is super comfortable , of good quality and the ribbed knit texture is a very cool touch...\" Read more 38 customers mention \"Flattering\" 36 positive 2 negative Customers find the sweater flattering, particularly noting how the bodycon style hugs their curves, with one customer mentioning it shows off their figure without clinging. \"...right amount of stretch to be super comfortable while still being flattering . It hugs in the right places without feeling tight....\" Read more \"Very soft, very flattering , princess seaming, and lightly puffed shoulders. Wore this out to dinner and a speakeasy in the city....\" Read more \"Really love this. It's super flattering and comfortable. The ribbed knit is soft, and the fit hugs in all the right places....\" Read more \"This dress is incredibly flattering . I The length was great, and the material was excellent. Perfect winter dress with boots.\" Read more 34 customers mention \"Color\" 28 positive 6 negative Customers love the color of the sweater, with many appreciating the nice orange fall dress and perfect baby pink shade, while others describe it as the best little black dress. \"...Love the style, fit and was comfortable and kept me warm. Loved the color as well, will order again in another color!\" Read more \" Beautiful black dress ! Fabric is thick like sweater material and great for winter wear. It hangs perfect around the arms and runs about calf length....\" Read more \"...The I got the more brown color, perfect fall color . I love the way it covers the boobs but left a little bit to show off....\" Read more \"Very cute sweater dress, beautiful color ....\" Read more 32 customers mention \"Softness\" 32 positive 0 negative Customers find the sweater soft and appreciate the feel of the knit, with one customer noting that the ribbed texture adds a nice visual detail. \"...a medium-weight to it so it feels like it will stay in place, plus is soft . The color is exactly what was pictured....\" Read more \"...Great fit and not too short as I am 5\"3'. Love the feel of the knit. Very soft and it hugs all the curves in just the right places with enough...\" Read more \"Made really well, I love the material. It is so soft and fits so well.\" Read more \"...The softness and weight is just enough workout weigh you down. The neck line and area lays very nice on your collar bone and can be worn w/ most bras.\" Read more 31 customers mention \"Fall/winter dress\" 31 positive 0 negative Customers love this sweater as a fall and winter dress, describing it as a versatile wardrobe staple that works well for outdoor and indoor parties, casual outings, and everyday wear. \"Love this dress! Super comfy, flattering fit, and perfect for fall and winter . Easy to dress up with boots or wear casual. Definitely a new favorite!\" Read more \"...Was a great date night dress . Really soft and comfortable. Washed and hung to dry well....\" Read more \" Great fall/winter dress !...\" Read more \"...It’s still very fitted but looks classy. Love this color. Perfect for fall \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Perfect for Fall & Winter – Stylish, Comfortable, and Flattering!",
        "body": "I absolutely love this Sidefeel Ribbed Knit Sweater Dress! It's the perfect combination of cozy and stylish, making it ideal for the cooler months. Here are my thoughts: Fit: The fit is fantastic! The bodycon style hugs my curves in all the right places without being too tight or uncomfortable. It’s form-fitting but still gives enough stretch to move easily. I went with my usual size, and it fits perfectly. The V-neckline adds a sexy yet sophisticated touch. Material: The knit fabric is soft and not too thick, so it's perfect for layering with a coat or scarf, but still breathable. It’s also incredibly comfortable – no itching or discomfort, even after wearing it all day. The ribbed texture adds a nice visual detail without being too overwhelming. Versatility: I’ve worn this dress for both casual outings and dressier events. You can easily dress it down with a pair of boots for a day out, or add heels and accessories for a night out. It’s super versatile, and the rich color options make it easy to pair with different accessories. Quality: The stitching is well-done, and the fabric has held up after multiple washes (I always air dry it to preserve the shape). It hasn't lost its shape or color, which I really appreciate. Overall, I’m extremely happy with this purchase. It’s a great wardrobe staple for fall and winter that combines comfort, style, and versatility. Highly recommend it! Read more",
        "author": "Juja",
        "rating": 5.0,
        "date": "August 25, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/81+lWEr5B8L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars ⭐️⭐️⭐️⭐️⭐️ Perfect White Sweater Dress – Classy, Cozy, and Flattering",
        "body": "This white sweater dress is absolutely perfect. The material is soft, thick enough that it’s not see-through, and has just the right amount of stretch to be super comfortable while still being flattering. It hugs in the right places without feeling tight. I’ve worn it dressed up with boots and also more casual with sneakers, and it looks amazing both ways. The length is just right, the white is a true crisp white, and it doesn’t look cheap at all. I also love that it keeps you warm without being bulky. I got so many compliments the first time I wore it, and I’ll definitely be ordering it in more colors. If you’re on the fence—get it. It’s a staple piece you’ll wear over and over again Read more",
        "author": "Jsamluck",
        "rating": 5.0,
        "date": "December 7, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71u9YnEBVnL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71kmqGXGhkL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Amazing dress",
        "body": "I absolutely love the Sidefeel Women’s 2025 Fall Winter Ribbed Knit Sweater Dress! The material is soft, warm, and super comfortable, making it perfect for the colder months. The ribbed knit design hugs the body in all the right places, giving a flattering bodycon fit without feeling too tight. The V-neckline adds just the right touch of sexy while still keeping it classy, and the long sleeves make it cozy and stylish Read more",
        "author": "Elianne Delgado",
        "rating": 5.0,
        "date": "August 21, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61sCqMR0oSL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/611MJyzSoRL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Very nice!",
        "body": "Beautiful ribbed knit sweater dress, both comfortable and elegant. The bodycon fit highlights the silhouette, while the V-neckline adds a feminine touch. Warm yet lightweight, perfect for fall and winter. Easy to style with boots or heels. A chic, versatile piece every wardrobe needs. Read more",
        "author": "Juanderlie Josema",
        "rating": 5.0,
        "date": "August 24, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71aCTE1847L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "4.0 out of 5 stars Fits well BUT see-through",
        "body": "Adorable and fits well. Some of the stitching makes it look cheap, like the neckline. It is extremely SEE-THROUGH. You must wear something under it. It’s so see-through, I can’t stress this enough. I wore with fleece lined leggings and a black tank top. I’m 5”7’ - 130lbs and ordered a small. Read more",
        "author": "Fran",
        "rating": 4.0,
        "date": "November 29, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71IVqYSD-KL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71bRBIPG1zL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Great Fall Dress!",
        "body": "This is the kind of dress that you just can't wait for the cooler temps so you can wear it! It is just beautiful and so, so comfortable. Hugs my curves where it should, thanks to the stretchiness of the fabric, but doesn't highlight my stomach area that I struggle with. The material is a mid-weight sweater material and appears to be very well made. Love the pink - very eye-catching, but a warmer, fall tone. I'm 5'4\", 130 lbs and the small fits me great. Definitely recommend as a comfortable, beautiful and stylish addition to your autumn wardrobe. Read more",
        "author": "Spencer's Mom",
        "rating": 5.0,
        "date": "July 21, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Cute silhouette with nice details, cream color very see through",
        "body": "Cute silhouette with nice details at the wrist and bra line to make this a more fitted sweater dress. V neck was appropriately classy, not too low cut. Only complaint is the light color is very see through. Putting a nude bodyshaper underneath solved the issue but without it even nude undergarments were visible. Read more",
        "author": "Customer",
        "rating": 3.0,
        "date": "November 8, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Flattering and So Comfortable!",
        "body": "I’m 5’2” and 135 lbs and got a size small—it fits perfectly! This dress is super flattering, hugs in all the right places, and the ribbed knit fabric is soft and cozy without being too thick. The V-neck adds a nice touch, and it’s the perfect length for fall with boots or tights. I already want it in more colors. Definitely a great staple for the cooler months! Read more",
        "author": "Tiffany Deram",
        "rating": 5.0,
        "date": "October 21, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress V Neck Long Sleeve Bodycon is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.",
  "about_this_item": "Womens Maxi Dress V Neck Long Sleeve Bodycon is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.",
  "long_description": "Womens Maxi Dress V Neck Long Sleeve Bodycon is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Brown, Gray, Burgundy, Apricot, Army Green, Hot Pink, Black, Orange, Khaki, Pink, White, Dark Blue, Green. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress V Neck Long Sleeve Bodycon is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Brown, Gray, Burgundy, Apricot, Army Green, Hot Pink, Black, Orange, Khaki, Pink, White, Dark Blue, Green. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "b2877890-fe95-4c24-ba35-87728fd41a05",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b2877890-fe95-4c24-ba35-87728fd41a05/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b2877890-fe95-4c24-ba35-87728fd41a05/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/cab051d4-a910-415f-8ff0-6d3d0e79b759.mp4/r/THUMBNAIL_1080P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "fe947072-f04a-4922-a000-0d5afcde7d3c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/fe947072-f04a-4922-a000-0d5afcde7d3c/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/fe947072-f04a-4922-a000-0d5afcde7d3c/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/cab051d4-a910-415f-8ff0-6d3d0e79b759.mp4/r/THUMBNAIL_1080P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "395a27e2-9833-40e9-a33a-9b047a297128",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/395a27e2-9833-40e9-a33a-9b047a297128/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/395a27e2-9833-40e9-a33a-9b047a297128/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/cab051d4-a910-415f-8ff0-6d3d0e79b759.mp4/r/THUMBNAIL_1080P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "f55c3f79-7b1e-4de6-a451-647d84f1cadf",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f55c3f79-7b1e-4de6-a451-647d84f1cadf/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f55c3f79-7b1e-4de6-a451-647d84f1cadf/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/cab051d4-a910-415f-8ff0-6d3d0e79b759.mp4/r/THUMBNAIL_1080P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "c8b53f29-2d36-4f2f-a5d5-60e12f3c3d78",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c8b53f29-2d36-4f2f-a5d5-60e12f3c3d78/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c8b53f29-2d36-4f2f-a5d5-60e12f3c3d78/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/cab051d4-a910-415f-8ff0-6d3d0e79b759.mp4/r/THUMBNAIL_1080P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "610d2757-502e-4c67-b62c-78156493a3b6",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/610d2757-502e-4c67-b62c-78156493a3b6/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/610d2757-502e-4c67-b62c-78156493a3b6/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/cab051d4-a910-415f-8ff0-6d3d0e79b759.mp4/r/THUMBNAIL_1080P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "52130f4d-7829-4b82-a110-e0fed30e8a00",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/52130f4d-7829-4b82-a110-e0fed30e8a00/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/52130f4d-7829-4b82-a110-e0fed30e8a00/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/cab051d4-a910-415f-8ff0-6d3d0e79b759.mp4/r/THUMBNAIL_1080P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "2f230e6f-cfbf-46e9-b899-f5e39823ab2c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2f230e6f-cfbf-46e9-b899-f5e39823ab2c/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2f230e6f-cfbf-46e9-b899-f5e39823ab2c/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/cab051d4-a910-415f-8ff0-6d3d0e79b759.mp4/r/THUMBNAIL_1080P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "59dae9a0-71bf-419e-8fd1-fb9e1210fa6f",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/59dae9a0-71bf-419e-8fd1-fb9e1210fa6f/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/59dae9a0-71bf-419e-8fd1-fb9e1210fa6f/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/cab051d4-a910-415f-8ff0-6d3d0e79b759.mp4/r/THUMBNAIL_1080P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "b8c6d061-3ea1-46e3-b7ba-055c3f5720f2",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b8c6d061-3ea1-46e3-b7ba-055c3f5720f2/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b8c6d061-3ea1-46e3-b7ba-055c3f5720f2/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/cab051d4-a910-415f-8ff0-6d3d0e79b759.mp4/r/THUMBNAIL_1080P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "1dcbb386-4cd9-4b2d-b747-4d67d19ef18c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1dcbb386-4cd9-4b2d-b747-4d67d19ef18c/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1dcbb386-4cd9-4b2d-b747-4d67d19ef18c/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/cab051d4-a910-415f-8ff0-6d3d0e79b759.mp4/r/THUMBNAIL_1080P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "c2c2f07b-bfb8-40bd-85b5-0c412a1c5adb",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c2c2f07b-bfb8-40bd-85b5-0c412a1c5adb/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c2c2f07b-bfb8-40bd-85b5-0c412a1c5adb/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/cab051d4-a910-415f-8ff0-6d3d0e79b759.mp4/r/THUMBNAIL_1080P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Brown": "https://m.media-amazon.com/images/I/51hiAskKV7L._AC_SR38,50_.jpg",
    "Gray": "https://m.media-amazon.com/images/I/41Xt33Pz0IL._AC_SR38,50_.jpg",
    "Burgundy": "https://m.media-amazon.com/images/I/41fT4yL6MTL._AC_SR38,50_.jpg",
    "Apricot": "https://m.media-amazon.com/images/I/41GTF7XjMFL._AC_SR38,50_.jpg",
    "Army Green": "https://m.media-amazon.com/images/I/412c8NRo1fL._AC_SR38,50_.jpg",
    "Hot Pink": "https://m.media-amazon.com/images/I/415o1mWEVHL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/41ngJ4BLyyL._AC_SR38,50_.jpg",
    "Orange": "https://m.media-amazon.com/images/I/410SSgmCzmL._AC_SR38,50_.jpg",
    "Khaki": "https://m.media-amazon.com/images/I/41h813E3q-L._AC_SR38,50_.jpg",
    "Pink": "https://m.media-amazon.com/images/I/41SYkoTu8PL._AC_SR38,50_.jpg",
    "White": "https://m.media-amazon.com/images/I/413hNWL29iL._AC_SR38,50_.jpg",
    "Dark Blue": "https://m.media-amazon.com/images/I/41HJ6-ocyaL._AC_SR38,50_.jpg",
    "Green": "https://m.media-amazon.com/images/I/41HZ1+RQAUL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Brown": "81hOgzDG-BL",
    "Gray": "81XVpIcYh6L",
    "Burgundy": "713RRWZrGQL",
    "Apricot": "81rKQ136-mL",
    "Army Green": "81-AKbao95L",
    "Hot Pink": "81x5q1tV4iL",
    "Black": "71a0x4LTzmL",
    "Orange": "81V9tV9L8SL",
    "Khaki": "810iP8A86FL",
    "Pink": "81l6BWFZDZL",
    "White": "81mX9yruE+L",
    "Dark Blue": "81wWFXDopFL",
    "Green": "81ilWDvXV3L"
  },
  "color_images": {
    "Brown": [
      "https://m.media-amazon.com/images/I/81hOgzDG-BL._SL1500_.jpg"
    ],
    "Gray": [
      "https://m.media-amazon.com/images/I/81XVpIcYh6L._SL1500_.jpg"
    ],
    "Burgundy": [
      "https://m.media-amazon.com/images/I/713RRWZrGQL._SL1500_.jpg"
    ],
    "Apricot": [
      "https://m.media-amazon.com/images/I/81rKQ136-mL._SL1500_.jpg"
    ],
    "Army Green": [
      "https://m.media-amazon.com/images/I/81-AKbao95L._SL1500_.jpg"
    ],
    "Hot Pink": [
      "https://m.media-amazon.com/images/I/81x5q1tV4iL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/71a0x4LTzmL._SL1500_.jpg"
    ],
    "Orange": [
      "https://m.media-amazon.com/images/I/81V9tV9L8SL._SL1500_.jpg"
    ],
    "Khaki": [
      "https://m.media-amazon.com/images/I/810iP8A86FL._SL1500_.jpg"
    ],
    "Pink": [
      "https://m.media-amazon.com/images/I/81l6BWFZDZL._SL1500_.jpg"
    ],
    "White": [
      "https://m.media-amazon.com/images/I/81mX9yruE+L._SL1500_.jpg"
    ],
    "Dark Blue": [
      "https://m.media-amazon.com/images/I/81wWFXDopFL._SL1500_.jpg"
    ],
    "Green": [
      "https://m.media-amazon.com/images/I/81ilWDvXV3L._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 570.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61KAHPReuiL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-evening",
      "title": "Womens Dress Evening",
      "price": 36.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61gc4P8lHWL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 33.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61u9MU0UihL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 160.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/612Qh9bFWKL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-ruched-cocktail",
      "title": "Womens Dress Ruched Cocktail",
      "price": 32.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/51YkbVSwXWL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 89.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51gOJfjwHUL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-bodycon-formal-long-sleeve-cocktail",
      "title": "Womens Maxi Dress Maxi Bodycon Formal Long Sleeve Cocktail",
      "price": 89.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61Obg23nrhL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-ruched-formal",
      "title": "Womens Maxi Dress Ruched Formal",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61XMAEPLKzL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-bodycon-sleeveless",
      "title": "Womens Dress Bodycon Sleeveless",
      "price": 29.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51UthcjfRfL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71ot7Msq9QL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-v-neck",
      "title": "Womens Maxi Dress Maxi V Neck",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51REOrSH6bL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 43.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71kbBZy3bvL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-short-sleeve-maxi",
      "title": "Womens Maxi Dress Short Sleeve Maxi",
      "price": 50.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61ALR9XGyNL._SL1500_.jpg"
      ]
    }
  ]
}