{
  "id": "womens-maxi-dress-maxi-formal-v-neck",
  "handle": "womens-maxi-dress-maxi-formal-v-neck",
  "sku": "JC2243",
  "asin": "B0DD32XNJR",
  "title": "Womens Maxi Dress Maxi Formal V Neck",
  "title_original": "Popilush Corset Dress Built in Shapewear - Formal Dress for Women Deep V Neck Maxi Slip Bridesmaid Dresses for Wedding",
  "brand": "Visit the Popilush Store",
  "price": 101.99,
  "social_proof": {
    "bought_past_month": 51,
    "text": "51+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/61nBlsgpmDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81tGEOiM4bL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71hvIpu6GlL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/613We7mAORL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71kemtY-usL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71QWduIAR0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/6110BEtbjbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61P+L-W3eLL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/61nBlsgpmDL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81tGEOiM4bL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71hvIpu6GlL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/613We7mAORL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71kemtY-usL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71QWduIAR0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/6110BEtbjbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61P+L-W3eLL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Item model number ‏": "‎ 738061333026",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ September 6, 2023",
    "ASIN ‏": "‎ B0CHF9YQFW",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#178,454 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #897 in Women's Formal Dresses",
    "Customer Reviews": "4.2 4.2 out of 5 stars (187)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Brown",
      "Pure Black",
      "White"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.2,
    "count": 187,
    "customers_say": "Customers find the dress gorgeous, well-made, comfortable, and flattering, with the fabric hugging curves in all the right places. The built-in shapewear receives mixed feedback, with some finding it nice while others say it doesn't help much. The fit and sizing are also mixed aspects, with some finding it great while others say it's too tight and not true to size. Generated from the text of customer reviews Select to learn more Style (27) Quality (25) Comfort (15) Flattering (14) Material quality (11) Fit (39) Shapewear (13) Size (12) 27 customers mention style, 25 positive, 2 negative 27 customers mention \"Style\" 25 positive 2 negative Customers find the dress gorgeous and sexy, with one customer describing it as very feminine. \" The perfect brown dress. Formal & sexy , but not too over the top….I ordered a small for reference, I am about 5’1” and around 120 pounds The bust... \" Read more \" Beautiful dress had to get one size up \" Read more \" So it’s cute but idk I feel like it did absolutely nothing for my chest? It felt like an unsupportive bralette or something.... \" Read more \" ...I felt beautiful and sexy in it . I’m definitely curvy 200 lbs 5”3 and not in shape at all , but in this dress I felt like I was. \" Read more 25 customers mention quality, 20 positive, 5 negative 25 customers mention \"Quality\" 20 positive 5 negative Customers find the dress to be well made. \" Nice dress but arrived stained right over my girly area. Ordered 2 sizes up and still looking like a white sausage. \" Read more \" Love this dress ! Sucked me in and I didn’t need to wear a bra. Highly recommend! \" Read more \" I'm 6ft tall, 160lbs, ordered a medium and it fit great. Good quality , loved that the shapewear is built-in, didn't wear a bra, and felt extremely... \" Read more \" Received it used. Disgusting . Deodorant stains. Thank God I have time to get another dress in time for my event. \" Read more 15 customers mention comfort, 14 positive, 1 negative 15 customers mention \"Comfort\" 14 positive 1 negative Customers find the dress comfortable. \" ...It fit me perfectly. The material was very silky and comfortable . I would recommend this dress 100 percent. \" Read more \" ...Aside for my chest not fitting into the dress it was very comfortable and light weight.... \" Read more \" the built in shapewear is so nice and snatched!!! the dress was comfy and fit nicely. i wore it to a ballet with arm length gloves and it was perfect. \" Read more \" ...is thick, I wore it with a sheer black shawl and it was so comfortable all night ! There’s no pinching or adjusting I needed to do.... \" Read more 14 customers mention flattering, 11 positive, 3 negative 14 customers mention \"Flattering\" 11 positive 3 negative Customers find the dress flattering and appreciate how it hugs their curves in all the right places, with one customer noting it provides good compression on the belly. \" ...The material is soft, stretchy, and flattering . I have slightly bigger girls that have a hard time fitting into tops like this dress.... \" Read more \" 10/10 most flattering dress I own! Sucks you in, true to size (just feel small because of the compression of the shapewear) , just LOVE! \" Read more \" AMAZING!! Puts everything in place and is extremely flattering !... \" Read more \" Ordered smaller than the sizing recommended and it offered little compression . Based on the reviews I was expected this to be very tight.... \" Read more 11 customers mention material quality, 8 positive, 3 negative 11 customers mention \"Material quality\" 8 positive 3 negative Customers appreciate the dress's material quality, with one customer noting it feels like swimwear and another mentioning the built-in spandex. \" The dress looks exactly like the picture and the fabric felt good . The shapewear didn’t help as much as I thought it would.... \" Read more \" ...The material is thick , I wore it with a sheer black shawl and it was so comfortable all night! There’s no pinching or adjusting I needed to do.... \" Read more \" ...The straps are essentially bra strap material , which kind of make them stand out. In fact, the straps were thinner than my normal bra straps own.... \" Read more \" ...I got so many compliments Also the material is good quality \" Read more 39 customers mention fit, 21 positive, 18 negative 39 customers mention \"Fit\" 21 positive 18 negative Customers have mixed experiences with how the dress fits, with some saying it sits comfortably without being too tight, while others find it runs tight and is difficult to put on. \" ...medium and white and it I would give that one 5 stars because it fits like a glove and you cant see through any part of it. But not this one.... \" Read more \" ...It’s very comfortable and stretchy. It was hard to put on cause of the shape wear. \" Read more \" Fit Like a glove ... \" Read more \" This dress is so sexy! Unfortunately it was way to tight so I have to return it. \" Read more 13 customers mention shapewear, 9 positive, 4 negative 13 customers mention \"Shapewear\" 9 positive 4 negative Customers have mixed opinions about the shapewear feature of the dress, with some appreciating its nice built-in design, while another customer notes that it doesn't provide significant support in the stomach area. \" ...It fits very flattering with the built in shapewear and makes curves standout and your waist look snatched.... \" Read more \" ...The others fit really well and shaped my body perfectly I thought why not try this style too.... \" Read more \" ...It felt like an unsupportive bralette or something. The shapewear was intense tho, definitely a battle to put on but once it was on it didn’t felt... \" Read more \" ...I recommend going up one size. Quality material and wrinkle free. Nice for curves . \" Read more 12 customers mention size, 4 positive, 8 negative 12 customers mention \"Size\" 4 positive 8 negative Customers have mixed experiences with the dress's sizing, with several reporting that it is not true to size and runs small. \" ...though order up in size - I usually wear a M but this was just way too small and tight. \" Read more \" 10/10 most flattering dress I own! Sucks you in, true to size (just feel small because of the compression of the shapewear) , just LOVE! \" Read more \" ...I would say this dress runs a bit small . I got a medium and it is very tight.... \" Read more \" I absolutely loved this dress, however it is not made for a bust size like mine. I would say it is likely to fit a full C and not much more.... \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars The MOST FLATTERING dress I've ever worn",
        "body": "I ordered some other popilush dresses to consider before coming across this one. The others fit really well and shaped my body perfectly I thought why not try this style too. This dress hugs my curves in ALL the right places and the girls looked absolutely perfect and stayed in place all night. I will say the fabric is exactly what I anticipated. A very lovely satin like finish but stretchy and form fitting. This enough not to need any slip (no that you could with the shapewear, but some manufacturers use really thin fabric. Anyways if you want a sexy AF stunning black dress get this you won't be sorry. I just ordered this in white to have as well. Wish it came in more colors than just the 4 available. One sizing note... I am a small in the other styles of popilush this I sized up since it was coresetted and I have a larger chest. I am glad I did. Read more",
        "author": "SK",
        "rating": 5.0,
        "date": "July 3, 2024",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars GIRLLLLLLLL!!!!!!",
        "body": "TREAT YO SELF!!!! If you’re in your “winter weight” but want to look like your summer body then get this! Now you may have to do some yoga to get this thing on, but it’s well worth it! And let me just tell you, the “girls” look fabulous! I NEVER wear anything with underwire, because of my implants, (not being under the muscle means they don’t move), so typically I’d be better off molding a wire hanger and replacing the underwire! NOT IN POPILUSH!!! THESE BODYSUITS AND DRESSES ARE PERFECTION!!!!!! THEY TUCK, SUCK, PUSH, AND HOLD ALL THE THINGSSSSSS!!!!!! I have not been disappointed with ANY of the dresses or bodysuits (my order number FIVE JUST got delivered) and the fact that I don’t have to sit in a stall/bathroom & cover myself from “the elements” with my hands over my tatas and the dress/bodysuits around my ankle, makes mama HAPPYYYYYYYYY!!!! Read more",
        "author": "Brandon",
        "rating": 5.0,
        "date": "January 4, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Perfect dress for that evening out!",
        "body": "I'm in love with this dress. I needed something to wear to a wedding and I was told to try a mermaid dress. I came across this one and decided to give it a chance. According to the size chart, I would be a medium, so that's what I ordered. I've never worn shapewear before so I wasn't sure what to expect. Trying it on for the first time was a little rough. I was dancing and jumping around to get it up over my hips. Once it was on, it was incredibly comfortable. The material is soft, stretchy, and flattering. I have slightly bigger girls that have a hard time fitting into tops like this dress. I fit perfectly with no spillage! HUGE plus for me! The second time I went to put it on, there was no dancing involved. Apparently I broke it in the first time. You can't see the shorts under the dress, but the second time, the shapewear was loose and not formfitting. I was okay with it, but wanted to mention it just in case! Do I think it held me in? Not really, but I don't have a ton to hold in. I'm not sure how this would fair with someone who wants to wear the shapewear. I washed and dried the dress and it is still in brand new condition! I imagine this dress will hold up for a long time. I would 100% buy this dress again! Every penny was worth the comfort and confidence I had all night. Read more",
        "author": "sincity_bookworm",
        "rating": 5.0,
        "date": "May 7, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61oW8JjdFzL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "1.0 out of 5 stars White is COMPLETELY see-through",
        "body": "Do not buy the white dress unless you want to show your naked body to the world! It is completely see through! You can see everything. There is no padding or lining in the bra cup at all. The built in shapewear is also see-through and you can see everything through even that. I would say this dress runs a bit small. I got a medium and it is very tight. I got their other more flowy dress in medium and white and it I would give that one 5 stars because it fits like a glove and you cant see through any part of it. But not this one. This might be better dress one size up and probably in a dark color. For reference I am 5'2\", 145lbs, semi-athletic build, 34D. I would consider getting the black in large just to see if that makes any difference. But heed my warning. The white is a no-go. Read more",
        "author": "N.",
        "rating": 1.0,
        "date": "June 17, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Must Buy",
        "body": "The perfect brown dress. Formal & sexy, but not too over the top….I ordered a small for reference, I am about 5’1” and around 120 pounds The bust area was slightly small, I wear a 32ddd/ 34dd. So keep in mind if you are bigger chested. Dress material is perfect. Stretchy and shiny but not satin. Doesn’t leave water stains or wrinkles. The shape wear wasn’t too tight but definitely keeps you snatched. My favorite part was the opening for easy bathroom breaks. I’ve never worn a dress with one before and it was life changing. 10/10 would recommend. I will definitely be purchasing more dresses from this brand in the future! Read more",
        "author": "Kait",
        "rating": 5.0,
        "date": "September 18, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/614PKL745PL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "3.0 out of 5 stars Another pain vs beauty",
        "body": "So the thing is, I really like this dress but I also don’t. It does what it’s supposed to, my husband really likes it. It’s definitely instant sexy vibes. I think the design of the dress is really appealing, it smoothed out bumps and sucks you in. However, the straps are thin, cheap elastic(?) kind of like most bra straps but instead of your girls weighing you down it’s your entire compressed body. Maybe it is because I have a slightly longer torso than average but the maxed out straps couldn’t save my shoulders. I do wish the body of it were a little longer. The material of the dress wasn’t anything amazing, it honestly felt like a “good quality” costume more than anything else. Other than the straps it was quite comfortable. My other complaint is that received a dress someone else had tried on or wore. While I do understand this is very typical for clothing in any retail store, seeing other peoples reviews really had me concerned about what I’d be opening up in my home. I guess the silver lining is that the lady bits were clean as I have seen some people were less fortunate. Otherwise i probably would have thrown up. It would have been nice if they had at least wiped off the body marks from the dress but that’s just me being unrealistic. If you have money to blow I think this dress is worth the shot. I might change my mind later and try to finagle new straps but until then I’m choosing to return the dress. Read more",
        "author": "Ally",
        "rating": 3.0,
        "date": "March 21, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/81k6-fxoyFL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "4.0 out of 5 stars Excellent quality and fabric but not enough tummy control",
        "body": "The dress is good quality and just barely fit but I didn’t feel it held in my tummy as I had hoped it would Read more",
        "author": "JADE0199",
        "rating": 4.0,
        "date": "December 10, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Maxi Formal V Neck is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.",
  "about_this_item": "Womens Maxi Dress Maxi Formal V Neck is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.",
  "long_description": "Womens Maxi Dress Maxi Formal V Neck is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Brown, Pure Black, White. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Maxi Formal V Neck is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Brown, Pure Black, White. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "b87e1405-bf28-4345-853f-6743a85e1bdf",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b87e1405-bf28-4345-853f-6743a85e1bdf/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b87e1405-bf28-4345-853f-6743a85e1bdf/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "c1efe01d-c038-471e-a868-522e85033537",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c1efe01d-c038-471e-a868-522e85033537/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c1efe01d-c038-471e-a868-522e85033537/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "3cf5abee-db45-4e76-bd5a-4e90833613e1",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3cf5abee-db45-4e76-bd5a-4e90833613e1/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3cf5abee-db45-4e76-bd5a-4e90833613e1/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "59bb3530-cc25-4067-8ebc-1cd5df8db3a6",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/59bb3530-cc25-4067-8ebc-1cd5df8db3a6/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/59bb3530-cc25-4067-8ebc-1cd5df8db3a6/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "63b880a5-5fef-4b5a-98b1-c267695f7c58",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/63b880a5-5fef-4b5a-98b1-c267695f7c58/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/63b880a5-5fef-4b5a-98b1-c267695f7c58/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "ed2ce175-d2fb-42c4-a24f-188de18ff943",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ed2ce175-d2fb-42c4-a24f-188de18ff943/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ed2ce175-d2fb-42c4-a24f-188de18ff943/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "ff3c56d9-cdd8-499d-abfc-f5bf07e116e5",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ff3c56d9-cdd8-499d-abfc-f5bf07e116e5/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ff3c56d9-cdd8-499d-abfc-f5bf07e116e5/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "7b7791e1-6625-4cc8-8736-17c439f2c24c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7b7791e1-6625-4cc8-8736-17c439f2c24c/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7b7791e1-6625-4cc8-8736-17c439f2c24c/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Brown": "https://m.media-amazon.com/images/I/31H6rPAn0CL._AC_SR38,50_.jpg",
    "Pure Black": "https://m.media-amazon.com/images/I/31JbuAelikL._AC_SR38,50_.jpg",
    "White": "https://m.media-amazon.com/images/I/31P9V5Y538L._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Brown": "6110BEtbjbL",
    "Pure Black": "61nBlsgpmDL",
    "White": "61P+L-W3eLL"
  },
  "color_images": {
    "Brown": [
      "https://m.media-amazon.com/images/I/6110BEtbjbL._SL1500_.jpg"
    ],
    "Pure Black": [
      "https://m.media-amazon.com/images/I/61nBlsgpmDL._SL1500_.jpg"
    ],
    "White": [
      "https://m.media-amazon.com/images/I/61P+L-W3eLL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress-cocktail-sleeveless",
      "title": "Womens Dress Cocktail Sleeveless",
      "price": 38.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71rvHkK5eFL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 43.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71qHTSpfIAL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-bodycon",
      "title": "Womens Maxi Dress Long Sleeve Bodycon",
      "price": 36.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71ItDQZXFtL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-v-neck-maxi-bodycon-split-formal-evening",
      "title": "Womens Maxi Dress V Neck Maxi Bodycon Split Formal Evening",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61ll5FCrhKL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 192.5,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/517lHQyl+HL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress-v-neck-bodycon",
      "title": "Womens Dress V Neck Bodycon",
      "price": 48.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61Q98Q6HTZL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-formal-evening-mermaid",
      "title": "Womens Dress Formal Evening Mermaid",
      "price": 104.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61xiU0h91KL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-formal-evening",
      "title": "Womens Maxi Dress Maxi Formal Evening",
      "price": 61.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Wedding Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/81aAsXMtVBL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-ruched-off-shoulder",
      "title": "Womens Dress Ruched Off Shoulder",
      "price": 32.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71uifIWto+L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-cocktail-v-neck-ruched-long-sleeve",
      "title": "Womens Maxi Dress Bodycon Cocktail V Neck Ruched Long Sleeve",
      "price": 29.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/514tsiNTQdL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-maxi-evening-cocktail-bodycon-ruched",
      "title": "Womens Maxi Dress Formal Maxi Evening Cocktail Bodycon Ruched",
      "price": 53.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61FIQsn+WdL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-off-shoulder-bodycon",
      "title": "Womens Dress Off Shoulder Bodycon",
      "price": 35.58,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61abQ+pTZfL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-maxi-bodycon",
      "title": "Womens Maxi Dress Evening Maxi Bodycon",
      "price": 48.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61hfLAiSHJL._SL1500_.jpg"
      ]
    }
  ]
}