{
  "id": "womens-maxi-dress-formal-high-split-cocktail-split-maxi-evening",
  "handle": "womens-maxi-dress-formal-high-split-cocktail-split-maxi-evening",
  "sku": "JC2739",
  "asin": "B0DS563F2P",
  "title": "Womens Maxi Dress Formal High Split Cocktail Split Maxi Evening",
  "title_original": "Vakkest Women Off The Shoulder Formal Dresses Long Sleeve Evening Party Velvet Maxi Dress High Split Cocktail Gowns",
  "brand": "Visit the Vakkest Store",
  "price": 47.99,
  "social_proof": {
    "bought_past_month": 572,
    "text": "572+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/61Le9mZzGJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61o9O6abLIL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71HijfyFatL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/613qIh00dJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61vDULXRFLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61h8H9TEnFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71T5YY0F0YL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61X-Pt2YIdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61qla1Yvn0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/618VtfdgeRL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/61Le9mZzGJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61o9O6abLIL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71HijfyFatL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/613qIh00dJL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61vDULXRFLL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61h8H9TEnFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71T5YY0F0YL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61X-Pt2YIdL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61qla1Yvn0L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/618VtfdgeRL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Item model number ‏": "‎ Formal dresses for women",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ January 3, 2025",
    "Manufacturer ‏": "‎ Vakkest",
    "ASIN ‏": "‎ B0DS572WN9",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#22,558 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #35 in Women's Formal Dresses",
    "Customer Reviews": "4.3 4.3 out of 5 stars (139)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Wine",
      "Blue",
      "Black",
      "Green"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.3,
    "count": 139,
    "customers_say": "Customers find the dress beautiful, with one noting it looks and feels like a million dollars, and appreciate its quality, stretchiness, and comfort. The dress is true to size and works well for formal occasions like holiday parties and Royal Christmas work events. Customers describe the material as perfect and flattering, with one mentioning how it accentuates their body. The fit receives mixed feedback, with some finding it amazing while others note the length is a little off. Generated from the text of customer reviews Select to learn more Beauty (32) Quality (19) Size (13) Stretchiness (13) Comfort (11) Material thickness (10) Flattering (9) Fit (28) 32 customers mention beauty, 30 positive, 2 negative 32 customers mention \"Beauty\" 30 positive 2 negative Customers find the dress beautiful, describing it as looking and feeling like a million dollars, while also appreciating its expensive appearance on a budget. \" Beautiful dress . I am 5’9, 150 pounds, bra size is 36B. This dress is definitely made for a bustier (is that a word) woman.... \" Read more \" This dress is so beautiful . I purchased this for my birthday photoshoot and for the price it is stunning. \" Read more \" This dress is stunning . Classy but yet still sexy. I’m really tall so was surprised by how long the dress was. \" Read more \" Comfortable and Elegant ... \" Read more 19 customers mention quality, 17 positive, 2 negative 19 customers mention \"Quality\" 17 positive 2 negative Customers find the dress to be of great quality and very nice. \" Just like the picture. True to size. Fit perfectly. Good quality . Love it! I wore it last Friday to an event. \" Read more \" Very flattering. Lots of stretch. Great quality . Perfect for plus size formal. I’m five 5 1/2 so it was a tad bit long even with 3.9 inch heels on.... \" Read more \" Love this dress ! \" Read more \" This dress is amazing . My husband and I wore matching colors and I received many compliments. People stopped to tell me how gorgeous I looked.... \" Read more 13 customers mention size, 11 positive, 2 negative 13 customers mention \"Size\" 11 positive 2 negative Customers find the dress runs true to size and works well for formal occasions, particularly mentioning it's perfect for holiday parties and Royal Christmas work events. \" Just like the picture. True to size . Fit perfectly. Good quality. Love it! I wore it last Friday to an event. \" Read more \" Runs big .I hope this company makes this in XS. \" Read more \" ...The quality was great and it’s very stylish. Perfect for a gala , wedding, etc but keep in mind the slit is high.... \" Read more \" This dress was perfect for the occasion . Very comfortable all night long \" Read more 13 customers mention stretchiness, 11 positive, 2 negative 13 customers mention \"Stretchiness\" 11 positive 2 negative Customers appreciate the dress's stretchiness, with one mentioning it provides enough flexibility to move around comfortably. \" I am 171 pounds. 5'3. Very soft velvet. Very stretchy . The dress is pretty long as well. I bought a size 14.... \" Read more \" ...everything about this dress is TRUE... has stretch so if you want a snatched look size down if you want just right keep your original size..My... \" Read more \" ...The material is soft and has some stretch . It’s incredibly flattering and I got a ton of compliments if you were looking for a velvet formal dress.... \" Read more \" Very flattering. Lots of stretch . Great quality. Perfect for plus size formal. I’m five 5 1/2 so it was a tad bit long even with 3.9 inch heels on.... \" Read more 11 customers mention comfort, 11 positive, 0 negative 11 customers mention \"Comfort\" 11 positive 0 negative Customers find the dress comfortable. \" ...I received several compliments. It was comfortable , great for the part indoor part outdoor winter wedding we attended.... \" Read more \" ...140lbs then. This Was a very beautiful and comfortable dress . Very affordable!... \" Read more \" This dress was absolutely stunning and was so comfortable and fit like a glove! !... \" Read more \" This dress was perfect for the occasion. Very comfortable all night long \" Read more 10 customers mention material thickness, 7 positive, 3 negative 10 customers mention \"Material thickness\" 7 positive 3 negative Customers are satisfied with the material thickness of the dress. \" Exactly what I expected. Material was thick , length was perfect, shaped my body.... \" Read more \" ...Very affordable! The material was great , the fit was awesome and shoulders didnt move up. \" Read more \" Beautiful color and fabric is very soft BUT — the fabric is very THIN — looks and feels like the cheap “velveteen that it is.... \" Read more \" So comfortable and stretchy. Material is perfect . The color is exactly as described. I did have to get this hemmed. I’m 5’3-137lbs I got a medium. \" Read more 9 customers mention flattering, 9 positive, 0 negative 9 customers mention \"Flattering\" 9 positive 0 negative Customers find the dress incredibly flattering, with one mentioning how it accentuates their body. \" Very flattering . Lots of stretch. Great quality. Perfect for plus size formal. I’m five 5 1/2 so it was a tad bit long even with 3.9 inch heels on.... \" Read more \" ...The material is soft and has some stretch. It’s incredibly flattering and I got a ton of compliments if you were looking for a velvet formal dress.... \" Read more \" ...I was nervous this would accentuate my belly, but I think it's pretty flattering .... \" Read more \" ...Other than that, the dress is comfortable, flattering , and I’m happy with my purchase. \" Read more 28 customers mention fit, 19 positive, 9 negative 28 customers mention \"Fit\" 19 positive 9 negative Customers have mixed opinions about the dress's fit, with some finding it amazing while others report issues with the length being off or too long. \" ...It fit like a glove , with the exception of a minor stitch issue, which was no biggie as it was fixed. It was not see through at all!... \" Read more \" ...My daughter looks amazing in it! And the shopping was fast. It fits perfectly ! \" Read more \" ...People stopped to tell me how gorgeous I looked. The dress is long so I hope your taller tan 5'6 or your wearing heels \" Read more \" I am 171 pounds. 5'3. Very soft velvet. Very stretchy. The dress is pretty long as well. I bought a size 14.... \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars It's stretchy",
        "body": "The dress is nicely fitted overall and looks really good on. I ordered it in a 2XL, but an XL or 1XL would have given me a more perfect fit around the bust area, as it felt slightly loose. Other than that, the dress is comfortable, flattering, and I’m happy with my purchase. Read more",
        "author": "Customer",
        "rating": 5.0,
        "date": "December 20, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/81p--BcL1gL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Comfortable and Elegant",
        "body": "This dress is incredibly comfortable. And being a kind of tall girl at 5’8 I was surprised how it still draped down to the floor. After having a baby five months ago and needing a fancy dress for Christmas party, I found this dress and have no regrets. I’m currently weighing about 160 pounds and it was perfect for reference. I’m wearing a size medium and a lot of other clothes. The material is soft and has some stretch. It’s incredibly flattering and I got a ton of compliments if you were looking for a velvet formal dress. You can’t go wrong with this one Read more",
        "author": "Bretagne Stowe",
        "rating": 5.0,
        "date": "December 20, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71QqF-iQ1QL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71QpqmZucDL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71VFRQe2BcL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Velvety Perfection",
        "body": "Very flattering. Lots of stretch. Great quality. Perfect for plus size formal. I’m five 5 1/2 so it was a tad bit long even with 3.9 inch heels on. I had to hold the tail of the dress up to climb stairs. Split is pretty high but still tasteful. Read more",
        "author": "The Harvey’s",
        "rating": 5.0,
        "date": "December 17, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71wf3Lz462L._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/61a+8aIQkGL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71UBi3PZCUL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/610EOALHn5L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Comfortable dress",
        "body": "Purchased a size M. I’m 5’3. 140lbs then. This Was a very beautiful and comfortable dress. Very affordable! The material was great, the fit was awesome and shoulders didnt move up. Read more",
        "author": "Denise",
        "rating": 5.0,
        "date": "December 1, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Beautiful dress",
        "body": "Beautiful dress. I am 5’9, 150 pounds, bra size is 36B. This dress is definitely made for a bustier (is that a word) woman. My boobs did not fill it the best but the dress was still beautiful. I ordered a medium. Read more",
        "author": "PENNY ECKLES",
        "rating": 4.0,
        "date": "December 20, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71xu81xsFFL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71kKDdIw3dL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/81GpNObjfnL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "1.0 out of 5 stars Quality not great.",
        "body": "The length was a little off and the rouching wasnt sitting where the the pictures showed. However, my biggest issue was that as soon as I opened the bag, it reeked of stale cigarettes. It felt like I walked into a bar in the 80's. The velvet was not soft enough for my taste either. Read more",
        "author": "Zuleima",
        "rating": 1.0,
        "date": "August 25, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Cosplay",
        "body": "Beautiful color and fabric is very soft BUT — the fabric is very THIN — looks and feels like the cheap “velveteen that it is. The padding in the bust cup is crooked and cannot be easily removed to fix without taking a seam a loose. The hem is not finished all the way around and the split is very HIGH and very WIDE. This is suitable for Cosplay, a school theater production or cruise ship formal night. Definitely would NOT wear FOR a FORMAL BLACK TIE EVENT OR WEDDING. Read more",
        "author": "FleurDeLis",
        "rating": 3.0,
        "date": "November 12, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71EKJrDUB0L._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/81u54peKZpL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/7182f6Oj0TL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/81awGwHYkSL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/61kM6fFAfbL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/81Ewj7F5YYL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/816jIVzNQwL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars JUST GET THE DRESS",
        "body": "I am 5'6\" and weigh 225 pounds. I opted for the XL and it fit like a glove. I received several compliments. It was comfortable, great for the part indoor part outdoor winter wedding we attended. The rouching took eyes away from my apron belly. Quality is fine. It is on the thinner side but that attributes to the stretch which is a good thing! I would have normally purchase a 2x and I am so glad I sized down! Read more",
        "author": "Customer",
        "rating": 5.0,
        "date": "December 9, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61nxVOAWINL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71if5SwbL4L._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71GlBTA0ktL._SY88._SL1500_.jpg"
        ]
      }
    ]
  },
  "short_description": "Womens Maxi Dress Formal High Split Cocktail Split Maxi Evening is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.",
  "about_this_item": "Womens Maxi Dress Formal High Split Cocktail Split Maxi Evening is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nFor the best look, smooth the fabric, check the neckline placement, and pair it with shoes that match the occasion and the hem length.",
  "long_description": "Womens Maxi Dress Formal High Split Cocktail Split Maxi Evening is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Wine, Blue, Black, Green. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Formal High Split Cocktail Split Maxi Evening is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Wine, Blue, Black, Green. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "6fbaa28e-0c65-4a15-8465-0af9cc789551",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6fbaa28e-0c65-4a15-8465-0af9cc789551/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6fbaa28e-0c65-4a15-8465-0af9cc789551/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "cef36d84-0d44-42df-9367-c148dc1d5089",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/cef36d84-0d44-42df-9367-c148dc1d5089/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/cef36d84-0d44-42df-9367-c148dc1d5089/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "1980a382-6743-4183-bcc3-3dfaf967eda1",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1980a382-6743-4183-bcc3-3dfaf967eda1/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1980a382-6743-4183-bcc3-3dfaf967eda1/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "819ae5c1-7110-45db-a323-dec18630d67d",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/819ae5c1-7110-45db-a323-dec18630d67d/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/819ae5c1-7110-45db-a323-dec18630d67d/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "9f1589dd-c7c9-4f10-b32b-648b26d14bed",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9f1589dd-c7c9-4f10-b32b-648b26d14bed/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9f1589dd-c7c9-4f10-b32b-648b26d14bed/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "6018f7a6-2583-4039-936a-8e61a6451556",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6018f7a6-2583-4039-936a-8e61a6451556/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6018f7a6-2583-4039-936a-8e61a6451556/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/6f8abe5f-bbb0-41df-92de-41c3e9440f18.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Wine": "https://m.media-amazon.com/images/I/41+qg-WoghL._AC_SR38,50_.jpg",
    "Blue": "https://m.media-amazon.com/images/I/417kGFPEbzL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31X75thZgOL._AC_SR38,50_.jpg",
    "Green": "https://m.media-amazon.com/images/I/41PFvfJb7CL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Wine": "61X-Pt2YIdL",
    "Blue": "61qla1Yvn0L",
    "Black": "61Le9mZzGJL",
    "Green": "618VtfdgeRL"
  },
  "color_images": {
    "Wine": [
      "https://m.media-amazon.com/images/I/61X-Pt2YIdL._SL1500_.jpg"
    ],
    "Blue": [
      "https://m.media-amazon.com/images/I/61qla1Yvn0L._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/61Le9mZzGJL._SL1500_.jpg"
    ],
    "Green": [
      "https://m.media-amazon.com/images/I/618VtfdgeRL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-evening-formal-maxi",
      "title": "Womens Maxi Dress Evening Formal Maxi",
      "price": 69.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61XpYmQl2ZL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-bodycon-cocktail",
      "title": "Womens Maxi Dress Long Sleeve Bodycon Cocktail",
      "price": 29.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71uLDl8TnLL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-long-sleeve",
      "title": "Womens Maxi Dress Bodycon Long Sleeve",
      "price": 27.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61vp1Bx9d8L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 28.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51KJxZ6xlhL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-bodycon",
      "title": "Womens Dress Bodycon",
      "price": 27.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51QDBPG-e0L._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-bodycon-long-sleeve",
      "title": "Womens Maxi Dress Bodycon Long Sleeve",
      "price": 40.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61Bip0Ce6yL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-mermaid-evening-ruched",
      "title": "Womens Maxi Dress Formal Mermaid Evening Ruched",
      "price": 74.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61qHc0kmHEL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-bodycon-sleeveless",
      "title": "Womens Dress Bodycon Sleeveless",
      "price": 40.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61nnB4TWroL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-formal-maxi-cocktail",
      "title": "Womens Maxi Dress Bodycon Formal Maxi Cocktail",
      "price": 41.59,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61x+lw2lFuL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 211.2,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/81cSY3QyDJL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-short-sleeve-bodycon",
      "title": "Womens Dress Short Sleeve Bodycon",
      "price": 24.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61sr++s5LSL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-formal",
      "title": "Womens Maxi Dress Evening Formal",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61ZQe1k644L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-split-evening-formal",
      "title": "Womens Maxi Dress Split Evening Formal",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51BZ1BqPx8L._SL1500_.jpg"
      ]
    }
  ]
}