{
  "id": "womens-maxi-dress-split-cocktail-ruched-sleeveless-bodycon-one-shoulder",
  "handle": "womens-maxi-dress-split-cocktail-ruched-sleeveless-bodycon-one-shoulder",
  "sku": "JC2454",
  "asin": "B0BQ7437TF",
  "title": "Womens Maxi Dress Split Cocktail Ruched Sleeveless Bodycon One Shoulder",
  "title_original": "Sarin Mathews Womens One Shoulder Long Formal Dress Sexy Summer Sleeveless Bodycon Ruched Wrap Split Cocktail Dresses",
  "brand": "Visit the Sarin Mathews Store",
  "price": 55.99,
  "social_proof": {
    "bought_past_month": 579,
    "text": "579+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/61e8oVv2ToL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71xPwqFeThL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81FOXbeGaFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71YSrPVnE8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81yOhVoMYOL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/619eTyw0ysL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61vcf7a0MnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61qfGhPUMnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61C0jU6MNzL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/613lD-P1gmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61b5WWmTA8L._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/61e8oVv2ToL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71xPwqFeThL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81FOXbeGaFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71YSrPVnE8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81yOhVoMYOL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/619eTyw0ysL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61vcf7a0MnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61qfGhPUMnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61C0jU6MNzL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/613lD-P1gmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61b5WWmTA8L._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ December 15, 2022",
    "ASIN ‏": "‎ B0BQ73S29L",
    "Best Sellers Rank": "#28,797 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #437 in Women's Club & Night Out Dresses",
    "Customer Reviews": "4.3 4.3 out of 5 stars (1,647)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "04red",
      "07darkgreen",
      "03burgundy",
      "05royal Blue",
      "06navy",
      "02white",
      "01black"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.3,
    "count": 1647,
    "customers_say": "Customers find the dress fits well and is comfortable, with one mentioning it's stretchy enough to accommodate a bump. The material receives positive feedback for its nice fabric thickness and breathability, while being particularly flattering for athletic and curvy body types. They appreciate its elegance, with one customer noting their daughter looked like a princess in it, and consider it a good value for the price point. Generated from the text of customer reviews Select to learn more Fit (248) Beauty (200) Quality (162) Flattering (135) Material quality (130) Comfort (127) Stretchiness (69) Value for money (55) 248 customers mention fit, 213 positive, 35 negative 248 customers mention \"Fit\" 213 positive 35 negative Customers like how the dress fits, with one mentioning it's stretchy and another noting it's perfect in color. \" Great fit ..loved it! Went to a Christmas party in it. Fabric soft, its body hugging, lots of stretch great length, not tripping over the hem.... \" Read more \" Fit perfectly except up top. The top part is disproportionate to the rest of the dress. Needed to return but was traveling and ran out of time. \" Read more \" ...Amazon came thru. The dress was a perfect fit . The dress lays on my natural curves. I ordered a size small. I am 5’7” and 145 lbs.... \" Read more \" I bought it for a formal. Fits well , very stretchy, very flattering. No alterations needed. May order in another color for other occasions… \" Read more 200 customers mention beauty, 185 positive, 15 negative 200 customers mention \"Beauty\" 185 positive 15 negative Customers find the dress beautiful, describing it as gorgeous and sexy, with one customer noting their daughter looked like a princess in it. \" This was a beautiful dress but the day I went to put it on for a wedding I was attending there was a rip in the seam.... \" Read more \" ...I received so many compliments of the dress and how beautiful and elegant it was. Comfortable material, hid the belly, perfect dress \" Read more \" ...The front slit is not heavy enough to stay in one place. Overall cute but not an addition to my forever closet - if it was $24/$30 maybe but for $50... \" Read more \" gorgeous dress , material is not as thick as I would have hoped, unfortunately, I was unable to wear it due to the fact that the dress has clearly... \" Read more 162 customers mention quality, 144 positive, 18 negative 162 customers mention \"Quality\" 144 positive 18 negative Customers find the dress to be well-made and not cheap-feeling, making it a great choice for special occasions like weddings. \" ... Great dress , does run a bit large. My measurements all match the ‘small’ size and it was a bit baggy.... \" Read more \" ...This is the perfect wedding guest dress . The side that is gathered gives it an elegant look. I can’t wait to purchase this dress in another color. \" Read more \" ...when I got it that I would look like a sack of potatoes but this dress is amazing . The fabric is wonderful, stretchy and soft.... \" Read more \" Fit me a bit odd but a nice dress \" Read more 135 customers mention flattering, 131 positive, 4 negative 135 customers mention \"Flattering\" 131 positive 4 negative Customers find the dress flattering, particularly noting how it makes curves stand out and hugs them, while being suitable for all body types. \" ...high quality with just the right amount of stretch, making it both flattering and elegant. I wore it to a wedding and got so many compliments!... \" Read more \" I wish I’d gotten a better picture wearing this dress. It is very flattering . I wore it to a formal holiday party and got so many compliments on it.... \" Read more \" Super flattering and comfortable! I wore with some shape-wear. I might order this in another color but the dark green is so pretty.... \" Read more \" ...It is so flattering if you have big hips, the cinching pulls just right. Such a comfy dress too!... \" Read more 130 customers mention material quality, 92 positive, 38 negative 130 customers mention \"Material quality\" 92 positive 38 negative Customers like the material of the dress, noting its nice fabric thickness and how it feels great, with one customer mentioning its breathability. \" Excellent fit for a pear shape. Very flattering design with material that has a great balance between stretch and structure. \" Read more \" Great fit, nice material , only reasons I didn’t give it five stars is because when I opened the packaging the dress reeked of marijuana.... \" Read more \" ...The dress is not linen , it is like a shirt fabric. It would have been okay, if it was not so misleading. Now 5 days out, and I have no dress… \" Read more \" This dress is gorgeous! Great material and had a zipper on the side. I went w a small . I'm 5ft 5 and 144lbs. 34dd. Waist 26ish one way or another.... \" Read more 127 customers mention comfort, 125 positive, 2 negative 127 customers mention \"Comfort\" 125 positive 2 negative Customers find the dress comfortable. \" ...I used a warm iron on it. It was a very cold night too, but i was comfortable . I was very happy with the value and the zipper worked just fine.... \" Read more \" Very comfortable and flattering fit. For the full shoulder effect, it does need to be under the armpit rather than a draping effect over the top.... \" Read more \" ...in all the right places and the ruching in the waist helps hide rolls, comfy , not too tight, not see thru, and the perfect line between sexy and... \" Read more \" ...I wore it for a work party and it was super comfortable and I didn’t feel as though I kept having to pull up on the side without the shoulder strap! \" Read more 69 customers mention stretchiness, 65 positive, 4 negative 69 customers mention \"Stretchiness\" 65 positive 4 negative Customers appreciate the dress's stretchiness, noting its comfortable material and elastic features at the shoulder and across the chest. \" I wore this to my sister in law's wedding and it was definitely stretchy which was nice but it was a hot day and this dress definitely did NOT seem... \" Read more \" ...I am 5’5 159lbs and ordered a large. The material is stretchy but still has a thick feel-not cheap. Definitely worth it! Many compliments! \" Read more \" I bought it for a formal. Fits well, very stretchy , very flattering. No alterations needed. May order in another color for other occasions… \" Read more \" ...Well made and has some stretch . I was looking at dept stores w no luck so I figured I'll try here. \" Read more 55 customers mention value for money, 48 positive, 7 negative 55 customers mention \"Value for money\" 48 positive 7 negative Customers find the dress offers good value for money, being well-made for its price point and having fine fabric. \" Great Purchase, great value ! Will purchase in multiple colors. Very true to size and good stretch. Covers in all the right places.... \" Read more \" ...slit was not too revealing, very comfortable and well made So worth it . So many compliments. \" Read more \" ...I am 5’5” 150 lbs. DDD cup Length is also perfect. Great value for the price . I received lots of compliments. \" Read more \" I love this dress! It was a great price and very flattering. I bought it in 3 colors as I had 3 events.... \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Beautiful dress, great for big chested women",
        "body": "Wore this in black to a wedding and got so many compliments. I was 12 weeks pregnant and this hugged my curves and stretched in all the right places. It came with a slight smell so I washed before wearing. I’m a 2-4 with a larger chest (34 G), an hourglass shaped body, and got a small, it fit perfectly. I had no excessive cleavage or slippage, it also didn’t ride up too much like a lot of tight fitting dresses do. The feel was much like comfortable tee-shirt, but the fabric was thick and good quality. Overall I’m pleased with the buy and might buy another color in the future Read more",
        "author": "Gabriela",
        "rating": 5.0,
        "date": "December 2, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Great last minute find",
        "body": "Really flattering and heavier-ish material that isn’t see through at all. Really nice for the price! I’m sometimes a small, sometimes a medium, I got a medium so it isn’t skin tight and glad I did. Great find, not tight on your stomach and will make you look great, too! Read more",
        "author": "Jennifer",
        "rating": 5.0,
        "date": "November 22, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Comfortable and flattering",
        "body": "I love this dress, comfortable, material was great. Very flattering. Only issue is had was I got a tear in it right where the zipper ends on the seam. It was at the end of the night. Not sure why. The dress was not too tight at all. I can sew it up. It was only about 2 inches but other then that it was great Read more",
        "author": "ginny",
        "rating": 5.0,
        "date": "December 19, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "4.0 out of 5 stars Chic and elegant but slightly loose at the bust",
        "body": "I bought the Sarin Mathews Women's One Shoulder Long Formal Dress for a special event and was very happy with the overall look. The one-shoulder design is stylish and flattering, and the side slit adds a nice touch of elegance without going overboard. Fit: I ordered my usual size, and while the dress fits well in the waist and hips, the bust area was a little too loose. It didn’t quite sit snugly, so I had to adjust it a few times. A strapless or padded bra helped a bit, but it might require slight tailoring for a perfect fit. Quality: The material is soft, slightly stretchy, and feels comfortable against the skin. The dress drapes nicely and moves well when walking. Stitching was clean, and the zipper worked smoothly. Style: Perfect for formal events like weddings, banquets, or galas. I styled it with nude heels and a statement clutch—got lots of compliments! Final Thoughts: Great value and very elegant overall. If you’re in between sizes or smaller-busted, consider sizing down or planning for minor alterations. Read more",
        "author": "Alison Johnson",
        "rating": 4.0,
        "date": "July 4, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Great, Inexpensive Dress",
        "body": "I purchased this to wear to a last minute fundraiser gala and was NOT disappointed! It was extremely comfortable and very flattering! The slit is just high enough to be sexy but elegant and revealing. There is a thin elastic line that clings to your skin to hold it in place so even when I was dancing, I didn't have to tug or pull up on the strapless side. I second another review I saw that it did need to be ironed due to wrinkles in shipping, but it was very easy to iron. It was machine washable too! I purchased the deep green and it was a rich, beautiful emerald green. The fabric is thick so no peek-a-boo undergarments. I'm 5'7\" and it hit right at my ankles so it may be a little long for shorter women. Read more",
        "author": "CarynC",
        "rating": 5.0,
        "date": "November 8, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars LOVE THIS DRESS!",
        "body": "This dress is amazing! I received so many compliments in it. It does a great job of camouflaging the tummy area. It’s stretchy too so was perfect for a night of dancing at a wedding. It fit as expected. For reference I ordered a Medium and I’m 5’6 and weigh 140 pounds. Read more",
        "author": "Stephanie Gonzalez",
        "rating": 5.0,
        "date": "November 13, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71JtDCqiv9L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "3.0 out of 5 stars Nice Dress, someone else wore this one already",
        "body": "gorgeous dress, material is not as thick as I would have hoped, unfortunately, I was unable to wear it due to the fact that the dress has clearly been worn by someone else and smells of body odor and perfume. Just plain gross. Read more",
        "author": "bh",
        "rating": 3.0,
        "date": "November 9, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars LOVE LOVE LOVE",
        "body": "Love everything about this dress. Quality material, sturdy zipper, length and overall fit. Sizing chart is accurate. I’m 5’1 and 118 lbs and bought a size small. Being 5’1, length is always a concern for me. With 3” heels the length was perfect. Can’t wait to wear it again. Read more",
        "author": "Customer",
        "rating": 5.0,
        "date": "November 16, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Split Cocktail Ruched Sleeveless Bodycon One Shoulder is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.",
  "about_this_item": "Womens Maxi Dress Split Cocktail Ruched Sleeveless Bodycon One Shoulder is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.",
  "long_description": "Womens Maxi Dress Split Cocktail Ruched Sleeveless Bodycon One Shoulder is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: 04red, 07darkgreen, 03burgundy, 05royal Blue, 06navy, 02white, 01black. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Split Cocktail Ruched Sleeveless Bodycon One Shoulder is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: 04red, 07darkgreen, 03burgundy, 05royal Blue, 06navy, 02white, 01black. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "de591c0f-43c6-4104-b1b3-194ac44e4279",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/de591c0f-43c6-4104-b1b3-194ac44e4279/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/de591c0f-43c6-4104-b1b3-194ac44e4279/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "c5cde990-cf2d-46fc-800a-00640c1a1fe0",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c5cde990-cf2d-46fc-800a-00640c1a1fe0/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c5cde990-cf2d-46fc-800a-00640c1a1fe0/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "3f66bc47-9668-40f8-9264-7f2d515eadde",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3f66bc47-9668-40f8-9264-7f2d515eadde/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3f66bc47-9668-40f8-9264-7f2d515eadde/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "1a3e0f65-fa2a-4ea6-9b16-ba78c6699c4a",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1a3e0f65-fa2a-4ea6-9b16-ba78c6699c4a/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1a3e0f65-fa2a-4ea6-9b16-ba78c6699c4a/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "74568864-73ab-4cc8-a80b-e1203b41a2cd",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/74568864-73ab-4cc8-a80b-e1203b41a2cd/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/74568864-73ab-4cc8-a80b-e1203b41a2cd/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "c6c40af7-542a-4a89-a8f6-a1f0799a9b29",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c6c40af7-542a-4a89-a8f6-a1f0799a9b29/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c6c40af7-542a-4a89-a8f6-a1f0799a9b29/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "f6279955-b7af-4fc3-a195-95f282b0060a",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f6279955-b7af-4fc3-a195-95f282b0060a/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f6279955-b7af-4fc3-a195-95f282b0060a/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "58ce1f5d-1578-4a38-b5c8-576ed05df749",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/58ce1f5d-1578-4a38-b5c8-576ed05df749/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/58ce1f5d-1578-4a38-b5c8-576ed05df749/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "5404f9b7-fbd0-4f75-9642-65e9ade031f7",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5404f9b7-fbd0-4f75-9642-65e9ade031f7/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5404f9b7-fbd0-4f75-9642-65e9ade031f7/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "1213c871-217a-4fc7-b346-b83811d2af5d",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1213c871-217a-4fc7-b346-b83811d2af5d/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1213c871-217a-4fc7-b346-b83811d2af5d/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "656dd85a-14bc-47c3-a55a-1ad7c106b780",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/656dd85a-14bc-47c3-a55a-1ad7c106b780/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/656dd85a-14bc-47c3-a55a-1ad7c106b780/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "c0e63718-3509-4f12-a45c-06359709bffe",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c0e63718-3509-4f12-a45c-06359709bffe/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c0e63718-3509-4f12-a45c-06359709bffe/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "04red": "https://m.media-amazon.com/images/I/31NVsTIfi8L._AC_SR38,50_.jpg",
    "07darkgreen": "https://m.media-amazon.com/images/I/311k6mvQVnL._AC_SR38,50_.jpg",
    "03burgundy": "https://m.media-amazon.com/images/I/31gONgd46lL._AC_SR38,50_.jpg",
    "05royal Blue": "https://m.media-amazon.com/images/I/31sUYPeDuLL._AC_SR38,50_.jpg",
    "06navy": "https://m.media-amazon.com/images/I/31+bXmIF0LL._AC_SR38,50_.jpg",
    "02white": "https://m.media-amazon.com/images/I/31W0dvrRQtL._AC_SR38,50_.jpg",
    "01black": "https://m.media-amazon.com/images/I/31+qgD1NkgL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "04red": "619eTyw0ysL",
    "07darkgreen": "61vcf7a0MnL",
    "03burgundy": "61qfGhPUMnL",
    "05royal Blue": "61C0jU6MNzL",
    "06navy": "613lD-P1gmL",
    "02white": "61b5WWmTA8L",
    "01black": "61e8oVv2ToL"
  },
  "color_images": {
    "04red": [
      "https://m.media-amazon.com/images/I/619eTyw0ysL._SL1500_.jpg"
    ],
    "07darkgreen": [
      "https://m.media-amazon.com/images/I/61vcf7a0MnL._SL1500_.jpg"
    ],
    "03burgundy": [
      "https://m.media-amazon.com/images/I/61qfGhPUMnL._SL1500_.jpg"
    ],
    "05royal Blue": [
      "https://m.media-amazon.com/images/I/61C0jU6MNzL._SL1500_.jpg"
    ],
    "06navy": [
      "https://m.media-amazon.com/images/I/613lD-P1gmL._SL1500_.jpg"
    ],
    "02white": [
      "https://m.media-amazon.com/images/I/61b5WWmTA8L._SL1500_.jpg"
    ],
    "01black": [
      "https://m.media-amazon.com/images/I/61e8oVv2ToL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-bodycon-maxi",
      "title": "Womens Maxi Dress Bodycon Maxi",
      "price": 32.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/41dICcJ5pJL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 26.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/914VIFBe1lL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-bodycon",
      "title": "Womens Dress Bodycon",
      "price": 44.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/71f2SHW7r3L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 12.6,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61Xhe0Mbt4L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-ruched-bodycon-maxi",
      "title": "Womens Maxi Dress Ruched Bodycon Maxi",
      "price": 43.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/518e8ryCJGL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-cocktail-bodycon-maxi",
      "title": "Womens Maxi Dress Cocktail Bodycon Maxi",
      "price": 32.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61tpO1rTF2L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-bodycon-ruched",
      "title": "Womens Maxi Dress Long Sleeve Bodycon Ruched",
      "price": 37.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51Jfo4Yc9xL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-cocktail-v-neck-ruched-long-sleeve",
      "title": "Womens Maxi Dress Bodycon Cocktail V Neck Ruched Long Sleeve",
      "price": 29.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/514tsiNTQdL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-bodycon",
      "title": "Womens Maxi Dress Long Sleeve Bodycon",
      "price": 24.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61iVwwdZBkL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-cocktail-long-sleeve-bodycon-maxi",
      "title": "Womens Maxi Dress Cocktail Long Sleeve Bodycon Maxi",
      "price": 50.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/51aURhIoLlL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 37.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61G5OJlQIEL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 89.9,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51n9oszkk2L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-long-sleeve-cocktail-ruched",
      "title": "Womens Maxi Dress Bodycon Long Sleeve Cocktail Ruched",
      "price": 38.95,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/61d07ntAVqL._SL1500_.jpg"
      ]
    }
  ]
}