{
  "id": "womens-maxi-dress-evening-cocktail-formal-off-shoulder-bodycon-v-neck",
  "handle": "womens-maxi-dress-evening-cocktail-formal-off-shoulder-bodycon-v-neck",
  "sku": "JC2253",
  "asin": "B0CW3BT5LL",
  "title": "Womens Maxi Dress Evening Cocktail Formal Off Shoulder Bodycon V Neck",
  "title_original": "Popilush Women's Shapewear Midi Dress Off Shoulder Wrap V Neck Formal Wedding Guest Cocktail Dresses Bodycon Evening Gowns",
  "brand": "Visit the Popilush Store",
  "price": 103.99,
  "social_proof": {
    "bought_past_month": 1438,
    "text": "1438+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/61VaF+mm2lL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/818g8ZmgtjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71X5aeWECZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71wXrchfHBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61aqbmb5iGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Nz0-p0S7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61IjuZ-2+nL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/61VaF+mm2lL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/818g8ZmgtjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71X5aeWECZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71wXrchfHBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61aqbmb5iGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Nz0-p0S7L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61IjuZ-2+nL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Item model number ‏": "‎ 738061371783",
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ June 16, 2023",
    "ASIN ‏": "‎ B0C89SQBJV",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#160,785 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #512 in Women's Cocktail Dresses",
    "Customer Reviews": "4.0 4.0 out of 5 stars (250)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Wine Red",
      "Black",
      "Green"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.0,
    "count": 250,
    "customers_say": "Customers find the dress gorgeous, beautifully made, and flattering, particularly noting how it hugs all the curves. Moreover, they appreciate its comfort and shape, with one customer highlighting the built-in shapewear as a game-changer. However, the fit receives mixed feedback, with some finding it nice while others say it's way too tight. Additionally, the fabric quality is also mixed, with some praising its good quality while others compare it to bathing suit material, and several customers report the dress being too small. Generated from the text of customer reviews Select to learn more Look (31) Quality (24) Flattering (23) Comfort (14) Shape (7) Fit (33) Fabric quality (11) Size (8) 31 customers mention look, 27 positive, 4 negative 31 customers mention \"Look\" 27 positive 4 negative Customers find the dress gorgeous, with one mentioning that the color and quality are amazing. \" This looked like a beautiful dress but it was way too small for me. The quality looked and felt good, too bad it didn't fit. \" Read more \" This dress may be cute - it was so incredibly tight. Runs super small. I’m 5’5” 130lbs and Medium was waaaayyyy too tight. Returned. \" Read more \" This dress is absolutely stunning , beautiful beautiful dress it wasn’t for me, but for the right person I would pay this every day for this dress \" Read more \" Such a pretty dress and comfortable. The tummy control is great and creates a nice shape. True to size. Material has a good stretch \" Read more 24 customers mention quality, 20 positive, 4 negative 24 customers mention \"Quality\" 20 positive 4 negative Customers find the dress beautifully made, with one mentioning it hides all flaws. \" Definitely sucks you in! Great dress \" Read more \" Love this dress . I wore this for a wedding. I got a xl. I’m 5”5 199lbs. I could have went to a large but I think xl was perfect to be comfortable.... \" Read more \" Amazing dress ... \" Read more \" The dress was ok ! It looked like it was previously worn!... \" Read more 23 customers mention flattering, 17 positive, 6 negative 23 customers mention \"Flattering\" 17 positive 6 negative Customers find the dress flattering, noting that it shapes the body and tucks in all the right places, with one customer specifically mentioning how it shows curves in all the right places. \" ...It made me feel so put together and compressed! Love the way it hugged my body ! Highly recommend it! Comfortable great quality material !... \" Read more \" ...All were very flattering to say the least. She said that \"The Hole\" was a workable solution too. \" Read more \" ...It’s more like swim wear material. Weird fitting had to return. Not flattering . \" Read more \" I love this dress! It flatters in all the right places and is comfortable! \" Read more 14 customers mention comfort, 11 positive, 3 negative 14 customers mention \"Comfort\" 11 positive 3 negative Customers find the dress comfortable. \" ...Love the way it hugged my body! Highly recommend it! Comfortable great quality material ! Nice and thick fabric . Worth the price. Runs true to size.... \" Read more \" ...The built in undergarment was perfect. Super comfy , showed curves in all the right places and didn’t cost a fortune. Would buy again. \" Read more \" Super comfortable and fits great. I sized up 1 size as recommended and it fit perfect. Love this dress. \" Read more \" ...bodysuits and had high hopes but the arms were impossible and uncomfortable . Still love their bodysuit/shapewear a ton and highly recommend \" Read more 7 customers mention shape, 5 positive, 2 negative 7 customers mention \"Shape\" 5 positive 2 negative Customers like the dress's shape, with one mentioning that the built-in shapewear is a game changer. \" ...The tummy control is great and creates a nice shape . True to size. Material has a good stretch \" Read more \" ...It snatches in your tummy and gives you a nice curvy shape and the material is soft. \" Read more \" ...There is no shape wear like it shows on the picture ,no v cut .... \" Read more \" This dress is gorgeous. And the built-in shape where this make it even better. I’m 5’3 140. And it sucks every in and flattens it.... \" Read more 33 customers mention fit, 20 positive, 13 negative 33 customers mention \"Fit\" 20 positive 13 negative Customers have mixed opinions about the dress's fit, with some finding it nice while others report it being uncomfortably tight around the shoulders and too small. \" My wife wore the dress to her high school reunion and it fit like a glove . Firm yet breathable spandex material that will snatch your waist.... \" Read more \" Dress label and package label doesn’t match. Dress did not fit \" Read more \" Amazing fit . Received many compliments \" Read more \" I love this dress. It is comfortable and fits very nicely . \" Read more 11 customers mention fabric quality, 5 positive, 6 negative 11 customers mention \"Fabric quality\" 5 positive 6 negative Customers have mixed opinions about the fabric of the dress, with some finding it well-made while others compare it to bathing suit material. \" ...Mostly disappointed in the fabric . Thin and feels cheap. \" Read more \" I love this dress! Perfect fabric , length, and shape! Very elegant. \" Read more \" The material is like a bathing suit . Weirdest dress I’ve purchased and it is going right back. \" Read more \" This dress is amazing!. It shapes your body, made with good quality fabric . The body shaper doesn’t roll up the legs. Very nice! \" Read more 8 customers mention size, 2 positive, 6 negative 8 customers mention \"Size\" 2 positive 6 negative Customers report sizing issues with the dress, finding it too small. \" This dress may be cute - it was so incredibly tight. Runs super small . I’m 5’5” 130lbs and Medium was waaaayyyy too tight. Returned. \" Read more \" Two sizes too small \" Read more \" ...Nice and thick fabric . Worth the price. Runs true to size . Nice stretchy fabric. \" Read more \" Cute dress but size runs small . \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Impressive!",
        "body": "Lots of compliments, beautiful dress! It definitely will hug all the curves! I bought black and size large. Read more",
        "author": "Jacklyn",
        "rating": 5.0,
        "date": "October 22, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Great dress, wont break the bank and sucks you in perfectly!",
        "body": "Wore this to an important awards banquet and got so many compliments! It's comfortable, breathable, and also squeezes and tucks in all the right places. very beautiful! Read more",
        "author": "Jenny Dillard",
        "rating": 5.0,
        "date": "April 3, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "1.0 out of 5 stars Extremely small not true to size",
        "body": "Order this in 2sizes bigger it’s extremely small. Read more",
        "author": "Customer",
        "rating": 1.0,
        "date": "December 12, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars The perfect flattering red dress",
        "body": "Very lovely and fitted. The inside garment is made to perfect the body for the fit. I’m 5.5 weight is 155 purchased the L and it’s so comfy even without a bra, it’s just the little magic dress for any type of body. No restrictions and material is soft and of great quality. Read more",
        "author": "Bella Beaver",
        "rating": 5.0,
        "date": "June 26, 2024",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61gEAoVXCYL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71-iJPWFJ6L._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/61VCiTZCwPL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71wmw-ng65L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "4.0 out of 5 stars Very snug",
        "body": "5’4”, 135lbs, 34E/F the large fit but was tight on the lower belly (supported the bust great). Because the dress is red I felt that it was too tight showing the belly button & hips to stomach. Would have been more forgiving in a darker color. Keeping the dress tho. Read more",
        "author": "Shopper",
        "rating": 4.0,
        "date": "October 12, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Cocktail dress",
        "body": "This dress is absolutely stunning, beautiful beautiful dress it wasn’t for me, but for the right person I would pay this every day for this dress Read more",
        "author": "Betty Cooper",
        "rating": 5.0,
        "date": "November 5, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Boyfriend loved",
        "body": "Definitely sucks you in! Great dress Read more",
        "author": "Ariana",
        "rating": 5.0,
        "date": "September 28, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Too tight around the shoulders/arms",
        "body": "Fits really well, but it is awkwardly tight around the shoulders. Read more",
        "author": "Andrew Hess",
        "rating": 3.0,
        "date": "April 28, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Evening Cocktail Formal Off Shoulder Bodycon V Neck is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.",
  "about_this_item": "Womens Maxi Dress Evening Cocktail Formal Off Shoulder Bodycon V Neck is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.\n\nThis piece transitions well from daytime plans to evening events with a quick change of shoes and a small bag or clutch.",
  "long_description": "Womens Maxi Dress Evening Cocktail Formal Off Shoulder Bodycon V Neck is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Wine Red, Black, Green. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Evening Cocktail Formal Off Shoulder Bodycon V Neck is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Wine Red, Black, Green. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "adf9431c-22ba-404c-a5c5-c3e15cf42af8",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/adf9431c-22ba-404c-a5c5-c3e15cf42af8/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/adf9431c-22ba-404c-a5c5-c3e15cf42af8/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/48a5c487-f45b-4362-8970-b85e5f752e45.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "628525fa-ac62-4b6e-b722-1a91cd5d6c1c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/628525fa-ac62-4b6e-b722-1a91cd5d6c1c/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/628525fa-ac62-4b6e-b722-1a91cd5d6c1c/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/48a5c487-f45b-4362-8970-b85e5f752e45.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "f49d2fd0-9561-4e94-9fe4-e16bf525f309",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f49d2fd0-9561-4e94-9fe4-e16bf525f309/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f49d2fd0-9561-4e94-9fe4-e16bf525f309/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/48a5c487-f45b-4362-8970-b85e5f752e45.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "c8574c65-2842-4631-b2bc-1ed30990254a",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c8574c65-2842-4631-b2bc-1ed30990254a/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c8574c65-2842-4631-b2bc-1ed30990254a/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/48a5c487-f45b-4362-8970-b85e5f752e45.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "1d49aba9-a09e-4870-be43-120a43ad3f9c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1d49aba9-a09e-4870-be43-120a43ad3f9c/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1d49aba9-a09e-4870-be43-120a43ad3f9c/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/48a5c487-f45b-4362-8970-b85e5f752e45.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "aa0c7618-9821-42fc-82ec-fa9f1f491903",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/aa0c7618-9821-42fc-82ec-fa9f1f491903/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/aa0c7618-9821-42fc-82ec-fa9f1f491903/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/48a5c487-f45b-4362-8970-b85e5f752e45.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "1125e7bc-6c81-40c9-a3c0-573066063b85",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1125e7bc-6c81-40c9-a3c0-573066063b85/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1125e7bc-6c81-40c9-a3c0-573066063b85/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/48a5c487-f45b-4362-8970-b85e5f752e45.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "2c6eb303-6d3b-43a8-955b-d3bf20db6db6",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2c6eb303-6d3b-43a8-955b-d3bf20db6db6/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2c6eb303-6d3b-43a8-955b-d3bf20db6db6/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/48a5c487-f45b-4362-8970-b85e5f752e45.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "3d8efc8a-4a0d-4df0-806b-9465f7b45d91",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3d8efc8a-4a0d-4df0-806b-9465f7b45d91/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3d8efc8a-4a0d-4df0-806b-9465f7b45d91/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/48a5c487-f45b-4362-8970-b85e5f752e45.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "407fa545-7e55-414c-8b65-8c4563dc8cf5",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/407fa545-7e55-414c-8b65-8c4563dc8cf5/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/407fa545-7e55-414c-8b65-8c4563dc8cf5/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/48a5c487-f45b-4362-8970-b85e5f752e45.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "6cf5c01d-db2d-4a02-aa8d-f7b8a532d8aa",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6cf5c01d-db2d-4a02-aa8d-f7b8a532d8aa/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6cf5c01d-db2d-4a02-aa8d-f7b8a532d8aa/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/48a5c487-f45b-4362-8970-b85e5f752e45.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "d03b8070-7839-4152-9cfa-08fa2096667e",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d03b8070-7839-4152-9cfa-08fa2096667e/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d03b8070-7839-4152-9cfa-08fa2096667e/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/48a5c487-f45b-4362-8970-b85e5f752e45.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Wine Red": "https://m.media-amazon.com/images/I/41JxbuSUmnL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/41jJwKS9PpL._AC_SR38,50_.jpg",
    "Green": "https://m.media-amazon.com/images/I/41HD6LSaWfL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Wine Red": "61Nz0-p0S7L",
    "Black": "61VaF+mm2lL",
    "Green": "61IjuZ-2+nL"
  },
  "color_images": {
    "Wine Red": [
      "https://m.media-amazon.com/images/I/61Nz0-p0S7L._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/61VaF+mm2lL._SL1500_.jpg"
    ],
    "Green": [
      "https://m.media-amazon.com/images/I/61IjuZ-2+nL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress-sleeveless",
      "title": "Womens Dress Sleeveless",
      "price": 27.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/714+pDb6hQL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 24.48,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71G83IulR7L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-short-sleeve-evening-v-neck-formal",
      "title": "Womens Maxi Dress Short Sleeve Evening V Neck Formal",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61y+g6il2gL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/81g5W2lCqIL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 95.61,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Work",
      "images": [
        "https://m.media-amazon.com/images/I/71hVgSIB1jL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 56.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/81-Ei6AlfUL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-short-sleeve-bodycon",
      "title": "Womens Dress Short Sleeve Bodycon",
      "price": 24.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61sr++s5LSL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-bodycon-ruched-maxi-long-sleeve",
      "title": "Womens Maxi Dress Formal Bodycon Ruched Maxi Long Sleeve",
      "price": 61.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/513Uwep+gwL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-long-sleeve-bodycon-maxi-ruched",
      "title": "Womens Maxi Dress Formal Long Sleeve Bodycon Maxi Ruched",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61bpONagFML._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi",
      "title": "Womens Maxi Dress Maxi",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61gzw-KOLqL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail",
      "title": "Womens Dress Cocktail",
      "price": 47.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61+PGMK5HtL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-mermaid",
      "title": "Womens Maxi Dress Long Sleeve Mermaid",
      "price": 75.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/41ZrHu0al1L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-short-sleeve",
      "title": "Womens Maxi Dress Evening Short Sleeve",
      "price": 65.98,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61LNlQEZAzL._SL1500_.jpg"
      ]
    }
  ]
}