{
  "id": "womens-maxi-dress-bodycon-formal-cocktail-maxi",
  "handle": "womens-maxi-dress-bodycon-formal-cocktail-maxi",
  "sku": "JC2324",
  "asin": "B0DRCKF5F1",
  "title": "Womens Maxi Dress Bodycon Formal Cocktail Maxi",
  "title_original": "PRETTYGARDEN Women Summer Strapless Maxi Dress Bodycon Floral Sexy Long Wedding Guest Dress Formal Tube Mesh Cocktail Dresses",
  "brand": "Visit the PRETTYGARDEN Store",
  "price": 29.89,
  "social_proof": {
    "bought_past_month": 1706,
    "text": "1706+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/71NMR4flx8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/818GzM-EUBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/8160fbdZJoL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81Vxn3AD1VL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/8108ZxcQDjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/812MwA0ixSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71foRueyzFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61wHgowXjzL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61sTR9oze4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61g1AeFL7wL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61fILjXdD+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71UnmYmpXTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Xurq0AAeL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/612KDF3RwyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61VfuGAkmTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/719msvFewKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/6167pp31JGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/616JS0djxUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61FC-QcviRL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61wA3WbJU-L._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/71NMR4flx8L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/818GzM-EUBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/8160fbdZJoL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81Vxn3AD1VL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/8108ZxcQDjL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/812MwA0ixSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71foRueyzFL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61wHgowXjzL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61sTR9oze4L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61g1AeFL7wL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61fILjXdD+L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71UnmYmpXTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Xurq0AAeL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/612KDF3RwyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61VfuGAkmTL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/719msvFewKL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/6167pp31JGL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/616JS0djxUL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61FC-QcviRL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61wA3WbJU-L._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ December 24, 2024",
    "ASIN ‏": "‎ B0DRCJW9MF",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#13,783 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #30 in Women's Formal Dresses",
    "Customer Reviews": "4.5 4.5 out of 5 stars (546)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Sky Blue Red Floral",
      "Floral Purple Pink",
      "Pink Floral",
      "Green Floral",
      "Navy Rose Red Flower",
      "Brown Floral",
      "Blue Pink Floral",
      "Yellow Flower",
      "White Orange Floral",
      "Black Pink Flower",
      "Eggplant Purple",
      "Black Red Flower",
      "Gradient Bean Paste",
      "Dark Green Floral",
      "Red Pink Flower"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.5,
    "count": 546,
    "customers_say": "Customers find this dress beautiful, with one noting it looks expensive, and appreciate its perfect length and flattering fit that hugs the body down to the thighs. The dress is comfortable, not itchy, and comes in vibrant colors with multiple color options. Customers find it versatile, suitable for both day and night events, and appreciate its sturdiness as the top stays in place without sliding down. Select to learn more Beauty Fit Quality Comfort Flattering Color Wearability Sturdiness 103 customers mention \"Beauty\" 101 positive 2 negative Customers find the dress beautiful, describing it as super pretty with a multi-style look that appears expensive. \"Got many compliments on this beautiful dress . It’s very form fitting, so I returned my normal size small and ordered a medium. It was perfect.\" Read more \"Sexy, beautiful , slimming dress. Made for slender body! Great fabric, not see through. Buy it! You will love it.\" Read more \"...again when I know I want to wear something comfortable, stretchy, and sexy . I'm even 5'0 and the length is perfect for me.\" Read more \"...I wore this to an awards event and received a lot of compliments! Super cute and right amount of fancy. Comfort:...\" Read more 86 customers mention \"Fit\" 76 positive 10 negative Customers are satisfied with how the dress fits, particularly noting its perfect length and how it sits well above the chest, with one customer mentioning it scrunches nicely. \"Beautiful dress, super soft fabric, great fit , perfect length.\" Read more \"...and went with my normal size of small which was true to size and a perfect fit . For the price this dress is very well made and good quality....\" Read more \"...The colors are vibrant and fits like a glove . The material is stretchy but no see through. Perfect for vacation or a night on the town....\" Read more \"It fits perfectly and it goes for all occasions! Love the color, material is great very comfortable and it stretches.\" Read more 47 customers mention \"Quality\" 40 positive 7 negative Customers have mixed opinions about the dress's quality, with some finding it beautiful and amazing, while others describe it as cheap. \"...For the price this dress is very well made and good quality . It's made of a soft comfortable stretchy material and flows with the body....\" Read more \" Great dress ! I might suggest if you're a size 6/8 get the medium its stretchy but small is bit tight\" Read more \"...Never disappointed. Great quality . Perfect fit. I have never returned anything from Pretty Garden. A huge fan!\" Read more \" Perfect dress ! True to size. I received many compliments.\" Read more 46 customers mention \"Comfort\" 46 positive 0 negative Customers find the dress comfortable and not itchy, with one mentioning it is very forgiving. \"I LOVE this dress! it is so comfortable and soft. I wore it on my honeymoon and got so many compliments. It is true to size as well. So sexy and fun!\" Read more \"...It stayed up all night and was very comfortable . It’s also lined, so no worries about being see-through. I got many compliments on it!\" Read more \"Very flattering and comfy . I ordered the yellow one for outdoor college graduation. I got so many compliments on it....\" Read more \"The dress was so comfortable and looked amazing on! I am 5’3” and 155lbs and I ordered a medium. The size was perfect and it fit like a glove....\" Read more 38 customers mention \"Flattering\" 37 positive 1 negative Customers find the dress flattering, noting that it hugs all the right places, and one customer mentions it works well for curves. \"This dress is very flattering and fits TTS. The material is lightweight, silky smooth, and has stretch. The silicone grips around the top are a plus!...\" Read more \"Perfect dress for my anniversary! Comfortable and flattering , true to size but has some stretch. I got lots of compliments on it!...\" Read more \"Such a pretty and flattering dress ! Wore it to a dinner in Miami Beach and it was perfect. It stayed up all night and was very comfortable....\" Read more \"... Very flattering dress and loose enough to \"scrunch\" it around my tummy to hide my waist a bit.\" Read more 32 customers mention \"Color\" 31 positive 1 negative Customers like the dress's color, describing it as vibrant. \"It fits perfectly and it goes for all occasions! Love the color , material is great very comfortable and it stretches.\" Read more \"This dress is EVERYTHING I hoped for and more! The floral print is vibrant but not too loud — it gives such a soft, feminine look that’s perfect for...\" Read more \"...with a secure elastic around the bust, awesome split in the back, gorgeous color and fiited silhouette. The dress is also very comfortable....\" Read more \"...the dress isn’t tight-fitting and very attractive, and the color is true to the picture . By the way, I look young for my age, it runs in my family.\" Read more 29 customers mention \"Wearability\" 29 positive 0 negative Customers find the dress versatile, describing it as a great day-to-night vacation dress that works well for both weddings and date nights. \" perfect summer dress \" Read more \"...This is the perfect vacation dress !\" Read more \"This strapless maxi dress is beautiful and perfect for Summer events ! The floral mesh design is elegant and flattering....\" Read more \"...I love the fit & the fashion. Perfect for a date night .\" Read more 23 customers mention \"Sturdiness\" 22 positive 1 negative Customers appreciate the dress's sturdiness, noting that the top stays in place without sliding down, and one customer mentions it works well with adhesive tape. \"Fits my curves perfectly and it stays in place ! Looks just as pictured! Vibrant blue and pink and it is lined! Very happy with this purchase!\" Read more \"...This dress is stunning. It fits well. It’s not too clingy . It’s got a little rushing on the side, beautiful.\" Read more \"Buy it, it's a sexy dress and nice fabric. Clings to your body .\" Read more \"...Wore it to a dinner in Miami Beach and it was perfect. It stayed up all night and was very comfortable....\" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars A must buy",
        "body": "I love this dress so much I had to order 2 more colors. First- the material is high quality- the dress actually has 2 layers yet is still lightweight enough for a hot summer day. 2nd, the colors POP- they are so vibrant and design of flowers is clear and well made. 3rd- the fit. Like a glove. I felt so sexy and comfortable wearing this dress with wedges or flip flops - I am only 5”3 and usually dresses can be too long. This was perfectly to my ankle so I didn’t trip on it and could run barefoot if I wanted. I am not big chested so I always feel like with a strapless I have to keep pulling it up- not this dress. It was tight- in a good way- and I felt secure every minute. Don’t need to wear a bra but I chose to. I got so many compliments and questions on where I got the dress- I’m afraid now my whole neighborhood will be wearing it !! lol can’t beat the price, quality, design, fit, color choices. Bought a small. These aren’t the best pictures but you’ll see I’m having a grand ol time in this dress lol Read more",
        "author": "Steph O",
        "rating": 5.0,
        "date": "July 20, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71TIU6QoweL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71y-R6g8iML._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/81jnUsuuK6L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Affordable and very well made. Beautiful dress",
        "body": "The media could not be loaded. I'm 5'1\" 110 pounds and went with my normal size of small which was true to size and a perfect fit. For the price this dress is very well made and good quality. It's made of a soft comfortable stretchy material and flows with the body. The outer material is mesh with a sewn in stretchy material that feels almost like satin. Very breathable. This dress is very flattering in all the right places and doesn't cling. The top elastic has a silicone material to hold in place and it doesn't fall down. I love the back slit. The length is just right and works for tall or short women. The colors are so vibrant and exactly as advertised. This dress is a great deal and very affordable. Perfect for the beach or to wear to a wedding. Highly recommend. Read more",
        "author": "Sarah Owen",
        "rating": 5.0,
        "date": "August 19, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61LWlKiBWsL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/612OC2rriNL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars The most comfortable strapless dress",
        "body": "This dress hugs you in all the right places. I got the red so that my tan would look nice against it. Love all the color options and will definitely wear again when I know I want to wear something comfortable, stretchy, and sexy. I'm even 5'0 and the length is perfect for me. Read more",
        "author": "Ashley May",
        "rating": 5.0,
        "date": "November 21, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars New Fav Floral Dress!!",
        "body": "It fit SO NICELY!! I have a square body and it made my body look great. I wore it for some birthday beach photos and I love the way the dress looked in them. Material was comfortable and not sheer at all. Color matched the dress and I found the length and fit to be perfect (i’m about 5’3 and 118lbs)!! Definitely true to size!! Would highly recommend this dress!!! Read more",
        "author": "Lauren",
        "rating": 5.0,
        "date": "October 13, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/51bwON3bJeL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "4.0 out of 5 stars Cute maxi",
        "body": "I love the brand PRETTYGARDEN and I’ve bought a lot of clothing off here from them. The sizing is always true to size, but this dress was a little bit tight. I always wear a medium, I’m 5 foot six, 155 pounds. The length is nice however it’s a bit cheap in the quality of material. I wouldn’t say it’s sheer, but it’s very thin. It has a minimal amount of stretching to it. The print was very pretty and vivid which I liked so that’s why I kept the dress. The price point was good so I decided to purchase, happy I did. Read more",
        "author": "Customer",
        "rating": 4.0,
        "date": "October 15, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars STUNNING",
        "body": "fits like a glove and looks exactly as pictured!! it doesn’t slip or shift if i’m moving or anything!! it’s so soft and thin enough to be stretchy and breathable but thick enough to be transparent or cheap looking. color is vibrant and the dress hugs my body down to my thighs and loosens at the knees to allow for walking. 10/10 no notes at all Read more",
        "author": "Kayden Safavi",
        "rating": 5.0,
        "date": "October 27, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars PERFECT SUMMER DRESS",
        "body": "This dress is EVERYTHING I hoped for and more! The floral print is vibrant but not too loud — it gives such a soft, feminine look that’s perfect for spring and summer. I wore it to a brunch and had three people ask where I got it! The fabric is lightweight and breathable, making it ideal for warm weather, but it’s not see-through at all. It hugs in all the right places and flows beautifully — super flattering without being tight. I especially love the waistline and how it gives that effortlessly put-together look. I’m 5'5\" and about 170 lbs, and the fit was true to size. If you're on the fence, GET IT. You won’t regret adding this to your wardrobe! Read more",
        "author": "Jazzyymannn",
        "rating": 5.0,
        "date": "July 1, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/81gJc8zja5L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Super cute",
        "body": "Fits great , it does not slip . The fabric is really nice and good quality . Great for warm weather . Read more",
        "author": "Christine Lino",
        "rating": 5.0,
        "date": "November 26, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Bodycon Formal Cocktail Maxi is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.",
  "about_this_item": "Womens Maxi Dress Bodycon Formal Cocktail Maxi is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nComfort comes from both the cut and the fabric, so selecting your preferred fit makes a noticeable difference over a full day of wear.\n\nTo keep it looking sharp, follow the care label first and avoid high heat when drying or steaming if the material is sensitive.",
  "long_description": "Womens Maxi Dress Bodycon Formal Cocktail Maxi is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Sky Blue Red Floral, Floral Purple Pink, Pink Floral, Green Floral, Navy Rose Red Flower, Brown Floral, Blue Pink Floral, Yellow Flower, White Orange Floral, Black Pink Flower, Eggplant Purple, Black Red Flower, Gradient Bean Paste, Dark Green Floral. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Bodycon Formal Cocktail Maxi is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Sky Blue Red Floral, Floral Purple Pink, Pink Floral, Green Floral, Navy Rose Red Flower, Brown Floral, Blue Pink Floral, Yellow Flower, White Orange Floral, Black Pink Flower, Eggplant Purple, Black Red Flower, Gradient Bean Paste, Dark Green Floral. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "0e9f7877-8df1-4168-a987-8cfbeec55080",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0e9f7877-8df1-4168-a987-8cfbeec55080/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0e9f7877-8df1-4168-a987-8cfbeec55080/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/552b0439-6111-44e5-a207-24971b1cbf4a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "81e19505-61cd-444f-bf20-8c7b1ad81753",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/81e19505-61cd-444f-bf20-8c7b1ad81753/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/81e19505-61cd-444f-bf20-8c7b1ad81753/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/552b0439-6111-44e5-a207-24971b1cbf4a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "d576ba1f-55cf-4168-b271-00a9a137a983",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d576ba1f-55cf-4168-b271-00a9a137a983/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d576ba1f-55cf-4168-b271-00a9a137a983/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/552b0439-6111-44e5-a207-24971b1cbf4a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "f74fde5c-fcb4-4943-a3ae-6aa81e5a7f4c",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f74fde5c-fcb4-4943-a3ae-6aa81e5a7f4c/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f74fde5c-fcb4-4943-a3ae-6aa81e5a7f4c/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/552b0439-6111-44e5-a207-24971b1cbf4a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "882c4692-d1e2-4901-b680-cb98b5187894",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/882c4692-d1e2-4901-b680-cb98b5187894/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/882c4692-d1e2-4901-b680-cb98b5187894/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/552b0439-6111-44e5-a207-24971b1cbf4a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "74e48f0c-a16d-495d-a949-819ed979ab21",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/74e48f0c-a16d-495d-a949-819ed979ab21/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/74e48f0c-a16d-495d-a949-819ed979ab21/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/552b0439-6111-44e5-a207-24971b1cbf4a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "7ccd7707-9fa7-4491-bd9b-48400fbd47d5",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7ccd7707-9fa7-4491-bd9b-48400fbd47d5/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7ccd7707-9fa7-4491-bd9b-48400fbd47d5/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/552b0439-6111-44e5-a207-24971b1cbf4a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "183a60b8-0299-444c-8180-2a3be85ce710",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/183a60b8-0299-444c-8180-2a3be85ce710/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/183a60b8-0299-444c-8180-2a3be85ce710/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/552b0439-6111-44e5-a207-24971b1cbf4a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "9f47288e-f204-4495-b903-8959c9f7e3eb",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9f47288e-f204-4495-b903-8959c9f7e3eb/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9f47288e-f204-4495-b903-8959c9f7e3eb/default.vertical.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/552b0439-6111-44e5-a207-24971b1cbf4a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "e4140eb4-c995-4a4e-a461-acd5f4ca3315",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e4140eb4-c995-4a4e-a461-acd5f4ca3315/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e4140eb4-c995-4a4e-a461-acd5f4ca3315/default.jobtemplate.hls.m3u8"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/552b0439-6111-44e5-a207-24971b1cbf4a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "4125bc55-7d6d-40ff-ada5-72c391eb4934",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4125bc55-7d6d-40ff-ada5-72c391eb4934/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4125bc55-7d6d-40ff-ada5-72c391eb4934/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/552b0439-6111-44e5-a207-24971b1cbf4a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    },
    {
      "id": "4055d866-5e22-4e79-b171-71dd2c64cad4",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4055d866-5e22-4e79-b171-71dd2c64cad4/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4055d866-5e22-4e79-b171-71dd2c64cad4/videopreview.jobtemplate.mp4.default.mp4"
        }
      ],
      "poster": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/552b0439-6111-44e5-a207-24971b1cbf4a.mp4/r/THUMBNAIL_360P_FRAME_3_CAPTURE_2.JPG"
    }
  ],
  "color_swatches": {
    "Sky Blue Red Floral": "https://m.media-amazon.com/images/I/31vOS9br2OL._AC_SR38,50_.jpg",
    "Floral Purple Pink": "https://m.media-amazon.com/images/I/31nFyeDSOiL._AC_SR38,50_.jpg",
    "Pink Floral": "https://m.media-amazon.com/images/I/314E6LKTIBL._AC_SR38,50_.jpg",
    "Green Floral": "https://m.media-amazon.com/images/I/31j771FrqIL._AC_SR38,50_.jpg",
    "Navy Rose Red Flower": "https://m.media-amazon.com/images/I/31ACRB-s7EL._AC_SR38,50_.jpg",
    "Brown Floral": "https://m.media-amazon.com/images/I/31TfP4ryiWL._AC_SR38,50_.jpg",
    "Blue Pink Floral": "https://m.media-amazon.com/images/I/31YTbKGSB6L._AC_SR38,50_.jpg",
    "Yellow Flower": "https://m.media-amazon.com/images/I/31HWunNA5AL._AC_SR38,50_.jpg",
    "White Orange Floral": "https://m.media-amazon.com/images/I/312IrOEQfKL._AC_SR38,50_.jpg",
    "Black Pink Flower": "https://m.media-amazon.com/images/I/312ZMSjyiML._AC_SR38,50_.jpg",
    "Eggplant Purple": "https://m.media-amazon.com/images/I/31Wmgy7cWdL._AC_SR38,50_.jpg",
    "Black Red Flower": "https://m.media-amazon.com/images/I/316X5bLJM3L._AC_SR38,50_.jpg",
    "Gradient Bean Paste": "https://m.media-amazon.com/images/I/31cIn2t6-5L._AC_SR38,50_.jpg",
    "Dark Green Floral": "https://m.media-amazon.com/images/I/31R5lAnGEbL._AC_SR38,50_.jpg",
    "Red Pink Flower": "https://m.media-amazon.com/images/I/31M7PlzR74L._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Sky Blue Red Floral": "71foRueyzFL",
    "Floral Purple Pink": "61wHgowXjzL",
    "Pink Floral": "61sTR9oze4L",
    "Green Floral": "61g1AeFL7wL",
    "Navy Rose Red Flower": "61fILjXdD+L",
    "Brown Floral": "71UnmYmpXTL",
    "Blue Pink Floral": "61Xurq0AAeL",
    "Yellow Flower": "612KDF3RwyL",
    "White Orange Floral": "61VfuGAkmTL",
    "Black Pink Flower": "71NMR4flx8L",
    "Eggplant Purple": "719msvFewKL",
    "Black Red Flower": "6167pp31JGL",
    "Gradient Bean Paste": "616JS0djxUL",
    "Dark Green Floral": "61FC-QcviRL",
    "Red Pink Flower": "61wA3WbJU-L"
  },
  "color_images": {
    "Sky Blue Red Floral": [
      "https://m.media-amazon.com/images/I/71foRueyzFL._SL1500_.jpg"
    ],
    "Floral Purple Pink": [
      "https://m.media-amazon.com/images/I/61wHgowXjzL._SL1500_.jpg"
    ],
    "Pink Floral": [
      "https://m.media-amazon.com/images/I/61sTR9oze4L._SL1500_.jpg"
    ],
    "Green Floral": [
      "https://m.media-amazon.com/images/I/61g1AeFL7wL._SL1500_.jpg"
    ],
    "Navy Rose Red Flower": [
      "https://m.media-amazon.com/images/I/61fILjXdD+L._SL1500_.jpg"
    ],
    "Brown Floral": [
      "https://m.media-amazon.com/images/I/71UnmYmpXTL._SL1500_.jpg"
    ],
    "Blue Pink Floral": [
      "https://m.media-amazon.com/images/I/61Xurq0AAeL._SL1500_.jpg"
    ],
    "Yellow Flower": [
      "https://m.media-amazon.com/images/I/612KDF3RwyL._SL1500_.jpg"
    ],
    "White Orange Floral": [
      "https://m.media-amazon.com/images/I/61VfuGAkmTL._SL1500_.jpg"
    ],
    "Black Pink Flower": [
      "https://m.media-amazon.com/images/I/71NMR4flx8L._SL1500_.jpg"
    ],
    "Eggplant Purple": [
      "https://m.media-amazon.com/images/I/719msvFewKL._SL1500_.jpg"
    ],
    "Black Red Flower": [
      "https://m.media-amazon.com/images/I/6167pp31JGL._SL1500_.jpg"
    ],
    "Gradient Bean Paste": [
      "https://m.media-amazon.com/images/I/616JS0djxUL._SL1500_.jpg"
    ],
    "Dark Green Floral": [
      "https://m.media-amazon.com/images/I/61FC-QcviRL._SL1500_.jpg"
    ],
    "Red Pink Flower": [
      "https://m.media-amazon.com/images/I/61wA3WbJU-L._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress-cocktail-formal-evening",
      "title": "Womens Dress Cocktail Formal Evening",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/71-YlJD0XgL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-formal-evening",
      "title": "Womens Dress Formal Evening",
      "price": 72.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/616d5PsvI0L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51+ZvnP0Z4L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-cocktail-short-sleeve",
      "title": "Womens Dress Cocktail Short Sleeve",
      "price": 34.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61qT6feocKL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-split-evening-off-shoulder-cocktail-sleeveless",
      "title": "Womens Maxi Dress Split Evening Off Shoulder Cocktail Sleeveless",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51XYSPVNS9L._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 37.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Work",
      "images": [
        "https://m.media-amazon.com/images/I/71A+oMNr1kL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi",
      "title": "Womens Maxi Dress Maxi",
      "price": 46.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/81MG1MAn2FL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 389.55,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/717dKlwUK-L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-formal",
      "title": "Womens Dress Formal",
      "price": 82.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61xvGFTRlEL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 24.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/81-gVZjMLrL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 10.95,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/81VSldp0TJL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-mermaid-off-shoulder-long-sleeve",
      "title": "Womens Maxi Dress Mermaid Off Shoulder Long Sleeve",
      "price": 54.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Wedding Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/61rENQWxiaL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-off-shoulder",
      "title": "Womens Maxi Dress Off Shoulder",
      "price": 109.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/81rA4Ceha4L._SL1500_.jpg"
      ]
    }
  ]
}