{
  "id": "womens-maxi-dress-short-sleeve-bodycon-maxi",
  "handle": "womens-maxi-dress-short-sleeve-bodycon-maxi",
  "sku": "JC1128",
  "asin": "B0F5P4ZM1M",
  "title": "Womens Maxi Dress Short Sleeve Bodycon Maxi",
  "title_original": "AYWA Womens Sexy Backless Maxi Dress Casual Bodycon Short Sleeve Party Club Long Dresses",
  "brand": "Visit the AYWA Store",
  "price": 19.99,
  "social_proof": {
    "bought_past_month": 55,
    "text": "55+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/31RG-6bRDnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/718Nvpvj-jL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61gqEA20ZCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51N+2tnKfuL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51YKrblfGSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Kt9UCOXCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41PHcxvW-CL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41wcqPE5unL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31O0t4YoHtL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31S0VcDo01L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41CjYLwNqgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41FP5G7oaCL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/31RG-6bRDnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/718Nvpvj-jL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61gqEA20ZCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51N+2tnKfuL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51YKrblfGSL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71Kt9UCOXCL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41PHcxvW-CL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41wcqPE5unL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31O0t4YoHtL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/31S0VcDo01L._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41CjYLwNqgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41FP5G7oaCL._SL1500_.jpg"
  ],
  "aplus_images": [],
  "description_images": [],
  "bullets": [],
  "specs": {
    "Date First Available ‏": "‎ April 20, 2025",
    "ASIN ‏": "‎ B0F5NXZCYR",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#73,561 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #416 in Women's Club & Night Out Dresses",
    "Customer Reviews": "4.7 4.7 out of 5 stars (96)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Navy",
      "Pink",
      "White",
      "Light Heather Grey",
      "Dark Grey",
      "Black",
      "Cocoa"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 4.7,
    "count": 96,
    "customers_say": "Customers find the dress fits well, with one noting it hits at the right length, and they appreciate its soft, stretchy material that's comfortable and flattering. The dress receives positive feedback for its quality, with one customer mentioning it's perfect for a night on Broadway, and customers find it sexy in the back. The sturdiness receives mixed reviews. Generated from the text of customer reviews Select to learn more Fit (11) Beauty (9) Quality (9) Comfort (8) Flattering (7) Soft material (6) Stretchiness (5) Sturdiness (3) 11 customers mention fit, 9 positive, 2 negative 11 customers mention \"Fit\" 9 positive 2 negative Customers like how the dress fits, with one mentioning it's stretchy and another noting it hits at the right length. \" ...I’ve worn it twice now. It’s very form fitting but comfortable. The fabric is pretty stretchy so you can dress up for down. \" Read more \" ...Got a size XS, I'm 5'2 and around 110 lbs! Fit so perfect , wasn't too long or short either!... \" Read more \" This dress fit like a glove . I got so many compliments! It was a nice stretchy material. I got a size small. I’m 5’3 125lbs 34 DD.... \" Read more \" I'm typically a small but went with a medium and it fits perfect . Fitted but stretchy. I'm 5'6 130 lbs.... \" Read more 9 customers mention beauty, 9 positive, 0 negative 9 customers mention \"Beauty\" 9 positive 0 negative Customers find the dress very pretty and sexy in the back, with one describing it as a perfect little black dress. \" Gorgeous ! \" Read more \" Fabric is nice, cute dress \" Read more \" The dress is beautiful , I had gotten size S but I personally don’t like it so so tight so I will be returning and sizing up for reference I’m 120... \" Read more \" ...I got so many compliments and it is very sexy without being too over the top.... \" Read more 9 customers mention quality, 9 positive, 0 negative 9 customers mention \"Quality\" 9 positive 0 negative Customers find the dress to be of great quality, with one mentioning it's perfect for a night on Broadway, while another notes it's ideal for date night. \" Fits perfectly and looks beautiful on it, great quality \" Read more \" Get the dress! Perfect for date night or if you just want to show off your back LOL... \" Read more \" Soooo comfy, almost perfect but it’s a little short for a tall girly \" Read more \" ...Sizing was perfect and just right . \" Read more 8 customers mention comfort, 8 positive, 0 negative 8 customers mention \"Comfort\" 8 positive 0 negative Customers find the dress comfortable. \" Put it in the cart!! This dress is SO soft, comfortable , and flattering. The material and thick and has a lot of stretch to it.... \" Read more \" ...It is so easy to either dress up or dress down. It’s also very comfortable , soft material that helps snatch you.... \" Read more \" Soooo comfy ,almost perfect but it’s a little short for a tall girly \" Read more \" ...I was skeptical, but exceeded my expectations and it’s so comfortable . \" Read more 7 customers mention flattering, 7 positive, 0 negative 7 customers mention \"Flattering\" 7 positive 0 negative Customers find the dress flattering, with one mentioning it fits well to the body. \" Put it in the cart!! This dress is SO soft, comfortable, and flattering . The material and thick and has a lot of stretch to it.... \" Read more \" This dress is so flattering ! I saw it on my daughter and I had to get one too ! \" Read more \" Very flattering \" Read more \" Was soooo flattering , wore this for my anniversary! Got a size XS, I'm 5'2 and around 110 lbs! Fit so perfect, wasn't too long or short either!... \" Read more 6 customers mention soft material, 6 positive, 0 negative 6 customers mention \"Soft material\" 6 positive 0 negative Customers like the soft material of the dress. \" ...Fitted but stretchy. I'm 5'6 130 lbs. material is very soft and pretty thick for the price. Length hits right where it should \" Read more \" ...It’s also very comfortable, soft material that helps snatch you. I am only 5 feet tall so it deets like a maxi but still loved it either way!... \" Read more \" ...Looks just like the picture, I wore it off the shoulder tho! Feels super soft and light on the skin, did ride up slightly since it was skintight,... \" Read more \" Put it in the cart!! This dress is SO soft , comfortable, and flattering. The material and thick and has a lot of stretch to it.... \" Read more 5 customers mention stretchiness, 5 positive, 0 negative 5 customers mention \"Stretchiness\" 5 positive 0 negative Customers appreciate the dress's stretchiness. \" ...I got so many compliments! It was a nice stretchy material . I got a size small. I’m 5’3 125lbs 34 DD. I taped my tatas and it looked great.... \" Read more \" ...The material and thick and has a lot of stretch to it . Not see through at all. I’m 5’6”, 149lbs, and got a medium, which was a perfect fit.... \" Read more \" ...It’s breathable and soft to the touch. It also has great stretch to it so it can form well to your body. Sizing was perfect and just right. \" Read more \" ...It’s very form fitting but comfortable. The fabric is pretty stretchy so you can dress up for down. \" Read more 3 customers mention sturdiness, 2 positive, 1 negative 3 customers mention \"Sturdiness\" 2 positive 1 negative Customers have mixed opinions about the dress's sturdiness, with one mentioning that the adhesive covers work well, while another notes that it rides up slightly. \" ...The fit is secure enough that adhesive covers (such as Cakes or Nippies) stay in place without any problems.... \" Read more \" ...Feels super soft and light on the skin, did ride up slightly since it was skintight, but this is pretty expected as I was running and dancing lol!... \" Read more \" ... Sat nicely against my skin , and wasn't see through at all! Can dress it up with some heels and pearls, or dress down with a sweater over top! \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Perfect date night dress",
        "body": "Was soooo flattering, wore this for my anniversary! Got a size XS, I'm 5'2 and around 110 lbs! Fit so perfect, wasn't too long or short either! Fell a bit below my ankles, but could be pulled up if desired! Looks just like the picture, I wore it off the shoulder tho! Feels super soft and light on the skin, did ride up slightly since it was skintight, but this is pretty expected as I was running and dancing lol! Sat nicely against my skin, and wasn't see through at all! Can dress it up with some heels and pearls, or dress down with a sweater over top! Read more",
        "author": "Teagan",
        "rating": 5.0,
        "date": "December 20, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Gorgeous and flattering",
        "body": "This dress is so flattering! I got so many compliments and it’s comfortable too. Quality is great for the price! It’s breathable and soft to the touch. It also has great stretch to it so it can form well to your body. Sizing was perfect and just right. Read more",
        "author": "Kimberly",
        "rating": 5.0,
        "date": "December 2, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Perfect little black dress! Classy in the front, sexy in the back!",
        "body": "The media could not be loaded. I’m 5’7”, 145 lbs, and typically wear a 34DDD. I ordered a size Medium and it fit perfectly. The material is very soft, stretchy, and comfortable, with a nice snug fit. I saw some reviews mentioning that the fabric was see-through, but I did not experience that issue at all. I did not wear a bra, and the dress was opaque for me. The fit is secure enough that adhesive covers (such as Cakes or Nippies) stay in place without any problems. If someone does find it to be slightly sheer, I would recommend sizing up. I wore this dress to a Christmas party and loved it—so much so that I plan to order it in additional colors. Read more",
        "author": "Sara B. Montgomery",
        "rating": 5.0,
        "date": "December 17, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71thsG-aOqL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71TkI7pQm+L._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "4.0 out of 5 stars Skims dupe!",
        "body": "Soooo comfy,almost perfect but it’s a little short for a tall girly Read more",
        "author": "Hannah Grauman",
        "rating": 4.0,
        "date": "October 11, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Highly recommend!",
        "body": "Put it in the cart!! This dress is SO soft, comfortable, and flattering. The material and thick and has a lot of stretch to it. Not see through at all. I’m 5’6”, 149lbs, and got a medium, which was a perfect fit. I got so many compliments and it is very sexy without being too over the top. If you’ve got a back that you want to show off, this is the dress to do it with! Read more",
        "author": "Mark Johnson",
        "rating": 5.0,
        "date": "September 16, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61durE-18EL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Solid choice",
        "body": "I'm typically a small but went with a medium and it fits perfect. Fitted but stretchy. I'm 5'6 130 lbs. material is very soft and pretty thick for the price. Length hits right where it should Read more",
        "author": "chris diacopoulos",
        "rating": 5.0,
        "date": "December 11, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/71lJzgu5ziL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/51s8p580bBL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Great quality",
        "body": "Fits perfectly and looks beautiful on it, great quality Read more",
        "author": "Lilian",
        "rating": 5.0,
        "date": "November 14, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars 5 stars!",
        "body": "This dress fit like a glove. I got so many compliments! It was a nice stretchy material. I got a size small. I’m 5’3 125lbs 34 DD. I taped my tatas and it looked great. It was very comfortable and flattering. Read more",
        "author": "Camryn",
        "rating": 5.0,
        "date": "October 25, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61at9xZuJAL._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71nnbPrJ5ML._SY88._SL1500_.jpg"
        ]
      }
    ]
  },
  "short_description": "Womens Maxi Dress Short Sleeve Bodycon Maxi is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.",
  "about_this_item": "Womens Maxi Dress Short Sleeve Bodycon Maxi is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.",
  "long_description": "Womens Maxi Dress Short Sleeve Bodycon Maxi is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Navy, Pink, White, Light Heather Grey, Dark Grey, Black, Cocoa. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Short Sleeve Bodycon Maxi is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Navy, Pink, White, Light Heather Grey, Dark Grey, Black, Cocoa. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "9571805e-03ff-421d-85c2-83f616c9c745",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9571805e-03ff-421d-85c2-83f616c9c745/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9571805e-03ff-421d-85c2-83f616c9c745/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "55904ebb-7916-4404-a85f-b8a8d7d7ebb9",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/55904ebb-7916-4404-a85f-b8a8d7d7ebb9/embedded.cc.default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/55904ebb-7916-4404-a85f-b8a8d7d7ebb9/embedded.cc.default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "fbddfca6-6d3e-4bee-b199-4e42d27e60e5",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/fbddfca6-6d3e-4bee-b199-4e42d27e60e5/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/fbddfca6-6d3e-4bee-b199-4e42d27e60e5/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "475c68ef-74a3-410f-8082-5f6d68a69316",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/475c68ef-74a3-410f-8082-5f6d68a69316/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/475c68ef-74a3-410f-8082-5f6d68a69316/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Navy": "https://m.media-amazon.com/images/I/21+ll5U4feL._AC_SR38,50_.jpg",
    "Pink": "https://m.media-amazon.com/images/I/21GCBOL9BlL._AC_SR38,50_.jpg",
    "White": "https://m.media-amazon.com/images/I/31O0t4YoHtL._AC_SR38,50_.jpg",
    "Light Heather Grey": "https://m.media-amazon.com/images/I/31S0VcDo01L._AC_SR38,50_.jpg",
    "Dark Grey": "https://m.media-amazon.com/images/I/214PLLY6lFL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31RG-6bRDnL._AC_SR38,50_.jpg",
    "Cocoa": "https://m.media-amazon.com/images/I/21-4Q38q4TL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Navy": "41PHcxvW-CL",
    "Pink": "41wcqPE5unL",
    "White": "31O0t4YoHtL",
    "Light Heather Grey": "31S0VcDo01L",
    "Dark Grey": "41CjYLwNqgL",
    "Black": "31RG-6bRDnL",
    "Cocoa": "41FP5G7oaCL"
  },
  "color_images": {
    "Navy": [
      "https://m.media-amazon.com/images/I/41PHcxvW-CL._SL1500_.jpg"
    ],
    "Pink": [
      "https://m.media-amazon.com/images/I/41wcqPE5unL._SL1500_.jpg"
    ],
    "White": [
      "https://m.media-amazon.com/images/I/31O0t4YoHtL._SL1500_.jpg"
    ],
    "Light Heather Grey": [
      "https://m.media-amazon.com/images/I/31S0VcDo01L._SL1500_.jpg"
    ],
    "Dark Grey": [
      "https://m.media-amazon.com/images/I/41CjYLwNqgL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/31RG-6bRDnL._SL1500_.jpg"
    ],
    "Cocoa": [
      "https://m.media-amazon.com/images/I/41FP5G7oaCL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 33.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61W5l+uioHL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-one-shoulder-formal-mermaid",
      "title": "Womens Maxi Dress Evening One Shoulder Formal Mermaid",
      "price": 69.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/613xHpbpN5L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-split-maxi-long-sleeve",
      "title": "Womens Maxi Dress Split Maxi Long Sleeve",
      "price": 18.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61tOVhv9IVL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 27.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/61Xr-CW12GL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress",
      "title": "Womens Maxi Dress",
      "price": 155.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61Oyv4QLL-L._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-maxi-dress-v-neck-formal-maxi-short-sleeve-evening",
      "title": "Womens Maxi Dress V Neck Formal Maxi Short Sleeve Evening",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71jMpbRn-1L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-bodycon-sleeveless-off-shoulder",
      "title": "Womens Dress Bodycon Sleeveless Off Shoulder",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/515+8bU3ojL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-bodycon-maxi-v-neck-long-sleeve",
      "title": "Womens Maxi Dress Evening Bodycon Maxi V Neck Long Sleeve",
      "price": 45.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses",
      "images": [
        "https://m.media-amazon.com/images/I/519n5+gVMAL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-v-neck",
      "title": "Womens Dress V Neck",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51sXBITuxDL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-cocktail-maxi-long-sleeve",
      "title": "Womens Maxi Dress Formal Cocktail Maxi Long Sleeve",
      "price": 60.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/510LBzSeAtL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-evening-formal",
      "title": "Womens Maxi Dress Evening Formal",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51LOMeoQOFL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve-maxi-v-neck-formal",
      "title": "Womens Maxi Dress Long Sleeve Maxi V Neck Formal",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/610jcJG1Q0L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-mermaid-formal",
      "title": "Womens Maxi Dress Mermaid Formal",
      "price": 76.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/51FZ-KaORvL._SL1500_.jpg"
      ]
    }
  ]
}