{
  "id": "womens-maxi-dress-long-sleeve-split-ruched",
  "handle": "womens-maxi-dress-long-sleeve-split-ruched",
  "sku": "JC1510",
  "asin": "B0DMP3FTTS",
  "title": "Womens Maxi Dress Long Sleeve Split Ruched",
  "title_original": "Floerns Women's Square Neck Lantern Long Sleeve Dress Split Ruched Party Midi Dresses",
  "brand": "Visit the Floerns Store",
  "price": 52.99,
  "social_proof": {
    "bought_past_month": 54,
    "text": "54+ bought in the past month"
  },
  "images": [
    "https://m.media-amazon.com/images/I/61F+2INCNkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61AoRKC-SsL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61w+IWwdIbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61+EwfafZyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71j3IVOH4CL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61VIlmFSspL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61iz96yMpHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Zi8rhD9ZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/617fFzqrSaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Sa9MugasL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/613BkAmD5fL._SL1500_.jpg"
  ],
  "gallery_images": [
    "https://m.media-amazon.com/images/I/61F+2INCNkL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61AoRKC-SsL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61w+IWwdIbL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61+EwfafZyL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/71j3IVOH4CL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61VIlmFSspL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61iz96yMpHL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Zi8rhD9ZL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/617fFzqrSaL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/61Sa9MugasL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/613BkAmD5fL._SL1500_.jpg"
  ],
  "aplus_images": [
    "https://m.media-amazon.com/images/I/31Ygq6A3GgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41KWWivf%2BpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41ZaTgdyfIL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51QwyxPNdmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41uSs9sXtBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41BmLiZTYxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41bPv%2B3xMtL._SL1500_.jpg"
  ],
  "description_images": [
    "https://m.media-amazon.com/images/I/31Ygq6A3GgL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41KWWivf%2BpL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41ZaTgdyfIL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51QwyxPNdmL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41uSs9sXtBL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41BmLiZTYxL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/41bPv%2B3xMtL._SL1500_.jpg"
  ],
  "bullets": [],
  "specs": {
    "Department ‏": "‎ womens",
    "Date First Available ‏": "‎ September 28, 2024",
    "ASIN ‏": "‎ B0DJ53PQZL",
    "Product Warranty": "For warranty information about this product, please click here",
    "Best Sellers Rank": "#27,927 in Clothing, Shoes & Jewelry ( See Top 100 in Clothing, Shoes & Jewelry ) #247 in Women's Casual Dresses",
    "Customer Reviews": "3.9 3.9 out of 5 stars (98)"
  },
  "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
  "variations": {
    "sizes": [
      "5",
      "5.5",
      "6",
      "6.5",
      "7",
      "7.5",
      "8",
      "8.5",
      "9",
      "9.5",
      "10",
      "11"
    ],
    "colors": [
      "Dark Green",
      "Maroon",
      "Rust Brown",
      "Black",
      "Dusty Blue",
      "Green"
    ],
    "size_chart": {
      "label": "Size chart",
      "href": "javascript:void(0)",
      "html": null
    }
  },
  "reviews": {
    "average_rating": 3.9,
    "count": 98,
    "customers_say": "Customers find the dress beautiful, with one noting it looks okay from a distance, and they appreciate its lovely color, flattering appearance, comfort, and high quality. The fit receives mixed feedback - while some say it's perfect length, others find it very tight on the chest. The material quality is also mixed, with some finding it nice while others describe it as thin. Generated from the text of customer reviews Select to learn more Beauty (21) Color (8) Flattering (8) Comfort (7) Quality (7) Fit (18) Material quality (8) Material thickness (11) 21 customers mention beauty, 19 positive, 2 negative 21 customers mention \"Beauty\" 19 positive 2 negative Customers find the dress cute, with one mentioning it looks okay from a distance. \" It's cute ... but for the price.. I wouldn't purchase it. It's thin and see through and the top doesn't look like it does in the picture.... \" Read more \" Super flattering and beautiful ! I got this so I could feel pretty while postpartum. Fits well and is comfortable and good quality! \" Read more \" Beautiful dress but no lining. Just one layer so it was chilly at a cool fall wedding. Other than that, it is very flattering! \" Read more \" This dress ended up being the perfect wedding guest dress! Flowy and super cute .... \" Read more 8 customers mention color, 8 positive, 0 negative 8 customers mention \"Color\" 8 positive 0 negative Customers love the color of the dress. \" I loved the color of this dress and think it may be cute on a different body type. The chest was a little tight along the middle.... \" Read more \" ...My sister got it, and I’m already eyeing hers to borrow. The green is gorgeous , the ruching is adorable, and the flow of the dress is perfect.... \" Read more \" Really love this dress, the color is gorgeous . It was comfortable to wear and didn’t feel uncomfortable. It had a good stretch to it.... \" Read more \" ...The color is beautiful . \" Read more 8 customers mention flattering, 7 positive, 1 negative 8 customers mention \"Flattering\" 7 positive 1 negative Customers find the dress flattering. \" This dress is so cute, elegant, and flattering ! My sister got it, and I’m already eyeing hers to borrow.... \" Read more \" Very flattering !... \" Read more \" This dress would be really flattering on the right body type , I am definitely not the type for this dress lol.... \" Read more \" Beautiful. Flattering . Perfect length for me. I’m 5’3”. I’m a size 6 and a medium was great.... \" Read more 7 customers mention comfort, 7 positive, 0 negative 7 customers mention \"Comfort\" 7 positive 0 negative Customers find the dress comfortable. \" ...I got this so I could feel pretty while postpartum. Fits well and is comfortable and good quality! \" Read more \" ...’s perfectly fitted at the top and loose enough in the arms to be so comfortable . And was a great length! \" Read more \" Really love this dress, the color is gorgeous. It was comfortable to wear and didn’t feel uncomfortable. It had a good stretch to it.... \" Read more \" ...No pockets but is pretty comfortable . \" Read more 7 customers mention quality, 5 positive, 2 negative 7 customers mention \"Quality\" 5 positive 2 negative Customers find the dress to be of high quality, with one mentioning it works perfectly as a wedding guest dress. \" ...It is also very thin. It is of good quality , but still thin. I wore it for a fall wedding and wished I had something a little warmer.... \" Read more \" This dress ended up being the perfect wedding guest dress ! Flowy and super cute.... \" Read more \" The dress looks okay from a distance, but the quality is very cheap . The material feels exactly the same as a dress from SHEIN.... \" Read more \" Absolutely gorgeous, high quality , well made dress! It looks exactly as pictured and fit me perfectly!... \" Read more 18 customers mention fit, 11 positive, 7 negative 18 customers mention \"Fit\" 11 positive 7 negative Customers have mixed opinions about the dress's fit, with some finding it perfect in length while others report it being very tight on the chest. \" Lovely color and great length . I did wear a slip underneath because I felt it was a little bit sheer. Material was nice and it was comfortable.... \" Read more \" Not a good fit . Tightness across chest causes the pleats to flatten out .... \" Read more \" ...I got this so I could feel pretty while postpartum. Fits well and is comfortable and good quality! \" Read more \" ...Like others have mentioned it is snug in the chest area (I’m 28D), which actually worked out for me because I didn’t need a bra. \" Read more 8 customers mention material quality, 4 positive, 4 negative 8 customers mention \"Material quality\" 4 positive 4 negative Customers have mixed opinions about the dress's material quality, with some finding it nice, while one customer describes it as plastic-like. \" ... Material was nice and it was comfortable. Perfect for a fall event. \" Read more \" ...This is definitely not Jean material . It is kind of rough. I would not purchase this again. \" Read more \" Love the color and the fabric . However I had to send it back because the chest area was so tight it was pulling at the armpits.... \" Read more \" This dress was NOT worth $50. It’s SHEIN material . You can see through the dress.... \" Read more 11 customers mention material thickness, 2 positive, 9 negative 11 customers mention \"Material thickness\" 2 positive 9 negative Customers find the dress material to be thin. \" ...The material feels exactly the same as a dress from SHEIN. It is a thin material that could be see through if the light was behind you, and it won’t... \" Read more \" I loooove this dress! The fit is so flattering, it was a little thin , but as far as fit, it’s perfectly fitted at the top and loose enough in the... \" Read more \" It's cute... but for the price.. I wouldn't purchase it. It's thin and see through and the top doesn't look like it does in the picture.... \" Read more \" ...Was hoping to dress it up for a wedding but couldn’t use it. Thin fabric . Pockets were not good quality. Had to return \" Read more",
    "items": [
      {
        "title": "5.0 out of 5 stars Can't explain ho CUTE! Perfect! Read for more details...",
        "body": "The media could not be loaded. This dress is so cute, elegant, and flattering! My sister got it, and I’m already eyeing hers to borrow. The green is gorgeous, the ruching is adorable, and the flow of the dress is perfect. She’s 5’4”, 130 lbs, and her usual small fit beautifully. The material is just the right thickness, not too heavy or thin, and it moves so nicely. Super versatile—you can dress it up for a wedding or down for church or brunch. Honestly, this dress is a staple waiting to happen. You need this in your closet! Read more",
        "author": "NayVee Reese",
        "rating": 5.0,
        "date": "November 10, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61EMc-RfzML._SY88._SL1500_.jpg",
          "https://m.media-amazon.com/images/I/71moJKfHDjL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "4.0 out of 5 stars Very pretty dress",
        "body": "Lovely color and great length. I did wear a slip underneath because I felt it was a little bit sheer. Material was nice and it was comfortable. Perfect for a fall event. Read more",
        "author": "Customer",
        "rating": 4.0,
        "date": "November 17, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/81TDD6we2sL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Great dress for events and holidays.",
        "body": "Beautiful. Flattering. Perfect length for me. I’m 5’3”. I’m a size 6 and a medium was great. The neckline isn’t too low and the square neck isn’t too far out to my shoulders. The color is beautiful. Read more",
        "author": "Debra and Nate (Parents of 9)",
        "rating": 5.0,
        "date": "December 5, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "3.0 out of 5 stars Disappointed - Not Worth the Price",
        "body": "The dress looks okay from a distance, but the quality is very cheap. The material feels exactly the same as a dress from SHEIN. It is a thin material that could be see through if the light was behind you, and it won’t stop sticking to my legs. You would probably need to buy a slip just to wear this dress somewhere. Also, as a larger chested woman, when I sit up straight with my shoulders back the dress is very tight on my chest, just a warning for other large chested girls. I was very disappointed in the quality and am planning to return the dress today. Read more",
        "author": "JennaReviewsThings",
        "rating": 3.0,
        "date": "November 11, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "1.0 out of 5 stars Plastic dress - do not buy!",
        "body": "This was the absolute worst item I have ever received from Amazon. The material is thin and plastic-like, it feels like a plastic bag you get from a grocery store. DO NOT BUY THIS Read more",
        "author": "Laura",
        "rating": 1.0,
        "date": "December 12, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "5.0 out of 5 stars Beautiful dress!!",
        "body": "Absolutely gorgeous, high quality, well made dress! It looks exactly as pictured and fit me perfectly! The material is soft (I’m highly sensitive to anything scratchy) and I comfortably wore it to a wedding all night. Highly recommend! Read more",
        "author": "Customer",
        "rating": 5.0,
        "date": "December 1, 2025",
        "verified": false,
        "images": []
      },
      {
        "title": "2.0 out of 5 stars Beautiful color but thin fabric shows all",
        "body": "I loved the color of this dress and think it may be cute on a different body type. The chest was a little tight along the middle. The sleeves fell down often enough to be irritating. The biggest flaw was that the dress was see through. Read more",
        "author": "Tmtz",
        "rating": 2.0,
        "date": "December 2, 2025",
        "verified": false,
        "images": [
          "https://m.media-amazon.com/images/I/61cIJ3Tj+dL._SY88._SL1500_.jpg"
        ]
      },
      {
        "title": "5.0 out of 5 stars Gorgeous dress",
        "body": "Really love this dress, the color is gorgeous. It was comfortable to wear and didn’t feel uncomfortable. It had a good stretch to it. I recommend the dress Read more",
        "author": "bryant arias",
        "rating": 5.0,
        "date": "December 15, 2025",
        "verified": false,
        "images": []
      }
    ]
  },
  "short_description": "Womens Maxi Dress Long Sleeve Split Ruched is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.",
  "about_this_item": "Womens Maxi Dress Long Sleeve Split Ruched is made for a polished look that still feels comfortable to wear. It is designed to sit cleanly on the body with a flattering shape that works for day plans and dressier moments without feeling overdone.\n\nThe fit focuses on balance rather than extremes, so you can move naturally while still getting a defined silhouette. Choose your usual size for a closer look, or size up if you prefer a little more ease through the waist and hips.\n\nStyling is simple: keep accessories minimal for a clean finish, or add a jacket and statement shoes when you want a sharper outfit. This piece photographs well thanks to smooth lines and a structured feel that stays put once you have it adjusted.\n\nWith the right fit and simple styling, this item becomes an easy go-to when you want something that looks intentional without requiring extra effort.\n\nIf you are between sizes, choose based on how close you like the fit through the waist and hips, then adjust with your usual layering choices.\n\nThe design is easy to style with simple accessories and works well in photos thanks to clean lines and a balanced silhouette.",
  "long_description": "Womens Maxi Dress Long Sleeve Split Ruched is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night.\n\nFit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.\n\nFabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable.\n\nHighlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces.\n\nHow to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish.\n\nColor notes Available colors may include: Dark Green, Maroon, Rust Brown, Black, Dusty Blue, Green. If a shade is sold out, check back as availability can change.\n\nCare Care guidance matters if you want it to keep its shape and finish. Follow the label first.",
  "long_description_blocks": [
    {
      "type": "p",
      "text": "Womens Maxi Dress Long Sleeve Split Ruched is a versatile piece you can reach for when you want a put-together look that still feels comfortable. The goal is simple: a silhouette that reads polished, photographs well, and stays wearable for a full day or a long night."
    },
    {
      "type": "p",
      "text": "Fit and sizing Fit is where most outfits win or lose. This design aims for a balanced shape with a defined line through the torso, a clean waist, and a smooth finish through the hips and legs. If you prefer a more relaxed feel, size up; if you like a closer fit, stay true to size. Sizes may include: 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/31Ygq6A3GgL._SL1500_.jpg",
      "alt": "Womens Maxi Dress Long Sleeve Split Ruched details image 1"
    },
    {
      "type": "p",
      "text": "Fabric and comfort Comfort is not just about softness. It is also about movement and how the fabric behaves as you walk, sit, and stand. A fabric blend with a bit of give helps it keep its shape while still feeling wearable."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/41KWWivf%2BpL._SL1500_.jpg",
      "alt": "Womens Maxi Dress Long Sleeve Split Ruched details image 2"
    },
    {
      "type": "p",
      "text": "Highlights A clean neckline and a refined silhouette for an elevated look. Designed to layer easily with jackets, wraps, or sweaters. Works well with both minimal accessories and statement pieces."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/41ZaTgdyfIL._SL1500_.jpg",
      "alt": "Womens Maxi Dress Long Sleeve Split Ruched details image 3"
    },
    {
      "type": "p",
      "text": "How to style Styling ideas: keep it minimal with neutral shoes and one standout accessory. For a relaxed daytime look, add a denim jacket or cardigan. For events, switch to a bolder shoe and a small clutch for a sharper finish."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/51QwyxPNdmL._SL1500_.jpg",
      "alt": "Womens Maxi Dress Long Sleeve Split Ruched details image 4"
    },
    {
      "type": "p",
      "text": "Color notes Available colors may include: Dark Green, Maroon, Rust Brown, Black, Dusty Blue, Green. If a shade is sold out, check back as availability can change."
    },
    {
      "type": "img",
      "src": "https://m.media-amazon.com/images/I/41uSs9sXtBL._SL1500_.jpg",
      "alt": "Womens Maxi Dress Long Sleeve Split Ruched details image 5"
    },
    {
      "type": "p",
      "text": "Care Care guidance matters if you want it to keep its shape and finish. Follow the label first."
    }
  ],
  "videos": [
    {
      "id": "f5e3d45c-e8fa-4209-bc8b-84595802757e",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f5e3d45c-e8fa-4209-bc8b-84595802757e/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f5e3d45c-e8fa-4209-bc8b-84595802757e/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "8bfe9569-44c1-4b5e-8fbc-fb52859ed427",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8bfe9569-44c1-4b5e-8fbc-fb52859ed427/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8bfe9569-44c1-4b5e-8fbc-fb52859ed427/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "660f166d-4990-4914-b2be-1ff2126287e8",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/660f166d-4990-4914-b2be-1ff2126287e8/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/660f166d-4990-4914-b2be-1ff2126287e8/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "657bd4c0-b2a1-4f83-bbb0-718b46e0e3b1",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/657bd4c0-b2a1-4f83-bbb0-718b46e0e3b1/default.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/657bd4c0-b2a1-4f83-bbb0-718b46e0e3b1/default.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "4f7930f4-75a9-4f36-8946-7a6f454dba24",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4f7930f4-75a9-4f36-8946-7a6f454dba24/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4f7930f4-75a9-4f36-8946-7a6f454dba24/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "ddedafa3-c077-4f59-8c3d-1a2e21553f98",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ddedafa3-c077-4f59-8c3d-1a2e21553f98/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ddedafa3-c077-4f59-8c3d-1a2e21553f98/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "db07543c-4763-4264-8666-9e6d80bdeb61",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/db07543c-4763-4264-8666-9e6d80bdeb61/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/db07543c-4763-4264-8666-9e6d80bdeb61/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "414aed85-185e-4223-bcf7-f2959a50f40d",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/414aed85-185e-4223-bcf7-f2959a50f40d/default.vertical.jobtemplate.hls.m3u8",
      "sources": [
        {
          "type": "application/x-mpegURL",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/414aed85-185e-4223-bcf7-f2959a50f40d/default.vertical.jobtemplate.hls.m3u8"
        }
      ]
    },
    {
      "id": "b405be94-0d53-4026-ad07-7128e9b13c82",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b405be94-0d53-4026-ad07-7128e9b13c82/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b405be94-0d53-4026-ad07-7128e9b13c82/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "7bb7ffcf-a7d1-439e-b057-85df9eb46253",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7bb7ffcf-a7d1-439e-b057-85df9eb46253/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7bb7ffcf-a7d1-439e-b057-85df9eb46253/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "63364e4e-8dd5-4793-9058-4863124da729",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/63364e4e-8dd5-4793-9058-4863124da729/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/63364e4e-8dd5-4793-9058-4863124da729/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    },
    {
      "id": "38fe89cf-162c-42d2-b7b0-82614762b1ba",
      "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/38fe89cf-162c-42d2-b7b0-82614762b1ba/videopreview.jobtemplate.mp4.default.mp4",
      "sources": [
        {
          "type": "video/mp4",
          "src": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/38fe89cf-162c-42d2-b7b0-82614762b1ba/videopreview.jobtemplate.mp4.default.mp4"
        }
      ]
    }
  ],
  "color_swatches": {
    "Dark Green": "https://m.media-amazon.com/images/I/31a5GWjnShL._AC_SR38,50_.jpg",
    "Maroon": "https://m.media-amazon.com/images/I/31H2cnDLf-L._AC_SR38,50_.jpg",
    "Rust Brown": "https://m.media-amazon.com/images/I/31EZiVH2KXL._AC_SR38,50_.jpg",
    "Black": "https://m.media-amazon.com/images/I/31-Qg8o2eoL._AC_SR38,50_.jpg",
    "Dusty Blue": "https://m.media-amazon.com/images/I/31vFsvspU6L._AC_SR38,50_.jpg",
    "Green": "https://m.media-amazon.com/images/I/31pNV8GzXaL._AC_SR38,50_.jpg"
  },
  "color_image_key": {
    "Dark Green": "61iz96yMpHL",
    "Maroon": "61F+2INCNkL",
    "Rust Brown": "61Zi8rhD9ZL",
    "Black": "617fFzqrSaL",
    "Dusty Blue": "61Sa9MugasL",
    "Green": "613BkAmD5fL"
  },
  "color_images": {
    "Dark Green": [
      "https://m.media-amazon.com/images/I/61iz96yMpHL._SL1500_.jpg"
    ],
    "Maroon": [
      "https://m.media-amazon.com/images/I/61F+2INCNkL._SL1500_.jpg"
    ],
    "Rust Brown": [
      "https://m.media-amazon.com/images/I/61Zi8rhD9ZL._SL1500_.jpg"
    ],
    "Black": [
      "https://m.media-amazon.com/images/I/617fFzqrSaL._SL1500_.jpg"
    ],
    "Dusty Blue": [
      "https://m.media-amazon.com/images/I/61Sa9MugasL._SL1500_.jpg"
    ],
    "Green": [
      "https://m.media-amazon.com/images/I/613BkAmD5fL._SL1500_.jpg"
    ]
  },
  "related": [
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 39.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Work",
      "images": [
        "https://m.media-amazon.com/images/I/81Q5KH4YWwL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-v-neck-maxi",
      "title": "Womens Maxi Dress V Neck Maxi",
      "price": 48.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71b-lFZMlqL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-evening",
      "title": "Womens Maxi Dress Formal Evening",
      "price": 79.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/61kmZ5xI4yL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-long-sleeve-ruched",
      "title": "Womens Maxi Dress Bodycon Long Sleeve Ruched",
      "price": 38.88,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61tZM8-MF2L._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-long-sleeve",
      "title": "Womens Maxi Dress Long Sleeve",
      "price": 18.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/71e0f6DNBbL._SL1500_.jpg"
      ]
    }
  ],
  "customer_also_viewed": [
    {
      "id": "womens-dress",
      "title": "Womens Dress",
      "price": 425.0,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Cocktail",
      "images": [
        "https://m.media-amazon.com/images/I/61ZCDDUGOBL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-sleeveless-off-shoulder",
      "title": "Womens Dress Sleeveless Off Shoulder",
      "price": 37.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/61dMM-S4qXL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-formal-long-sleeve",
      "title": "Womens Maxi Dress Formal Long Sleeve",
      "price": 99.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/611hcqR+HOL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-split-sleeveless-ruched-maxi-high-split-one-shoulder",
      "title": "Womens Maxi Dress Split Sleeveless Ruched Maxi High Split One Shoulder",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/41MyHvruybL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-dress-ruched-bodycon-v-neck",
      "title": "Womens Dress Ruched Bodycon V Neck",
      "price": 31.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51P0kVASvyL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-maxi-sleeveless-formal",
      "title": "Womens Maxi Dress Maxi Sleeveless Formal",
      "price": 49.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Casual",
      "images": [
        "https://m.media-amazon.com/images/I/51lRzRj0tOL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-bodycon-maxi-ruched-split",
      "title": "Womens Maxi Dress Bodycon Maxi Ruched Split",
      "price": 46.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Club & Night Out",
      "images": [
        "https://m.media-amazon.com/images/I/51z3XNCEBIL._SL1500_.jpg"
      ]
    },
    {
      "id": "womens-maxi-dress-v-neck-formal-maxi-short-sleeve-evening",
      "title": "Womens Maxi Dress V Neck Formal Maxi Short Sleeve Evening",
      "price": 59.99,
      "category": "Clothing, Shoes & Jewelry > Women > Clothing > Dresses > Formal",
      "images": [
        "https://m.media-amazon.com/images/I/71jMpbRn-1L._SL1500_.jpg"
      ]
    }
  ]
}